Repository: gitGNU/gnu_www-fr
Catalog: licenses/old-licenses/gpl-2.0-faq.*.po
Languages: fr

source: Frequently Asked Questions about the GNU GPL v2.0 - GNU Project - Free Software Foundation (FSF)
fr: Foire Aux Questions de la GNU GPL v2.0 - GNU Project - Free Software Foundation (FSF)

source: Frequently Asked Questions about version 2 of the GNU GPL
fr: Foire Aux Questions de la GNU GPL version 2

source: This page contains answers to commonly asked questions about the GNU General Public License (GPL), version 2. The FAQ for the current version of the GPL is <a href="/licenses/gpl-faq.html">here</a>. To learn more about the Free Software Foundation's other licenses, please see <a href="/licenses/licenses.html">our licenses page</a>.
fr: Cette page contient les r&eacute;ponses aux questions les plus courantes sur la GNU General Public License (GPL). La foire aux questions pour la dernière version de la GPL se trouve <a href="/licenses/gpl-faq.fr.html">ici</a>. Pour en apprendre plus sur les autres licences de la Fondation pour le logiciel libre, veuillez consulter <a href="/licenses/licenses.fr.html">notre page des licences</a>.

source: After you read this FAQ, <a href="/cgi-bin/license-quiz.cgi">you can test your knowledge of Free Software licensing with our quiz</a>.
fr: Apr&egrave;s avoir lu cette FAQ, <a href="http://www.gnu.org/cgi-bin/license-quiz.cgi">vous pouvez tester vos connaissances sur les licences de logiciels libres avec notre quiz (en anglais)</a>.

source: Table of Contents
fr: Table des mati&egrave;res

source: Basic questions about the GPL, the GNU Project, and the Free Software Foundation
fr: Questions de base sur la GPL, le projet GNU, et le Fondation pour le logiciel libre

source: <a href="#WhatDoesGPLStandFor" name="TOCWhatDoesGPLStandFor">What does &ldquo;GPL&rdquo; stand for?</a>
fr: <a href="#WhatDoesGPLStandFor" name="TOCWhatDoesGPLStandFor">Que veut dire &laquo;&nbsp;GPL&nbsp;&raquo;&nbsp;?</a>

source: <a href="#DoesFreeSoftwareMeanUsingTheGPL" name="TOCDoesFreeSoftwareMeanUsingTheGPL">Does free software mean using the GPL?</a>
fr: <a href="#DoesFreeSoftwareMeanUsingTheGPL" name="TOCDoesFreeSoftwareMeanUsingTheGPL">Est-ce que logiciel libre signifie utiliser la GPL&nbsp;?</a>

source: <a href="#WhyUseGPL" name="TOCWhyUseGPL">Why should I use the GNU GPL rather than other free software licenses?</a>
fr: <a href="#WhyUseGPL" name="TOCWhyUseGPL">Pourquoi devrais-je utiliser la GNU GPL plut&ocirc;t que d'autres licences de logiciel libre&nbsp;?</a>

source: <a href="#DoesAllGNUSoftwareUseTheGNUGPLAsItsLicense" name="TOCDoesAllGNUSoftwareUseTheGNUGPLAsItsLicense">Does all GNU software use the GNU GPL as its license?</a>
fr: <a href="#DoesAllGNUSoftwareUseTheGNUGPLAsItsLicense" name="TOCDoesAllGNUSoftwareUseTheGNUGPLAsItsLicense">Est-ce que tous les logiciels GNU utilisent la GNU GPL comme licence&nbsp;?</a>

source: <a href="#DoesUsingTheGPLForAProgramMakeItGNUSoftware" name="TOCDoesUsingTheGPLForAProgramMakeItGNUSoftware">Does using the GPL for a program make it GNU software?</a>
fr: <a href="#DoesUsingTheGPLForAProgramMakeItGNUSoftware" name="TOCDoesUsingTheGPLForAProgramMakeItGNUSoftware">Est-ce que le fait d'utiliser la GPL pour un programme en fait un logiciel GNU&nbsp;?</a>

source: <a href="#GPLOtherThanSoftware" name="TOCGPLOtherThanSoftware">Can I use the GPL for something other than software?</a>
fr: <a href="#GPLOtherThanSoftware" name="TOCGPLOtherThanSoftware">Puis-je utiliser la GPL pour autre chose que des logiciels&nbsp;?</a>

source: <a href="#WhyNotGPLForManuals" name="TOCWhyNotGPLForManuals">Why don't you use the GPL for manuals?</a>
fr: <a href="#WhyNotGPLForManuals" name="TOCWhyNotGPLForManuals">Pourquoi n'utilisez-vous pas la GPL pour les manuels&nbsp;?</a>

source: <a href="#GPLTranslations" name="TOCGPLTranslations">Are there translations of the GPL into other languages?</a>
fr: <a href="#GPLTranslations" name="TOCGPLTranslations">Existe-t-il des traductions de la GPL dans d'autres langues&nbsp;?</a>

source: <a href="#WhySomeGPLAndNotLGPL" name="TOCWhySomeGPLAndNotLGPL">Why are some GNU libraries released under the ordinary GPL rather than the Lesser GPL?</a>
fr: <a href="#WhySomeGPLAndNotLGPL" name="TOCWhySomeGPLAndNotLGPL">Pourquoi certaines biblioth&egrave;ques GNU sont-elles distribu&eacute;es sous GPL normale, plut&ocirc;t que sous GPL amoindrie (<i>Lesser GPL</i>)&nbsp;?</a>

source: <a href="#WhoHasThePower" name="TOCWhoHasThePower">Who has the power to enforce the GPL?</a>
fr: <a href="#WhoHasThePower" name="TOCWhoHasThePower">Qui a la capacit&eacute; de faire respecter la GPL&nbsp;?</a>

source: <a href="#AssignCopyright" name="TOCAssignCopyright">Why does the FSF require that contributors to FSF-copyrighted programs assign copyright to the FSF? If I hold copyright on a GPL'ed program, should I do this, too? If so, how?</a>
fr: <a href="#AssignCopyright" name="TOCAssignCopyright">Pourquoi la FSF requiert-elle que les contributeurs de programmes sous copyright de la FSF transf&egrave;rent le copyright &agrave; la FSF&nbsp;? Si je d&eacute;tiens le copyright d'un programme sous GPL, devrais-je faire la m&ecirc;me chose&nbsp;? Si oui, comment&nbsp;?</a>

source: <a href="#ModifyGPL" name="TOCModifyGPL">Can I modify the GPL and make a modified license?</a>
fr: <a href="#ModifyGPL" name="TOCModifyGPL">Puis-je modifier la GPL et faire une licence modifi&eacute;e&nbsp;?</a>

source: General understanding of the GPL
fr: Compr&eacute;hension g&eacute;n&eacute;rale de la GPL

source: <a href="#WhyDoesTheGPLPermitUsersToPublishTheirModifiedVersions" name="TOCWhyDoesTheGPLPermitUsersToPublishTheirModifiedVersions">Why does the GPL permit users to publish their modified versions?</a>
fr: <a href="#WhyDoesTheGPLPermitUsersToPublishTheirModifiedVersions" name="TOCWhyDoesTheGPLPermitUsersToPublishTheirModifiedVersions">Pourquoi la GPL permet-elle aux utilisateurs de publier leur versions modifi&eacute;es&nbsp;?</a>

source: <a href="#GPLRequireSourcePostedPublic" name="TOCGPLRequireSourcePostedPublic">Does the GPL require that source code of modified versions be posted to the public?</a>
fr: <a href="#GPLRequireSourcePostedPublic" name="TOCGPLRequireSourcePostedPublic">Est-ce que la GPL requiert que le code source des versions modifi&eacute;es soit port&eacute; &agrave; la connaissance du public&nbsp;?</a>

source: <a href="#GPLAndNonfreeOnSameMachine" name="TOCGPLAndNonfreeOnSameMachine"> Can I have a GPL-covered program and an unrelated non-free program on the same computer?</a>
fr: <a href="#GPLAndNonfreeOnSameMachine" name="TOCGPLAndNonfreeOnSameMachine">Puis-je avoir un programme couvert par la GPL et un programme non-libre ind&eacute;pendant sur le m&ecirc;me ordinateur&nbsp;?</a>

source: <a href="#CanIDemandACopy" name="TOCCanIDemandACopy">If I know someone has a copy of a GPL-covered program, can I demand he give me a copy?</a>
fr: <a href="#CanIDemandACopy" name="TOCCanIDemandACopy">Si je connais quelqu'un qui a une copie d'un programme couvert par la GPL, puis-je lui demander de me donner une copie&nbsp;?</a>

source: <a href="#WhatDoesWrittenOfferValid" name="TOCWhatDoesWrittenOfferValid">What does this &ldquo;written offer valid for any third party&rdquo; mean? Does that mean everyone in the world can get the source to any GPL'ed program no matter what?</a>
fr: <a href="#WhatDoesWrittenOfferValid" name="TOCWhatDoesWrittenOfferValid">Que veut dire &laquo;&nbsp;offre &eacute;crite valide pour n'importe quel tiers&nbsp;&raquo; (<i>written offer valid for any third party</i>)&nbsp;? Cela signifie-t-il que n'importe qui peut obtenir les sources de n'importe quel programme sous GPL dans tous les cas&nbsp;?</a>

source: <a href="#TheGPLSaysModifiedVersions" name="TOCTheGPLSaysModifiedVersions">The GPL says that modified versions, if released, must be &ldquo;licensed &hellip; to all third parties.&rdquo; Who are these third parties?</a>
fr: <a href="#TheGPLSaysModifiedVersions" name="TOCTheGPLSaysModifiedVersions">La GPL dit que les versions modifi&eacute;es, si elles sont diffus&eacute;es, doivent &ecirc;tre &laquo;&nbsp;donner une licence&hellip; pour tout tiers&nbsp;&raquo; (<i>&laquo;&nbsp;licensed&hellip; to all third parties&nbsp;&raquo;.</i>). Qui sont ces tiers&nbsp;?</a>

source: <a href="#DoesTheGPLAllowMoney" name="TOCDoesTheGPLAllowMoney">Does the GPL allow me to sell copies of the program for money?</a>
fr: <a href="#DoesTheGPLAllowMoney" name="TOCDoesTheGPLAllowMoney">Est-ce que la GPL m'autorise &agrave; vendre des copies payantes de mon programme&nbsp;?</a>

source: <a href="#DoesTheGPLAllowDownloadFee" name="TOCDoesTheGPLAllowDownloadFee"> Does the GPL allow me to charge a fee for downloading the program from my site?</a>
fr: <a href="#DoesTheGPLAllowDownloadFee" name="TOCDoesTheGPLAllowDownloadFee">La GPL me permet-elle de demander de l'argent pour le t&eacute;l&eacute;chargement d'un programme sur mon site&nbsp;?</a>

source: <a href="#DoesTheGPLAllowRequireFee" name="TOCDoesTheGPLAllowRequireFee"> Does the GPL allow me to require that anyone who receives the software must pay me a fee and/or notify me?</a>
fr: <a href="#DoesTheGPLAllowRequireFee" name="TOCDoesTheGPLAllowRequireFee">Est-ce que la GPL m'autorise &agrave; exiger que quiconque re&ccedil;oit le logiciel doive me payer un montant et/ou me le signaler&nbsp;?</a>

source: <a href="#DoesTheGPLRequireAvailabilityToPublic" name="TOCDoesTheGPLRequireAvailabilityToPublic">If I distribute GPL'd software for a fee, am I required to also make it available to the public without a charge?</a>
fr: <a href="#DoesTheGPLRequireAvailabilityToPublic" name="TOCDoesTheGPLRequireAvailabilityToPublic">Si je distribue un programme couvert par la GPL contre r&eacute;mun&eacute;ration, suis-je oblig&eacute; de le rendre &eacute;galement disponible au public gratuitement&nbsp;?</a>

source: <a href="#DoesTheGPLAllowNDA" name="TOCDoesTheGPLAllowNDA">Does the GPL allow me to distribute a copy under a nondisclosure agreement?</a>
fr: <a href="#DoesTheGPLAllowNDA" name="TOCDoesTheGPLAllowNDA">La GPL me permet-elle de distribuer une copie sous accord de non divulgation&nbsp;?</a>

source: <a href="#DoesTheGPLAllowModNDA" name="TOCDoesTheGPLAllowModNDA">Does the GPL allow me to distribute a modified or beta version under a nondisclosure agreement?</a>
fr: <a href="#DoesTheGPLAllowModNDA" name="TOCDoesTheGPLAllowModNDA">La GPL me permet-elle de distribuer une version modifiée ou beta sous accord de non divulgation&nbsp;?</a>

source: <a href="#DevelopChangesUnderNDA" name="TOCDevelopChangesUnderNDA">Does the GPL allow me to develop a modified version under a nondisclosure agreement?</a>
fr: <a href="#DevelopChangesUnderNDA" name="TOCDevelopChangesUnderNDA">La GPL me permet-elle de d&eacute;velopper une version modifi&eacute;e sous accord de non divulgation&nbsp;?</a>

source: <a href="#WhyMustIInclude" name="TOCWhyMustIInclude">Why does the GPL require including a copy of the GPL with every copy of the program?</a>
fr: <a href="#WhyMustIInclude" name="TOCWhyMustIInclude">Pourquoi la GPL exige-t-elle d'inclure une copie de la GPL avec chaque copie du programme&nbsp;?</a>

source: <a href="#WhatIfWorkIsShort" name="TOCWhatIfWorkIsShort">What if the work is not much longer than the license itself?</a>
fr: <a href="#WhatIfWorkIsShort" name="TOCWhatIfWorkIsShort">Et si le programme n'est gu&egrave;re plus long que la licence elle-m&ecirc;me&nbsp;?</a>

source: <a href="#RequiredToClaimCopyright" name="TOCRequiredToClaimCopyright">Am I required to claim a copyright on my modifications to a GPL-covered program?</a>
fr: <a href="#RequiredToClaimCopyright" name="TOCRequiredToClaimCopyright">Dois-je revendiquer un copyright pour mes modifications sur un programme couvert par la GPL&nbsp;?</a>

source: <a href="#CombinePublicDomainWithGPL" name="TOCCombinePublicDomainWithGPL">If a program combines public-domain code with GPL-covered code, can I take the public-domain part and use it as public domain code?</a>
fr: <a href="#CombinePublicDomainWithGPL" name="TOCCombinePublicDomainWithGPL">Si un programme combine du code du domaine public et du code couvert sous GPL, puis-je prendre la partie d&eacute;pendant du domaine public et l'utiliser comme tel&nbsp;?</a>

source: <a href="#IWantCredit" name="TOCIWantCredit">I want to get credit for my work. I want people to know what I wrote. Can I still get credit if I use the GPL?</a>
fr: <a href="#IWantCredit" name="TOCIWantCredit">Je veux que mon travail soit reconnu. Je veux que les gens sachent ce que j'ai &eacute;crit. Puis-je encore &ecirc;tre reconnu si j'utilise la GPL&nbsp;?</a>

source: <a href="#GPLOmitPreamble" name="TOCGPLOmitPreamble">Can I omit the preamble of the GPL, or the instructions for how to use it on your own programs, to save space?</a>
fr: <a href="#GPLOmitPreamble" name="TOCGPLOmitPreamble">Puis-je &ocirc;ter le pr&eacute;ambule de la GPL, ou les instructions sur la fa&ccedil;on de l'utiliser dans vos propres programmes, pour &eacute;conomiser de l'espace&nbsp;?</a>

source: <a href="#WhatIsCompatible" name="TOCWhatIsCompatible">What does it mean to say that two licenses are compatible?</a>
fr: <a href="#WhatIsCompatible" name="TOCWhatIsCompatible">Que signifie le fait que deux licences sont &laquo;&nbsp;compatibles&nbsp;&raquo;&nbsp;?</a>

source: <a href="#WhatDoesCompatMean" name="TOCWhatDoesCompatMean">What does it mean to say a license is &ldquo;compatible with the GPL&rdquo;?</a>
fr: <a href="#WhatDoesCompatMean" name="TOCWhatDoesCompatMean">Que veut dire le fait qu'une licence soit &laquo;&nbsp;compatible avec la GPL&nbsp;&raquo; (<i>&laquo;&nbsp;compatible with the GPL&nbsp;&raquo;</i>)&nbsp;?</a>

source: <a href="#OrigBSD" name="TOCOrigBSD">Why is the original BSD license incompatible with the GPL?</a>
fr: <a href="#OrigBSD" name="TOCOrigBSD">Pourquoi la licence BSD originale est-elle incompatible avec la GPL&nbsp;?</a>

source: <a href="#MereAggregation" name="TOCMereAggregation">What is the difference between &ldquo;mere aggregation&rdquo; and &ldquo;combining two modules into one program&rdquo;?</a>
fr: <a href="#MereAggregation" name="TOCMereAggregation">Quelle est la diff&eacute;rence entre <i>&laquo;&nbsp;mere aggregation&nbsp;&raquo;</i> et <i>&laquo;&nbsp;combining two modules into one program&nbsp;&raquo;</i>&nbsp;?</a>

source: <a href="#GPLCommercially" name="TOCGPLCommercially">If I use a piece of software that has been obtained under the GNU GPL, am I allowed to modify the original code into a new program, then distribute and sell that new program commercially?</a>
fr: <a href="#GPLCommercially" name="TOCGPLCommercially">Si j'utilise un morceau de logiciel que j'ai obtenu sous GNU GPL, ai-je le droit de modifier le code original pour cr&eacute;er un nouveau programme, puis de commercialiser ce programme&nbsp;?</a>

source: <a href="#LGPLJava" name="TOCLGPLJava">How does the LGPL work with Java?</a>
fr: <a href="#LGPLJava" name="TOCLGPLJava">Comment la LGPL fonctionne avec Java&nbsp;?</a>

source: Using the GPL for your programs
fr: Utiliser la GPL pour vos programmes

source: <a href="#CouldYouHelpApplyGPL" name="TOCCouldYouHelpApplyGPL">Could you give me step by step instructions on how to apply the GPL to my program?</a>
fr: <a href="#CouldYouHelpApplyGPL" name="TOCCouldYouHelpApplyGPL">Pourriez-vous me donner des instructions d&eacute;taill&eacute;es sur la fa&ccedil;on d'appliquer la GPL &agrave; mon programme&nbsp;?</a>

source: <a href="#HowIGetCopyright" name="TOCHowIGetCopyright">How do I get a copyright on my program in order to release it under the GPL?</a>
fr: <a href="#HowIGetCopyright" name="TOCHowIGetCopyright">Comment obtenir un copyright sur mon programme de fa&ccedil;on &agrave; le distribuer sous la GPL&nbsp;?</a>

source: <a href="#WhatIfSchool" name="TOCWhatIfSchool">What if my school might want to make my program into its own proprietary software product?</a>
fr: <a href="#WhatIfSchool" name="TOCWhatIfSchool">Et si mon &eacute;cole d&eacute;cidait de mettre mon programme dans son propre logiciel propri&eacute;taire&nbsp;?</a>

source: <a href="#ReleaseUnderGPLAndNF" name="TOCReleaseUnderGPLAndNF">I would like to release a program I wrote under the GNU GPL, but I would like to use the same code in non-free programs.</a>
fr: <a href="#ReleaseUnderGPLAndNF" name="TOCReleaseUnderGPLAndNF">Je voudrais diffuser sous GNU GPL un programme que j'ai &eacute;crit, mais j'aimerais utiliser le m&ecirc;me code dans un programme non-libre.</a>

source: <a href="#CanDeveloperThirdParty" name="TOCCanDeveloperThirdParty">Can the developer of a program who distributed it under the GPL later license it to another party for exclusive use?</a>
fr: <a href="#CanDeveloperThirdParty" name="TOCCanDeveloperThirdParty">Le d&eacute;veloppeur d'un programme qui l'a distribu&eacute; sous GPL peut-il ensuite &eacute;tablir avec un tiers une licence pour son usage exclusif&nbsp;?</a>

source: <a href="#GPLUSGov" name="TOCGPLUSGov">Can the US Government release a program under the GNU GPL?</a>
fr: <a href="#GPLUSGov" name="TOCGPLUSGov">Le gouvernement am&eacute;ricain peut-il publier un programme couvert par la GNU GPL&nbsp;?</a>

source: <a href="#GPLUSGovAdd" name="TOCGPLUSGovAdd">Can the US Government release improvements to a GPL-covered program?</a>
fr: <a href="#GPLUSGovAdd" name="TOCGPLUSGovAdd">Le gouvernement am&eacute;ricain peut-il publier des am&eacute;liorations d'un programme couvert par la GPL&nbsp;?</a>

source: <a href="#VersionTwoOrLater" name="TOCVersionTwoOrLater">Why should programs say &ldquo;Version 2 of the GPL or any later version&rdquo;?</a>
fr: <a href="#VersionTwoOrLater" name="TOCVersionTwoOrLater">Pourquoi les programmes doivent-ils se r&eacute;f&eacute;rer &agrave; &laquo;&nbsp;la version 2 de la GPL ou toute version ult&eacute;rieure&nbsp;&raquo; (<i>&laquo;&nbsp;Version 2 of the GPL or any later version&nbsp;&raquo;</i>)&nbsp;?</a>

source: <a href="#GPLOutput" name="TOCGPLOutput">Is there some way that I can GPL the output people get from use of my program? For example, if my program is used to develop hardware designs, can I require these these designs must be free?</a>
fr: <a href="#GPLOutput" name="TOCGPLOutput">Y a-t-il un moyen de mettre sous GPL le r&eacute;sultat que les utilisateurs obtiennent en se servant de mon programme&nbsp;? Par exemple, si mon programme sert &agrave; produire des &eacute;l&eacute;ments de conception de composants mat&eacute;riels, puis-je exiger que ces &eacute;l&eacute;ments de conception soient libres&nbsp;?</a>

source: <a href="#FontException" name="TOCFontException">How does the GPL apply to fonts?</a>
fr: <a href="#FontException" name="TOCFontException">Comment la GPL s'applique t-elle aux polices&nbsp;?</a>

source: <a href="#WMS" name="TOCWMS">What license should I use for website maintenance system templates?</a>
fr: <a href="#WMS" name="TOCWMS">Quelle licence dois-je utiliser pour des mod&egrave;les de syst&egrave;me de maintenance de sites Web&nbsp;?</a>

source: <a href="#NonFreeTools" name="TOCNonFreeTools">Can I release a program under the GPL which I developed using non-free tools?</a>
fr: <a href="#NonFreeTools" name="TOCNonFreeTools">Puis-je publier un programme sous licence GPL que j'ai d&eacute;velopp&eacute; en utilisant des outils non-libres&nbsp;?</a>

source: Distribution of programs released under the GPL
fr: Distribution de programmes couverts par la GPL

source: <a href="#ModifiedJustBinary" name="TOCModifiedJustBinary">Can I release a modified version of a GPL-covered program in binary form only?</a>
fr: <a href="#ModifiedJustBinary" name="TOCModifiedJustBinary">Puis-je publier une version modifi&eacute;e d'un programme sous GPL sous forme binaire uniquement&nbsp;?</a>

source: <a href="#UnchangedJustBinary" name="TOCUnchangedJustBinary">I downloaded just the binary from the net. If I distribute copies, do I have to get the source and distribute that too?</a>
fr: <a href="#UnchangedJustBinary" name="TOCUnchangedJustBinary">J'ai t&eacute;l&eacute;charg&eacute; seulement le programme binaire &agrave; partir d'Internet. Si je distribue des copies, dois-je obtenir le code source et le redistribuer aussi&nbsp;?</a>

source: <a href="#DistributeWithSourceOnInternet" name="TOCDistributeWithSourceOnInternet">I want to distribute binaries via physical media without accompanying sources. Can I provide source code by FTP instead of by mail order?</a>
fr: <a href="#DistributeWithSourceOnInternet" name="TOCDistributeWithSourceOnInternet">Je veux distribuer les fichiers binaires d'un programme sous GPL sur support physique sans les sources associ&eacute;es. Au lieu d'envoyer ult&eacute;rieurement le code source aux utilisateurs qui en font la demande, puis-je me contenter de mettre les sources sur un serveur Internet&nbsp;?</a>

source: <a href="#RedistributedBinariesGetSource" name="TOCRedistributedBinariesGetSource">My friend got a GPL-covered binary with an offer to supply source, and made a copy for me. Can I use the offer to obtain the source?</a>
fr: <a href="#RedistributedBinariesGetSource" name="TOCRedistributedBinariesGetSource">Mon ami a un ex&eacute;cutable d'un programme sous GPL avec une offre de fourniture des sources, et a fait une copie pour moi. Puis-je utiliser l'offre pour obtenir les sources&nbsp;?</a>

source: <a href="#SourceAndBinaryOnDifferentSites" name="TOCSourceAndBinaryOnDifferentSites">Can I put the binaries on my Internet server and put the source on a different Internet site?</a>
fr: <a href="#SourceAndBinaryOnDifferentSites" name="TOCSourceAndBinaryOnDifferentSites">Puis-je mettre les fichiers binaires sur mon serveur Internet et les sources sur un site Internet diff&eacute;rent&nbsp;?</a>

source: <a href="#DistributeExtendedBinary" name="TOCDistributeExtendedBinary">I want to distribute an extended version of a GPL-covered program in binary form. Is it enough to distribute the source for the original version?</a>
fr: <a href="#DistributeExtendedBinary" name="TOCDistributeExtendedBinary">Je veux distribuer une version &eacute;tendue d'un programme sous GPL sous forme de fichiers binaires. Me suffit-il de distribuer le code source de la version originale&nbsp;?</a>

source: <a href="#DistributingSourceIsInconvenient" name="TOCDistributingSourceIsInconvenient">I want to distribute binaries, but distributing complete source is inconvenient. Is it ok if I give users the diffs from the &ldquo;standard&rdquo; version along with the binaries?</a>
fr: <a href="#DistributingSourceIsInconvenient" name="TOCDistributingSourceIsInconvenient">Je souhaite distribuer des fichiers binaires, mais il est difficile de distribuer l'ensemble du code source. Et si je donnais aux utilisateurs les diff&eacute;rences par rapport &agrave; la version &laquo;standard&raquo; en m&ecirc;me temps que les binaires&nbsp;?</a>

source: <a href="#AnonFTPAndSendSources" name="TOCAnonFTPAndSendSources">I want to make binaries available for anonymous FTP, but send sources only to people who order them.</a>
fr: <a href="#AnonFTPAndSendSources" name="TOCAnonFTPAndSendSources">Je veux rendre disponible par FTP anonyme les fichiers binaires, mais envoyer les sources seulement &agrave; ceux qui en font la demande.</a>

source: <a href="#HowCanIMakeSureEachDownloadGetsSource" name="TOCHowCanIMakeSureEachDownloadGetsSource">How can I make sure each user who downloads the binaries also gets the source?</a>
fr: <a href="#HowCanIMakeSureEachDownloadGetsSource" name="TOCHowCanIMakeSureEachDownloadGetsSource">Comment puis-je m'assurer que tout utilisateur qui t&eacute;l&eacute;charge les fichiers binaires obtient &eacute;galement le code source&nbsp;?</a>
