Repository: gitGNU/gnu_www-fr
Catalog: licenses/old-licenses/gpl-2.0-faq.*.po
Languages: fr

source: You should <a href="/licenses/gpl-violation.html">report it.</a> First, check the facts as best you can. Then tell the publisher or copyright holder of the specific GPL-covered program. If that is the Free Software Foundation, write to <a href="mailto:license-violation@gnu.org">&lt;license-violation@gnu.org&gt;</a>. Otherwise, the program's maintainer may be the copyright holder, or else could tell you how to contact the copyright holder, so report it to the maintainer.
fr: Vous devriez <a href="/licences/gpl-violation.html">la signaler</a>. Tout d'abord, v&eacute;rifiez les faits du mieux que vous pouvez. Puis signalez-le &agrave; l'&eacute;diteur ou au d&eacute;tenteur du copyright du programme en question couvert par la GPL. Si c'est la Free Software Foundation, &eacute;crivez &agrave; <a href="mailto:license-violation&#64;gnu.org">&lt;license-violation&#64;gnu.org&gt;</a>. Sinon, le mainteneur du programme pourrait &ecirc;tre le d&eacute;tenteur du copyright, ou pourrait sinon vous dire comment contacter le d&eacute;tenteur du copyright, donc signalez-le au mainteneur.

source: <b><a href="#TOCWhyDoesTheGPLPermitUsersToPublishTheirModifiedVersions" name="WhyDoesTheGPLPermitUsersToPublishTheirModifiedVersions"> Why does the GPL permit users to publish their modified versions?</a></b>
fr: <b><a href="#TOCWhyDoesTheGPLPermitUsersToPublishTheirModifiedVersions" name="WhyDoesTheGPLPermitUsersToPublishTheirModifiedVersions">Pourquoi la GPL permet-elle aux utilisateurs de publier leur versions modifi&eacute;es&nbsp;?</a></b>

source: A crucial aspect of free software is that users are free to cooperate. It is absolutely essential to permit users who wish to help each other to share their bug fixes and improvements with other users.
fr: Un aspect crucial du logiciel libre est que les utilisateurs sont libres de coop&eacute;rer. Il est absolument essentiel de permettre aux utilisateurs qui d&eacute;sirent s'entraider de partager leurs patches et am&eacute;liorations avec d'autres.

source: Some have proposed alternatives to the GPL that require modified versions to go through the original author. As long as the original author keeps up with the need for maintenance, this may work well in practice, but if the author stops (more or less) to do something else or does not attend to all the users' needs, this scheme falls down. Aside from the practical problems, this scheme does not allow users to help each other.
fr: Certains ont propos&eacute; des alternatives &agrave; la GPL qui requi&egrave;rent que la version modifi&eacute;e passe par l'auteur original. Tant que l'auteur original assure la maintenance n&eacute;cessaire, ceci peut fonctionner en pratique, mais si l'auteur cesse (plus ou moins) et passe &agrave; autre chose, ou ne r&eacute;pond pas aux besoins de tous les utilisateurs, cette mani&egrave;re de proc&eacute;der s'effondre. En plus des probl&egrave;mes pratiques, cette fa&ccedil;on de faire ne permet pas aux utilisateurs de s'entraider.

source: Sometimes control over modified versions is proposed as a means of preventing confusion between various versions made by users. In our experience, this confusion is not a major problem. Many versions of Emacs have been made outside the GNU Project, but users can tell them apart. The GPL requires the maker of a version to place his or her name on it, to distinguish it from other versions and to protect the reputations of other maintainers.
fr: Quelquefois, le contr&ocirc;le sur les versions modifi&eacute;es est propos&eacute; comme un moyen d'&eacute;viter des confusions entre les diff&eacute;rentes versions faites par les utilisateurs. Notre exp&eacute;rience nous a montr&eacute; qu'il ne s'agit pas d'un probl&egrave;me majeur. De nombreuses versions d'Emacs ont &eacute;t&eacute; faites en dehors du cadre du Projet GNU, mais les utilisateurs peuvent les diff&eacute;rencier. La GPL requiert que l'auteur d'une version mette son nom dessus, pour la distinguer des autres versions et prot&eacute;ger la r&eacute;putation des autres mainteneurs.

source: <b><a href="#TOCGPLRequireSourcePostedPublic" name="GPLRequireSourcePostedPublic"> Does the GPL require that source code of modified versions be posted to the public?</a></b>
fr: <b><a href="#TOCGPLRequireSourcePostedPublic" name="GPLRequireSourcePostedPublic">Est-ce que la GPL requiert que le code source des versions modifi&eacute;es soit port&eacute; &agrave; la connaissance du public&nbsp;?</a></b>

source: The GPL does not require you to release your modified version. You are free to make modifications and use them privately, without ever releasing them. This applies to organizations (including companies), too; an organization can make a modified version and use it internally without ever releasing it outside the organization.
fr: La GPL n'exige pas que vous publiiez votre version modifi&eacute;e. Vous &ecirc;tes libre de faire des modifications et de les utiliser &agrave; titre priv&eacute;, sans jamais les publier. Ceci s'applique aussi aux organisations (y compris les soci&eacute;t&eacute;s); une organisation peut r&eacute;aliser une version modifi&eacute;e et l'utiliser en interne sans jamais la diffuser en dehors de l'organisation.

source: But <em>if</em> you release the modified version to the public in some way, the GPL requires you to make the modified source code available to the program's users, under the GPL.
fr: Mais <em>si</em> vous distribuez la version modifi&eacute;e au public de quelque mani&egrave;re que soit, la GPL vous oblige &agrave; rendre la version du code source modifi&eacute;e disponible pour les utilisateurs, sous GPL.

source: Thus, the GPL gives permission to release the modified program in certain ways, and not in other ways; but the decision of whether to release it is up to you.
fr: Ainsi, la GPL autorise &agrave; distribuer des programmes modifi&eacute;s sous certaines conditions, et pas sous d'autres; mais la d&eacute;cision de le distribuer vous regarde.

source: <b><a href="#TOCGPLAndNonfreeOnSameMachine" name="GPLAndNonfreeOnSameMachine"> Can I have a GPL-covered program and an unrelated non-free program on the same computer?</a></b>
fr: <b><a href="#TOCGPLAndNonfreeOnSameMachine" name="GPLAndNonfreeOnSameMachine">Puis-je avoir un programme couvert par la GPL et programme non-libre ind&eacute;pendant sur le m&ecirc;me ordinateur&nbsp;?</a></b>

source: Yes. The &ldquo;mere aggregation&rdquo; clause in the GPL makes this permission explicit, but that only reinforces what we believe would be true anyway.
fr: Oui. La clause de &laquo;&nbsp;mere aggregation&nbsp;&raquo; (simple aggr&eacute;gation) de la GPL rend cette autorisation explicite, mais cela renforce seulement ce que nous pensons &ecirc;tre correct.

source: <b><a href="#TOCCanIDemandACopy" name="CanIDemandACopy">If I know someone has a copy of a GPL-covered program, can I demand he give me a copy?</a></b>
fr: <b><a href="#TOCCanIDemandACopy" name="CanIDemandACopy">Si je connais quelqu'un qui a une copie d'un programme couvert par la GPL, puis-je lui demander de me donner une copie&nbsp;?</a></b>

source: No. The GPL gives him permission to make and redistribute copies of the program <em>if he chooses to do so</em>. He also has the right not to redistribute the program, if that is what he chooses.
fr: Non. La GPL lui donne la permission de faire et de redistribuer des copies du programme <em>s'il choisit de le faire</em>. Il a &eacute;galement le droit de ne pas redistribuer le programme, si c'est son choix.

source: <b><a href="#TOCWhatDoesWrittenOfferValid" name="WhatDoesWrittenOfferValid"> What does this &ldquo;written offer valid for any third party&rdquo; mean? Does that mean everyone in the world can get the source to any GPL'ed program no matter what?</a></b>
fr: <b><a href="#TOCWhatDoesWrittenOfferValid" name="WhatDoesWrittenOfferValid">Que veut dire &laquo;&nbsp;offre &eacute;crite valide pour n'importe quel tiers&nbsp;&raquo; (<i>written offer valid for any third party</i>)&nbsp;? Cela signifie-t-il que n'importe qui peut obtenir les sources de n'importe quel programme sous GPL dans tous les cas&nbsp;?</a></b>

source: If you choose to provide source through a written offer, then anybody who requests the source from you is entitled to receive it.
fr: &laquo;&nbsp;Valide pour n'importe quel tiers&nbsp;&raquo; (<i>&laquo;&nbsp;Valid for any third party&nbsp;&raquo;</i>) signifie que quiconque dispose de cette offre de votre part peut l'accepter.

source: If you commercially distribute binaries not accompanied with source code, the GPL says you must provide a written offer to distribute the source code later. When users non-commercially redistribute the binaries they received from you, they must pass along a copy of this written offer. This means that people who did not get the binaries directly from you can still receive copies of the source code, along with the written offer.
fr: Si vous distribuez commercialement des fichiers binaires non accompagn&eacute;s du code source, la GPL dit que vous devez fournir une offre &eacute;crite de distribuer le code source ult&eacute;rieurement. Quand les utilisateurs redistribuent non commercialement les fichiers binaires qu'ils ont obtenu aupr&egrave;s de vous, ils doivent transmettre en m&ecirc;me temps une copie de cette offre &eacute;crite. Ce qui veut dire que les personnes n'ayant pas r&eacute;cup&eacute;r&eacute; les fichiers binaires directement aupr&egrave;s de vous peuvent quand m&ecirc;me recevoir une copie du code source, selon l'offre &eacute;crite.

source: The reason we require the offer to be valid for any third party is so that people who receive the binaries indirectly in that way can order the source code from you.
fr: La raison pour laquelle nous exigeons que l'offre soit valide pour n'importe quel tiers est qu'ainsi les personnes qui re&ccedil;oivent les fichiers binaires indirectement de cette fa&ccedil;on peuvent ainsi commander le code source aupr&egrave;s de vous.

source: <b><a href="#TOCTheGPLSaysModifiedVersions" name="TheGPLSaysModifiedVersions">The GPL says that modified versions, if released, must be &ldquo;licensed &hellip; to all third parties.&rdquo; Who are these third parties?</a></b>
fr: <b><a href="#TOCTheGPLSaysModifiedVersions" name="TheGPLSaysModifiedVersions">La GPL dit que les versions modifi&eacute;es, si elles sont diffus&eacute;es, doivent &ecirc;tre &laquo;&nbsp;donner une licence&hellip; pour tout tiers&raquo; (<i>&laquo;&nbsp;licensed&hellip; to all third parties&nbsp;&raquo;.</i>). Qui sont ces tiers&nbsp;?</a></b>

source: Section 2 says that modified versions you distribute must be licensed to all third parties under the GPL. &ldquo;All third parties&rdquo; means absolutely everyone&mdash;but this does not require you to <strong>do</strong> anything physically for them. It only means they have a license from you, under the GPL, for your version.
fr: La section 2 dit que vous devez donner &agrave; tous les tiers une licence sous GPL sur les versions modifi&eacute;es que vous distribuez. &laquo;&nbsp;&Agrave; tous les tiers&nbsp;&raquo; (<i>&laquo;&nbsp;all third parties&nbsp;&raquo;</i>) signifie absolument tout le monde &mdash;&nbsp;mais &ccedil;a ne vous oblige pas &agrave; *faire* quelque chose physiquement pour eux. Cela veut seulement dire qu'ils ont une obtenu une licence de votre part, sous la GPL, pour votre version.

source: <b><a href="#TOCRequiredToClaimCopyright" name="RequiredToClaimCopyright">Am I required to claim a copyright on my modifications to a GPL-covered program?</a></b>
fr: <b><a href="#TOCRequiredToClaimCopyright" name="RequiredToClaimCopyright">Dois-je revendiquer un copyright pour mes modifications sur un programme couvert par la GPL&nbsp;?</a></b>

source: You are not required to claim a copyright on your changes. In most countries, however, that happens automatically by default, so you need to place your changes explicitly in the public domain if you do not want them to be copyrighted.
fr: Vous n'&ecirc;tes oblig&eacute; de revendiquer un copyright sur vos modifications. Dans la plupart des pays, cependant, ceci arrive automatiquement par d&eacute;faut, aussi vous devrez mettre de fa&ccedil;on explicite les modifications dans le domaine public si vous ne voulez pas qu'elles soient sous copyright.

source: Whether you claim a copyright on your changes or not, either way you must release the modified version, as a whole, under the GPL. (<a href="#GPLRequireSourcePostedPublic">if you release your modified version at all</a>)
fr: Que vous revendiquiez ou non un copyright sur vos modifications, vous devrez publier la version modifi&eacute;e, dans son entier, sous la GPL. (<a href="#GPLRequireSourcePostedPublic">si vous la publiez</a>).

source: <b><a href="#TOCCombinePublicDomainWithGPL" name="CombinePublicDomainWithGPL">If a program combines public-domain code with GPL-covered code, can I take the public-domain part and use it as public domain code?</a></b>
fr: <b><a href="#TOCCombinePublicDomainWithGPL" name="CombinePublicDomainWithGPL">Si un programme combine du code du domaine public et du code couvert sous GPL, Puis-je prendre la partie d&eacute;pendant du domaine public et l'utiliser comme tel&nbsp;?</a></b>

source: You can do that, if you can figure out which part is the public domain part and separate it from the rest. If code was put in the public domain by its developer, it is in the public domain no matter where it has been.
fr: Vous pouvez le faire, si vous pouvez d&eacute;terminer quelle part fait partie du domaine public et la s&eacute;parer du reste. Si du code a &eacute;t&eacute; mis dans le domaine public par son d&eacute;veloppeur, il est dans le domaine public peu importe ou il &eacute;tait auparavant.

source: <b><a href="#TOCDoesTheGPLAllowMoney" name="DoesTheGPLAllowMoney"> Does the GPL allow me to sell copies of the program for money?</a></b>
fr: <b><a href="#TOCDoesTheGPLAllowMoney" name="DoesTheGPLAllowMoney">Est-ce que la GPL m'autorise &agrave; vendre des copies payantes de mon programme&nbsp;?</a></b>

source: Yes, the GPL allows everyone to do this. The <a href="/philosophy/selling.html"> right to sell copies </a> is part of the definition of free software. Except in one special situation, there is no limit on what price you can charge. (The one exception is the required written offer to provide source code that must accompany binary-only release.)
fr: Oui, la GPL autorise cela pour tout le monde. Le <a href="/philosophy/selling.fr.html">droit de vendre des copies</a> est une partie de la d&eacute;finition du logiciel libre.

source: <b><a href="#TOCDoesTheGPLAllowDownloadFee" name="DoesTheGPLAllowDownloadFee"> Does the GPL allow me to charge a fee for downloading the program from my site?</a></b>
fr: <b><a href="#TOCDoesTheGPLAllowDownloadFee" name="DoesTheGPLAllowDownloadFee">La GPL me permet-elle de demander de l'argent pour le t&eacute;l&eacute;chargement d'un programme sur mon site&nbsp;?</a></b>

source: Yes. You can charge any fee you wish for distributing a copy of the program. If you distribute binaries by download, you must provide &ldquo;equivalent access&rdquo; to download the source&mdash;therefore, the fee to download source may not be greater than the fee to download the binary.
fr: Oui. Vous pouvez demander le montant que vous souhaitez pour distribuer une copie du programme. Si vous distribuez des ex&eacute;cutables en t&eacute;l&eacute;chargement, vous devez fournir un &laquo;&nbsp;acc&egrave;s &eacute;quivalent&nbsp;&raquo; pour le t&eacute;l&eacute;chargement de sources &mdash;&nbsp;cependant, le montant du t&eacute;l&eacute;chragement des sources ne doit pas &ecirc;tre plus important que celui du t&eacute;l&eacute;chargement des ex&eacute;cutables.

source: <b><a href="#TOCDoesTheGPLAllowRequireFee" name="DoesTheGPLAllowRequireFee"> Does the GPL allow me to require that anyone who receives the software must pay me a fee and/or notify me?</a></b>
fr: <b><a href="#TOCDoesTheGPLAllowRequireFee" name="DoesTheGPLAllowRequireFee">Est-ce que la GPL m'autorise &agrave; exiger que quiconque re&ccedil;oit le logiciel doive me payer un montant et/ou me le signaler&nbsp;?</a></b>

source: No. In fact, a requirement like that would make the program non-free. If people have to pay when they get a copy of a program, or if they have to notify anyone in particular, then the program is not free. See the <a href="/philosophy/free-sw.html"> definition of free software</a>.
fr: Non. D'ailleurs, une telle exigence rendrait le programme non-libre. Si l'on doit payer pour recevoir une copie d'un programme, ou si l'on doit le signaler &agrave; quelqu'un en particulier, alors le programme n'est pas libre. Voir la <a href="/philosophy/free-sw.fr.html">d&eacute;finition du logiciel libre</a>.

source: The GPL is a free software license, and therefore it permits people to use and even redistribute the software without being required to pay anyone a fee for doing so.
fr: La GPL est une licence de logiciel libre, et par cons&eacute;quent elle permet l'utilisation et m&ecirc;me la redistribution du logiciel sans que l'on ait &agrave; payer de droit &agrave; quiconque pour cela.

source: <b><a href="#TOCDoesTheGPLRequireAvailabilityToPublic" name="DoesTheGPLRequireAvailabilityToPublic">If I distribute GPL'd software for a fee, am I required to also make it available to the public without a charge?</a></b>
fr: <b><a href="#TOCDoesTheGPLRequireAvailabilityToPublic" name="DoesTheGPLRequireAvailabilityToPublic">Si je distribue un programme couvert par la GPL contre r&eacute;mun&eacute;ration, suis-je oblig&eacute; de le rendre &eacute;galement disponible au public gratuitement&nbsp;?</a></b>

source: No. However, if someone pays your fee and gets a copy, the GPL gives them the freedom to release it to the public, with or without a fee. For example, someone could pay your fee, and then put her copy on a web site for the general public.
fr: Non. Cependant, si quelqu'un paie pour obtenir une copie, la GPL lui donne la libert&eacute; de la rendre disponible au public, avec ou sans r&eacute;tribution. Par exemple, quelqu'un pourrait payer un montant, puis mettre sa copie sur un site Web &agrave; disposition du public.

source: <b><a href="#TOCDoesTheGPLAllowNDA" name="DoesTheGPLAllowNDA"> Does the GPL allow me to distribute copies under a nondisclosure agreement?</a></b>
fr: <b><a href="#TOCDoesTheGPLAllowNDA" name="DoesTheGPLAllowNDA">La GPL me permet-elle de distribuer des copies sous accord de non divulgation&nbsp;?</a></b>

source: No. The GPL says that anyone who receives a copy from you has the right to redistribute copies, modified or not. You are not allowed to distribute the work on any more restrictive basis.
fr: Non. La GPL dit que quiconque re&ccedil;oit une copie de votre version de votre part a le droit de redistribuer des copies (modifi&eacute;es ou non) de cette version. Elle ne vous donne pas le droit de distribuer votre travail avec plus de restrictions.

source: If someone asks you to sign an NDA for receiving GPL-covered copyright FSF, please inform the FSF immediately by writing to license-violation@gnu.org.
fr: Si quelqu'un vous demande de signer un accord de non-divulgation pour un logiciel couvert par la GPL sous copyright de la FSF, veuillez en informer immédiatement la FSF en écrivant à license-violation@gnu.org.

source: If the violation involves GPL-covered code that has some other copyright holder, please inform that copyright holder, just as you would for any other kind of violation of the GPL.
fr: Si la violation concerne du code couvert par la GPL dont le détenteur de copyright est autre, veuillez en informer ce détenteur du copyright, comme vous le feriez pour toute autre violation de la GPL.

source: <b><a href="#TOCDoesTheGPLAllowModNDA" name="DoesTheGPLAllowModNDA"> Does the GPL allow me to distribute a modified or beta version under a nondisclosure agreement?</a></b>
fr: <b><a href="#TOCDoesTheGPLAllowModNDA" name="DoesTheGPLAllowModNDA">La GPL me permet-elle de distribuer une version modifiée ou beta sous accord de non-divulgation&nbsp;?</a></b>

source: No. The GPL says that your modified versions must carry all the freedoms stated in the GPL. Thus, anyone who receives a copy of your version from you has the right to redistribute copies (modified or not) of that version. You may not distribute any version of the work on a more restrictive basis.
fr: Non. La GPL stipule que vos versions modifiées doivent avoir toutes les libertés indiquées dans la GPL. Par conséquent, quiconque reçoit une copie de votre version a le droit de redistribuer des copies (modifiées ou non) de cette version. Vous ne pouvez pas redistribuer de version de ce travail sur des bases plus restrictives.

source: <b><a href="#TOCDevelopChangesUnderNDA" name="DevelopChangesUnderNDA"> Does the GPL allow me to develop a modified version under a nondisclosure agreement?</a></b>
fr: <b><a href="#TOCDevelopChangesUnderNDA" name="DevelopChangesUnderNDA">La GPL me permet-elle de d&eacute;velopper une version modifi&eacute;e sous accord de non divulgation&nbsp;?</a></b>

source: Yes. For instance, you can accept a contract to develop changes and agree not to release <em>your changes</em> until the client says ok. This is permitted because in this case no GPL-covered code is being distributed under an NDA.
fr: Oui. Par exemple, vous pouvez accepter un contrat pour d&eacute;velopper des modifications et accepter de ne pas publier <em>vos modifications</em> jusqu'&agrave; ce que le client soit d'accord. Ceci est permis car dans ce cas aucun code couvert par la GPL n'est distribu&eacute; sous accord de non divulgation.

source: You can also release your changes to the client under the GPL, but agree not to release them to anyone else unless the client says ok. In this case, too, no GPL-covered code is being distributed under an NDA, or under any additional restrictions.
fr: Vous pouvez &eacute;galement publier vos modifications pour le client sous GPL, mais accepter de ne pas les diffuser &agrave; d'autres personnes &agrave; moins que le client ne soit d'accord. Dans ce cas aussi, aucun code couvert par la GPL n'est distribu&eacute; sous accord de non divulgation, ou toute autre restriction suppl&eacute;mentaire.

source: The GPL would give the client the right to redistribute your version. In this scenario, the client will probably choose not to exercise that right, but does <em>have</em> the right.
fr: La GPL donne le droit au client de redistributer votre version. Dans ce sc&eacute;nario, le client choisira probablement de ne pas exercer ce droit, mais il <em>a</em> le droit de le faire.

source: <b><a href="#TOCIWantCredit" name="IWantCredit">I want to get credit for my work. I want people to know what I wrote. Can I still get credit if I use the GPL?</a></b>
fr: <b><a href="#TOCIWantCredit" name="IWantCredit">Je veux que mon travail soit reconnu. Je veux que les gens sachent ce que j'ai &eacute;crit. Puis-je encore &ecirc;tre reconnu si j'utilise la GPL&nbsp;?</a></b>

source: You can certainly get credit for the work. Part of releasing a program under the GPL is writing a copyright notice in your own name (assuming you are the copyright holder). The GPL requires all copies to carry an appropriate copyright notice.
fr: Votre travail doit certainement &ecirc;tre reconnu. La distribution d'un programme sous licence GPL doit aussi se traduire par la mention d'un copyright &agrave; votre propre nom (&agrave; supposer que vous d&eacute;teniez ce copyright). La GPL requiert que chaque copie porte une mention de copyright appropri&eacute;e.
