Repository: gitGNU/gnu_www-fr
Catalog: licenses/old-licenses/gpl-2.0-faq.*.po
Languages: fr

source: When the interpreter just interprets a language, the answer is yes. The interpreted program, to the interpreter, is just data; the GPL doesn't restrict what tools you process the program with.
fr: Quand un interpr&eacute;teur interpr&egrave;te seulement un langage, la r&eacute;ponse est oui. Le programme interpr&eacute;t&eacute; est juste des donn&eacute;es, pour l'interpr&eacute;teur; la GPL ne restreint pas les outils avec lesquels vous traitez le programme.

source: However, when the interpreter is extended to provide &ldquo;bindings&rdquo; to other facilities (often, but not necessarily, libraries), the interpreted program is effectively linked to the facilities it uses through these bindings. The JNI or Java Native Interface is an example of such a facility; libraries that are accessed in this way are linked dynamically with the Java programs that call them.
fr: Cependant, lorsque l'interpr&eacute;teur est &eacute;tendu pour fournir des &laquo;&nbsp;bindings&nbsp;&raquo; (interfaces) vers d'autres dispositifs (souvent, mais pas n&eacute;cessairement, des biblioth&egrave;ques), le programme interpr&eacute;t&eacute; est effectivement li&eacute; aux dispositifs qu'il utilise &agrave; travers ces interfaces. La JNI ou Java Native Interface est un exemple d'un tel dispositif; les biblioth&egrave;ques auxquelles on acc&egrave;de de cette fa&ccedil;on sont li&eacute;es dynamiquement avec les programmes Java qui les appellent.

source: So if these facilities are released under a GPL-incompatible license, the situation is like linking in any other way with a GPL-incompatible library. Which implies that:
fr: Ainsi si ces dispositifs sont diffus&eacute;s sous une licence incompatible avec la GPL, la situation est similaire dans tout autre aspect &agrave; l'&eacute;dition de liens avec une biblioth&egrave;que non compatible avec la GPL. Ce qui implique que&nbsp;:

source: If you are writing code and releasing it under the GPL, you can state an explicit exception giving permission to link it with those GPL-incompatible facilities.
fr: Si vous &eacute;crivez du code et le diffusez sous GPL, vous pouvez d&eacute;finir une exception explicite donnant l'autorisation d'en faire une &eacute;dition de liens avec ces dispositifs incompatibles avec la GPL.

source: If you wrote and released the program under the GPL, and you designed it specifically to work with those facilities, people can take that as an implicit exception permitting them to link it with those facilities. But if that is what you intend, it is better to say so explicitly.
fr: Si vous avez &eacute;crit et diffus&eacute; le programme sous GPL, et que vous l'avez con&ccedil;u sp&eacute;cifiquement pour fonctionner avec ces dispositifs, on peut consid&eacute;rer qu'il y a une exception implicite autorisant une &eacute;dition de lien avec ces dispositifs. Mais si c'est ce que vous souhaitez, il est pr&eacute;f&eacute;rable de le d&eacute;clarer de fa&ccedil;on explicite.

source: You can't take someone else's GPL-covered code and use it that way, or add such exceptions to it. Only the copyright holders of that code can add the exception.
fr: Vous ne pouvez pas prendre le code de quelqu'un d'autre couvert par la GPL et l'utiliser de de cette fa&ccedil;on, ou y ajouter de telles exceptions. Seul le d&eacute;tenteur du copyright pour ce code peut ajouter l'exception.

source: <b><a href="#TOCWhoHasThePower" name="WhoHasThePower">Who has the power to enforce the GPL?</a></b>
fr: <b><a href="#TOCWhoHasThePower" name="WhoHasThePower">Qui a la capacit&eacute; de faire respecter la GPL&nbsp;?</a></b>

source: Since the GPL is a copyright license, the copyright holders of the software are the ones who have the power to enforce the GPL. If you see a violation of the GPL, you should inform the developers of the GPL-covered software involved. They either are the copyright holders, or are connected with the copyright holders. <a href="http://www.fsf.org/licenses/gpl-faq.html#ReportingViolation">Learn more about reporting GPL violations.</a>
fr: Puisque la GPL est une licence de copyright, les d&eacute;tenteurs du copyright du logiciel sont ceux qui ont la capacit&eacute; de faire respecter la GPL. Si vous constatez une violation de la GPL, vous devriez en informer les d&eacute;veloppeurs du logiciel couvert par la GPL concern&eacute;. Ils sont soit les d&eacute;tenteurs du copyright, ou bien sont li&eacute;s au d&eacute;tenteur du copyright.

source: <b><a href="#TOCOOPLang" name="OOPLang"> In an object-oriented language such as Java, if I use a class that is GPL'ed without modifying, and subclass it, in what way does the GPL affect the larger program?</a></b>
fr: <b><a href="#TOCOOPLang" name="OOPLang">Dans un langage orient&eacute;-objet comme Java, si j'utilise une classe qui est sous GPL sans la modifier et que j'en h&eacute;rite, dans quelle mesure la GPL affecte-t-elle le programme r&eacute;sultant&nbsp;?</a></b>

source: Subclassing is creating a derivative work. Therefore, the terms of the GPL affect the whole program where you create a subclass of a GPL'ed class.
fr: Une sous-classe cr&eacute;&eacute;e par h&eacute;ritage est un travail d&eacute;riv&eacute;. Ainsi, les termes de la GPL s'appliquent &agrave; l'ensemble du programme dans lequel vous cr&eacute;ez une sous-classe d'une classe sous GPL.

source: <b><a href="#TOCPortProgramToGL" name="PortProgramToGL">If I port my program to GNU/Linux, does that mean I have to release it as Free Software under the GPL or some other Free Software license?</a></b>
fr: <b><a href="#TOCPortProgramToGL" name="PortProgramToGL">Si je fais un portage de mon programme vers GNU/Linux, est-ce que cela signifie que je doive le diffuser en tant que Logiciel Libre plac&eacute; sous la GPL ou une autre licence de Logiciel Libre&nbsp;?</a></b>

source: In general, the answer is no&mdash;this is not a legal requirement. In specific, the answer depends on which libraries you want to use and what their licenses are. Most system libraries either use the <a href="/copyleft/lesser.html">GNU Lesser GPL</a>, or use the GNU GPL plus an exception permitting linking the library with anything. These libraries can be used in non-free programs; but in the case of the Lesser GPL, it does have some requirements you must follow.
fr: De fa&ccedil;on g&eacute;n&eacute;rale, la r&eacute;ponse est non &mdash;&nbsp;ce n'est pas une exigence l&eacute;gale. De fa&ccedil;on plus sp&eacute;cifique, la r&eacute;ponse d&eacute;pend des biblioth&egrave;ques que vous d&eacute;sirez utiliser et de leurs licences. La plupart des biblioth&egrave;ques syst&egrave;me utilisent soit la <a href="/copyleft/lesser.html">GNU Lesser GPL</a> (GNU GPL Amoindrie), ou utilisent la GNU GPL plus une exception permettant l'&eacute;dition de liens de la biblioth&egrave;que avec quoique ce soit. Ces biblioth&egrave;ques peuvent &ecirc;tre utilis&eacute;es dans des programmes non-libres; mais dans le cas de la GPL Amoindrie, elle comporte des exigences que vous devez suivre.

source: Some libraries are released under the GNU GPL alone; you must use a GPL-compatible license to use those libraries. But these are normally the more specialized libraries, and you would not have had anything much like them on another platform, so you probably won't find yourself wanting to use these libraries for simple porting.
fr: Certaines biblioth&egrave;ques sont diffus&eacute;es sous la GNU GPL seule&nbsp;; vous devez utiliser une licence compatible GPL pour utiliser ces biblioth&egrave;ques. Mais c'est normalement les biblioth&egrave;ques les plus sp&eacute;cialis&eacute;es, et vous n'auriez pas eu quelque chose de similaire sur une autre plateforme, donc vous n'aurez probablement pas besoin de ces biblioth&egrave;ques pour un simple portage.

source: Of course, your software is not a contribution to our community if it is not free, and people who value their freedom will refuse to use it. Only people willing to give up their freedom will use your software, which means that it will effectively function as an inducement for people to lose their freedom.
fr: Bien s&ucirc;r, votre logiciel n'est pas une contribution &agrave; notre communaut&eacute; s'il n'est pas libre, et ceux qui accordent de la valeur &agrave; leur libert&eacute; refuseront de l'utiliser. Le r&eacute;sultat sera qu'il constituera une incitation &agrave; l'abandon de cette libert&eacute;, et sera seulement utile &agrave; ceux qui auront fait cela. Si vous esp&eacute;rez un jour jeter un regard en arri&egrave;re sur votre carri&egrave;re et sentir que votre travail a &eacute;t&eacute; plus qu'une fa&ccedil;on de gagner de l'argent, cela devrait vous inciter &agrave; rendre votre programme libre.

source: If you hope some day to look back on your career and feel that it has contributed to the growth of a good and free society, you need to make your software free.
fr: Si vous espérez un jour vous faire le point sur votre carrière et sentir qu'elle a contribué à la croissance d'une société bonne et libre, vous devez rendre vos logiciels libres.

source: <b><a href="#TOCCompanyGPLCostsMoney" name="CompanyGPLCostsMoney"> I just found out that a company has a copy of a GPL'ed program, and it costs money to get it. Aren't they violating the GPL by not making it available on the Internet?</a></b>
fr: <b><a href="#TOCCompanyGPLCostsMoney" name="CompanyGPLCostsMoney">Je viens de d&eacute;couvrir qu'une compagnie a une copie d'un programme sous GPL, et qu'il faut payer pour l'obtenir. Ne violent-ils pas la GPL en ne la rendant pas disponible sur Internet&nbsp;?</a></b>

source: No. The GPL does not require anyone to use the Internet for distribution. It also does not require anyone in particular to redistribute the program. And (outside of one special case), even if someone does decide to redistribute the program sometimes, the GPL doesn't say he has to distribute a copy to you in particular, or any other person in particular.
fr: Non. La GPL n'oblige personne &agrave; utiliser Internet pour la distribution. Elle ne requiert pas non plus que quelqu'un en particulier redistribue le programme. Et (en dehors d'un cas particulier), m&ecirc;me si quelqu'un d&eacute;cide parfois de redistribuer le programme, la GPL ne dit pas qu'il doit vous distribuer une copie &agrave; vous en particulier, ou tout autre personne en particulier.

source: What the GPL requires is that he must have the freedom to distribute a copy to you <em>if he wishes to</em>. Once the copyright holder does distribute a copy program to someone, that someone can then redistribute the program to you, or to anyone else, as he sees fit.
fr: Ce que la GPL exige, c'est qu'il ait la libert&eacute; de vous en distribuer une copie <em>s'il le souhaite</em>. Une fois que le d&eacute;tenteur du copyright distribue une copie du programme &agrave; quelqu'un, ce quelqu'un peut alors vous redistribuer le programme, ou &agrave; n'importe qui d'autre, comme &ccedil;a lui convient.

source: <b><a href="#TOCReleaseNotOriginal" name="ReleaseNotOriginal"> Can I release a program with a license which says that you can distribute modified versions of it under the GPL but you can't distribute the original itself under the GPL?</a></b>
fr: <b><a href="#TOCReleaseNotOriginal" name="ReleaseNotOriginal">Puis-je publier un programme avec une licence stipulant que vous pouvez redistribuer des versions modifi&eacute;es de celui-ci sous la GPL mais pas l'original lui-m&ecirc;me sous GPL&nbsp;?</a></b>

source: No. Such a license would be self-contradictory. Let's look at its implications for me as a user.
fr: Non. Une telle licence serait contradictoire. Regardons ses implications pour moi l'utilisateur.

source: Suppose I start with the original version (call it version A), add some code (let's imagine it is 1000 lines), and release that modified version (call it B) under the GPL. The GPL says anyone can change version B again and release the result under the GPL. So I (or someone else) can delete those 1000 lines, producing version C which has the same code as version A but is under the GPL.
fr: Supposons que je commence avec la version originale (appelons-la version A), que j'ajoute du code (disons 1000 lignes), et que je publie cette version (appelons-la B) sous la GPL. La GPL dit que quiconque peut changer la version B &agrave; nouveau et publier le r&eacute;sultat sous la GPL. Aussi je peux (ou quelqu'un d'autre) supprimer ces 1000 lignes, en produisant la version C qui a le m&ecirc;me code que la version A mais sous la GPL.

source: If you try to block that path, by saying explicitly in the license that I'm not allowed to reproduce something identical to version A under the GPL by deleting those lines from version B, in effect the license now says that I can't fully use version B in all the ways that the GPL permits. In other words, the license does not in fact allow a user to release a modified version such as B under the GPL.
fr: Si vous essayez de bloquer ceci, en disant explicitement dans la licence que je ne suis pas autoris&eacute; &agrave; reproduire quelque chose identique &agrave; la version A sous la GPL en supprimant ces lignes de la version B, en fait la licence dit maintenant que je ne peux pas utiliser enti&egrave;rement la version B des toutes les mani&egrave;res que l'autorise la GPL. En d'autres mots, la licence n'autorise pas en fait un utilisateur &agrave; publier une version telle que la version B sous la GPL.

source: <b><a href="#TOCDistributeSubsidiary" name="DistributeSubsidiary"> Does moving a copy to a majority-owned, and controlled, subsidiary constitute distribution?</a></b>
fr: <b><a href="#TOCDistributeSubsidiary" name="DistributeSubsidiary">Est-ce que d&eacute;placer une copie vers une filiale contr&ocirc;l&eacute;e majoritairement constitue une distribution&nbsp;?</a></b>

source: Whether moving a copy to or from this subsidiary constitutes 'distribution' is a matter to be decided in each case under the copyright law of the appropriate jurisdiction. The GPL does not and cannot override local laws. US copyright law is not entirely clear on the point, but appears not to consider this distribution.
fr: Que le d&eacute;placement vers ou &agrave; partir de cette filiale constitue une &laquo;&nbsp;distribution&nbsp;&raquo; ou pas est une question qui doit &ecirc;tre d&eacute;cid&eacute;e en fonction de la loi sur le droit d'auteur et de la juridiction appropri&eacute;s. La GPL ne surpasse pas les lois locales. La loi sur le droit d'auteur am&eacute;ricain n'est pas totalement claire sur ce point, mais ne semble pas traiter de ce cas de distribution.

source: If, in some country, this is considered distribution, and the subsidiary must receive the right to redistribute the program, that will not make a practical difference. The subsidiary is controlled by the parent company; rights or no rights, it won't redistribute the program unless the parent company decides to do so.
fr: Si, dans certains pays, c'est consid&eacute;r&eacute; comme une distribution, et que la filiale doit recevoir le droit de redistribuer le programme, cela ne fera pas de grande diff&eacute;rence. La filiale est contr&ocirc;l&eacute;e par la soci&eacute;t&eacute; m&egrave;re; droits ou pas droits, elle ne redistribuera pas le programme &agrave; moins que la soci&eacute;t&eacute; m&egrave;re ne le d&eacute;cide.

source: <b><a href="#TOCClickThrough" name="ClickThrough"> Can software installers ask people to click to agree to the GPL? If I get some software under the GPL, do I have to agree to anything?</a></b>
fr: <b><a href="#TOCClickThrough" name="ClickThrough">Est-ce que des installeurs de logiciels peuvent demander aux gens de cliquer pour accepter la GPL&nbsp;? Si j'obtiens un logiciel sous GPL, dois-je tout accepter quoi&nbsp;?</a></b>

source: Some software packaging systems have a place which requires you to click through or otherwise indicate assent to the terms of the GPL. This is neither required nor forbidden. With or without a click through, the GPL's rules remain the same.
fr: Certains syst&egrave;mes d'empaquetage de logiciel ont une partie qui n&eacute;cessite de cliquer ou d'indiquer votre accord des termes de la GPL. Ce n'est ni requis, ni interdit. Avec ou sans clic, les r&egrave;gles de la GPL demeurent les m&ecirc;mes.

source: Merely agreeing to the GPL doesn't place any obligations on you. You are not required to agree to anything to merely use software which is licensed under the GPL. You only have obligations if you modify or distribute the software. If it really bothers you to click through the GPL, nothing stops you from hacking the GPLed software to bypass this.
fr: Le fait d'accepter les termes de la GPL ne vous obligent &agrave; rien. Vous n'&ecirc;tes pas oblig&eacute; d'accepter quoi que ce soit pour seulement utiliser le logiciel sous licence GPL. Vous avez des obligations seulement si vous modifier ou distribuer le logiciel. Si cela vous ennuie vraiment de cliquer pour accepter l'accord de licence de la GPL, rien ne vous emp&ecirc;che de modifier le logiciel pour passer outre.

source: <b><a href="#TOCGPLCompatInstaller" name="GPLCompatInstaller">I would like to bundle GPLed software with some sort of installation software. Does that installer need to have a GPL-compatible license?</a></b>
fr: <b><a href="#TOCGPLCompatInstaller" name="GPLCompatInstaller">Je voudrais fournir un logiciel sous GPL avec un installeur. Cet installeur doit-il &ecirc;tre compatible avec la licence GPL&nbsp;?</a></b>

source: No. The installer and the files it installs are separate works. As a result, the terms of the GPL do not apply to the installation software.
fr: Non. L'installeur et les fichiers qu'il installe sont des travaux s&eacute;par&eacute;s. Par cons&eacute;quent, les termes de la GPL ne s'appliquent pas au logiciel d'installation.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;: <ol><li id="TransNote1">La notion de &laquo;&nbsp;<i>fair use</i>&nbsp;&raquo; (litt. &laquo;&nbsp;utilisation correcte&nbsp;&raquo;) est d&eacute;termin&eacute;e pr&eacute;cis&eacute;ment dans la l&eacute;gislation des &Eacute;tats-Unis d'Am&eacute;rique. Nous l'avons donc laiss&eacute;e telle-quelle dans la traduction. Il vous appartient de v&eacute;rifier si une telle notion existe &eacute;galement dans votre syst&egrave;me juridique.</li></ol>

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Vincent Veyron et Olivier Berger.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
