Repository: gitGNU/gnu_www-fr
Catalog: licenses/old-licenses/gpl-2.0-faq.*.po
Languages: fr

source: Although we will not raise legal objections to your making a modified license in this way, we hope you will think twice and not do it. Such a modified license is almost certainly <a href="#WhatIsCompatible"> incompatible with the GNU GPL</a>, and that incompatibility blocks useful combinations of modules. The mere proliferation of different free software licenses is a burden in and of itself.
fr: Bien que nous n'objecterons pas de raisons juridiques pour modifier la licence de cette mani&egrave;re, nous esp&eacute;rons que vous y r&eacute;fl&eacute;chirez &agrave; deux fois et que vous ne le ferez pas. Une telle licence modifi&eacute;e est presque s&ucirc;rement <a href="#WhatIsCompatible">incompatible avec la GPL GNU</a>, et cette incompatibilit&eacute; bloque des combinaisons utiles de modules. La prolif&eacute;ration de diff&eacute;rentes licences de logiciels libres est un fardeau en soi.

source: <b><a href="#TOCGPLCommercially" name="GPLCommercially">If I use a piece of software that has been obtained under the GNU GPL, am I allowed to modify the original code into a new program, then distribute and sell that new program commercially?</a></b>
fr: <b><a href="#TOCGPLCommercially" name="GPLCommercially">Si j'utilise un morceau de logiciel que j'ai obtenu sous GNU GPL, ai-je le droit de modifier le code original pour cr&eacute;er un nouveau programme, puis de commercialiser ce programme&nbsp;?</a></b>

source: You are allowed to sell copies of the modified program commercially, but only under the terms of the GNU GPL. Thus, for instance, you must make the source code available to the users of the program as described in the GPL, and they must be allowed to redistribute and modify it as described in the GPL.
fr: Vous &ecirc;tes autoris&eacute; &agrave; vendre des copies du programme modifi&eacute;, mais uniquement selon les termes de la GNU GPL. Ainsi, par exemple, vous devez rendre le code source disponible pour les utilisateurs du programme comme pr&eacute;cis&eacute; par la GPL, et ils doivent &ecirc;tre autoris&eacute;s &agrave; le redistribuer et &agrave; le modifier, comme pr&eacute;vu &eacute;galement par la GPL.

source: These requirements are the condition for including the GPL-covered code you received in a program of your own.
fr: Ces conditions sont indispensables pour inclure dans votre programme le code sous GPL que vous avez re&ccedil;u.

source: <b><a href="#TOCGPLOtherThanSoftware" name="GPLOtherThanSoftware">Can I use the GPL for something other than software?</a></b>
fr: <b><a href="#TOCGPLOtherThanSoftware" name="GPLOtherThanSoftware">Puis-je utiliser la GPL pour autre chose que des logiciels&nbsp;?</a></b>

source: You can apply the GPL to any kind of work, as long as it is clear what constitutes the &ldquo;source code&rdquo; for the work. The GPL defines this as the preferred form of the work for making changes in it.
fr: Vous pouvez appliquer la GPL &agrave; n'importe quel type d'&oelig;uvre, du moment qu'il n'y a pas d'incertitude sur ce qui constitue le &laquo;&nbsp;code source&nbsp;&raquo; de l'&oelig;uvre. Ce que la GPL d&eacute;finit par la forme privil&eacute;gi&eacute;e de l'&oelig;uvre permettant d'y apporter des modifications.

source: However, for manuals and textbooks, or more generally any sort of work that is meant to teach a subject, we recommend using the GFDL rather than the GPL.
fr: Toutefois, pour les manuels et les ouvrages, et plus g&eacute;n&eacute;ralement toute &oelig;uvre ayant pour but d'enseigner un sujet, nous recommandons l'utilisation de la GFDL, plut&ocirc;t que de la GPL.

source: <b><a href="#TOCLGPLJava" name="LGPLJava">How does the LGPL work with Java?</a></b>
fr: <b><a href="#TOCLGPLJava" name="LGPLJava">Comment la LGPL fonctionne avec Java&nbsp;?</a></b>

source: <a href="/licenses/lgpl-java.html">See this article for details.</a> It works as designed, intended, and expected.
fr: <a href="/licenses/lgpl-java.fr.html">Voir cet article pour les d&eacute;tails</a>. Cela fonctionne comme c'est con&ccedil;u, voulu et attendu.

source: <b><a href="#TOCConsider" name="Consider">Consider this situation: 1. X releases V1 of a project under the GPL. 2. Y contributes to the development of V2 with changes and new code based on V1. 3. X wants to convert V2 to a non-GPL license. Does X need Y's permission?</a></b>
fr: <b><a href="#TOCConsider" name="Consider">Consid&eacute;rez la situation suivante&nbsp;:<br />1. X distribue la version V1 d'un projet sous GPL.<br />2. Y contribue au d&eacute;veloppement de la version V2 avec des modifications et des ajouts au code bas&eacute;s sur V1.<br />3. X veut convertir la version V2 vers une licence autre que GPL.<br />X a-t-il besoin de la permission de Y&nbsp;?</a></b>

source: Yes. Y was required to release its version under the GNU GPL, as a consequence of basing it on X's version V1. Nothing required Y to agree to any other license for its code. Therefore, X must get Y's permission before releasing that code under another license.
fr: Oui. Y avait l'obligation de distribuer sa version sous GNU GPL, du fait qu'elle est bas&eacute;e sur la version V1 de X. Rien n'oblige Y &agrave; &ecirc;tre d'accord avec toute autre licence pour son code. Par cons&eacute;quent, X doit obtenir la permission de Y avant de distribuer ce code sous une autre licence.

source: <b><a href="#TOCGPLInProprietarySystem" name="GPLInProprietarySystem">I'd like to incorporate GPL-covered software in my proprietary system. Can I do this?</a></b>
fr: <b><a href="#TOCGPLInProprietarySystem" name="GPLInProprietarySystem">J'aimerais incorporer un logiciel sous GPL dans mon syst&egrave;me propri&eacute;taire. Est-ce possible&nbsp;?</a></b>

source: You cannot incorporate GPL-covered software in a proprietary system. The goal of the GPL is to grant everyone the freedom to copy, redistribute, understand, and modify a program. If you could incorporate GPL-covered software into a non-free system, it would have the effect of making the GPL-covered software non-free too.
fr: Vous ne pouvez pas incorporer un logiciel couvert par la GPL dans un syst&egrave;me propri&eacute;taire. L'objectif de la GPL est d'accorder &agrave; tous la libert&eacute; de copier, redistribuer, comprendre, et modifier un programme. Si vous pouviez incorporer des logiciels sous GPL dans un syst&egrave;me non-libre, cela aurait pour effet de rendre &eacute;galement non-libre les logiciels sous GPL.

source: A system incorporating a GPL-covered program is an extended version of that program. The GPL says that any extended version of the program must be released under the GPL if it is released at all. This is for two reasons: to make sure that users who get the software get the freedom they should have, and to encourage people to give back improvements that they make.
fr: Un syst&egrave;me qui incorpore un programme plac&eacute; sous GPL est une version &eacute;tendue de ce programme. La GPL dit que toute version &eacute;tendue du programme doit &ecirc;tre distribu&eacute;e sous GPL d&egrave;s qu'elle est seulement diffus&eacute;e. Il y a deux raisons &agrave; cela&nbsp;: s'assurer que les utilisateurs qui obtiennent le programme disposent de la libert&eacute; &agrave; laquelle ils ont droit, et encourager les gens &agrave; donner en &eacute;change les am&eacute;liorations qu'ils ont pu apporter.

source: However, in many cases you can distribute the GPL-covered software alongside your proprietary system. To do this validly, you must make sure that the free and non-free programs communicate at arms length, that they are not combined in a way that would make them effectively a single program.
fr: Toutefois, dans de nombreux cas, vous pouvez distribuer un logiciel sous GPL &agrave; c&ocirc;t&eacute; de votre syst&egrave;me propri&eacute;taire. Pour que cette op&eacute;ration soit l&eacute;gale, vous devez vous assurer que les programmes libres et non-libres communiquent de suffisamment loin, et qu'ils ne sont pas combin&eacute;s de fa&ccedil;on &agrave; cr&eacute;er de fait un seul et m&ecirc;me programme.

source: The difference between this and &ldquo;incorporating&rdquo; the GPL-covered software is partly a matter of substance and partly form. The substantive part is this: if the two programs are combined so that they become effectively two parts of one program, then you can't treat them as two separate programs. So the GPL has to cover the whole thing.
fr: La diff&eacute;rence entre ceci et &laquo;l'incorporation&raquo; du logiciel sous GPL est une question &agrave; la fois de fond et de forme. Essentiellement&nbsp;: si les deux programmes sont combin&eacute;s de telle fa&ccedil;on qu'ils forment les deux parties d'un m&ecirc;me programme, alors vous ne pouvez les traiter comme des programmes s&eacute;par&eacute;s. La GPL doit alors couvrir l'ensemble.

source: If the two programs remain well separated, like the compiler and the kernel, or like an editor and a shell, then you can treat them as two separate programs&mdash;but you have to do it properly. The issue is simply one of form: how you describe what you are doing. Why do we care about this? Because we want to make sure the users clearly understand the free status of the GPL-covered software in the collection.
fr: Si les deux programmes demeurent bien s&eacute;par&eacute;s, comme par exemple le compilateur et le noyau, ou comme un &eacute;diteur de texte et un shell, vous pouvez alors les traiter comme des programmes s&eacute;par&eacute;s &mdash;&nbsp;mais vous devez faire cela comme il faut. Se pose alors simplement la question de la forme&nbsp;: comment vous d&eacute;crivez ce que vous faites. Pourquoi cela nous importe-t-il&nbsp;? Parce que nous voulons &ecirc;tre s&ucirc;r que l'utilisateur comprenne bien le statut libre du logiciel de cet ensemble qui est sous GPL.

source: If people were to distribute GPL-covered software calling it &ldquo;part of&rdquo; a system that users know is partly proprietary, users might be uncertain of their rights regarding the GPL-covered software. But if they know that what they have received is a free program plus another program, side by side, their rights will be clear.
fr: Si quelqu'un distribue un logiciel sous GPL en l'identifiant comme &eacute;tant &laquo;&nbsp;une partie&nbsp;&raquo; d'un syst&egrave;me dont les utilisateurs savent qu'il est partiellement propri&eacute;taire, ces derniers pourraient ne pas avoir une id&eacute;e claire de leurs droits concernant le logiciel GNU. Mais s'ils savent que ce qu'ils ont re&ccedil;u correspond &agrave; un programme libre plus un autre programme, c&ocirc;te &agrave; c&ocirc;te, leurs droits sont clairs.

source: <b><a href="#TOCGPLWrapper" name="GPLWrapper"> I'd like to incorporate GPL-covered software in my proprietary system. Can I do this by putting a &ldquo;wrapper&rdquo; module, under a GPL-compatible lax permissive license (such as the X11 license) in between the GPL-covered part and the proprietary part?</a></b>
fr: <b><a href="#TOCGPLWrapper" name="GPLWrapper">J'aimerais incorporer un logiciel couvert par la GPL dans mon syst&egrave;me propri&eacute;taire. Puis-je le faire en ajoutant un module &laquo;&nbsp;enveloppant&nbsp;&raquo;, sous une licence permissive compatible avec la GPL (de type licence X 11) entre la partie couverte par la GPL et la partie propri&eacute;taire&nbsp;?</a></b>

source: No. The X11 license is compatible with the GPL, so you can add a module to the GPL-covered program and put it under the X11 license. But if you were to incorporate them both in a larger program, that whole would include the GPL-covered part, so it would have to be licensed <em> as a whole </em> under the GNU GPL.
fr: Non. La licence X11 est compatible avec la GPL, donc vous pouvez incorporer un module au programme couvert par la GPL et le mettre sous licence X 11. Mais si vous les incorporez dans un programme plus gros, cet ensemble incluerait la partie couverte par la GPL, donc <em>cet ensemble</em> devrait &ecirc;tre sous licence GPL.

source: The fact that proprietary module A communicates with GPL-covered module C only through X11-licensed module B is legally irrelevant; what matters is the fact that module C is included in the whole.
fr: Le fait qu'un module propri&eacute;taire A communique avec un module C couvert par la GPL par le seul biais d'un module B sous licence X 11 n'est pas l&eacute;galement recevable&nbsp;; ce qui importe, c'est que le module C est inclus dans l'ensemble.

source: <b><a href="#TOCLibGCCException" name="LibGCCException"> Does the libstdc++ exception permit dynamic linking?</a></b>
fr: <b><a href="#TOCLibGCCException" name="LibGCCException">Est-ce que l'exception libstdc++ permet de lier dynamiquement&nbsp;?</a></b>

source: Yes. The intent of the exception is to allow people to compile proprietary software using gcc.
fr: Oui. Le but de l'exception est d'autoriser les gens &agrave; compiler des logiciels propri&eacute;taires en utilisant gcc.

source: <b><a href="#TOCMoneyGuzzlerInc" name="MoneyGuzzlerInc">I'd like to modify GPL-covered programs and link them with the portability libraries from Money Guzzler Inc. I cannot distribute the source code for these libraries, so any user who wanted to change these versions would have to obtained those libraries separately. Why doesn't the GPL permit this?</a></b>
fr: <b><a href="#TOCMoneyGuzzlerInc" name="MoneyGuzzlerInc">J'aimerais modifier des programmes plac&eacute;s sous GPL et les lier avec les biblioth&egrave;ques de portage de Pompe À Fric, S.A. Je ne peux pas distribuer le code source de ces biblioth&egrave;ques, aussi tout utilisateur voulant modifier ces versions devrait acheter ces biblioth&egrave;ques. Pourquoi la GPL ne le permet-elle pas&nbsp;?</a></b>

source: There are two reasons for this.
fr: Il y a deux raisons &agrave; cela.

source: First, a general one. If we permitted company A to make a proprietary file, and company B to distribute GPL-covered software linked with that file, the effect would be to make a hole in the GPL big enough to drive a truck through. This would be carte blanche for withholding the source code for all sorts of modifications and extensions to GPL-covered software.
fr: D'abord une raison d'ordre g&eacute;n&eacute;ral. Si nous autorisions la soci&eacute;t&eacute; A &agrave; cr&eacute;er un fichier propri&eacute;taire, et la soci&eacute;t&eacute; B &agrave; distribuer un logiciel sous GPL li&eacute; &agrave; ce fichier, cela aurait pour effet de cr&eacute;er une faille dans la GPL suffisante pour qu'un camion passe &agrave; travers. On aurait alors <i>carte blanche</i> pour faire de la r&eacute;tention sur le code source pour toute sorte de modifications et d'extensions &agrave; des logiciels sous GPL.

source: Giving all users access to the source code is one of our main goals, so this consequence is definitely something we want to avoid.
fr: L'un de nos objectifs principaux &eacute;tant de donner acc&egrave;s au code source &agrave; tous les utilisateurs, c'est l&agrave; une cons&eacute;quence que nous essayons &agrave; tout prix d'&eacute;viter.

source: More concretely, the versions of the programs linked with the Money Guzzler libraries would not really be free software as we understand the term&mdash;they would not come with full source code that enables users to change and recompile the program.
fr: Plus sp&eacute;cifiquement, les versions du programme li&eacute;es avec les biblioth&egrave;ques de Pompe-À-Fric ne seraient pas vraiment des logiciels libres au sens o&ugrave; nous l'entendons &mdash;&nbsp;elles ne comprendraient pas l'int&eacute;gralit&eacute; du code source qui permet aux utilisateurs de modifier et de recompiler le programme.

source: <b><a href="#TOCGPLIncompatibleAlone" name="GPLIncompatibleAlone">If license for a module Q has a requirement that's incompatible with the GPL, but the requirement applies only when Q is distributed by itself, not when Q is included in a larger program, does that make the license GPL-compatible? Can I combine or link Q with a GPL-covered program?</a></b>
fr: <b><a href="#TOCGPLIncompatibleAlone" name="GPLIncompatibleAlone">Si la licence pour un module Q requiert une condition incompatible avec la GPL, mais que cette condition ne s'applique seulement lorsque Q est distribu&eacute; seul, et non lorsqu'il est distribu&eacute; dans un plus grand programme, est-ce compatible avec la licence GPL&nbsp;? Puis-je combiner ou lier Q avec un programme couvert par la GPL&nbsp;?</a></b>

source: If a program P is released under the GPL that means <strong>any and every part of it</strong> can be used under the GPL. If you integrate module Q, and release the combined program P+Q under the GPL, that means any part of P+Q can be used under the GPL. One part of P+Q is Q. So releasing P+Q under the GPL says that Q any part of it can be used under the GPL. Putting it in other words, a user who obtains P+Q under the GPL can delete P, so that just Q remains, still under the GPL.
fr: Si un programme P est publi&eacute; sous la GPL cela signifie que *toute et chaque partie de celui-ci* peut &ecirc;tre utilis&eacute;e sous la GPL. Si vous int&eacute;grez le module Q, et publiez le programme combin&eacute; P+Q sous la GPL, cela signifie que chaque partie de P+Q peut &ecirc;tre utilis&eacute;e sous la GPL. Une partie de P+Q est Q. Aussi, publier P+Q sous la GPL signifie que Q, une partie de celui-ci, peut &ecirc;tre utilis&eacute; sous la GPL. En le formulant autrement, un utilisateur qui obtient P+Q sous la GPL peut supprimer P, de sorte que seul Q demeure, toujours sous la GPL.

source: If the license of module Q permits you to give permission for that, then it is GPL-compatible. Otherwise, it is not GPL-compatible.
fr: Si la licence du module Q vous permet d'autoriser cela, alors elle est compatible avec la GPL. Sinon, elle est incompatible.

source: If the license for Q says in no uncertain terms that you must do certain things (not compatible with the GPL) when you redistribute Q on its own, then it does not permit you to distribute Q under the GPL. It follows that you can't release P+Q under the GPL either. So you cannot link or combine P with Q.
fr: Si la licence de Q dit en des termes incertains que vous devez faire certaines choses (incompatibles avec la GPL) quand vous redistribuer Q lui-m&ecirc;me, alors cela ne vous permet pas de distribuer Q sous la GPL. Il s'ensuit que vous ne pouvez pas publier P+Q sous la GPL non plus. Donc vous ne pouvez pas lier ou combiner P avec Q.

source: <b><a href="#TOCModifiedJustBinary" name="ModifiedJustBinary">Can I release a modified version of a GPL-covered program in binary form only?</a></b>
fr: <b><a href="#TOCModifiedJustBinary" name="ModifiedJustBinary">Puis-je publier une version modifi&eacute;e d'un programme sous GPL sous forme binaire uniquement&nbsp;?</a></b>

source: No. The whole point of the GPL is that all modified versions must be <a href="/philosophy/free-sw.html"> free software</a>&mdash;which means, in particular, that the source code of the modified version is available to the users.
fr: Non. Tout le propos de la GPL est que toutes les versions modifi&eacute;es doivent &ecirc;tre des <a href="/philosophy/free-sw.fr.html">logiciels libres</a> &mdash;&nbsp;ce qui signifie, en particulier, que le code source de la version modifi&eacute;e est disponible pour les utilisateurs.

source: <b><a href="#TOCUnchangedJustBinary" name="UnchangedJustBinary">I downloaded just the binary from the net. If I distribute copies, do I have to get the source and distribute that too?</a></b>
fr: <b><a href="#UnchangedJustBinary" name="TOCUnchangedJustBinary">J'ai t&eacute;l&eacute;charg&eacute; seulement le programme binaire &agrave; partir d'Internet. Si je distribue des copies, dois-je obtenir le code source et le redistribuer aussi&nbsp;?</a></b>

source: Yes. The general rule is, if you distribute binaries, you must distribute the complete corresponding source code too. The exception for the case where you received a written offer for source code is quite limited.
fr: Oui. La r&egrave;gle g&eacute;n&eacute;rale est que si vous distribuez des binaires, vous devez aussi distribuer le code source complet correspondant. L'exception pour le cas o&ugrave; vous recevez une offre &eacute;crite pour le code source est tout &agrave; fait limit&eacute;e.

source: <b><a href="#TOCDistributeWithSourceOnInternet" name="DistributeWithSourceOnInternet">I want to distribute binaries via physical media without accompanying sources. Can I provide source code by FTP instead of by mail order?</a></b>
fr: <b><a href="#TOCDistributeWithSourceOnInternet" name="DistributeWithSourceOnInternet">Je veux distribuer les fichiers binaires d'un programme sous GPL sur support physique sans les sources associ&eacute;es. Au lieu d'envoyer ult&eacute;rieurement le code source aux utilisateurs qui en font la demande, puis-je me contenter de mettre les sources sur un serveur Internet&nbsp;?</a></b>

source: You're supposed to provide the source code by mail-order on a physical medium, if someone orders it. You are welcome to offer people a way to copy the corresponding source code by FTP, in addition to the mail-order option, but FTP access to the source is not sufficient to satisfy section 3 of the GPL.
fr: Vous pouvez tr&egrave;s bien mettre &agrave; disposition par FTP anonyme le code source de n'importe quelle version d'un programme sous GPL, mais cela ne suffit pas pour respecter la section 3 de la GPL.

source: When a user orders the source, you have to make sure to get the source to that user. If a particular user can conveniently get the source from you by anonymous FTP, fine&mdash;that does the job. But not every user can do such a download. The rest of the users are just as entitled to get the source code from you, which means you must be prepared to send it to them by post.
fr: Lorsqu'un utilisateur demande le code source, vous devez faire en sorte de le lui faire parvenir. Si un certain utilisateur peut commod&eacute;ment obtenir les sources par FTP, tout va bien &mdash;&nbsp;cela suffit. Mais tous les utilisateurs ne sont pas reli&eacute;s &agrave; un r&eacute;seau. Ceux qui ne le sont pas ont tout autant le droit d'obtenir le code source de votre part. Aussi vous devez &ecirc;tre pr&ecirc;t &agrave; le leur envoyer, sur disquette ou sur bande magn&eacute;tique, par courrier postal.

source: If the FTP access is convenient enough, perhaps no one will choose to mail-order a copy. If so, you will never have to ship one. But you cannot assume that.
fr: Si l'accès FTP est suffisamment pratique, peut-être qu personne ne choisira de demander une copie par courrier. Si c'est le cas, vous n'aurez pas à en envoyer. Mais vous ne pouvez pas en être sûr.

source: Of course, it's easiest to just send the source with the binary in the first place.
fr: Bien entendu, il est plus simple de mettre le code source avec le fichier binaire d&egrave;s le d&eacute;part.

source: If you distribute binaries via FTP, <a href="#AnonFTPAndSendSource">you should distribute source via FTP.</a>
fr: Si vous distribuez les binaires par FTP, <a href="#AnonFTPAndSendSource">vous devez distribuer le source par FTP.</a>

source: <b><a href="#TOCRedistributedBinariesGetSource" name="RedistributedBinariesGetSource">My friend got a GPL-covered binary with an offer to supply source, and made a copy for me. Can I use the offer myself to obtain the source?</a></b>
fr: <b><a href="#TOCRedistributedBinariesGetSource" name="RedistributedBinariesGetSource">Mon ami a un ex&eacute;cutable d'un programme sous GPL avec une offre de fourniture des sources, et a fait une copie pour moi. Puis-je utiliser l'offre pour obtenir les sources&nbsp;?</a></b>
