Repository: gitGNU/gnu_www-fr
Catalog: licenses/old-licenses/gpl-2.0-faq.*.po
Languages: fr

source: <b><a href="#TOCWhyMustIInclude" name="WhyMustIInclude">Why does the GPL require including a copy of the GPL with every copy of the program?</a></b>
fr: <b><a href="#TOCWhyMustIInclude" name="WhyMustIInclude">Pourquoi la GPL exige-t-elle d'inclure une copie de la GPL avec chaque copie du programme&nbsp;?</a></b>

source: Including a copy of the license with the work is vital so that everyone who gets a copy of the program can know what his rights are.
fr: Le fait d'inclure une copie de la licence avec le programme est vital, ainsi tous ceux qui re&ccedil;oivent une copie du programme peuvent conna&icirc;tre leurs droits.

source: It might be tempting to include a URL that refers to the license, instead of the license itself. But you cannot be sure that the URL will still be valid, five years or ten years from now. Twenty years from now, URLs as we know them today may no longer exist.
fr: Il peut para&icirc;tre tentant d'inclure une URL qui r&eacute;f&egrave;re &agrave; cette licence, au lieu de la licence elle-m&ecirc;me. Mais vous ne pouvez pas &ecirc;tre s&ucirc;r que cette URL sera toujours valable dans cinq ou dix ans. Dans vingt ans, les URL que nous connaissons aujourd'hui n'existeront peut-&ecirc;tre plus.

source: The only way to make sure that people who have copies of the program will continue to be able to see the license, despite all the changes that will happen in the network, is to include a copy of the license in the program.
fr: La seule fa&ccedil;on de s'assurer que les d&eacute;tenteurs de copies du programme pourront continuer &agrave; voir les licences, malgr&eacute; les changements qui appara&icirc;tront dans le r&eacute;seau, est d'inclure une copie de la licence dans le programme.

source: <b><a href="#TOCWhatIfWorkIsShort" name="WhatIfWorkIsShort">What if the work is not much longer than the license itself?</a></b>
fr: <b><a href="#TOCWhatIfWorkIsShort" name="WhatIfWorkIsShort">Et si le programme n'est gu&egrave;re plus long que la licence elle-m&ecirc;me&nbsp;?</a></b>

source: If a single program is that short, you may as well use a simple all-permissive license for it, rather than the GNU GPL.
fr: Si un programme est aussi court, vous pouvez aussi bien utiliser une licence sans restriction, plut&ocirc;t que la GNU GPL.

source: <b><a href="#TOCGPLOmitPreamble" name="GPLOmitPreamble"> Can I omit the preamble of the GPL, or the instructions for how to use it on your own programs, to save space?</a></b>
fr: <b><a href="#TOCGPLOmitPreamble" name="GPLOmitPreamble">Puis-je &ocirc;ter le pr&eacute;ambule de la GPL, ou les instructions sur la fa&ccedil;on de l'utiliser dans vos propres programmes, pour &eacute;conomiser de l'espace&nbsp;?</a></b>

source: The preamble and instructions are integral parts of the GNU GPL and may not be omitted. In fact, the GPL is copyrighted, and its license permits only verbatim copying of the entire GPL. (You can use the legal terms to make <a href="#ModifyGPL">another license</a> but it won't be the GNU GPL.)
fr: Le pr&eacute;ambule et les instructions sont des portions int&eacute;grales de la GNU GPL et ne peuvent &ecirc;tre supprim&eacute;es. Lisez s'il vous pla&icirc;t l'ensemble de la GPL. En fait, la GPL est sous copyright, et sa licence permet seulement de la recopier telle-quelle dans son int&eacute;gralit&eacute;.

source: The preamble and instructions add up to some 5000 characters, less than 1/3 of the GPL's total size. They will not make a substantial fractional change in the size of a software package unless the package itself is quite small. In that case, you may as well use a simple all-permissive license rather than the GNU GPL.
fr: Le pr&eacute;ambule et les instructions ajoutent environ 5000 caract&egrave;res, moins d'un tiers de la taille totale de la GPL. Ils ne constitueraient pas un changement substantiel de la taille d'un paquetage logiciel &agrave; moins que ce paquetage lui-m&ecirc;me soit vraiment petit. Dans ce cas, vous pourriez aussi bien utiliser une licence totalement permissive au lieu de la GNU GPL.

source: <b><a href="#TOCWhatIsCompatible" name="WhatIsCompatible">What does it mean to say that two licenses are &ldquo;compatible&rdquo;?</a></b>
fr: <b><a href="#TOCWhatIsCompatible" name="WhatIsCompatible">Que signifie de dire que deux licences sont &laquo;&nbsp;compatibles&nbsp;&raquo;&nbsp;?</a></b>

source: In order to combine two programs (or substantial parts of them) into a larger work, you need to have permission to use both programs in this way. If the two programs' licenses permit this, they are compatible. If there is no way to satisfy both licenses at once, they are incompatible.
fr: Afin de combiner deux programmes (ou des parties conséquentes de ceux-ci) dans une programme plus gros, vous avez besoin d'avoir la permission d'utiliser les deux programmes de cette manière. Si les deux licences des programmes le permettent, ils sont compatibles. S'il n'y a aucun moyen de satisfaire les deux licences en même temps, ils sont incompatibles.

source: For some licenses, the way in which the combination is made may affect whether they are compatible&mdash;for instance, they may allow linking two modules together, but not allow merging their code into one module.
fr: Pour certaine licences, la façon dont est faite la combinaison peut affecter la compatibilité &mdash;&nbsp;par exemple, elles peuvent autoriser de lier deux modules ensemble, mais ne pas autoriser la fusion de leurs codes dans un seul module.

source: Just to install two separate programs in the same system, it is not necessary that their licenses be compatible, because this does not combine them into a larger work.
fr: S'il s'agit d'installer deux programmes distincts sur un même système, il n'est pas nécessaire que leurs licences soient compatibles, car cela ne les combine pas dans un programme plus gros.

source: <b><a href="#TOCWhatDoesCompatMean" name="WhatDoesCompatMean">What does it mean to say a license is &ldquo;compatible with the GPL&rdquo;.</a></b>
fr: <b><a href="#TOCWhatDoesCompatMean" name="WhatDoesCompatMean">Que veut dire le fait qu'une licence soit &laquo;&nbsp;compatible avec la GPL&nbsp;&raquo; (<i>&laquo;&nbsp;compatible with the GPL&nbsp;&raquo;</i>)&nbsp;?</a></b>

source: It means that the other license and the GNU GPL are compatible; you can combine code released under the other license with code released under the GNU GPL in one larger program.
fr: Cela signifie que l'autre licence et la GNU GPL sont compatibles&nbsp;; vous pouvez combiner du code publi&eacute; sous l'autre licence avec du code publi&eacute; sous la GNU GPL dans un programme plus large.

source: The GPL permits such a combination provided it is released under the GNU GPL. The other license is compatible with the GPL if it permits this too.
fr: La GPL autorise une telle combinaison, &agrave; condition qu'elle soit distribu&eacute;e sous GNU GPL. L'autre licence est compatible avec la GPL si elle permet cela aussi.

source: <b><a href="#TOCFSWithNFLibs" name="FSWithNFLibs">Can I write free software that uses non-free libraries?</a></b>
fr: <b><a href="#TOCFSWithNFLibs" name="FSWithNFLibs">Puis-je &eacute;crire un logiciel libre qui utilise des biblioth&egrave;ques non-libres&nbsp;?</a></b>

source: If you do this, your program won't be fully usable in a free environment. If your program depends on a non-free library to do a certain job, it cannot do that job in the Free World. If it depends on a non-free library to run at all, it cannot be part of a free operating system such as GNU; it is entirely off limits to the Free World.
fr: Si vous faites cela, votre programme ne sera pas totalement utilisable dans un environnement libre. Si votre programme d&eacute;pend d'une biblioth&egrave;que non-libre pour faire certaines actions, il ne pourra pas le faire dans le Monde libre. S'il d&eacute;pend d'une biblioth&egrave;que non-libre pour fonctionner, il ne pourra pas faire partie d'un syst&egrave;me d'exploitation libre tel que GNU; c'est totalement hors des limites du Monde libre.

source: So please consider: can you find a way to get the job done without using this library? Can you write a free replacement for that library?
fr: Aussi, veuillez consid&eacute;rer ceci&nbsp;: pouvez-vous trouver un moyen de r&eacute;aliser cette action sans utiliser cette biblioth&egrave;que&nbsp;? Pouvez-vous &eacute;crire une biblioth&egrave;que libre pour la remplacer&nbsp;?

source: If the program is already written using the non-free library, perhaps it is too late to change the decision. You may as well release the program as it stands, rather than not release it. But please mention in the README that the need for the non-free library is a drawback, and suggest the task of changing the program so that it does the same job without the non-free library. Please suggest that anyone who thinks of doing substantial further work on the program first free it from dependence on the non-free library.
fr: Si le programme est d&eacute;j&agrave; &eacute;crit en utilisant la biblioth&egrave;que non-libre, il est peut-&ecirc;tre d&eacute;j&agrave; trop tard pour changer de d&eacute;cision. Vous pouvez aussi publier le programme tel qu'il est plut&ocirc;t que de ne pas le publier. Mais veuillez mentionner dans le fichier README que la n&eacute;cessit&eacute; de la biblioth&egrave;qe non-libre est un inconv&eacute;nient, et sugg&eacute;rez de changer de programme pour qu'il puisse faire la m&ecirc;me chose sans la biblioth&egrave;que non-libre. Veuillez sugg&eacute;rez que quiconque pense faire un gros travail sur le programme, le lib&egrave;re d'abord de sa d&eacute;pendance &agrave; la biblioth&egrave;que non-libre.

source: Note that there may also be legal issues with combining certain non-free libraries with GPL-covered Free Software. Please see <a href="#GPLIncompatibleLibs">the question on GPL software with GPL-incompatible libraries</a> for more information.
fr: Notez &eacute;galement qu'il peut y avoir des probl&egrave;mes juridiques en combinant certaines biblioth&egrave;ques non-libres avec un logiciel libre couvert par la GPL. Veuillez consulter <a href="#GPLIncompatibleLibs">la question sur les logiciels sous GPL avec les biblioth&egrave;ques incompatibles avec la GPL</a> pour plus de renseignements.

source: <b><a href="#TOCGPLIncompatibleLibs" name="GPLIncompatibleLibs">What legal issues come up if I use GPL-incompatible libraries with GPL software?</a></b>
fr: <b><a href="#TOCGPLIncompatibleLibs" name="GPLIncompatibleLibs">J'&eacute;cris du logiciel libre qui utilise des biblioth&egrave;ques non-libres. Quels probl&egrave;mes l&eacute;gaux surgissent si j'utilise la GPL&nbsp;?</a></b>

source: If the libraries that you link with fall within the following exception in the GPL:
fr: Si les biblioth&egrave;ques avec lesquelles vous faites une &eacute;dition de liens entre dans le champ de l'exception suivante de la GPL&nbsp;:

source: then you don't have to do anything special to use them; the requirement to distribute source code for the whole program does not include those libraries, even if you distribute a linked executable containing them. Thus, if the libraries you need come with major parts of a proprietary operating system, the GPL says people can link your program with them without any conditions.
fr: alors vous n'avez rien de sp&eacute;cial &agrave; faire pour les utiliser. En d'autres termes, si les biblioth&egrave;ques dont vous avez besoin accompagnent les &eacute;l&eacute;ments majeurs d'un syst&egrave;me d'exploitation propri&eacute;taire, la GPL dit que l'on peut les utiliser dans une &eacute;dition de lien avec votre programme.

source: If you want your program to link against a library not covered by that exception, you need to add your own exception, wholly outside of the GPL. This copyright notice and license notice give permission to link with the program FOO:
fr: Si vous d&eacute;sirez que votre programme puisse &ecirc;tre li&eacute; &agrave; une biblioth&egrave;que non couverte par cette exception, vous devrez ajouter votre propre exception, enti&egrave;rement en dehors de la GPL. Cette note de copyright et de licence autorise l'&eacute;dition de lien avec le programme FOO&nbsp;:

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
fr: Ce programme est un logiciel libre&nbsp;; vous pouvez le redistribuer et/ou le modifier selon les termes de la GNU General Public License (Licence Publique G&eacute;n&eacute;rale GNU) telle qu'elle a &eacute;t&eacute; publi&eacute;e par la Free Software Foundation; soit la version 2 de la licence, soit (comme vous le souhaitez) toute version ult&eacute;rieure.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
fr: Ce programme est distribu&eacute; dans l'espoir qu'il sera utile, mais SANS LA MOINDRE GARANTIE&nbsp;; pas m&ecirc;me la garantie implicite de COMMERCIABILIT&eacute; ou d'AD&eacute;QUATION &agrave; UN BUT PARTICULIER. Voir la GNU General Public License pour plus de d&eacute;tails.

source: You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA
fr: Vous devriez avoir re&ccedil;u une copie de la GNU General Public License en m&ecirc;me temps que ce programme; sinon, merci d'&eacute;crire &agrave; la Free Software Foundation, Inc, 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA

source: Linking ABC statically or dynamically with other modules is making a combined work based on ABC. Thus, the terms and conditions of the GNU General Public License cover the whole combination.
fr: Lier ABC statiquement ou dynamiquement avec d'autres modules en fait une &oelig;uvre combin&eacute;e bas&eacute;e sur ABC. Cependant, les termes et conditions de la Licence publique g&eacute;n&eacute;rale GNU couvrent la totalit&eacute; de la combinaison.

source: In addition, as a special exception, the copyright holders of ABC give you permission to combine ABC program with free software programs or libraries that are released under the GNU LGPL and with code included in the standard release of DEF under the XYZ license (or modified versions of such code, with unchanged license). You may copy and distribute such a system following the terms of the GNU GPL for ABC and the licenses of the other code concerned, provided that you include the source code of that other code when and as the GNU GPL requires distribution of source code.
fr: De plus, &agrave; titre exceptionnel, les d&eacute;tenteurs du copyright&gt; de ABC vous donne l'autorisation de combiner ABC avec des logiciels libres ou des biblioth&egrave;ques couvertes par la LGPL GNU et avec du code inclus dans la version standard de DEF sous la licence XYZ (ou des versions modifi&eacute;es de ce code, sans changement de licence). Vous pouvez copier et distribuer un tel syst&egrave;me en suivant les termes de la GPL GNU pour ABC et les licences de l'autre code concerné, pourvu d'y inclure le code source de l'autre code car la GPL GNU n&eacute;cessite la distribution du code source.

source: Note that people who make modified versions of ABC are not obligated to grant this special exception for their modified versions; it is their choice whether to do so. The GNU General Public License gives permission to release a modified version without this exception; this exception also makes it possible to release a modified version which carries forward this exception.
fr: Veuillez remarquer que les personnes qui font des versions modifi&eacute;es de ABC ne sont pas oblig&eacute;es d'accorder cette exception particuli&egrave;re pour leurs versions modifi&eacute;es; ils leur appartient de le faire ou pas. La Licence publique g&eacute;n&eacute;rale GNU donne la permission de publier une version modifi&eacute;e sans cette exception; cette exception rend &eacute;galement possible de publier une version modifi&eacute;e qui perp&eacute;tue cette exception.

source: You should put this text in each file to which the exception applies.
fr: Vous devez ajouter ce texte dans chaque fichier auquel s'applique l'exception.

source: Only the copyright holders for the program can legally authorize this exception. If you wrote the whole program yourself, then assuming your employer or school does not claim the copyright, you are the copyright holder&mdash;so you can authorize the exception. But if you want to use parts of other GPL-covered programs by other authors in your code, you cannot authorize the exception for them. You have to get the approval of the copyright holders of those programs.
fr: Seuls les d&eacute;tenteurs du copyright du programme peuvent l&eacute;galement autoriser cette exception. Si vous avez &eacute;crit tout le programme vous m&ecirc;me, alors &agrave; supposer que votre employeur ou votre &eacute;cole ne le r&eacute;clame pas, vous &ecirc;tes le d&eacute;tenteur du copyright &mdash;&nbsp;donc vous pouvez autoriser l'exception. Mais si vous voulez utiliser dans votre code des portions d'autres programmes sous GPL &eacute;crits par d'autres auteurs, vous ne pouvez autoriser cette exception &agrave; leur place. Vous devez obtenir l'autorisation des d&eacute;tenteurs des copyrights de ces programmes.

source: When other people modify the program, they do not have to make the same exception for their code&mdash;it is their choice whether to do so.
fr: Quand d'autres personnes modifient le programme, elles n'ont pas &agrave; cr&eacute;er la m&ecirc;me exception pour leur code &mdash;&nbsp;elles ont le choix de le faire ou non.

source: If the libraries you intend to link with are non-free, please also see <a href="#FSWithNFLibs">the section on writing Free Software which uses non-free libraries</a>.
fr: Si les biblioth&egrave;ques que vous avez l'intention de lier ne sont pas libres, veuillez &eacute;galement consulter <a href="#FSWithNFLibs">la section sur l'&eacute;criture de logiciels libres utilisant des biblioth&egrave;ques non-libres.</a>.

source: <b><a href="#TOCHowIGetCopyright" name="HowIGetCopyright">How do I get a copyright on my program in order to release it under the GPL?</a></b>
fr: <b><a href="#TOCHowIGetCopyright" name="HowIGetCopyright">Comment obtenir un copyright sur mon programme de fa&ccedil;on &agrave; le distribuer sous la GPL&nbsp;?</a></b>

source: Under the Berne Convention, everything written is automatically copyrighted from whenever it is put in fixed form. So you don't have to do anything to &ldquo;get&rdquo; the copyright on what you write&mdash;as long as nobody else can claim to own your work.
fr: Selon la Convention de Berne, tout &eacute;crit est automatiquement sous copyright d&egrave;s qu'il est plac&eacute; sous une forme fixe. Donc vous n'avez rien &agrave; faire pour &laquo;obtenir&raquo; un copyright sur ce que vous &eacute;crivez &mdash;&nbsp;d&egrave;s lors que personne d'autre ne peut pr&eacute;tendre poss&eacute;der votre travail.

source: However, registering the copyright in the US is a very good idea. It will give you more clout in dealing with an infringer in the US.
fr: C'est toutefois une excellente id&eacute;e d'enregistrer votre copyright aux &Eacute;tat-Unis. Cela vous donnera plus d'influence pour traiter avec une violation aux &Eacute;tats-Unis.

source: The case when someone else might possibly claim the copyright is if you are an employee or student; then the employer or the school might claim you did the job for them and that the copyright belongs to them. Whether they would have a valid claim would depend on circumstances such as the laws of the place where you live, and on your employment contract and what sort of work you do. It is best to consult a lawyer if there is any possible doubt.
fr: Il se peut que quelqu'un d'autre puisse r&eacute;clamer le copyright si vous &ecirc;tes un employ&eacute; ou un &eacute;tudiant; alors, l'employeur ou l'&eacute;cole peuvent pr&eacute;tendre que vous avez effectu&eacute; le travail pour eux, et que le copyright leur appartient. La validit&eacute; de leurs pr&eacute;tentions d&eacute;pend des circonstances telles que les lois de votre lieu de r&eacute;sidence, votre contrat d'embauche et le genre de travail que vous faites. Le mieux est de consulter un avocat s'il y a le moindre doute.

source: If you think that the employer or school might have a claim, you can resolve the problem clearly by getting a copyright disclaimer signed by a suitably authorized officer of the company or school. (Your immediate boss or a professor is usually NOT authorized to sign such a disclaimer.)
fr: Si vous pensez que l'employeur ou l'&eacute;cole peuvent avoir des droits, vous pouvez r&eacute;soudre le probl&egrave;me clairement en obtenant une renonciation au copyright sign&eacute;e par un officiel autoris&eacute; de l'entreprise ou de l'&eacute;cole. (Votre sup&eacute;rieur hi&eacute;rarchique imm&eacute;diat ou votre professeur ne sont g&eacute;n&eacute;ralement PAS autoris&eacute;s &agrave; signer de telles renonciations).

source: <b><a href="#TOCWhatIfSchool" name="WhatIfSchool">What if my school might want to make my program into its own proprietary software product?</a></b>
fr: <b><a href="#TOCWhatIfSchool" name="WhatIfSchool">Et si mon &eacute;cole d&eacute;cidait de mettre mon programme dans son propre logiciel propri&eacute;taire&nbsp;?</a></b>

source: Many universities nowadays try to raise funds by restricting the use of the knowledge and information they develop, in effect behaving little different from commercial businesses. (See &ldquo;The Kept University&rdquo;, Atlantic Monthly, March 2000, for a general discussion of this problem and its effects.)
fr: De nombreuses universit&eacute;s essaient aujourd'hui d'attirer des fonds en restreignant l'utilisation des connaissances et informations qu'elles d&eacute;veloppent, se comportant en cela de mani&egrave;re peu diff&eacute;rente des soci&eacute;t&eacute;s commerciales. (Voir &laquo;&nbsp;The Kept University&nbsp;&raquo;, Atlantic Monthly, Mars 2000, pour une discussion g&eacute;n&eacute;rale de ce probl&egrave;me et de ses effets).

source: If you see any chance that your school might refuse to allow your program to be released as free software, it is best to raise the issue at the earliest possible stage. The closer the program is to working usefully, the more temptation the administration might feel to take it from you and finish it without you. At an earlier stage, you have more leverage.
fr: Si vous pensez qu'il existe une probabilit&eacute; que votre &eacute;cole refuse de vous autoriser &agrave; distribuer votre programme sous GPL, il vaut mieux soulever le probl&egrave;me le plus t&ocirc;t possible. Plus le programme sera proche d'un fonctionnement utile, et plus la tentation sera grande pour l'administration de vous le prendre et de le finir sans vous. À un stade moins avanc&eacute;, vous avez plus de marge de man&oelig;uvre.
