Repository: gitGNU/gnu_www-fr
Catalog: licenses/old-licenses/gpl-2.0-faq.*.po
Languages: fr

source: From time to time, at intervals of years, we change the GPL&mdash;sometimes to clarify it, sometimes to permit certain kinds of use not previously permitted, and sometimes to tighten up a requirement. (The last change was in 1991.) Using this &ldquo;indirect pointer&rdquo; in each program makes it possible for us to change the distribution terms on the entire collection of GNU software, when we update the GPL.
fr: De temps en temps, apr&egrave;s quelques ann&eacute;es, il nous arrive de modifier la GPL &mdash;&nbsp;quelquefois simplement pour &eacute;claircir un point, quelquefois pour autoriser certaines utilisations alors qu'elles ne l'&eacute;taient pas auparavant, et quelquefois pour renforcer une exigence. (Le dernier changement date de 1991). L'utilisation de ce &laquo;pointeur indirect&raquo; dans chaque programme nous permet de changer les conditions de distribution de l'ensemble des logiciels GNU, lorsque nous modifions la GPL.

source: If each program lacked the indirect pointer, we would be forced to discuss the change at length with numerous copyright holders, which would be a virtual impossibility. In practice, the chance of having uniform distribution terms for GNU software would be nil.
fr: Si aucun programme ne contenait ce pointeur indirect, nous serions forc&eacute;s de longuement discuter du changement avec de tr&egrave;s nombreux d&eacute;tenteurs de copyright, ce qui serait virtuellement impossible. En pratique, la probabilit&eacute; d'aboutir &agrave; un mode de distribution unifi&eacute; pour les logiciels GNU serait nulle.

source: Suppose a program says &ldquo;Version 2 of the GPL or any later version&rdquo; and a new version of the GPL is released. If the new GPL version gives additional permission, that permission will be available immediately to all the users of the program. But if the new GPL version has a tighter requirement, it will not restrict use of the current version of the program, because it can still be used under GPL version 2. When a program says &ldquo;Version 2 of the GPL or any later version&rdquo;, users will always be permitted to use it, and even change it, according to the terms of GPL version 2&mdash;even after later versions of the GPL are available.
fr: Supposez qu'un programme dise &laquo;&nbsp;Version 2 de la GPL ou toute version ult&eacute;rieure&nbsp;&raquo; et qu'une nouvelle version de la GPL soit publi&eacute;e. Si la nouvelle version de la GPL donne une permission suppl&eacute;mentaire, cette permission est imm&eacute;diatement disponible pour tous les utilisateurs du programme. Mais, si la nouvelle version de la GPL comporte une exigence plus restrictive, cela ne limitera pas l'utilisation de la version courante du programme, car ce dernier peut toujours &ecirc;tre utilis&eacute; sous GPL Version 2. Lorsqu'un programme dit &laquo;&nbsp;Version 2 de la GPL ou toute version ult&eacute;rieure&nbsp;&raquo;, les utilisateurs seront toujours autoris&eacute;s &agrave; l'utiliser, et m&ecirc;me &agrave; le modifier, selon les termes de la GPL Version 2 &mdash;&nbsp;m&ecirc;me apr&egrave;s que d'autres versions de la GPL auront &eacute;t&eacute; rendues disponibles.

source: If a tighter requirement in a new version of the GPL need not be obeyed for existing software, how is it useful? Once GPL version 3 is available, the developers of most GPL-covered programs will release subsequent versions of their programs specifying &ldquo;Version 3 of the GPL or any later version&rdquo;. Then users will have to follow the tighter requirements in GPL version 3, for subsequent versions of the program.
fr: Si une exigence plus forte dans une nouvelle version de la GPL n'est pas obligatoire pour les logiciels existants, &agrave; quoi sert-elle&nbsp;? Lorsque la version 3 de la GPL est disponible, les d&eacute;veloppeurs de la plupart des programmes sous GPL distribueront les versions suivantes de leur programme en sp&eacute;cifiant &laquo;Version 3 de la GPL ou toute version ult&eacute;rieure&raquo;. Les utilisateurs devront se conformer aux clauses plus restrictives de la GPL Version 3, pour les versions suivantes de ce programme.

source: However, developers are not obligated to do this; developers can continue allowing use of the previous version of the GPL, if that is their preference.
fr: Les d&eacute;veloppeurs ne sont toutefois pas dans l'obligation d'agir ainsi&nbsp;; ils peuvent continuer &agrave; autoriser l'utilisation de la version pr&eacute;c&eacute;dente de la GPL, si c'est leur souhait.

source: <b><a href="#TOCWhyNotGPLForManuals" name="WhyNotGPLForManuals">Why don't you use the GPL for manuals?</a></b>
fr: <b><a href="#TOCWhyNotGPLForManuals" name="WhyNotGPLForManuals">Pourquoi n'utilisez-vous pas la GPL pour les manuels&nbsp;?</a></b>

source: It is possible to use the GPL for a manual, but the GNU Free Documentation License (GFDL) is much better for manuals.
fr: Il est possible d'utiliser la GPL pour les manuels, mais pour ceux-ci il vaut beaucoup mieux utiliser la GNU Free Documentation Licence (GFDL, Licence de Documentation Libre GNU).

source: The GPL was designed for programs; it contains lots of complex clauses that are crucial for programs, but that would be cumbersome and unnecessary for a book or manual. For instance, anyone publishing the book on paper would have to either include machine-readable &ldquo;source code&rdquo; of the book along with each printed copy, or provide a written offer to send the &ldquo;source code&rdquo; later.
fr: La GPL a &eacute;t&eacute; con&ccedil;ue pour les programmes; elle contient de nombreuses clauses complexes qui sont tr&egrave;s importantes pour les programmes, mais constituent un poids mort pour un livre ou un manuel. Par exemple, quiconque publie le livre sur support papier devra inclure le «&nbsp;code source&nbsp;» lisible par ordinateur avec le livre, ou fournir une offre écrite pour envoyer le «&nbsp;code source&nbsp;» plus tard.

source: Meanwhile, the GFDL has clauses that help publishers of free manuals make a profit from selling copies&mdash;cover texts, for instance. The special rules for Endorsements sections make it possible to use the GFDL for an official standard. This would permit modified versions, but they could not be labeled as &ldquo;the standard&rdquo;.
fr: En revanche, la GFDL contient des clauses qui permettent aux &eacute;diteurs de manuels libres d'en tirer des revenus. Les règles spéciales pour les sections Avenants rendent possible l'utilisation de la GFDL pour un standard officiel. Ceci permettrait des versions modifiées, mais ne pourrait pas être libellé comme «&nbsp;standard&nbsp;».

source: Using the GFDL, we permit changes in the text of a manual that covers its technical topic. It is important to be able to change the technical parts, because people who change a program ought to change the documentation to correspond. The freedom to do this is an ethical imperative.
fr: En utilisant la GFDL, nous permettons les changements dans le texte d'un manuel qui couvre un sujet technique. Il est important d'autoriser les modifications des parties techniques, car les gens qui modifient un programme doivent pouvoir modifier la documentation correspondante. La liberté de faire cela est un impératif éthique.

source: Our manuals also include sections that state our political position about free software. We mark these as &ldquo;invariant&rdquo;, so that they cannot be changed or removed. The GFDL makes provisions for these &ldquo;invariant sections&rdquo;.
fr: Nos manuels contiennent aussi des sections qui indiquent notre position politique au sujet des logiciels libres. Nous marquons ces sections comme «&nbsp;invariantes&nbsp;», de sorte qu'elles ne puissent être ni modifiées, ni supprimées. La GFDL indique des clauses pour ces «&nbsp;sections invariantes&nbsp;».

source: <b><a href="#TOCFontException" name="FontException">How does the GPL apply to fonts?</a></b>
fr: <b><a href="#TOCFontException" name="FontException">Comment la GPL s'applique t-elle aux polices&nbsp;?</a></b>

source: Font licensing is a complex issue which needs serious consideration. The following license exception is experimental but approved for general use. We welcome suggestions on this subject&mdash;please see this <a href="http://www.fsf.org/blogs/licensing/20050425novalis">explanatory essay</a> and write to <a href="mailto:licensing@gnu.org">&lt;licensing@gnu.org&gt;</a>.
fr: La licence de police est un probl&egrave;me complexe qui a besoin de s&eacute;rieuses consid&eacute;rations. L'exception de licence suivante est exp&eacute;rimentale mais approuv&eacute;e pour une utilisation g&eacute;n&eacute;rale. Les suggestions sont les bienvenues sur ce sujet &mdash;&nbsp;veuillez consulter ce <a href="http://www.fsf.org/blogs/licensing/20050425novalis">billet explicatif</a> et &eacute;crire &agrave; <a href="mailto:licensing&#64;gnu.org">licensing&#64;gnu.org</a>.

source: To use this exception, add this text to the license notice of each file in the package (to the extent possible), at the end of the text that says the file is distributed under the GNU GPL:
fr: Pour utiliser cette exception, ajouter ce texte &agrave; votre notice de licence pour chaque fichier du paquetage (dans la mesure du possible), apr&egrave;s le texte qui dit que le fichier est distribu&eacute; sous la GPL GNU&nbsp;:

source: <tt> As a special exception, if you create a document which uses this font, and embed this font or unaltered portions of this font into the document, this font does not by itself cause the resulting document to be covered by the GNU General Public License. This exception does not however invalidate any other reasons why the document might be covered by the GNU General Public License. If you modify this font, you may extend this exception to your version of the font, but you are not obligated to do so. If you do not wish to do so, delete this exception statement from your version. </tt>
fr: <tt>Comme exception sp&eacute;ciale, si vous cr&eacute;ez un document qui utilise cette police, ou int&eacute;grez cette police ou des parties inalt&eacute;r&eacute;es de cette police dans le document, cette police n'implique pas en soi que le document r&eacute;sultant soit couvert par la Licence publique g&eacute;n&eacute;rale GNU. Cette exception n'emp&ecirc;che pas cependant que le document soit, pour d'autres raisons, couvert par la Licence publique g&eacute;n&eacute;rale GNU. Si vous modifiez cette police, vous pouvez &eacute;tendre ce droit &agrave; votre version de la police, mais vous n'y &ecirc;tes pas oblig&eacute;. Si vous ne le souhaitez pas, supprimez cette clause de votre version.</tt>

source: <b><a href="#TOCWMS" name="WMS"> I am writing a website maintenance system</a> (called a &ldquo;<a href="/philosophy/words-to-avoid.html">content management system</a>&rdquo; by some), or some other application which generates web pages from templates. What license should I use for those templates?</b>
fr: <b><a href="#TOCWMS" name="WMS">J'&eacute;cris un syst&egrave;me de mainternance de site Web</a> (aussi appel&eacute; &laquo;&nbsp;<a href="http://www.gnu.org/philosophy/words-to-avoid.fr.html">content management system</a>&nbsp;&raquo; &lt;syst&eacute;me de gestion de contenu&gt;) ou une application qui g&eacute;n&egrave;re des pages Web &agrave; partir de mod&egrave;les. Quelle licence dois-je utiliser pour ces mod&egrave;les&nbsp;?</b>

source: Templates are minor enough that it is not worth using copyleft to protect them. It is normally harmless to use copyleft on minor works, but templates are a special case, because they are combined with data provided by users of the application and the combination is distributed. So, we recommend that you license your templates under simple permissive terms.
fr: Les mod&egrave;les sont assez mineurs et &ccedil;a ne vaut pas la peine d'utiliser le copyleft (la gauche d'auteur) pour les prot&eacute;ger. Il n'est normalement pas dangereux d'utiliser le copyleft pour des &oelig;uvres mineures, mais les mod&egrave;les sont un cas particulier car ils combinent des donn&eacute;es fournies par les utilisateurs de l'application et cette combinaison est distribu&eacute;e. C'est pourquoi nous recommandons d'utiliser une licence permissive simple pour vos mod&egrave;les.

source: Some templates make calls into Javascript functions. Since Javascript is often non-trivial, it is worth copylefting. Because the templates will be combined with user data, it's possible that template+user data+Javascript would be considered one work under copyright law. A line needs to be drawn between the Javascript (copylefted), and the user code (usually under incompatible terms).
fr: Certains mod&egrave;les font des appels &agrave; des fonctions JavaScript. Puisque le Javascript n'est pas souvent trivial, cela vaut la peine de mettre les scripts sous copyleft. Parce que les mod&egrave;les sont combin&eacute;s avec des donn&eacute;es utilisateur, il est possible que l'ensemble mod&egrave;le+donn&eacute;es utilisateur+Javascript soit consid&eacute;r&eacute; comme une seule &oelig;uvre selon la loi sur les droits d'auteur. Il est n&eacute;cessaire de tracer une ligne antre le code Javascript (sous copyleft) et le code utilisateur (habituellement en des termes incompatibles).

source: A diagram of the above content
fr: Un diagramme du contenu ci-dessus

source: Here's an exception for Javascript code that does this:
fr: Il y a une exception pour le code JavaScript qui dit ceci&nbsp;:

source: As a special exception to GPL, any HTML file which merely makes function calls to this code, and for that purpose includes it by reference shall be deemed a separate work for copyright law purposes. In addition, the copyright holders of this code give you permission to combine this code with free software libraries that are released under the GNU LGPL. You may copy and distribute such a system following the terms of the GNU GPL for this code and the LGPL for the libraries. If you modify this code, you may extend this exception to your version of the code, but you are not obligated to do so. If you do not wish to do so, delete this exception statement from your version.
fr: En tant qu'exception sp&eacute;ciale &agrave; la GPL, tout fichier HTML faisant essentiellement des appels de fonction &agrave; ce code et qui pour ce faire l'inclut par r&eacute;f&eacute;rence, devra &ecirc;tre consid&eacute;r&eacute; comme une &oelig;uvre s&eacute;par&eacute;e pour la loi sur le droit d'auteur. De plus, les d&eacute;tenteurs du droit d'auteur de ce code vous donne l'autorisation de combiner ce code avec des biblioth&egrave;ques de logiciels libres publi&eacute;es sous la GNU LGPL. Vous pouvez copier et distribuer un tel syst&egrave;me suivant les termes de la GNU GPL pour ce code et ceux de la LGPL pour les biblioth&egrave;ques. Si vous modifiez ce code, vous pouvez &eacute;tendre cette exception &agrave; votre version du code, mais vous n'y &ecirc;tes pas oblig&eacute;. Si vous ne souhaitez pas le faire, supprimez cette d&eacute;claration d'exception de votre version.

source: <b><a href="#TOCNonFreeTools" name="NonFreeTools">Can I release a program under the GPL which I developed using non-free tools?</a></b>
fr: <b><a href="#NonFreeTools" name="TOCNonFreeTools">Puis-je publier un programme sous licence GPL que j'ai d&eacute;velopp&eacute; en utilisant des outils non-libres&nbsp;?</a></b>

source: Which programs you used to edit the source code, or to compile it, or study it, or record it, usually makes no difference for issues concerning the licensing of that source code.
fr: Les programmes que vous utilisez pour &eacute;diter le code source, le compiler, l'&eacute;tudier ou l'enregistrer ne font g&eacute;n&eacute;ralement pas de diff&eacute;rence pour les probl&egrave;mes relatifs &agrave; la licence de ce code source.

source: However, if you link non-free libraries with the source code, that would be an issue you need to deal with. It does not preclude releasing the source code under the GPL, but if the libraries don't fit under the &ldquo;system library&rdquo; exception, you should affix an explicit notice giving permission to link your program with them. The FSF can give you advice on doing this.
fr: Toutefois, si vous liez des biblioth&egrave;ques non-libres &agrave; ce code source, ce serait un probl&egrave;me que vous devez prendre en compte. Cela n'emp&ecirc;che pas de publier le code source sous licence GPL, mais si les biblioth&egrave;ques ne correspondent pas &agrave; l'exception &laquo;&nbsp;biblioth&egrave;que syst&egrave;me&nbsp;&raquo;, vous devrez ajouter une notice explicite donnant la permission de lier votre programme avec elles. The FSF peut vous conseiller pour faire cela.

source: <b><a href="#TOCGPLTranslations" name="GPLTranslations">Are there translations of the GPL into other languages?</a></b>
fr: <b><a href="#TOCGPLTranslations" name="GPLTranslations">Existe-t-il des traductions de la GPL dans d'autres langues&nbsp;?</a></b>

source: It would be useful to have translations of the GPL into languages other than English. People have even written translations and sent them to us. But we have not dared to approve them as officially valid. That carries a risk so great we do not dare accept it.
fr: Il serait utile d'avoir des traductions de la GPL dans d'autres langues que l'anglais. Certains ont m&ecirc;me &eacute;crit des traductions et nous les ont faites parvenir. Mais nous ne nous sommes pas risqu&eacute;s &agrave; les annoncer comme officiellement valides. Cela comporte un trop grand risque, que nous ne sommes pas pr&ecirc;t &agrave; prendre.

source: A legal document is in some ways like a program. Translating it is like translating a program from one language and operating system to another. Only a lawyer skilled in both languages can do it&mdash;and even then, there is a risk of introducing a bug.
fr: Un document l&eacute;gal ressemble parfois &agrave; un programme. Le traduire est comme de porter un logiciel d'un langage et d'un syst&egrave;me d'exploitation vers un autre. Seul un juriste comp&eacute;tent dans les deux langues peut le faire &mdash;&nbsp;et m&ecirc;me alors subsiste le risque d'introduire un bogue.

source: If we were to approve, officially, a translation of the GPL, we would be giving everyone permission to do whatever the translation says they can do. If it is a completely accurate translation, that is fine. But if there is an error in the translation, the results could be a disaster which we could not fix.
fr: Si nous devions approuver, officiellement, une traduction de la GPL, nous donnerions &agrave; quiconque l'autorisation de faire tout ce que la traduction dit que l'on peut faire. Si la traduction est parfaitement exacte, tout va bien. Mais s'il existe une erreur dans la traduction, le r&eacute;sultat pourrait en &ecirc;tre un d&eacute;sastre que nous ne pourrions r&eacute;parer.

source: If a program has a bug, we can release a new version, and eventually the old version will more or less disappear. But once we have given everyone permission to act according to a particular translation, we have no way of taking back that permission if we find, later on, that it had a bug.
fr: Lorsqu'un programme contient un bogue, l'on peut distribuer une nouvelle version, et &eacute;ventuellement, l'ancienne version dispara&icirc;tra plus ou moins. Mais une fois que l'on a donn&eacute; &agrave; tout le monde la permission d'agir selon les termes d'une certaine traduction, il n'y a plus aucun moyen de reprendre cette permission, si l'on d&eacute;couvre, ult&eacute;rieurement, qu'elle avait un bogue.

source: Helpful people sometimes offer to do the work of translation for us. If the problem were a matter of finding someone to do the work, this would solve it. But the actual problem is the risk of error, and offering to do the work does not avoid the risk. We could not possibly authorize a translation written by a non-lawyer.
fr: Des gens qui souhaitent nous aider nous proposent parfois de faire pour nous le travail de traduction. Si le probl&egrave;me &eacute;tait de trouver quelqu'un pour accomplir la t&acirc;che, cela le r&eacute;soudrait. Mais en fait le vrai probl&egrave;me est le risque d'erreur, et le fait d'offrir de faire le travail ne l'&eacute;vite pas. Nous ne pourrions en aucun cas autoriser une traduction non &eacute;crite par un juriste.

source: Therefore, for the time being, we are not approving translations of the GPL as globally valid and binding. Instead, we are doing two things:
fr: Par cons&eacute;quent, pour le moment, nous n'approuvons pas les traductions de la GPL comme globalement valides ni contractuelles. Au lieu de cela, nous faisons deux choses&nbsp;:

source: Referring people to unofficial translations. This means that we permit people to write translations of the GPL, but we don't approve them as legally valid and binding.
fr: Nous dirigeons les gens vers des traductions non-officielles. Cela signifie que nous autorisons les gens &agrave; &eacute;crire des traductions de la GPL, mais que nous les approuvons pas comme l&eacute;galement valides et contractuelles.

source: An unapproved translation has no legal force, and it should say so explicitly. It should be marked as follows:
fr: Une traduction non-approuv&eacute;e n'a pas de valeur l&eacute;gale, et devrait le d&eacute;clarer explicitement. Cela devrait &ecirc;tre &eacute;crit comme suit&nbsp;:

source: But the unapproved translation can serve as a hint for how to understand the English GPL. For many users, that is sufficient.
fr: Mais la traduction non-officielle peut tr&egrave;s bien servir d'aide &agrave; la compr&eacute;hension de la GPL en anglais. Pour beaucoup d'utilisateurs, c'est suffisant.

source: However, businesses using GNU software in commercial activity, and people doing public ftp distribution, should need to check the real English GPL to make sure of what it permits.
fr: Toutefois, les entreprises qui utilisent des logiciels GNU dans leurs activit&eacute;s commerciales, et les gens faisant une distribution publique par ftp, devraient v&eacute;rifier la v&eacute;ritable GPL en anglais pour s'assurer de ce qu'elle autorise.

source: Publishing translations valid for a single country only.
fr: Nous publions des traductions valides pour seulement pour un pays.

source: We are considering the idea of publishing translations which are officially valid only for one country. This way, if there is a mistake, it will be limited to that country, and the damage will not be too great.
fr: Nous consid&eacute;rons l'id&eacute;e de publier des traductions qui soient officiellement valides pour un pays seulement. De cette fa&ccedil;on, si une erreur est faite, l'effet sera limit&eacute; &agrave; ce pays, et le dommage pas trop important.

source: It will still take considerable expertise and effort from a sympathetic and capable lawyer to make a translation, so we cannot promise any such translations soon.
fr: Il faudra quand m&ecirc;me pour faire une traduction une dose consid&eacute;rable d'expertise et d'efforts de la part d'un juriste &agrave; la fois acquis &agrave; la cause et comp&eacute;tent, aussi ne pouvons-nous promettre de telles traductions dans un futur proche.

source: <b><a href="#TOCInterpreterIncompat" name="InterpreterIncompat">If a programming language interpreter has a license that is incompatible with the GPL, can I run GPL-covered programs on it?</a></b>
fr: <b><a href="#TOCInterpreterIncompat" name="InterpreterIncompat">Si un interpr&eacute;teur de langage de programmation a une licence qui est incompatible avec la GPL, puis-je l'utiliser pour faire tourner des programmes plac&eacute;s sous GPL&nbsp;?</a></b>
