Repository: gitGNU/gnu_www-fr
Catalog: licenses/old-licenses/gpl-2.0-faq.*.po
Languages: fr

source: <b><a href="#TOCWindowsRuntimeAndGPL" name="WindowsRuntimeAndGPL">I'm writing a Windows application with Microsoft Visual C++ (or Visual Basic) and I will be releasing it under the GPL. Is dynamically linking my program with the Visual C++ (or Visual Basic) run-time library permitted under the GPL?</a></b>
fr: <b><a href="#TOCWindowsRuntimeAndGPL" name="WindowsRuntimeAndGPL">J'&eacute;cris une application Windows avec Microsoft Visual C++ et je pr&eacute;vois de la diffuser sous GPL. Est-il permis par ma GPL de lier mon programme dynamiquement avec la biblioth&egrave;que de run-time de Visual C++&nbsp;?</a></b>

source: The GPL permits this because that run-time library normally accompanies the compiler or interpreter you are using. So it falls under the exception in GPL section 3.
fr: La GPL permet ceci parce que cette biblioth&egrave;que <i>run-time</i> accompagne normalement le compilateur ou l'interpr&eacute;teur que vous utilisez. Cela tombe donc sous le coup de l'exception de la section 3 de la GPL.

source: That doesn't mean it is a good idea to write the program so that it only runs on Windows. Doing so results in a program that is free software but <a href="/philosophy/java-trap.html">&ldquo;trapped&rdquo;</a> (in this case, trapped by Windows instead of by Java, but the effect is the same). (Historical note: As of December 2006 Sun is in the middle of <a href="http://www.fsf.org/news/fsf-welcomes-gpl-java.html">rereleasing its Java platform under GNU GPL</a>.)
fr: Cela ne signifie pas que c'est une bonne id&eacute;e d'&eacute;crire un programme qui ne fonctionne que sur Windows. En faisant ceci, cela donne un logiciel libre mais<a href="/philosophy/java-trap.fr.html"> &laquo;&nbsp;pris au pi&egrave;ge&nbsp;&raquo;</a> (en ce cas pr&eacute;cis, pris au pi&egrave;ge de Windows au lieu de Java, mais l'effet est le m&ecirc;me).

source: <b><a href="#TOCOrigBSD" name="OrigBSD">Why is the original BSD license incompatible with the GPL?</a></b>
fr: <b><a href="#TOCOrigBSD" name="OrigBSD">Pourquoi la licence BSD originale est-elle incompatible avec la GPL&nbsp;?</a></b>

source: Because it imposes a specific requirement that is not in the GPL; namely, the requirement on advertisements of the program. The GPL states:
fr: Parce qu'elle impose une exigence sp&eacute;cifique qui n'est pas dans la GPL; &agrave; savoir la r&egrave;gle portant sur la publicit&eacute; du programme. La GPL dit&nbsp;:

source: The advertising clause provides just such a further restriction, and thus is GPL-incompatible.
fr: La clause concernant la publicit&eacute; est justement l'une de ces restrictions suppl&eacute;mentaires, et ceci la rend incompatible avec la GPL.

source: The revised BSD license does not have the advertising clause, which eliminates the problem.
fr: La licence BSD r&eacute;vis&eacute;e ne contient plus cette clause sur la publicit&eacute;, ce qui &eacute;limine le probl&egrave;me.

source: <b><a href="#TOCGPLAndPlugins" name="GPLAndPlugins">If a program released under the GPL uses plug-ins, what are the requirements for the licenses of a plug-in.</a></b>
fr: <b><a href="#TOCGPLAndPlugins" name="GPLAndPlugins">Si un programme distribu&eacute; sous GPL utilise des plug-ins, quelles sont les contraintes portant sur les licences d'un plug-in&nbsp;?</a></b>

source: It depends on how the program invokes its plug-ins. If the program uses fork and exec to invoke plug-ins, then the plug-ins are separate programs, so the license for the main program makes no requirements for them.
fr: Cela d&eacute;pend de la fa&ccedil;on dont le programme invoque ses plug-ins. S'il utilise 'fork' et 'exec' pour les invoquer, alors les plug-ins sont des programmes s&eacute;par&eacute;s, donc la licence du programme principal ne n'impose aucune exigence les concernant.

source: If the program dynamically links plug-ins, and they make function calls to each other and share data structures, we believe they form a single program, which must be treated as an extension of both the main program and the plug-ins. This means the plug-ins must be released under the GPL or a GPL-compatible free software license, and that the terms of the GPL must be followed when those plug-ins are distributed.
fr: Si le programme fait une &eacute;dition de liens dynamique avec les plug-ins, et qu'ils font des appels de fonctions mutuels et partagent de structure de donn&eacute;es, nous pensons qu'ils forment un seul et m&ecirc;me programme, et les plug-ins doivent donc &ecirc;tre trait&eacute;s comme des extensions du programme principal. Cela signifie qu'il doivent &ecirc;tre distribu&eacute;s sous la GPL ou sous une licence de logiciel libre compatible avec la GPL.

source: If the program dynamically links plug-ins, but the communication between them is limited to invoking the &lsquo;main&rsquo; function of the plug-in with some options and waiting for it to return, that is a borderline case.
fr: Si le programme fait une &eacute;dition de liens dynamique avec des plug-ins, mais que la communication entre eux est limit&eacute;e &agrave; l'invocation de la fonction `main' du plug-in avec quelques options et l'attente du r&eacute;sultat de l'ex&eacute;cution du plug-in, nous nous trouvons dans un cas limite.

source: <b><a href="#TOCGPLPluginsInNF" name="GPLPluginsInNF">Can I apply the GPL when writing a plug-in for a non-free program?</a></b>
fr: <b><a href="#TOCGPLPluginsInNF" name="GPLPluginsInNF">Puis-je utiliser la GPL pour un plug-in dans un programme non-libre&nbsp;?</a></b>

source: If the program uses fork and exec to invoke plug-ins, then the plug-ins are separate programs, so the license for the main program makes no requirements for them. So you can use the GPL for a plug-in, and there are no special requirements.
fr: Si le programme utilise 'fork' et 'exec' pour invoquer les plug-ins, alors les plug-ins sont des programmes s&eacute;par&eacute;s, aussi la licence pour le programme principal n'impose aucune exigence les concernant. Vous pouvez donc utiliser la GPL pour un plug-in, il n'y a pas d'exigence sp&eacute;ciale.

source: If the program dynamically links plug-ins, and they make function calls to each other and share data structures, we believe they form a single program, which must be treated as an extension of both the main program and the plug-ins. This means that combination of the GPL-covered plug-in with the non-free main program would violate the GPL. However, you can resolve that legal problem by adding an exception to your plug-in's license, giving permission to link it with the non-free main program.
fr: Si le programme fait une &eacute;dition de liens dynamique avec les plug-ins, et qu'ils font des appels de fonctions mutuels et partagent de structure de donn&eacute;es, nous pensons qu'ils forment un seul et m&ecirc;me programme qui doit &ecirc;tre trait&eacute; comme une extension du programme principal et des plug-ins. Cela signifie que la combinaison du plug-in sous GPL avec le programme principal constituerait une violation de la GPL. Toutefois, vous pouvez r&eacute;soudre ce probl&egrave;me l&eacute;gal en ajoutant une exception &agrave; la licence de votre plug-in, qui autorise &agrave; le lier avec le programme principal non-libre.

source: See also the question <a href="#FSWithNFLibs">I am writing free software that uses a non-free library.</a>
fr: Voir aussi la question <a href="#FSWithNFLibs">&laquo;&nbsp;Puis-je &eacute;crire un logiciel libre qui utilise des biblioth&egrave;ques non-libres&nbsp;?&nbsp;&raquo;</a>

source: <b><a href="#TOCNFUseGPLPlugins" name="NFUseGPLPlugins">Can I release a non-free program that's designed to load a GPL-covered plug-in?</a></b>
fr: <b><a href="#TOCNFUseGPLPlugins" name="NFUseGPLPlugins">Puis-je faire un programme non-libre con&ccedil;u pour charger un plugin couvert par la GPL&nbsp;?</a></b>

source: It depends on how the program invokes its plug-ins. If the program uses fork and exec to invoke plug-ins, then the plug-ins are separate programs, so the license of the plug-in makes no requirements about the main program.
fr: Cela d&eacute;pend de la fa&ccedil;on dont le programme invoque ses plug-ins. Si le programme utilise fork et exec pour invoquer les plug-ins, alors les plug-ins sont des programmes s&eacute;par&eacute;s, alors, la licence du plug-in ne demande pas de pr&eacute;requis pour le programme principal.

source: If the program dynamically links plug-ins, and they make function calls to each other and share data structures, we believe they form a single program, which must be treated as an extension of both the main program and the plug-ins. In order to use the GPL-covered plug-ins, the main program must be released under the GPL or a GPL-compatible free software license, and that the terms of the GPL must be followed when the main program is distributed for use with these plug-ins.
fr: Si le programme lie dynamiquement les plug-ins, et qu'ils font mutuellement des appels de fonctions et partagent des structures de donn&eacute;es, nous pensons qu'ils forment un seul programme, qui doit &ecirc;tre trait&eacute; comme une extension du programme principal et des plug-ins. Afin d'utiliser les plug-ins couverts par la GPL, le programme principal doit &ecirc;tre publi&eacute; sous la GPL ou une licence de logiciel libre compatible avec la GPL, et que les termes ne la GPL doivent &ecirc;tre respect&eacute;s quand le programme principal est distribu&eacute; pour utiliser ces plug-ins.

source: <b><a href="#TOCLinkingWithGPL" name="LinkingWithGPL">You have a GPL'ed program that I'd like to link with my code to build a proprietary program. Does the fact that I link with your program mean I have to GPL my program?</a></b>
fr: <b><a href="#TOCLinkingWithGPL" name="LinkingWithGPL">Vous avez mis sous GPL un programme que j'aimerais lier &agrave; mon code pour fabriquer un programme propri&eacute;taire. Le fait que je fasse une &eacute;dition de liens avec votre programme implique-t-il que je doive mettre mon programme sous GPL&nbsp;?</a></b>

source: Yes.
fr: Oui.

source: <b><a href="#TOCSwitchToLGPL" name="SwitchToLGPL">If so, is there any chance I could get a license of your program under the Lesser GPL?</a></b>
fr: <b><a href="#TOCSwitchToLGPL" name="SwitchToLGPL">Si oui, ai-je une chance d'obtenir une licence de votre programme sous la GPL amoindrie (<i>Lesser GPL</i>)&nbsp;?</a></b>

source: You can ask, but most authors will stand firm and say no. The idea of the GPL is that if you want to include our code in your program, your program must also be free software. It is supposed to put pressure on you to release your program in a way that makes it part of our community.
fr: Vous pouvez toujours demander, mais la plupart des auteurs persisteront et refuseront. L'id&eacute;e m&ecirc;me de la GPL est que, si vous voulez inclure notre code dans votre programme, votre programme doit aussi &ecirc;tre un logiciel libre. Ceci est fait pour vous inciter &agrave; distribuer votre programme de telle sorte qu'il s'int&egrave;gre &agrave; notre communaut&eacute;.

source: You always have the legal alternative of not using our code.
fr: Vous disposez toujours de l'alternative l&eacute;gale de ne pas utiliser notre code.

source: <b><a href="#TOCLinkingOverControlledInterface" name="LinkingOverControlledInterface">How can I allow linking of proprietary modules with my GPL-covered library under a controlled interface only?</a></b>
fr: <b><a href="#TOCLinkingOverControlledInterface" name="LinkingOverControlledInterface">Comment puis-je autoriser de lier des modules propri&eacute;taires avec ma biblioth&egrave;que sous GPL uniquement dans une interface contr&ocirc;l&eacute;e&nbsp;?</a></b>

source: Add this text to the license notice of each file in the package, at the end of the text that says the file is distributed under the GNU GPL:
fr: Ajouter ce texte &agrave; la notice de licence de chaque fichier du paquetage, &agrave; la fin du texte qui dit que le fichier est distribu&eacute; sous la licence GPL GNU&nbsp;:

source: <b><a href="#TOCManyDifferentLicenses" name="ManyDifferentLicenses">I have written an application that links with many different components, that have different licenses. I am very confused as to what licensing requirements are placed on my program. Can you please tell me what licenses I may use?</a></b>
fr: <b><a href="#TOCManyDifferentLicenses" name="ManyDifferentLicenses">J'ai &eacute;crit une application qui se lie avec de nombreux composants diff&eacute;rents, qui sont couverts par diff&eacute;rentes licences. Je ne comprends vraiment pas bien quelles clauses des licences s'appliquent &agrave; mon programme. Pourriez-vous m'expliquer quelle licences je peux utiliser&nbsp;?</a></b>

source: To answer this question, we would need to see a list of each component that your program uses, the license of that component, and a brief (a few sentences for each should suffice) describing how your library uses that component. Two examples would be:
fr: Pour r&eacute;pondre &agrave; cette question, nous aurions besoin de voir une liste compl&egrave;te des composants utilis&eacute;s par votre programme, des licences de chacun de ces composants, ainsi qu'une description br&egrave;ve (quelques phrases par composant devraient suffire de la fa&ccedil;on dont votre biblioth&egrave;que les utilise. Deux exemples potentiels&nbsp;:

source: To make my software work, it must be linked to the FOO library, which is available under the Lesser GPL.
fr: Pour que mon logiciel fonctionne, il doit subir une &eacute;dition de liens avec la librairie FOO, qui est disponible sous Lesser GPL (GPL Amoindrie).

source: My software makes a system call (with a command line that I built) to run the BAR program, which is licensed under &ldquo;the GPL, with a special exception allowing for linking with QUUX&rdquo;.
fr: Mon logiciel fait un appel syst&egrave;me (avec une ligne de commande que j'ai &eacute;crite) pour lancer le programme BAR, qui est &laquo;&nbsp;sous GPL, avec une exception sp&eacute;ciale autorisant une &eacute;dition de liens avec QUUX&nbsp;&raquo;.

source: <b><a href="#TOCMereAggregation" name="MereAggregation">What is the difference between &ldquo;mere aggregation&rdquo; and &ldquo;combining two modules into one program&rdquo;?</a></b>
fr: <b><a href="#TOCMereAggregation" name="MereAggregation">Quelle est la diff&eacute;rence entre <i>&laquo;&nbsp;mere aggregation&nbsp;&raquo;</i> et <i>&laquo;&nbsp;combining two modules into one program&nbsp;&raquo;</i>&nbsp;?</a></b>

source: Mere aggregation of two programs means putting them side by side on the same CD-ROM or hard disk. We use this term in the case where they are separate programs, not parts of a single program. In this case, if one of the programs is covered by the GPL, it has no effect on the other program.
fr: La <i>&laquo;&nbsp;mere aggregation&nbsp;&raquo;</i> de deux programmes consiste &agrave; les mettre c&ocirc;te-&agrave;-c&ocirc;te sur le m&ecirc;me CD-ROM ou le m&ecirc;me disque dur. Nous utilisons ce terme dans les cas o&ugrave; il s'agit de programmes distincts, pas des parties d'un m&ecirc;me programme. Dans ce cas, si l'un des programmes est couvert par la GPL, cela n'a pas d'effet sur l'autre programme.

source: Combining two modules means connecting them together so that they form a single larger program. If either part is covered by the GPL, the whole combination must also be released under the GPL&mdash;if you can't, or won't, do that, you may not combine them.
fr: Combiner deux modules (<i>&laquo;&nbsp;combining two modules&nbsp;&raquo;</i>) signifie les connecter de telle sorte qu'ils constituent un seul programme plus important. Si l'une au moins des parties est couverte par la GPL, l'ensemble doit alors aussi &ecirc;tre distribu&eacute; sous GPL--si vous ne pouvez ou ne voulez pas le faire, vous n'&ecirc;tes pas autoris&eacute; &agrave; les combiner.

source: What constitutes combining two parts into one program? This is a legal question, which ultimately judges will decide. We believe that a proper criterion depends both on the mechanism of communication (exec, pipes, rpc, function calls within a shared address space, etc.) and the semantics of the communication (what kinds of information are interchanged).
fr: Qu'est-ce qui constitue le fait de combiner deux parties en un seul programme&nbsp;? Il s'agit d'un probl&egrave;me juridique, qui sera tranch&eacute; en dernier recours par un juge. Nous pensons qu'un crit&egrave;re adapt&eacute; tient compte &agrave; la fois des modes de communication (exec, pipes, rpc, appel de fonctions au sein d'un espace de m&eacute;moire commun, etc.) et de la s&eacute;mantique de cette communication (quels genres d'informations sont &eacute;chang&eacute;s).

source: If the modules are included in the same executable file, they are definitely combined in one program. If modules are designed to run linked together in a shared address space, that almost surely means combining them into one program.
fr: Si les modules sont inclus dans un m&ecirc;me fichier ex&eacute;cutable, ils sont ind&eacute;niablement combin&eacute;s dans un seul programme. Si les modules sont con&ccedil;us pour &ecirc;tre ex&eacute;cut&eacute;s par &eacute;dition de liens dans un m&ecirc;me espace m&eacute;moire partag&eacute;, cela signifie presque &agrave; coup s&ucirc;r une combinaison en un seul programme.

source: By contrast, pipes, sockets and command-line arguments are communication mechanisms normally used between two separate programs. So when they are used for communication, the modules normally are separate programs. But if the semantics of the communication are intimate enough, exchanging complex internal data structures, that too could be a basis to consider the two parts as combined into a larger program.
fr: En revanche, les pipes, sockets et autres arguments de ligne de commande sont des m&eacute;canismes de communication utilis&eacute;s normalement entre deux programmes s&eacute;par&eacute;s. Aussi, tant que ceux-ci servent &agrave; communiquer, les modules sont normalement des programmes s&eacute;par&eacute;s. Mais si la s&eacute;mantique des &eacute;changes est assez 'intime', avec &eacute;change de structures de donn&eacute;es internes complexes, cela pourrait &eacute;galement constituer une base suffisante pour consid&eacute;rer les deux &eacute;l&eacute;ments combin&eacute;s comme un seul et m&ecirc;me programme.

source: <b><a href="#TOCAssignCopyright" name="AssignCopyright">Why does the FSF require that contributors to FSF-copyrighted programs assign copyright to the FSF? If I hold copyright on a GPL'ed program, should I do this, too? If so, how?</a></b>
fr: <b><a href="#TOCAssignCopyright" name="AssignCopyright">Pourquoi la FSF requiert-elle que les contributeurs de programmes sous copyright de la FSF transf&egrave;rent le copyright &agrave; la FSF&nbsp;? Si je d&eacute;tiens le copyright d'un programme sous GPL, devrais-je faire la m&ecirc;me chose&nbsp;? Si oui, comment&nbsp;?</a></b>

source: Our lawyers have told us that to be in the <a href="/licenses/why-assign.html">best position to enforce the GPL</a> in court against violators, we should keep the copyright status of the program as simple as possible. We do this by asking each contributor to either assign the copyright on his contribution to the FSF, or disclaim copyright on it and thus put it in the public domain.
fr: Nos avocats nous ont avis&eacute;s que pour &ecirc;tre dans la <a href="/licenses/why-assign.fr.html">meilleure position pour faire appliquer la GPL</a> au tribunal contre des contrevenants, il valait mieux conserver un statut de copyright le plus simple possible. C'est ce que nous faisons en demandant &agrave; chaque contributeur, soit de transf&eacute;rer le copyright de sa contribution &agrave; la FSF, soit d'abandonner ce copyright, le pla&ccedil;ant ainsi dans le domaine public.

source: We also ask individual contributors to get copyright disclaimers from their employers (if any) so that we can be sure those employers won't claim to own the contributions.
fr: Nous demandons &eacute;galement aux contributeurs individuels d'obtenir une renonciation au copyright &eacute;crite par leur employeur (s'il existe), de fa&ccedil;on &agrave; s'assurer que ce dernier ne puisse pr&eacute;tendre avoir des droits sur les &eacute;l&eacute;ments de contribution au projet.

source: Of course, if all the contributors put their code in the public domain, there is no copyright with which to enforce the GPL. So we encourage people to assign copyright on large code contributions, and only put small changes in the public domain.
fr: Bien entendu, si tous les participants mettent leur code dans le domaine public, il n'y a plus de copyright permettant de faire appliquer la GPL. Aussi nous encourageons &agrave; d&eacute;finir un copyright sur les des contributions importantes en mati&egrave;re de code, et &agrave; seulement mettre les modifications mineures dans le domaine public.

source: If you want to make an effort to enforce the GPL on your program, it is probably a good idea for you to follow a similar policy. Please contact <a href="mailto:licensing@gnu.org">&lt;licensing@gnu.org&gt;</a> if you want more information.
fr: Si &ecirc;tes pr&ecirc;t &agrave; faire un effort pour d&eacute;fendre la GPL appliqu&eacute;e &agrave; votre programme, c'est probablement une bonne id&eacute;e que d'adopter une politique similaire. Merci de contacter <a href="mailto:licensing&#64;gnu.org">&lt;licensing&#64;gnu.org&gt;</a> si vous d&eacute;sirez plus de renseignements.

source: <b><a href="#TOCModifyGPL" name="ModifyGPL">Can I modify the GPL and make a modified license?</a></b>
fr: <b><a href="#TOCModifyGPL" name="ModifyGPL">Puis-je modifier la GPL et faire une licence modifi&eacute;e&nbsp;?</a></b>

source: You can use the GPL terms (possibly modified) in another license provided that you call your license by another name and do not include the GPL preamble, and provided you modify the instructions-for-use at the end enough to make it clearly different in wording and not mention GNU (though the actual procedure you describe may be similar).
fr: Vous pouvez utiliser les termes de la GPL (qui peuvent &ecirc;tre modifi&eacute;s) dans une autre licence pourvu que vous l'appeliez par un autre nom et que vous n'y incluiez pas le pr&eacute;ambule de la GPL, et pourvu que vous modifiez les instructions d'usage &agrave; la fin suffisamment pour la rendre clairement diff&eacute;rente dans la formulation et en ne mentionnant pas GNU (bien que la proc&eacute;dure que vous d&eacute;crivez puisse &ecirc;tre similaire).

source: If you want to use our preamble in a modified license, please write to <a href="mailto:licensing@gnu.org">&lt;licensing@gnu.org&gt;</a> for permission. For this purpose we would want to check the actual license requirements to see if we approve of them.
fr: Si vous voulez utiliser notre pr&eacute;ambule dans une licence modifi&eacute;e, veuillez &eacute;crire &agrave; <a href="mailto:licensing&#64;gnu.org">&lt;licensing&#64;gnu.org&gt;</a> pour une autorisation. &Agrave; cette fin, vous voudrons v&eacute;rifier les conditions r&eacute;elles de la licence pour voir si nous les approuvons.
