Repository: gitGNU/gnu_www-fr
Catalog: licenses/old-licenses/gpl-2.0-faq.*.po
Languages: fr

source: Yes, you can. The offer must be open to everyone who has a copy of the binary that it accompanies. This is why the GPL says your friend must give you a copy of the offer along with a copy of the binary&mdash;so you can take advantage of it.
fr: Oui. L'offre doit &ecirc;tre ouverte &agrave; toute personne qui a une copie de l'ex&eacute;cutable qui l'accompagne. C'est pourquoi la GPL dit que votre ami doit vous donner une copie de l'offre avec la copie de l'ex&eacute;cutable &mdash;&nbsp;pour que vous puissiez en b&eacute;n&eacute;ficier.

source: <b><a href="#TOCSourceAndBinaryOnDifferentSites" name="SourceAndBinaryOnDifferentSites">Can I put the binaries on my Internet server and put the source on a different Internet site?</a></b>
fr: <b><a href="#TOCSourceAndBinaryOnDifferentSites" name="SourceAndBinaryOnDifferentSites">Puis-je mettre les fichiers binaires sur mon serveur Internet et les sources sur un site Internet diff&eacute;rent&nbsp;?</a></b>

source: The GPL says you must offer access to copy the source code &ldquo;from the same place&rdquo;; that is, next to the binaries. However, if you make arrangements with another site to keep the necessary source code available, and put a link or cross-reference to the source code next to the binaries, we think that qualifies as &ldquo;from the same place&rdquo;.
fr: La GPL pr&eacute;voit que vous devez offrir un acc&egrave;s au code source &laquo;&nbsp;&agrave; partir du m&ecirc;me endroit&nbsp;&raquo; (<i>&laquo;&nbsp;from the same place&nbsp;&raquo;</i>); ce qui signifie &agrave; c&ocirc;t&eacute; des fichiers binaires. Si toutefois vous vous arrangez avec un autre site pour rendre disponible le code source n&eacute;cessaire, et que vous mettez un lien ou une r&eacute;f&eacute;rence-crois&eacute;e au code source &agrave; c&ocirc;t&eacute; des fichiers binaires, nous pensons que cela &eacute;quivaut &agrave; &laquo;&nbsp;&agrave; partir du m&ecirc;me endroit&nbsp;&raquo;.

source: Note, however, that it is not enough to find some site that happens to have the appropriate source code today, and tell people to look there. Tomorrow that site may have deleted that source code, or simply replaced it with a newer version of the same program. Then you would no longer be complying with the GPL requirements. To make a reasonable effort to comply, you need to make a positive arrangement with the other site, and thus ensure that the source will be available there for as long as you keep the binaries available.
fr: Notez cependant qu'il ne suffit pas de trouver un site qui h&eacute;berge le code source actuellement, et de dire aux gens d'aller voir l&agrave;-bas. Demain, ce site peut supprimer le code source, ou simplement le remplacer par une version plus r&eacute;cente du m&ecirc;me programme. Vous ne seriez alors plus en r&egrave;gle avec les exigences de la GPL. Pour faire un effort raisonnable pour &ecirc;tre en r&egrave;gle, vous devez avoir un arrangement clair avec le site en question, et par l&agrave; vous assurer que le code source y sera disponible aussi longtemps que vous rendrez les fichiers binaires accessibles.

source: <b><a href="#TOCDistributeExtendedBinary" name="DistributeExtendedBinary">I want to distribute an extended version of a GPL-covered program in binary form. Is it enough to distribute the source for the original version?</a></b>
fr: <b><a href="#TOCDistributeExtendedBinary" name="DistributeExtendedBinary">Je veux distribuer une version &eacute;tendue d'un programme sous GPL sous forme de fichiers binaires. Me suffit-il de distribuer le code source de la version originale&nbsp;?</a></b>

source: No, you must supply the source code that corresponds to the binary. Corresponding source means the source from which users can rebuild the same binary.
fr: Non, vous devez fournir le code source qui correspond au fichier binaire. Le code source correspondant est celui &agrave; partir duquel l'utilisateur peut recompiler le m&ecirc;me fichier binaire.

source: Part of the idea of free software is that users should have access to the source code for <strong>the programs they use</strong>. Those using your version should have access to the source code for your version.
fr: Pour partie, l'id&eacute;e du logiciel libre est que les utilisateurs aient acc&egrave;s au code source pour *les programmes qu'ils utilisent*. Ceux qui utilisent votre version devraient avoir acc&egrave;s au code source de votre version.

source: A major goal of the GPL is to build up the Free World by making sure that improvement to a free program are themselves free. If you release an improved version of a GPL-covered program, you must release the improved source code under the GPL.
fr: Un objectif majeur de la GPL est de construire le Monde Libre en s'assurant que les am&eacute;liorations apport&eacute;es &agrave; un programme libre sont elles-m&ecirc;mes libres. Si vous distribuez une version am&eacute;lior&eacute;e d'un logiciel plac&eacute; sous GPL, vous devez distribuer le code source am&eacute;lior&eacute; sous GPL.

source: <b><a href="#TOCDistributingSourceIsInconvenient" name="DistributingSourceIsInconvenient">I want to distribute binaries, but distributing complete source is inconvenient. Is it ok if I give users the diffs from the &ldquo;standard&rdquo; version along with the binaries?</a></b>
fr: <b><a href="#TOCDistributingSourceIsInconvenient" name="DistributingSourceIsInconvenient">Je souhaite distribuer des fichiers binaires, mais il est difficile de distribuer l'ensemble du code source. Et si je donnais aux utilisateurs les diff&eacute;rences par rapport &agrave; la version &laquo;standard&raquo;en m&ecirc;me temps que les binaires&nbsp;?</a></b>

source: This is a well-meaning request, but this method of providing the source doesn't really do the job.
fr: L'intention est louable, mais cette m&eacute;thode pour fournir le code source ne convient pas vraiment.

source: A user that wants the source a year from now may be unable to get the proper version from another site at that time. The standard distribution site may have a newer version, but the same diffs probably won't work with that version.
fr: Un utilisateur qui souhaite r&eacute;cup&eacute;rer le code source dans un an peut se trouver dans l'incapacit&eacute; d'obtenir la bonne version aupr&egrave;s de la FSF &agrave; ce moment l&agrave;. Nous pourrions avoir une version plus r&eacute;cente, mais les diff&eacute;rences en question ne correspondraient probablement plus avec cette version.

source: So you need to provide complete sources, not just diffs, with the binaries.
fr: Vous devez donc fournir le code source complet, pas seulement les diff&eacute;rences, avec les fichiers binaires.

source: <b><a href="#TOCAnonFTPAndSendSource" name="AnonFTPAndSendSources">I want to make binaries available for anonymous FTP, but send sources only to people who order them.</a></b>
fr: <b><a href="#TOCAnonFTPAndSendSources" name="AnonFTPAndSendSources">Je veux rendre disponible par FTP anonyme les fichiers binaires, mais envoyer les sources seulement &agrave; ceux qui en font la demande</a></b>

source: If you want to distribute binaries by anonymous FTP, you still have to provide source through one of the options listed in section 3. This should not be hard. You can provide a written offer for source if you want; section 3(b) allows this. But if you can find a site to distribute your program, you can surely find one that has room for the sources.
fr: La GPL insiste sur le fait que les distributeurs de fichiers binaires sans les sources fournissent une offre &eacute;crite d'envoyer les sources, parce que c'est le seul moyen de s'assurer que les utilisateurs peuvent les obtenir.

source: No matter how you distribute the source, the sources you provide must correspond exactly to the binaries. In particular, you must make sure they are for the same version of the program&mdash;not an older version and not a newer version.
fr: Aussi, si vous d&eacute;sirez distribuer des fichiers binaires par FTP anonyme, vous devez distribuer les sources en m&ecirc;me temps. Cela ne devrait pas &ecirc;tre difficile. Si vous pouvez trouver un site pour votre programme, vous pouvez certainement en trouver un qui a de la place pour vos sources.

source: You can make the sources and binaries available on different machines, provided they are equally easy to get to, and provided that you have information next to the binaries saying where to find the sources.
fr: Les sources que vous fournirez doivent correspondre exactement aux fichiers binaires. Vous devez tout particuli&egrave;rement vous assurer qu'elles sont celles de la m&ecirc;me version du programme &mdash;&nbsp;pas une version plus ancienne ou plus r&eacute;cente.

source: <b><a href="#TOCHowCanIMakeSureEachDownloadGetsSource" name="HowCanIMakeSureEachDownloadGetsSource">How can I make sure each user who downloads the binaries also gets the source?</a></b>
fr: <b><a href="#TOCHowCanIMakeSureEachDownloadGetsSource" name="HowCanIMakeSureEachDownloadGetsSource">Comment puis-je m'assurer que tout utilisateur qui t&eacute;l&eacute;charge les fichiers binaires obtient &eacute;galement le code source&nbsp;?</a></b>

source: You don't have to make sure of this. As long as you make the source and binaries available so that the users can see what's available and take what they want, you have done what is required of you. It is up to the user whether to download the source.
fr: Vous n'avez pas &agrave; vous en assurer. Du moment que vous mettez &agrave; disposition des utilisateurs &agrave; la fois les sources et les binaires, afin qu'ils puissent voir ce qui est disponible et prendre ce qui les int&eacute;resse, vous avez fait ce que l'on attend de vous. C'est &agrave; l'utilisateur de d&eacute;cider s'il veut t&eacute;l&eacute;charger les sources.

source: Our requirements for redistributors are intended to make sure the users can get the source code, not to force users to download the source code even if they don't want it.
fr: Nos exigences vis-&agrave;-vis des redistributeurs ont pour but de s'assurer que les utilisateurs peuvent obtenir le code source, pas de forcer les utilisateurs &agrave; le t&eacute;l&eacute;charger m&ecirc;me s'ils ne le d&eacute;sirent pas.

source: <b><a href="#TOCUnreleasedMods" name="UnreleasedMods">A company is running a modified version of a GPL'ed program on a web site. Does the GPL say they must release their modified sources?</a></b>
fr: <b><a href="#TOCUnreleasedMods" name="UnreleasedMods">Une soci&eacute;t&eacute; utilise une version modifi&eacute;e d'un programme sous GPL sur son site Web. La GPL dit-elle qu'elle doit publier les sources modifi&eacute;es&nbsp;?</a></b>

source: The GPL permits anyone to make a modified version and use it without ever distributing it to others. What this company is doing is a special case of that. Therefore, the company does not have to release the modified sources.
fr: La GPL permet &agrave; quiconque de faire une version modifi&eacute;e sans avoir &agrave; la redistribuer &agrave; d'autres. Ce que fait cette soci&eacute;t&eacute; en est un cas particulier. Par cons&eacute;quent, la soci&eacute;t&eacute; n'est pas oblig&eacute;e de publier les sources modifi&eacute;es.

source: It is essential for people to have the freedom to make modifications and use them privately, without ever publishing those modifications. However, putting the program on a server machine for the public to talk to is hardly &ldquo;private&rdquo; use, so it would be legitimate to require release of the source code in that special case. We are thinking about doing something like this in GPL version 3, but we don't have precise wording in mind yet.
fr: Il est essentiel pour les gens d'avoir la libert&eacute; defaire des modifications et de les utiliser de fa&ccedil;on priv&eacute;e, sans avoir &agrave; publier les modifications. Cependant, mettre le programme sur un serveur accessible au public peut &ecirc;tre difficilement qualifi&eacute; d'utilisation &laquo;priv&eacute;e&raquo;, c'est pourquoi il serait l&eacute;gitime de r&eacute;clamer la publication du code source dans ce cas particulier. Nous pensons introduire quelque chose &agrave; ce sujet dans la GPL version 3, mais nous n'avons pas encore de formulation pr&eacute;cise en t&ecirc;te.

source: In the mean time, you might want to use the <a href="http://www.affero.org/oagpl.html">Affero GPL</a> for programs designed for network server use.
fr: Entre temps, vous pourriez vouloir la <a href="http://www.affero.org/oagpl.html">GPL Affero</a> pour des programmes con&ccedil;us pour une utilisation sur des serveurs en r&eacute;seau.

source: <b><a href="#TOCInternalDistribution" name="InternalDistribution">Is making and using multiple copies within one organization or company &ldquo;distribution&rdquo;?</a></b>
fr: <b><a href="#TOCInternalDistribution" name="InternalDistribution">Est-ce que l'utilisation &agrave; l'int&eacute;rieur d'une organisation ou d'une soci&eacute;t&eacute; est une &laquo;&nbsp;distribution&nbsp;&raquo;&nbsp;?</a></b>

source: No, in that case the organization is just making the copies for itself. As a consequence, a company or other organization can develop a modified version and install that version through its own facilities, without giving the staff permission to release that modified version to outsiders.
fr: Non, dans ce cas la soci&eacute;t&eacute; fait juste des copies pour elle-m&ecirc;me. Par cons&eacute;quent, une soci&eacute;t&eacute; ou une organisation peut d&eacute;velopper une version modifi&eacute;e et l'installer dans ces locaux, sans donner la permission au personnel de publier la version modifi&eacute;e &agrave; l'ext&eacute;rieur.

source: However, when the organization transfers copies to other organizations or individuals, that is distribution. In particular, providing copies to contractors for use off-site is distribution.
fr: Cependant, quand une organisation transf&egrave;re des copies &agrave; d'autres organisations ou &agrave; des particuliers, c'est une distribution. En particulier, fournir des copies &agrave; des sous-traitants pour une utilisation hors site est une distribution.

source: <b><a href="#TOCStolenCopy" name="StolenCopy"> If someone steals a CD containing a version of a GPL-covered program, does the GPL give him the right to redistribute that version?</a></b>
fr: <b><a href="#TOCStolenCopy" name="StolenCopy">Si quelqu'un vole un CD contenant une version d'un programme sous GPL, La GPL lui donne t-elle le droit de redistribuer cette version&nbsp;?</a></b>

source: If the version has been released elsewhere, then the thief probably does have the right to make copies and redistribute them under the GPL, but if he is imprisoned for stealing the CD he may have to wait until his release before doing so.
fr: Si la version a &eacute;t&eacute; publi&eacute;e ailleurs, alors le voleur a probablement le droit de faire des copies et de les redistribuer sous la GPL, mais s'il est emprisonn&eacute; pour avoir vol&eacute; le CD, il se peut qu'il doivent attendre sa lib&eacute;ration avant de le faire.

source: If the version in question is unpublished and considered by a company to be its trade secret, then publishing it may be a violation of trade secret law, depending on other circumstances. The GPL does not change that. If the company tried to release its version and still treat it as a trade secret, that would violate the GPL, but if the company hasn't released this version, no such violation has occurred.
fr: Si la version en question n'est pas publi&eacute;e ou consid&eacute;r&eacute;e par une soci&eacute;t&eacute; comme un secret commercial, alors la publier peut &ecirc;tre une violation du secret commercial, selon d'autres circonstances. La GPL ne change pas cela. Si la soci&eacute;t&eacute; a essay&eacute; de publier sa version en la consid&eacute;rant encore comme un secret commercial, cela violerait la GPL, mais si la soci&eacute;t&eacute; n'a pas publi&eacute; cette version, ce n'est pas une violation.

source: <b><a href="#TOCTradeSecretRelease" name="TradeSecretRelease">What if a company distributes a copy as a trade secret?</a></b>
fr: <b><a href="#TOCTradeSecretRelease" name="TradeSecretRelease">Et si une soci&eacute;t&eacute; distribuait une copie sous couvert du secret commercial&nbsp;?</a></b>

source: If a company distributes a copy to you and claims it is a trade secret, the company has violated the GPL and will have to cease distribution. Note how this differs from the theft case above; the company does not intentionally distribute a copy when a copy is stolen, so in that case the company has not violated the GPL.
fr: Si la soci&eacute;t&eacute; vous a distribu&eacute; une copie et revendique le secret commercial, la soci&eacute;t&eacute; a viol&eacute; la GPL et doit cesser la distribution. Notez comme cela diff&egrave;re du cas du vol ci-dessus; la soci&eacute;t&eacute; ne distribue pas intentionnellement une copie quand une copie est vol&eacute;e, aussi dans ce cas, la soci&eacute;t&eacute; n'a pas viol&eacute; la GPL.

source: <b><a href="#TOCWhySomeGPLAndNotLGPL" name="WhySomeGPLAndNotLGPL">Why are some GNU libraries released under the ordinary GPL rather than the Lesser GPL?</a></b>
fr: <b><a href="#TOCWhySomeGPLAndNotLGPL" name="WhySomeGPLAndNotLGPL">Pourquoi certaines biblioth&egrave;ques GNU sont-elles distribu&eacute;es sous GPL normale, plut&ocirc;t que sous GPL amoindrie (<i>Lesser GPL</i>)&nbsp;?</a></b>

source: Using the Lesser GPL for any particular library constitutes a retreat for free software. It means we partially abandon the attempt to defend the users' freedom, and some of the requirements to share what is built on top of GPL-covered software. In themselves, those are changes for the worse.
fr: L'utilisation de la <i>Lesser GPL</i> (GPL Amoindrie) pour toute biblioth&egrave;que particuli&egrave;re repr&eacute;sente une d&eacute;faite pour le logiciel libre. Cela signifie que nous abandonnons partiellement nos tentatives de d&eacute;fendre la libert&eacute; de l'utilisateur, et certaines des exigences sur le partage de ce qui est construit sur un logiciel sous GPL. Il s'agit en l'&eacute;tat d'&eacute;volutions n&eacute;gatives.

source: Sometimes a localized retreat is a good strategy. Sometimes, using the LGPL for a library might lead to wider use of that library, and thus to more improvement for it, wider support for free software, and so on. This could be good for free software if it happens to a large extent. But how much will this happen? We can only speculate.
fr: Une d&eacute;faite partielle peut parfois se r&eacute;v&eacute;ler &ecirc;tre une bonne strat&eacute;gie. Quelquefois, l'utilisation de la LGPL pour une biblioth&egrave;que peut amener &agrave; une utilisation plus large de cette biblioth&egrave;que, et par voie de cons&eacute;quence &agrave; son am&eacute;lioration, un plus grand soutien au logiciel libre, ainsi de suite. Cela pourrait &ecirc;tre bon pour le logiciel libre, si cela se passe &agrave; grande &eacute;chelle. Mais nous pouvons seulement sp&eacute;culer sur l'&eacute;tendue d'un tel succ&egrave;s.

source: It would be nice to try out the LGPL on each library for a while, see whether it helps, and change back to the GPL if the LGPL didn't help. But this is not feasible. Once we use the LGPL for a particular library, changing back would be difficult.
fr: Il serait sympathique d'essayer pendant un temps la LGPL pour chaque biblioth&egrave;que, pour voir si cela am&eacute;liore les choses, puis de se remettre sous GPL si la LGPL n'apporte rien de plus. Mais cela n'est pas envisageable. Une fois qu'une biblioth&egrave;que particuli&egrave;re est plac&eacute;e sous LGPL, il est difficile de changer &agrave; nouveau.

source: So we decide which license to use for each library on a case-by-case basis. There is a <a href="/licenses/why-not-lgpl.html"> long explanation</a> of how we judge the question.
fr: Nous d&eacute;cidons donc de quelle licence utiliser pour chaque bibliothèque au cas par cas. Il existe une <a href="/licenses/why-not-lgpl.fr.html">longue explication</a> sur la fa&ccedil;on dont nous proc&eacute;dons pour nous d&eacute;cider.

source: <b><a href="#TOCWillYouMakeAnException" name="WillYouMakeAnException">Using a certain GNU program under the GPL does not fit our project to make proprietary software. Will you make an exception for us? It would mean more users of that program.</a></b>
fr: <b><a href="#TOCWillYouMakeAnException" name="WillYouMakeAnException">L'utilisation d'un certain programme GNU plac&eacute; sous GPL ne cadre pas avec notre projet de r&eacute;alisation d'un logiciel propri&eacute;taire. Pourriez-vous faire une exception pour nous&nbsp;? Cela augmenterait le nombre d'utilisateurs de ce programme.</a></b>

source: Sorry, we don't make such exceptions. It would not be right.
fr: D&eacute;sol&eacute;, nous ne faisons pas d'exception de ce genre, cela ne serait pas bien.

source: Maximizing the number of users is not our aim. Rather, we are trying to give the crucial freedoms to as many users as possible. In general, proprietary software projects hinder rather than help the cause of freedom.
fr: Notre objectif n'est pas de maximiser le nombre d'utilisateurs. Nous essayons plut&ocirc;t de donner les libert&eacute;s fondamentales au plus grand nombre possible d'utilisateurs. D'une mani&egrave;re g&eacute;n&eacute;rale, les logiciels propri&eacute;taires freinent les libert&eacute;s plus qu'ils ne les favorisent.

source: We do occasionally make license exceptions to assist a project which is producing free software under a license other than the GPL. However, we have to see a good reason why this will advance the cause of free software.
fr: Il nous arrive de cr&eacute;er des exceptions de licence pour aider un projet de logiciel libre sous une autre licence que la GPL. Toutefois, il nous faut pour cela une bonne justification du fait que cela fera avancer la cause du logiciel libre.

source: We also do sometimes change the distribution terms of a package, when that seems clearly the right way to serve the cause of free software; but we are very cautious about this, so you will have to show us very convincing reasons.
fr: Il nous arrive aussi quelquefois de modifier les clauses de distribution d'un paquetage, quand cela nous appara&icirc;t clairement comme un moyen de promouvoir la cause du logiciel libre, mais nous sommes tr&egrave;s prudent &agrave; ce sujet et il vous faudra nous donner des raisons tr&egrave;s convainquantes.

source: <b><a href="#TOCVersionTwoOrLater" name="VersionTwoOrLater">Why should programs say &ldquo;Version 2 of the GPL or any later version&rdquo;?</a></b>
fr: <b><a href="#TOCVersionTwoOrLater" name="VersionTwoOrLater">Pourquoi les programmes doivent-ils se r&eacute;f&eacute;rer &agrave; &laquo;&nbsp;la version 2 de la GPL ou toute version ult&eacute;rieure&nbsp;&raquo; (<i>&laquo;&nbsp;Version 2 of the GPL or any later version&nbsp;&raquo;</i>)&nbsp;?</a></b>
