Repository: gitGNU/gnu_www-fr
Catalog: licenses/old-licenses/gpl-2.0-faq.*.po
Languages: fr

source: <a href="#ReleaseNotOriginal" name="TOCReleaseNotOriginal"> Can I release a program with a license which says that you can distribute modified versions of it under the GPL but you can't distribute the original itself under the GPL?</a>
fr: <a href="#ReleaseNotOriginal" name="TOCReleaseNotOriginal">Puis-je publier un programme avec une licence stipulant que vous pouvez redistribuer des versions modifi&eacute;es de celui-ci sous la GPL mais pas l'original lui-m&ecirc;me sous GPL&nbsp;?</a>

source: <a href="#CompanyGPLCostsMoney" name="TOCCompanyGPLCostsMoney"> I just found out that a company has a copy of a GPL'ed program, and it costs money to get it. Aren't they violating the GPL by not making it available on the Internet?</a>
fr: <a href="#CompanyGPLCostsMoney" name="TOCCompanyGPLCostsMoney">Je viens de d&eacute;couvrir qu'une compagnie a une copie d'un programme sous GPL, et qu'il faut payer pour l'obtenir. Ne violent-ils pas la GPL en ne la rendant pas disponible sur Internet&nbsp;?</a>

source: <a href="#UnreleasedMods" name="TOCUnreleasedMods"> A company is running a modified version of a GPL'ed program on a web site. Does the GPL say they must release their modified sources?</a>
fr: <a href="#UnreleasedMods" name="TOCUnreleasedMods">Une soci&eacute;t&eacute; utilise une version modifi&eacute;e d'un programme sous GPL sur son site Web. La GPL dit-elle qu'elle doit publier les sources modifi&eacute;es&nbsp;?</a>

source: <a href="#InternalDistribution" name="TOCInternalDistribution"> Is use within one organization or company &ldquo;distribution&rdquo;?</a>
fr: <a href="#InternalDistribution" name="TOCInternalDistribution">Est-ce que l'utilisation &agrave; l'int&eacute;rieur d'une organisation ou d'une soci&eacute;t&eacute; est une &laquo;distribution&raquo;?</a>

source: <a href="#StolenCopy" name="TOCStolenCopy"> If someone steals a CD containing a version of a GPL-covered program, does the GPL give him the right to redistribute that version?</a>
fr: <a href="#StolenCopy" name="TOCStolenCopy">Si quelqu'un vole un CD contenant une version d'un programme sous GPL, La GPL lui donne t-elle le droit de redistribuer cette version&nbsp;?</a>

source: <a href="#TradeSecretRelease" name="TOCTradeSecretRelease"> What if a company distributes a copy as a trade secret?</a>
fr: <a href="#TradeSecretRelease" name="TOCTradeSecretRelease">Et si une soci&eacute;t&eacute; distribuait une copie sous couvert du secret commercial&nbsp;?</a>

source: <a href="#GPLFairUse" name="TOCGPLFairUse">Do I have &ldquo;fair use&rdquo; rights in using the source code of a GPL-covered program?</a>
fr: <a href="#GPLFairUse" name="TOCGPLFairUse">Ai-je des droits de <i>&laquo;fair use&raquo;</i> pour l'utilisation du code source d'un programme couvert par la GPL&nbsp;?</a>

source: <a href="#DistributeSubsidiary" name="TOCDistributeSubsidiary"> Does moving a copy to a majority-owned, and controlled, subsidiary constitute distribution?</a>
fr: <a href="#DistributeSubsidiary" name="TOCDistributeSubsidiary">Est-ce que d&eacute;placer une copie vers une filiale contr&ocirc;l&eacute;e majoritairement constitue une distribution&nbsp;?</a>

source: <a href="#ClickThrough" name="TOCClickThrough"> Can software installers ask people to click to agree to the GPL? If I get some software under the GPL, do I have to agree to anything?</a>
fr: <a href="#ClickThrough" name="TOCClickThrough">Est-ce que des installeurs de logiciels peuvent demander aux gens de cliquer pour accepter la GPL&nbsp;? Si j'obtiens un logiciel sous GPL, dois-je tout accepter quoi&nbsp;?</a>

source: <a href="#GPLCompatInstaller" name="TOCGPLCompatInstaller">I would like to bundle GPLed software with some sort of installation software. Does that installer need to have a GPL-compatible license?</a>
fr: <a href="#GPLCompatInstaller" name="TOCGPLCompatInstaller">Je voudrais fournir un logiciel sous GPL avec un installeur. Cet installeur doit-il &ecirc;tre compatible avec la licence GPL&nbsp;?</a>

source: Using programs released under the GPL when writing other programs
fr: Utiliser des programmes sous GPL pour &eacute;crire d'autres programmes

source: <a href="#CanIUseGPLToolsForNF" name="TOCCanIUseGPLToolsForNF">Can I use GPL-covered editors such as GNU Emacs to develop non-free programs? Can I use GPL-covered tools such as GCC to compile them?</a>
fr: <a href="#CanIUseGPLToolsForNF" name="TOCCanIUseGPLToolsForNF">Puis-je utiliser des &eacute;diteurs sous GPL pour d&eacute;velopper des programmes non-libres&nbsp;? Puis-je utiliser des outils sous GPL pour les compiler&nbsp;?</a>

source: <a href="#WhatCaseIsOutputGPL" name="TOCWhatCaseIsOutputGPL">In what cases is the output of a GPL program covered by the GPL too?</a>
fr: <a href="#WhatCaseIsOutputGPL" name="TOCWhatCaseIsOutputGPL">Dans quels cas le r&eacute;sultat produit par un programme sous GPL est-il &eacute;galement couvert par la GPL&nbsp;?</a>

source: <a href="#PortProgramToGL" name="TOCPortProgramToGL">If I port my program to GNU/Linux, does that mean I have to release it as Free Software under the GPL or some other Free Software license?</a>
fr: <a href="#PortProgramToGL" name="TOCPortProgramToGL">Si je fais un portage de mon programme vers GNU/Linux, est-ce que cela signifie que je doive le diffuser en tant que Logiciel Libre plac&eacute; sous la GPL ou une autre licence de Logiciel Libre&nbsp;?</a>

source: <a href="#GPLInProprietarySystem" name="TOCGPLInProprietarySystem">I'd like to incorporate GPL-covered software in my proprietary system. Can I do this?</a>
fr: <a href="#GPLInProprietarySystem" name="TOCGPLInProprietarySystem">J'aimerais incorporer un logiciel sous GPL dans mon syst&egrave;me propri&eacute;taire. Est-ce possible&nbsp;?</a>

source: <a href="#LibGCCException" name="TOCLibGCCException">Does the libstdc++ exception permit dynamic linking?</a>
fr: <a href="#LibGCCException" name="TOCLibGCCException">Est-ce que l'exception libstdc++ permet de lier dynamiquement&nbsp;?</a>

source: Combining work with code released under the GPL
fr: Combiner une &oelig;uvre avec du code sous GPL

source: <a href="#IfLibraryIsGPL" name="TOCIfLibraryIsGPL">If a library is released under the GPL (not the LGPL), does that mean that any program which uses it has to be under the GPL?</a>
fr: <a href="#IfLibraryIsGPL" name="TOCIfLibraryIsGPL">Si une biblioth&egrave;que est distribu&eacute;e sous GPL (et non sous LGPL), cela signifie-t-il que n'importe quel programme qui l'utilise doit &ecirc;tre sous GPL&nbsp;?</a>

source: <a href="#LinkingWithGPL" name="TOCLinkingWithGPL">You have a GPL'ed program that I'd like to link with my code to build a proprietary program. Does the fact that I link with your program mean I have to GPL my program?</a>
fr: <a href="#LinkingWithGPL" name="TOCLinkingWithGPL">Vous avez mis sous GPL un programme que j'aimerais lier &agrave; mon code pour fabriquer un programme propri&eacute;taire. Le fait que je fasse une &eacute;dition de liens avec votre programme implique-t-il que je doive mettre mon programme sous GPL&nbsp;?</a>

source: <a href="#SwitchToLGPL" name="TOCSwitchToLGPL">If so, is there any chance I could get a license of your program under the Lesser GPL?</a>
fr: <a href="#SwitchToLGPL" name="TOCSwitchToLGPL">Si oui, ai-je une chance d'obtenir une licence de votre programme sous la GPL amoindrie (<i>Lesser GPL</i>)&nbsp;?</a>

source: <a href="#WillYouMakeAnException" name="TOCWillYouMakeAnException">Using a certain GNU program under the GPL does not fit our project to make proprietary software. Will you make an exception for us? It would mean more users of that program.</a>
fr: <a href="#WillYouMakeAnException" name="TOCWillYouMakeAnException">L'utilisation d'un certain programme GNU plac&eacute; sous GPL ne cadre pas avec notre projet de r&eacute;alisation d'un logiciel propri&eacute;taire. Pourriez-vous faire une exception pour nous&nbsp;? Cela augmenterait le nombre d'utilisateurs de ce programme.</a>

source: <a href="#IfInterpreterIsGPL" name="TOCIfInterpreterIsGPL">If a programming language interpreter is released under the GPL, does that mean programs written to be interpreted by it must be under GPL-compatible licenses?</a>
fr: <a href="#IfInterpreterIsGPL" name="TOCIfInterpreterIsGPL">Si un interpr&eacute;teur d'un langage de programmation est diffus&eacute; sous GPL, est-ce que cela signifie que les programmes &eacute;crits pour &ecirc;tre interpr&eacute;t&eacute;s par celui-ci doivent &ecirc;tre plac&eacute;s sous des licences compatibles avec la GPL&nbsp;?</a>

source: <a href="#InterpreterIncompat" name="TOCInterpreterIncompat">If a programming language interpreter has a license that is incompatible with the GPL, can I run GPL-covered programs on it?</a>
fr: <a href="#InterpreterIncompat" name="TOCInterpreterIncompat">Si un interpr&eacute;teur de langage de programmation a une licence qui est incompatible avec la GPL, puis-je l'utiliser pour faire tourner des programmes plac&eacute;s sous GPL&nbsp;?</a>

source: <a href="#GPLModuleLicense" name="TOCGPLModuleLicense">If I add a module to a GPL-covered program, do I have to use the GPL as the license for my module?</a>
fr: <a href="#GPLModuleLicense" name="TOCGPLModuleLicense">Si j'ajoute un module &agrave; un module couvert par la GPL, dois-je utiliser la GPL comme licence pour mon module&nbsp;?</a>

source: <a href="#GPLAndPlugins" name="TOCGPLAndPlugins">If a program released under the GPL uses plug-ins, what are the requirements for the licenses of a plug-in?</a>
fr: <a href="#GPLAndPlugins" name="TOCGPLAndPlugins">Si un programme distribu&eacute; sous GPL utilise des plug-ins, quelles sont les contraintes portant sur les licences d'un plug-in&nbsp;?</a>

source: <a href="#GPLPluginsInNF" name="TOCGPLPluginsInNF">Can I apply the GPL when writing a plug-in for a non-free program?</a>
fr: <a href="#GPLPluginsInNF" name="TOCGPLPluginsInNF">Puis-je utiliser la GPL pour un plug-in dans un programme non-libre&nbsp;?</a>

source: <a href="#NFUseGPLPlugins" name="TOCNFUseGPLPlugins">Can I release a non-free program that's designed to load a GPL-covered plug-in?</a>
fr: <a href="#NFUseGPLPlugins" name="TOCNFUseGPLPlugins">Puis-je faire un programme non-libre con&ccedil;u pour charger un plugin couvert par la GPL&nbsp;?</a>

source: <a href="#GPLWrapper" name="TOCGPLWrapper">I'd like to incorporate GPL-covered software in my proprietary system. Can I do this by putting a &ldquo;wrapper&rdquo; module, under a GPL-compatible lax permissive license (such as the X11 license) in between the GPL-covered part and the proprietary part?</a>
fr: <a href="#GPLWrapper" name="TOCGPLWrapper">J'aimerais incorporer un logiciel couvert par la GPL dans mon syst&egrave;me propri&eacute;taire. Puis-je le faire en ajoutant un module &laquo;&nbsp;enveloppant&nbsp;&raquo;, sous une licence permissive compatible avec la GPL (de type licence X 11) entre la partie couverte par la GPL et la partie propri&eacute;taire&nbsp;?</a>

source: <a href="#FSWithNFLibs" name="TOCFSWithNFLibs"> Can I write free software that uses non-free libraries?</a>
fr: <a href="#FSWithNFLibs" name="TOCFSWithNFLibs">Puis-je &eacute;crire un logiciel libre qui utilise des biblioth&egrave;ques non-libres&nbsp;?</a>

source: <a href="#GPLIncompatibleLibs" name="TOCGPLIncompatibleLibs"> What legal issues come up if I use GPL-incompatible libraries with GPL software?</a>
fr: <a href="#GPLIncompatibleLibs" name="TOCGPLIncompatibleLibs">J'&eacute;cris du logiciel libre qui utilise des biblioth&egrave;ques non-libres. Quels probl&egrave;mes l&eacute;gaux surgissent si j'utilise la GPL&nbsp;?</a>

source: <a href="#WindowsRuntimeAndGPL" name="TOCWindowsRuntimeAndGPL">I'm writing a Windows application with Microsoft Visual C++ and I will be releasing it under the GPL. Is dynamically linking my program with the Visual C++ run-time library permitted under the GPL?</a>
fr: <a href="#WindowsRuntimeAndGPL" name="TOCWindowsRuntimeAndGPL">J'&eacute;cris une application Windows avec Microsoft Visual C++ et je pr&eacute;vois de la diffuser sous GPL. Est-il permis par ma GPL de lier mon programme dynamiquement avec la biblioth&egrave;que de run-time de Visual C++&nbsp;?</a>

source: <a href="#MoneyGuzzlerInc" name="TOCMoneyGuzzlerInc">I'd like to modify GPL-covered programs and link them with the portability libraries from Money Guzzler Inc. I cannot distribute the source code for these libraries, so any user who wanted to change these versions would have to obtain those libraries separately. Why doesn't the GPL permit this?</a>
fr: <a href="#MoneyGuzzlerInc" name="TOCMoneyGuzzlerInc">J'aimerais modifier des programmes plac&eacute;s sous GPL et les lier avec les biblioth&egrave;ques de portage de Pompe À Fric, S.A. Je ne peux pas distribuer le code source de ces biblioth&egrave;ques, aussi tout utilisateur voulant modifier ces versions devrait acheter ces biblioth&egrave;ques. Pourquoi la GPL ne le permet-elle pas&nbsp;?</a>

source: <a href="#GPLIncompatibleAlone" name="TOCGPLIncompatibleAlone">If license for a module Q has a requirement that's incompatible with the GPL, but the requirement applies only when Q is distributed by itself, not when Q is included in a larger program, does that make the license GPL-compatible? Can I combine or link Q with a GPL-covered program?</a>
fr: <a href="#GPLIncompatibleAlone" name="TOCGPLIncompatibleAlone">Si la licence pour un module Q requiert une condition incompatible avec la GPL, mais que cette condition ne s'applique seulement lorsque Q est distribu&eacute; seul, et non lorsqu'il est distribu&eacute; dans un plus grand programme, est-ce compatible avec la licence GPL&nbsp;? Puis-je combiner ou lier Q avec un programme couvert par la GPL&nbsp;?</a>

source: <a href="#OOPLang" name="TOCOOPLANG"> In an object-oriented language such as Java, if I use a class that is GPL'ed without modifying, and subclass it, in what way does the GPL affect the larger program?</a>
fr: <a href="#OOPLang" name="TOCOOPLANG">Dans un langage orient&eacute;-objet comme Java, si j'utilise une classe qui est sous GPL sans la modifier et que j'en h&eacute;rite, dans quelle mesure la GPL affecte-t-elle le programme r&eacute;sultant&nbsp;?</a>

source: <a href="#LinkingOverControlledInterface" name="TOCLinkingOverControlledInterface">How can I allow linking of proprietary modules with my GPL-covered library under a controlled interface only?</a>
fr: <a href="#LinkingOverControlledInterface" name="TOCLinkingOverControlledInterface">Comment puis-je autoriser de lier des modules propri&eacute;taires avec ma biblioth&egrave;que sous GPL uniquement dans une interface contr&ocirc;l&eacute;e&nbsp;?</a>

source: <a href="#Consider" name="TOCConsider">Consider this situation: 1. X releases V1 of a project under the GPL. 2. Y contributes to the development of V2 with changes and new code based on V1. 3. X wants to convert V2 to a non-GPL license. Does X need Y's permission?</a>
fr: <a href="#Consider" name="TOCConsider">Consid&eacute;rez la situation suivante&nbsp;:<br />1. X distribue la version V1 d'un projet sous GPL.<br />2. Y contribue au d&eacute;veloppement de la version V2 avec des modifications et des ajouts au code bas&eacute;s sur V1.<br />3. X veut convertir la version V2 vers une licence autre que GPL.<br />X a-t-il besoin de la permission de Y&nbsp;?</a>

source: <a href="#ManyDifferentLicenses" name="TOCManyDifferentLicenses">I have written an application that links with many different components, that have different licenses. I am very confused as to what licensing requirements are placed on my program. Can you please tell me what licenses I may use?</a>
fr: <a href="#ManyDifferentLicenses" name="TOCManyDifferentLicenses">J'ai &eacute;crit une application qui se lie avec de nombreux composants diff&eacute;rents, qui sont couverts par diff&eacute;rentes licences. Je ne comprends vraiment pas bien quelles clauses des licences s'appliquent &agrave; mon programme. Pourriez-vous m'expliquer quelle licences je peux utiliser&nbsp;?</a>

source: Questions about violations of the GPL
fr: Questions sur les violations de la GPL

source: <a href="#ReportingViolation" name="TOCReportingViolation">What should I do if I discover a possible violation of the GPL?</a>
fr: <a href="#ReportingViolation" name="TOCReportingViolation">Que devrais-je faire si je d&eacute;couvre une violation potentielle de la GPL&nbsp;?</a>

source: <a href="#HeardOtherLicense" name="TOCHeardOtherLicense">I heard that someone got a copy of a GPL'ed program under another license. Is this possible?</a>
fr: <a href="#HeardOtherLicense" name="TOCHeardOtherLicense">J'ai entendu parler de quelqu'un qui a obtenu une copie d'un programme en GPL sous une autre licence. Cela est-il possible&nbsp;?</a>

source: <a href="#DeveloperViolate" name="TOCDeveloperViolate">Is the developer of a GPL-covered program bound by the GPL? Could the developer's actions ever be a violation of the GPL?</a>
fr: <a href="#DeveloperViolate" name="TOCDeveloperViolate">Est-ce que le d&eacute;veloppeur d'un programme couvert par la GPL est li&eacute; par cette GPL&nbsp;? Est-ce que le d&eacute;veloppeur pourrait se retrouver un jour en violation de la GPL&nbsp;?</a>

source: <b><a href="#TOCWhatDoesGPLStandFor" name="WhatDoesGPLStandFor">What does &ldquo;GPL&rdquo; stand for?</a></b>
fr: <b><a href="#TOCWhatDoesGPLStandFor" name="WhatDoesGPLStandFor">Que veut dire &laquo;&nbsp;GPL&nbsp;&raquo;&nbsp;?</a></b>

source: &ldquo;GPL&rdquo; stands for &ldquo;General Public License&rdquo;. The most widespread such license is the GNU General Public License, or GNU GPL for short. This can be further shortened to &ldquo;GPL&rdquo;, when it is understood that the GNU GPL is the one intended.
fr: &laquo;&nbsp;GPL&nbsp;&raquo; est l'acronyme de <i>&laquo;&nbsp;General Public License&nbsp;&raquo;</i> (Licence Publique G&eacute;n&eacute;rale). La plus r&eacute;pandue des licences de ce type est la Licence Publique G&eacute;n&eacute;rale GNU (<i>GNU General Public License</i>), ou GNU GPL pour faire court. On peut r&eacute;duire encore plus en &laquo;&nbsp;GPL&nbsp;&raquo;, s'il est entendu qu'il s'agit de la GNU GPL.

source: <b><a href="#TOCDoesFreeSoftwareMeanUsingTheGPL" name="DoesFreeSoftwareMeanUsingTheGPL"> Does free software mean using the GPL?</a></b>
fr: <b><a href="#TOCDoesFreeSoftwareMeanUsingTheGPL" name="DoesFreeSoftwareMeanUsingTheGPL">Est-ce que logiciel libre signifie utiliser la GPL&nbsp;?</a></b>

source: Not at all&mdash;there are many other free software licenses. We have an <a href="/licenses/license-list.html"> incomplete list</a>. Any license that provides the user <a href="/philosophy/free-sw.html">certain specific freedoms</a> is a free software license.
fr: Absolument pas &mdash;&nbsp;il y a beaucoup d'autres licences de logiciels libres. En voici une <a href="/licenses/license-list.fr.html">liste incompl&egrave;te</a>. Toute licence qui offre &agrave; l'utilisateur <a href="/philosophy/free-sw.fr.html">certaines libert&eacute;s sp&eacute;cifiques</a> est une licence de logiciel libre.

source: <b><a href="#TOCWhyUseGPL" name="WhyUseGPL"> Why should I use the GNU GPL rather than other free software licenses?</a></b>
fr: <b><a href="#TOCWhyUseGPL" name="WhyUseGPL">Pourquoi devrais-je utiliser la GNU GPL plut&ocirc;t que d'autres licences de logiciel libre&nbsp;?</a></b>

source: Using the GNU GPL will require that all the <a href="/philosophy/pragmatic.html">released improved versions be free software</a>. This means you can avoid the risk of having to compete with a proprietary modified version of your own work. However, in some special situations it can be better to use a <a href="/licenses/why-not-lgpl.html"> more permissive license</a>.
fr: En utilisant la GNU GPL vous exigerez que toutes les <a href="/philosophy/pragmatic.fr.html">versions am&eacute;lior&eacute;es diffus&eacute;es soient du logiciel libre</a>. Ceci signifie que vous pouvez &eacute;viter le risque d'avoir &agrave; entrer en comp&eacute;tition avec une version modifi&eacute;e propri&eacute;taire de votre propre travail. Cependant, dans certaines situations il peut &ecirc;tre pr&eacute;f&eacute;rable d'utiliser une <a href="/licenses/why-not-lgpl.fr.html">licence plus permissive</a>.

source: <b><a href="#TOCDoesAllGNUSoftwareUseTheGNUGPLAsItsLicense" name="DoesAllGNUSoftwareUseTheGNUGPLAsItsLicense"> Does all GNU software use the GNU GPL as its license?</a></b>
fr: <b><a href="#TOCDoesAllGNUSoftwareUseTheGNUGPLAsItsLicense" name="DoesAllGNUSoftwareUseTheGNUGPLAsItsLicense">Est-ce que tous les logiciels GNU utilisent la GNU GPL comme licence&nbsp;?</a></b>

source: Most GNU software packages use the GNU GPL, but there are a few GNU programs (and parts of programs) that use looser licenses, such as the Lesser GPL. When we do this, it is a matter of <a href="/licenses/why-not-lgpl.html"> strategy</a>.
fr: La plupart des paquets logiciels GNU utilisent la GNU GPL, mais il existe un petit nombre de programmes (et portions de programmes) GNU qui utilisent des licences moins restrictives, telles que la GPL amoindrie (<i>Lesser GPL</i>). Quand nous l'utilisons, c'est pour des raisons <a href="/licenses/why-not-lgpl.fr.html">strat&eacute;giques</a>.

source: <b><a href="#TOCDoesUsingTheGPLForAProgramMakeItGNUSoftware" name="DoesUsingTheGPLForAProgramMakeItGNUSoftware"> Does using the GPL for a program make it GNU software?</a></b>
fr: <b><a href="#TOCDoesUsingTheGPLForAProgramMakeItGNUSoftware" name="DoesUsingTheGPLForAProgramMakeItGNUSoftware">Est-ce que le fait d'utiliser la GPL pour un programme en fait un logiciel GNU&nbsp;?</a></b>

source: Anyone can release a program under the GNU GPL but that does not make it a GNU package.
fr: N'importe qui peut publier un programme sous licence GNU GPL mais &ccedil;a n'en fait pas un paquet logiciel GNU.

source: Making the program a GNU software package means explicitly contributing to the GNU Project. This happens when the program's developers and the GNU Project agree to do it. If you are interested in contributing a program to the GNU Project, please write to <a href="mailto:maintainers@gnu.org">&lt;maintainers@gnu.org&gt;</a>.
fr: Faire d'un programme un paquet logiciel GNU signifie contribuer explicitement au projet GNU. Ceci se produit quand les d&eacute;veloppeurs du programme et le projet GNU se mettent d'accord pour le faire. Si vous souhaitez contribuer au projet GNU par un programme, veuillez &eacute;crire &agrave; <a href="mailto:maintainers&#64;gnu.org">&lt;maintainers&#64;gnu.org&gt;</a>.

source: <b><a href="#TOCReportingViolation" name="ReportingViolation"> What should I do if I discover a possible violation of the GPL?</a></b>
fr: <b><a href="#TOCReportingViolation" name="ReportingViolation">Que devrais-je faire si je d&eacute;couvre une violation potentielle de la GPL&nbsp;?</a></b>
