Repository: gitGNU/gnu_www-fr
Catalog: licenses/old-licenses/gpl-2.0-translations.*.po
Languages: fr

source: Unofficial GNU GPL v2.0 Translations - GNU Project - Free Software Foundation (FSF)
fr: Traductions non officielles de la GNU GPL v2.0 - GNU Project - Free Software Foundation (FSF)

source: GNU, FSF, Free Software Foundation, Linux, Copyleft, Licenses
fr: GNU, FSF, Free Software Foundation, Linux, Copyleft, Licences

source: Unofficial GNU GPL v2.0 Translations
fr: Traductions non officielles de la GNU GPL v2.0

source: Information about unofficial translations
fr: &Agrave; propos des traductions non officielles

source: The reason the FSF does not approve these translations as officially valid is that checking them would be difficult and expensive (needing the help of bilingual lawyers in other countries). Even worse, if an error did slip through, the results could be disastrous for the whole free software community. As long as the translations are unofficial, they can't do any harm, and we hope they help more people understand the GPL.
fr: La raison pour laquelle la FSF n'approuve pas ces traductions comme &eacute;tant officiellement valides, c'est que leur v&eacute;rification serait difficile et co&ucirc;teuse (besoin de l'aide de juristes bilingues dans d'autres pays). Et pire, si une erreur se glissait, les cons&eacute;quences pourraient &ecirc;tre d&eacute;sastreuses pour toute la communaut&eacute; du logiciel libre. Tant que ces traductions ne sont pas officielles, elles ne peuvent pas faire de d&eacute;g&acirc;ts, et nous esp&eacute;rons qu'elles aideront plus de gens &agrave; comprendre la GPL.

source: We give permission to publish translations of the GPL, GFDL, or LGPL into other languages, provided that you (1) label your translations as unofficial (see below for how to do this), to inform people that they do not count legally as substitutes for the authentic version, and (2) you agree to install changes at our request, if we learn from other friends of GNU that changes are necessary to make the translation clearer.
fr: Nous permettons la publication de traductions de la GPL ou de la LGPL dans d'autres langues, pourvu que (1) vous sp&eacute;cifiiez dans vos traductions qu'elles ne sont pas officielles (voir plus loin comment faire), que vous informiez qu'elles ne tiennent pas lieu l&eacute;galement de substitution &agrave; la version originale, et (2) que vous autorisiez &agrave; ajouter des modifications &agrave; notre demande, si nous apprenons par d'autres amis de GNU que des modifications sont n&eacute;cessaires pour rendre la traduction plus claire.

source: To label your translations as unofficial we want you to add the following text at the beginning, both in English and in the language of the translation&mdash;replacing <em>language</em> with the name of that language:
fr: Pour sp&eacute;cifier que votre traduction n'est pas officielle, nous voudrions que vous ajoutiez le texte suivant au d&eacute;but, &agrave; la fois en anglais et dans la langue de la traduction, en rempla&ccedil;ant &laquo;&nbsp;language&nbsp;&raquo; par le nom de cette langue&nbsp;:

source: This is an unofficial translation of the GNU General Public License into <em>language</em>. It was not published by the Free Software Foundation, and does not legally state the distribution terms for software that uses the GNU GPL&mdash;only the original English text of the GNU GPL does that. However, we hope that this translation will help <em>language</em> speakers understand the GNU GPL better.
fr: Ceci est une traduction non officielle de la GNU General Public License en fran&ccedil;ais. Elle n'a pas &eacute;t&eacute; publi&eacute;e par la Free Software Foundation, et ne d&eacute;termine pas les termes de distribution pour les logiciels qui utilisent la GNU GPL &mdash;&nbsp;seul le texte anglais original de la GNU GPL en a le droit. Cependant, nous esp&eacute;rons que cette traduction aidera les francophones &agrave; mieux comprendre la GNU GPL.

source: If you make a translation, please inform the GNU Translation Managers <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>. They will check to make sure that your translation follows the above guidelines and make a link to it from this page.
fr: Si vous faites une traduction, veuillez en informer les responsables de la traduction de GNU <a href="mailto:web-translators&#64;gnu.org">&lt;web-translators&#64;gnu.org&gt;</a>. Ils s'assureront que votre traduction respecte les r&egrave;gles pr&eacute;c&eacute;dentes et ajouteront un lien vers votre traduction sur cette page.

source: To make the process of searching translations easy, please use the language code in brackets.
fr: Pour faciliter la recherche d'une traduction, veuillez utiliser le code de langue entre crochets.

source: These are translations of an older version of the GNU GPL. Translations of current licenses can be found <a href="/licenses/translations.html">here</a>.
fr: Voici la liste des traductions d'une ancienne version de la GNU GPL. Les traductions des licences en cours se trouvent <a href="/licenses/licenses.fr.html">ici</a>

source: <code>[af]</code> Afrikaans translation of the GPL (<a href="http://www.poespas.co.za/wiki/index.php/GNU_Algemene_Publieke_Lisensie">1</a>) (<a href="http://www.leuce.com/translate/GNU-GPL-af.txt">2</a>)
fr: <code>[af]</code> Traduction en afrikaans de la GPL (<a href="http://www.poespas.co.za/wiki/index.php/GNU_Algemene_Publieke_Lisensie">1</a>) (<a href="http://www.leuce.com/translate/GNU-GPL-af.txt">2</a>)

source: <code>[sq]</code> <a href="http://www.alblinux.net/dok/GPL.html">Albanian</a> translation of the GPL
fr: <code>[sq]</code> Traduction en <a href="http://www.alblinux.net/dok/GPL.html">albanais</a> de la GPL

source: <code>[ar]</code> <a href="http://www.linuxfuture.org/download/Arabic_GPL_2.0.htm">Arabic</a> translation of the GPL
fr: <code>[ar]</code> Traduction en <a href="http://www.linuxfuture.org/download/Arabic_GPL_2.0.htm">arabe</a> de la GPL

source: <code>[pt-br]</code> <a href="http://www.magnux.org/doc/GPL-pt_BR.txt">Brazilian Portuguese</a> translation of the GPL
fr: <code>[pt-br]</code> Traduction en <a href="http://www.magnux.org/doc/GPL-pt_BR.txt">portugais br&eacute;silien</a> de la GPL

source: <code>[cs]</code> Czech translations of the GPL (<a href="http://staff.cesnet.cz/~lhotka/gnugpl-cz.html">1</a>) (<a href="http://gnu.cz/article.php?id_art=32">2</a>)
fr: <code>[cs]</code> Traductions en tch&egrave;que de la GPL (<a href="http://staff.cesnet.cz/~lhotka/gnugpl-cz.html">1</a>) (<a href="http://gnu.cz/article.php?id_art=32">2</a>)

source: <code>[da]</code> <a href="http://www.fundanemt.com/gpl_da.html">Danish</a> translation of the GPL
fr: <code>[da]</code> Traduction en <a href="http://www.fundanemt.com/gpl_da.html">danois</a> de la GPL

source: <code>[nl]</code> <a href="http://users.skynet.be/xterm/gpld.txt">Dutch</a> translation of the GPL
fr: <code>[nl]</code> Traduction en <a href="http://users.skynet.be/xterm/gpld.txt">n&eacute;erlandais</a> de la GPL

source: <code>[eo]</code> <a href="http://www.esperanto.mv.ru/Cetero/gpl.html">Esperanto</a> translation of the GPL
fr: <code>[eo]</code> Traduction en <a href="http://www.esperanto.mv.ru/Cetero/gpl.html">esperanto</a> de la GPL

source: <code>[et]</code> <a href="http://www.dexsun.com/gnu/ee/">Estonian</a> translation of the GPL
fr: <code>[et]</code> Traduction en <a href="http://www.dexsun.com/gnu/ee/">estonien</a> de la GPL

source: <code>[fa]</code> <a href="http://www.kaveh.org/gnu/gpl-fa.html">Farsi</a> translation of the GPL
fr: <code>[fa]</code> Traduction en <a href="http://www.kaveh.org/gnu/gpl-fa.html">farsi</a> de la GPL

source: <code>[fi]</code> <a href="http://www.turre.com/licenses/gpl-2.0_fi.html">Finnish</a> translation of the GPL
fr: <code>[fi]</code> Traduction en <a href="http://www.turre.com/licenses/gpl_fi.php">finnois</a> de la GPL

source: <code>[fr]</code> <a href="http://fsffrance.org/gpl/gpl-fr.fr.html">French</a> translation of the GPL
fr: <code>[fr]</code> Traduction en <a href="http://fsffrance.org/gpl/gpl-fr.fr.html">fran&ccedil;ais</a> de la GPL

source: <code>[gl]</code> <a href="http://www.mancomun.org/GPL2_GL/gpl2_gl.txt"> Galician</a> and <a href="http://members.tripod.com.br/RamonFlores/GNU/gpl.html"> Galician minimo</a> translation of the GPL
fr: <code>[gl]</code> Traduction en <a href="http://www.mancomun.org/GPL2_GL/gpl2_gl.txt">galicien</a> et en <a href="http://members.tripod.com.br/RamonFlores/GNU/gpl.html">galicien minimo</a> de la GPL

source: <code>[ka]</code> <a href="http://aiet.qartuli.net/projects/gnu-gpl_en.php">Georgian</a> translation of the GPL
fr: <code>[ka]</code> Traduction en <a href="http://aiet.qartuli.net/projects/gnu-gpl_en.php">g&eacute;orgien</a> de la GPL

source: <code>[de]</code> <a href="http://www.gnu.de/gpl-ger.html">German</a> translation of the GPL
fr: <code>[de]</code> Traduction en <a href="http://www.gnu.de/gpl-ger.html">allemand</a> de la GPL

source: <code>[el]</code> Greek translation of the GPL (<a href="http://stillmover.tripod.com/Adana/">1</a>) (<a href="http://www.eexi.gr/?q=node/16">2</a>)
fr: <code>[el]</code> Traduction en <a href="http://stillmover.tripod.com/Adana/">grec</a> de la GPL (formats PDF et TXT)

source: <code>[he]</code> <a href="http://www.law.co.il/media/computer-law/gpl-hebrew.html"> Hebrew</a> translation of the GPL
fr: <code>[he]</code> Traduction en <a href="http://www.law.co.il/computer-law/gpl-hebrew.html">h&eacute;breu</a> de la GPL

source: <code>[hu]</code> Hungarian translation of the GPL (<a href="http://www.dexsun.com/gnu/hu/">1</a>, <a href="http://gnu.hu/gpl.html">2</a>)
fr: <code>[hu]</code> Traduction en <a href="http://www.dexsun.com/gnu/hu/">hongrois</a> de la GPL

source: <code>[id]</code> <a href="http://vlsm.org/etc/gpl-unofficial.id.html">Indonesian</a> translation of the GPL
fr: <code>[id]</code> Traduction en <a href="http://vlsm.org/etc/gpl-unofficial.id.html">indon&eacute;sien</a> de la GPL

source: <code>[it]</code> <a href="http://www.softwarelibero.it/gnudoc/gpl.it.txt">Italian</a> translation of the GPL
fr: <code>[it]</code> Traduction en <a href="http://www.softwarelibero.it/gnudoc/gpl.it.txt">italien</a> de la GPL

source: <code>[ja]</code> Japanese translations of the GPL (<a href="http://www.opensource.jp/gpl/gpl.ja.html.euc-jp">1</a>) (<a href="ftp://ftp.sra.co.jp/pub/gnu/local-fix/GPL2-j/">2</a>)
fr: <code>[ja]</code> Traductions en japonais de la GPL (<a href="http://www.opensource.jp/gpl/gpl.ja.html.euc-jp">1</a>) (<a href="ftp://ftp.sra.co.jp/pub/gnu/local-fix/GPL2-j/">2</a>)

source: <code>[ko]</code> <a href="http://korea.gnu.org/people/chsong/copyleft/gpl.ko.html">Korean</a> translation of the GPL
fr: <code>[ko]</code>Traduction en <a href="http://korea.gnu.org/people/chsong/copyleft/gpl.ko.html">coréen</a> de la GPL

source: <code>[lt]</code> <a href="http://www.autopenhosting.org/gnu/gnu_gpl.html">Lithuanian</a> translation of the GPL
fr: <code>[lt]</code> Traduction en <a href="http://www.autopenhosting.org/gnu/gnu_gpl.html">lituanien</a> de la GPL

source: <code>[mk]</code> <a href="http://www.slobodensoftver.org.mk/dokumenti/gnu_gpl_mk.html">Macedonian</a> translation of the GPL
fr: <code>[mk]</code> Traduction en <a href="http://www.slobodensoftver.org.mk/dokumenti/gnu_gpl_mk.html">mac&eacute;donien</a>de la GPL

source: <code>[mt]</code> <a href="http://www.dexsun.com/gnu/mt/">Maltese</a> translation of the GPL
fr: <code>[mt]</code> Traduction en <a href="http://www.dexsun.com/gnu/mt/">maltais</a> de la GPL

source: <code>[pl]</code> <a href="http://gnu.org.pl/text/licencja-gnu.html">Polish</a> translation of the GPL
fr: <code>[pl]</code> Traduction en <a href="http://gnu.org.pl/text/licencja-gnu.html">polonais</a> de la GPL

source: <code>[pt]</code> <a href="http://www.neoscopio.com/licenca_GPL_pt.txt">Portuguese</a> translation of the GPL
fr: <code>[pt]</code> Traduction en <a href="http://www.neoscopio.com/licenca_GPL_pt.txt">portugais</a> de la GPL

source: <code>[ro]</code> <a href="http://www.roedu.net/gplro.html">Romanian</a> translation of the GPL
fr: <code>[ro]</code> Traduction en <a href="http://www.roedu.net/gplro.html">roumain</a> de la GPL

source: <code>[ru]</code> Russian translations of the GPL (<a href="http://www.infolex.narod.ru/gpl_gnu/gplrus.html">1</a>) (<a href="http://law.bugtraq.ru/freesoft/gplrus3.html">2</a>)
fr: <code>[ru]</code> Traductions en russe de la GPL (<a href="http://www.infolex.narod.ru/gpl_gnu/gplrus.html">1</a>) (<a href="http://law.bugtraq.ru/freesoft/gplrus3.html">2</a>)

source: <code>[sr]</code> <a href="http://alas.matf.bg.ac.yu/~mr99164/ojl.html">Serbian</a> translation of the GPL
fr: <code>[sr]</code> Traduction en <a href="http://alas.matf.bg.ac.yu/~mr99164/ojl.html">serbe</a> de la GPL

source: <code>[es]</code> Spanish translations of the GPL (<a href="http://gugs.sindominio.net/licencias/">1</a> - several different translations) (<a href="http://www.fsl.org.mx/index.pl/fsl/artculos/articulosmb2/licencias/licencia-gpl-espaolmxico">2</a> - Spanish Mexican)
fr: <code>[es]</code> Traductions en espagnol de la GPL (<a href="http://gugs.sindominio.net/licencias/">1</a> - plusieurs traductions) (<a href="http://www.fsl.org.mx/index.pl/fsl/artculos/articulosmb2/licencias/licencia-gpl-espaolmxico">2</a> - espagnol mexicain)

source: <code>[sv]</code> <a href="http://danielnylander.se/gpl/">Swedish</a> translation of the GPL
fr: <code>[sv]</code> Traduction en <a href="http://danielnylander.se/gpl/">suédois</a>de la GPL

source: <code>[th]</code> <a href="http://developer.thai.net/gpl/">Thai</a> translation of the GPL
fr: <code>[th]</code> Traduction en <a href="http://developer.thai.net/gpl/">tha&iuml;</a> de la GPL

source: <code>[tr]</code> Turkish translations of the GPL (<a href="http://www.arayan.com/da/gpl_tr.html">1</a>) (<a href="http://www.belgeler.org/howto/gpl.html">2</a>)
fr: <code>[tr]</code> Traduction en turc de la GPL (<a href="http://www.arayan.com/da/gpl_tr.html">1</a>) (<a href="http://www.belgeler.org/howto/gpl.html">2</a>)

source: <code>[uk]</code> <a href="http://www.linux.kiev.ua/ua/devel/licenses/gnu-gpl2/">Ukranian</a> translation of the GPL
fr: <code>[uk]</code> Traduction en <a href="http://www.linux.kiev.ua/ua/devel/licenses/gnu-gpl/">ukrainien</a> de la GPL

source: <code>[vi]</code> <a href="http://vi.wikisource.org/wiki/GPL">Vietnamese</a> translation of the GPL
fr: <code>[vi]</code> Traduction en <a href="http://vi.wikisource.org/wiki/GPL">vietnamien</a> de la GPL

source: <code>[cy]</code> <a href="http://www.hebffinia.com/gpl_cymraeg/">Welsh</a> translation of the GPL
fr: <code>[cy]</code> Traduction en <a href="http://www.hebffinia.com/gpl_cymraeg/">gallois</a> de la GPL

source: <code>[zh-cn]</code> <a href="http://gnu.freehostingguru.com/gpl/">Chinese (Simplified)</a> translation of the GPL
fr: <code>[zh-cn]</code> Traduction en <a href="http://gnu.freehostingguru.com/gpl/">chinois (simplifi&eacute;)</a> de la GPL

source: <code>[zh-tw]</code> <a href="http://www.linux.org.tw/CLDP/OLD/doc/GPL.html">Chinese (Traditional)</a> translation of the GPL
fr: <code>[zh-tw]</code> Traduction en <a href="http://www.linux.org.tw/CLDP/OLD/doc/GPL.html">chinois (tradictionnel)</a> de la GPL

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
