Repository: gitGNU/gnu_www-fr
Catalog: graphics/wallpapers.*.po
Languages: fr

source: Wallpapers - GNU Project - Free Software Foundation
fr: Fonds d'écran - Projet GNU - Free Software Foundation

source: Wallpapers
fr: Fonds d'écran

source: <a href="/graphics/skwid-wallpapers.html">GNU Wallpapers</a> by Ben &ldquo;Skwid&rdquo; Gailly.
fr: <a href="/graphics/skwid-wallpapers.html">Fonds d'écran GNU</a>, par Ben « Skwid » Gailly.

source: &ldquo;<a href="/graphics/plant-onion.html">Plant Onions!</a>&rdquo; by Péhä.
fr: <cite><a href="/graphics/plant-onion.html">Plant Onions!</a></cite> (Plantez des oignons !), par Péhä.

source: &ldquo;<a href="/graphics/this-is-freedom-wallpaper.html">This is Freedom</a>&rdquo; wallpaper, created by Vadim Gush.
fr: <cite><a href="/graphics/this-is-freedom-wallpaper.html">This is Freedom</a></cite> (Voici la liberté), par Vadim Gush.

source: &ldquo;<a href="/graphics/gnu-born-free-run-free-wallpaper.png"> GNU Born Free Run Free</a>&rdquo; wallpaper, by Alicia Lapekas.
fr: <cite><a href="/graphics/gnu-born-free-run-free-wallpaper.png">GNU Born Free Run Free</a></cite> (GNU, né libre, tourne librement), par Alicia Lapekas.

source: &ldquo;<a href="/graphics/time_for_freedom.png">Time For Freedom</a>&rdquo; wallpaper is by <a href="mailto:sueroski@interia.pl"> Sueroski</a>.
fr: <cite><a href="/graphics/time_for_freedom.png">Time For Freedom</a></cite> (C'est l'heure de la liberté), par <a href="mailto:sueroski@interia.pl">Sueroski</a>.

source: &ldquo;<a href="/graphics/I_run_GNU_by_GNUlancer.png">I run gnu</a>&rdquo; wallpaper by <a href="mailto:idenim@mail.ru">GNULancer</a>. Its source is <a href="/graphics/__I_run_GNU___source_file_by_GNUlancer.xcf">here</a>.
fr: <cite>I run gnu</cite> (Je fais tourner GNU), par <a href="mailto:idenim@mail.ru">GNULancer</a>, disponible en <a href="/graphics/I_run_GNU_by_GNUlancer.png">PNG</a> et <a href="/graphics/__I_run_GNU___source_file_by_GNUlancer.xcf">XCF</a>.

source: <a href="http://hpfteam.free.fr/">Harrypopof</a> has created a set of &ldquo;Free Software Song&rdquo; wallpapers.
fr: Fonds d'écran sur le thème de la « Chanson du logiciel libre », par <a href="http://hpfteam.free.fr/">Harrypopof</a> :

source: - White font: <a href="/graphics/FSS_800.png">800x600</a> | <a href="/graphics/FSS_1024.png">1024x768</a> | <a href="/graphics/FSS_1280.png">1280x960</a>
fr: - police blanche : <a href="/graphics/FSS_800.png">800x600</a> | <a href="/graphics/FSS_1024.png">1024x768</a> | <a href="/graphics/FSS_1280.png">1280x960</a>

source: - Black font: <a href="/graphics/FSS-2_800.png">800x600</a> | <a href="/graphics/FSS-2_1024.png">1024x768</a> | <a href="/graphics/FSS-2_1280.png">1280x960</a>
fr: - police noire : <a href="/graphics/FSS-2_800.png">800x600</a> | <a href="/graphics/FSS-2_1024.png">1024x768</a> | <a href="/graphics/FSS-2_1280.png">1280x960</a>

source: &ldquo;<a href="/graphics/einstein-gnu-think-freely.png">Think freely</a>&rdquo; is a wallpaper created by <a href="http://lirhost.net/~jocke/">Joakim Olsson</a>. It is a travesty on <a href="http://en.wikipedia.org/wiki/Think_Different">the &ldquo;Think different&rdquo;-advertising slogan created for Apple Computer</a>.
fr: <a href="/graphics/einstein-gnu-think-freely.png"><cite>Think freely</cite></a> (Pensez librement), par <a href="http://lirhost.net/~jocke/">Joakim Olsson</a>. C'est une imitation de <a href="http://en.wikipedia.org/wiki/Think_Different"><cite>Think different</cite></a> (le slogan publicitaire créé pour Apple).

source: Shree Kant Bohra made a 900x900 wallpaper &ldquo;<a href="/graphics/grab-your-freedom.jpg">Grab your freedom today!</a>&rdquo;, promoting the usage of <a href="/gnu/linux-and-gnu.html">GNU/Linux</a>.
fr: <cite><a href="/graphics/grab-your-freedom.jpg">Grab your freedom today!</a></cite> (Aujourd'hui, emparez-vous de votre liberté !), fond d'écran 900x900 créé par Shree Kant Bohra pour promouvoir l'utilisation de <a href="/gnu/linux-and-gnu.html">GNU/Linux</a>.

source: Dustin Jorge made a nice wallpaper inspired by the GNU head. He spent some time researching copyright for a paper he had to do for a class. In the meantime he made this desktop (<a href="/graphics/gnublue.png">PNG, 503kB</a>).
fr: Joli fond d'écran inspiré de la tête de GNU (<a href="/graphics/gnublue.png">PNG, 503 ko</a>), réalisé par Dustin Jorge pendant les temps morts de recherches assez longues qu'il a dû faire pour un exposé sur le copyright .

source: <a href="/graphics/gnu-slash-linux.html">Three GNU/linux wallpapers</a> by Rui Damas.
fr: <a href="/graphics/gnu-slash-linux.html">Trois fonds d'écran GNU/linux</a>, par Rui Damas.

source: <a href="/graphics/gnu-alternative.html">Two wallpapers based on the alternative GNU head</a>.
fr: <a href="/graphics/gnu-alternative.html">Deux fonds d'écran basés sur la Tête de GNU alternative</a>.

source: <a href="/graphics/meditate.html">A wallpaper based on &ldquo;Levitating, Meditating, Flute-playing Gnu&rdquo;</a> by Gonzalo Pineda.
fr: <a href="/graphics/meditate.html">Fond d'écran basé sur le Gnou en méditation, en lévitation et jouant de la flûte</a>, par Gonzalo Pineda.

source: <a href="/graphics/winkler-gnu.html">A blue wallpaper</a> by Kyle Winkler.
fr: <a href="/graphics/winkler-gnu.html">Un fond d'écran bleu</a>, par Kyle Winkler.

source: &ldquo;<a href="/graphics/free_as_in_freedom.png">Free As In Freedom</a>&rdquo; by <a href="mailto:c0rtm4n@gmail.com">Cortman</a>.
fr: « <a href="/graphics/free_as_in_freedom.png">Libre comme dans liberté</a> », par <a href="mailto:c0rtm4n@gmail.com">Cortman</a>.

source: &ldquo;Free As In Freedom&rdquo; — minimalist wallpaper: <a href="/graphics/Free_as_in_Freedom_gnu-org_fsf-org.png">PNG </a> (30.3kB) and <a href="/graphics/Free_as_in_Freedom_gnu-org_fsf-org.xcf">XCF </a> (86.1kB). Written in 2015 by Caleb Herbert. To the extent possible under law, the author(s) have dedicated all copyright and related and neighboring rights to this work to the <a href="http://creativecommons.org/publicdomain/zero/1.0/">public domain</a> worldwide.
fr: Fond d'écran minimaliste créé en 2015 par Calb Herbert, disponible aux formats PNG (<a href="/graphics/Free_as_in_Freedom_gnu-org_fsf-org.png">30.3 ko</a>) et XCF (<a href="/graphics/Free_as_in_Freedom_gnu-org_fsf-org.xcf">86.1 ko</a>). L'auteur a dédié cette œuvre au <a href="http://creativecommons.org/publicdomain/zero/1.0/">domaine public</a> en renonçant dans le monde entier à ses droits sur l’œuvre selon les lois sur le droit d’auteur, les droits voisins et droits connexes, dans la mesure permise par la loi.

source: &ldquo;<a href="/graphics/gnulinux_rms_phrase.png">Baby GNU and baby Tux, with the GNU project definition</a>&rdquo; based on Nicolas Rougier's <a href="http://www.labri.fr/perso/nrougier/artwork/index.html">renders</a>, edited by Alex M James.
fr: <a href="/graphics/gnulinux_rms_phrase.png">Bébé GNU et bébé Tux avec la définition du projet GNU</a>, basé sur un <a href="http://www.labri.fr/perso/nrougier/artwork/index.html">rendu</a> de Nicolas Rougier édité par Alex M. James.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. Les liens orphelins et autres corrections ou suggestions peuvent être signalés à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Nous faisons le maximum pour proposer des traductions fidèles et de bonne qualité, mais nous ne sommes pas parfaits. Merci d'adresser vos commentaires sur cette page, ainsi que vos suggestions d'ordre général sur les traductions, à <a href="mailto:web-translators@gnu.org"> &lt;web-translators@gnu.org&gt;</a>.</p> <p>Pour tout renseignement sur la coordination et la soumission des traductions de nos pages web, reportez-vous au <a href="/server/standards/README.translations.html">guide de traduction</a>.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Attribution-NoDerivatives 4.0 International License</a>.
fr: Cette page peut être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/deed.fr">Creative Commons attribution, pas de modification, 4.0 internationale (CC BY-ND 4.0)</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction : Cédric Corazza.<br />Révision : <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour :
