Repository: gitGNU/gnu_www-fr
Catalog: distros/distros.*.po
Languages: fr

source: GNU/Linux Distros - GNU Operating System
fr: Distributions GNU/Linux - Le système d'exploitation GNU

source: GNU/Linux Distros
fr: Distributions GNU/Linux

source: Free GNU/Linux system distributions (or &ldquo;distros&rdquo;) only include and only propose free software. They reject non-free applications, non-free programming platforms, non-free drivers, non-free firmware &ldquo;blobs&rdquo;, and any other non-free software and documentation. If they discover that by mistake some had been included, they remove it.
fr: Les distributions système libres GNU/Linux (ou «&nbsp;distros&nbsp;») ne contiennent et ne proposent que des logiciels libres. Elles rejettent les applications non-libres, les plateformes de développement non-libres, les pilotes non-libres ou les «&nbsp;blobs&nbsp;» de microcodes non-libres et tout autre logiciel ou documentation non-libre. Si par erreur elles en incluent, elles le retirent dès qu'elles s'en rendent compte.

source: Free GNU/Linux Distros
fr: Distributions GNU/Linux libres

source: We recommend that you use a free GNU/Linux system distribution, one that does not include proprietary software at all. That way you can be sure that you are not installing any non-free programs. Here is the list of such distros:<br /> <a href="/distros/free-distros.html"> Free GNU/Linux Distributions</a><br />
fr: Nous vous recommandons d'utiliser une distribution système GNU/Linux libre, une qui ne contienne pas de logiciels propriétaires du tout. De cette manière vous pouvez être sûr que vous n'installez pas de programmes non-libres. Vous trouverez une liste de ces distributions ici&nbsp;:<br /><a href="/distros/free-distros.html">Distributions GNU/Linux libres</a><br />

source: If you want to contribute in the most useful way, we suggest that you join the development of an existing free distro rather that starting a new distro, even if the new one is free. Each of these existing distros could use more development help.
fr: Si vous souhaitez contribuer de la façon la plus utile, nous vous suggérons de rejoindre le développement d'une distribution libre existante plutôt que de démarrer une nouvelle distribution, même si celle-ci est libre. Chacune de ces distributions libres pourraient utiliser plus d'aide de développement.

source: Free Distro Guidelines
fr: Recommandations pour une distribution libre

source: Here is the list of problems that can prevent a distro from being considered entirely free:<br /> <a href="/distros/free-system-distribution-guidelines.html"> Guidelines for Free System Distributions</a>
fr: Voici une liste des problèmes qui empêchent une distribution d'être considérée comme libre&nbsp;:<br /> <a href="/distros/free-system-distribution-guidelines.fr.html">Recommandations pour la distribution de systèmes libres</a>

source: Common Distros
fr: Distributions courantes

source: Many common and well-known GNU/Linux software distributions don't meet our guidelines. You can read about their problems here:<br /> <a href="/distros/common-distros.html"> Explaining Why We Don't Endorse The Well-Known GNU/Linux Distros</a>
fr: Beaucoup de distributions GNU/Linux bien connues ne respectent pas nos recommandations. Vous pouvez lire les problèmes qu'elles ont ici&nbsp;:<br /><a href="/distros/common-distros.fr.html">Pourquoi nous n'homologuons pas les distributions GNU/Linux bien connues</a>

source: We appeal to the developers of these distros to remove the non-free parts and thus make them entirely free software.
fr: Nous appelons les développeurs de ces distributions à supprimer les parties non-libres et de les rendre par conséquent totalement libres.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
