Repository: gitGNU/gnu_www-fr
Catalog: distros/free-system-distribution-guidelines.*.po
Languages: fr

source: Guidelines for Free System Distributions - GNU Project - Free Software Foundation
fr: Recommandations pour la distribution de systèmes libres - GNU Project - Free Software Foundation

source: Guidelines for Free System Distributions
fr: Recommandations pour la distribution de systèmes libres

source: The purpose of these guidelines is to explain what it means for a system distribution (such as a GNU/Linux distribution) to qualify as free, and help distribution developers make their distributions qualify.
fr: Le propos de ces recommandations est d'expliquer ce que cela signifie pour une distribution système (telle qu'une distribution GNU/Linux) d'être qualifiée de libre, et d'aider les développeurs des distributions à rendre les leurs libres.

source: These guidelines are not complete. We have mentioned the issues we are aware of now, but we're sure there are more. We will add them when we come across them.
fr: Ces recommandations ne sont pas exhaustives. Nous avons mentionné les problèmes dont nous sommes conscients maintenant, mais nous sommes sûrs qu'il y en a plus. Nous les ajouterons quand nous les rencontrerons.

source: We would like to thank the Fedora Project for their help in focusing these policies, and allowing us to use their own distribution license guidelines as a basis for this document.
fr: Nous aimerions remercier le Projet Fedora pour nous avoir aidés à nous concentrer sur ces règles et pour nous avoir autorisés à utiliser leurs propres recommandations de licence de distribution comme base pour ce document.

source: License Rules
fr: Règles pour les licences

source: &ldquo;Information for practical use&rdquo; includes software, documentation, fonts, and other data that has direct functional applications. It does not include artistic works that have an aesthetic (rather than functional) purpose, or statements of opinion or judgment.
fr: «&nbsp;Les informations pour une utilisation pratique&nbsp;» incluent les logiciels, la documentation, les polices et les autres données qui ont des applications fonctionnelles directes. Cela n'inclut pas les travaux artistiques qui ont une vocation esthétique (plutôt que fonctionnelle), ou des déclarations ou des jugements.

source: All information for practical use in a free distribution must be available in source form. (&ldquo;Source&rdquo; means the form of the information that is preferred for making changes to it.)
fr: Toutes les informations pour l'utilisation pratique d'une distribution libre doit être disponible sous forme de source. («&nbsp;Source&nbsp;» signifie la forme sous laquelle les informations sont facilement modifiables).

source: The information, and the source, must be provided under an appropriate free license. We list the ones we have evaluated on <a class="reference" href="/licenses/license-list.html">our license list</a>, with separate sections for licenses that are suitable for software, documentation, fonts, and other useful works. If such a work is released under multiple licenses, at least one of which is free, it can be included in the system; the system developers just need to follow the terms of the available free license(s) when they distribute and/or modify it.
fr: Toutes les informations pour une utilisation pratique dans une distribution libre doivent être publiées sous une licence libre appropriée. Nous listons celles que nous avons évaluées dans <a class="reference" href="/licenses/license-list.fr.html">notre liste de licences</a>, avec des sections séparées pour les licences adéquates pour les logiciels, la documentation, les polices et d'autres travaux utiles. Si un tel travail est distribué sous de multiples licences, dont au moins une est libre, il peut être inclus dans notre système&nbsp;; les développeurs système ont seulement besoin de suivre les termes de la (des) licence(s) libre(s) disponible(s) quand ils le distribuent et/ou le modifient.

source: A free system distribution must not steer users towards obtaining any nonfree information for practical use, or encourage them to do so. There should be no repositories or ports for nonfree software. Nor should the distribution refer to third-party repositories that are not committed to only including free software; even if they only have free software today, that may not be true tomorrow. Programs in the system should not suggest installing nonfree plugins, documentation, and so on.
fr: Une distribution système libre ne doit pas aider les utilisateurs à obtenir des informations non-libres pour un usage pratique, ou les encourager à le faire. Il ne doit pas y avoir d'entrepôts de données ou de portages pour des logiciels non-libres. Elle ne devrait pas non plus faire référence à des entrepôts tiers qui ne promettent pas de ne fournir que des logiciels libres&nbsp;; même si ceux-ci ne contiennent aujourd'hui que des logiciels libres, cela peut changer demain. Les programmes du système ne doivent pas suggérer d'installer des greffons non-libres, de la documentation non-libre, etc.

source: A free system distribution should be self-hosting. This means that you must be able to develop and build the system with tools that the system provides you. As a result, a free system distribution cannot include free software that can only be built by using nonfree software.
fr: Une distribution système libre doit être autonome. Cela signifie que vous devez être capable de développer et de compiler le système avec des outils fournis par le système. Par conséquent, une distribution système libre ne peut pas contenir de logiciels libres qui ne peuvent être compilés qu'en utilisant des logiciels non-libres.

source: There's a lot of code in most free system distributions today; the amount of effort it would take to audit it all directly is impractical for most teams. In the past, some nonfree code has accidentally been included in free system distributions. We don't de-list distributions because of this; instead, we only ask that a distribution put forth a good faith effort to avoid including nonfree software, and commit itself to removing such programs if they are discovered later.
fr: Il y a beaucoup de code dans la plupart des distributions système libres aujourd'hui&nbsp;; la somme des efforts que cela prendrait pour les auditer entièrement et directement est impossible pour la plupart des équipes. Par le passé, du code non-libre a été accidentellement inclus dans des distributions système libres. Nous n'avons pas retiré ces distributions à cause de cela&nbsp;; au lieu de cela, nous demandons seulement qu'une distribution fasse de gros efforts pour éviter d'inclure du logiciel non-libre, et s'investisse pour retirer de tels programmes s'ils sont découverts plus tard.

source: Certain kinds of license situations merit special attention for people creating or considering free software distributions; those are discussed in the sections below.
fr: Certaines situations en matière de licences méritent une attention particulière de la part des personnes qui créent ou envisagent de le faire, des distributions système libres&nbsp;; celles-ci sont abordées dans les sections qui suivent.

source: Nonfree Firmware
fr: Microcode non-libre

source: Some applications and drivers require firmware to function, and sometimes that firmware is distributed only in object code form, under a nonfree license. We call these firmware programs &ldquo;blobs.&rdquo; On most GNU/Linux systems, you'll typically find these accompanying some drivers in the kernel Linux. Such firmware should be removed from a free system distribution.
fr: Certaines applications et pilotes nécessitent un microcode (firmware) pour fonctionner, et parfois, ce microcode est distribué seulement sous forme de code objet, sous une licence non-libre. Nous appelons ces programmes de microcode des «&nbsp;blobs&nbsp;». Dans la plupart des systèmes GNU/Linux, vous les trouverez typiquement qui accompagnent des pilotes dans le noyau Linux. De tels microcodes doivent être retirés d'une distribution système libre.

source: Blobs can take many forms. Sometimes, they will be provided in separate files. Other times, they may be incorporated into the source of the driver itself&mdash;for example, it could be encoded as a large array of numbers. But no matter how it's encoded, any nonfree firmware needs to be removed from a free system.
fr: Les blobs peuvent prendre plusieurs formes. Quelquefois, ils seront fournis dans des fichiers séparés. D'autres fois, ils peuvent être incorporés dans le code source du pilote lui-même &mdash; par exemple, ils peuvent être encodés sous la forme d'un grand tableau de nombre. Mais peu importe la façon dont ils sont encodés, tout microcode non-libre doit être retiré d'un système libre.

source: (To be clear, not every array of numbers in a driver is firmware. It's important to understand the purpose of the data before deciding whether or not it's appropriate for a free system.)
fr: (Plus clairement, tout tableau de nombres dans un pilote n'est pas nécessairement un microcode. Il est important de comprendre la destination des données avant de décider si le pilote est approprié ou pas pour un système libre).

source: Brian Brazil, Jeff Moe, and Alexandre Oliva have developed a series of <a class="reference" href="http://www.fsfla.org/svn/fsfla/software/linux-libre/scripts/">scripts to remove nonfree firmware</a> from a stock version of the Linux kernel. You may find them helpful if you would like to develop your own free GNU/Linux distribution&mdash;although we recommend joining development of an existing free distro rather than fragmenting effort by starting a new one. The complete source for a blob-free version of the Linux kernel is also available; you can learn more about this project from the <a class="reference" href="http://directory.fsf.org/project/linux/">Free Software Directory</a>.
fr: Brian Brazil, Jeff Moe et Alexandre Oliva ont développé une série de <a class="reference" href="http://www.fsfla.org/svn/fsfla/software/linux-libre/scripts/">scripts pour supprimer les microcodes non-libres</a> d'une version du noyau Linux. Vous pouvez les trouver utiles si vous souhaitez développer votre propre distribution GNU/Linux libre (bien que nous recommandions de rejoindre le développement d'une distribution existante plutôt que de fragmenter les efforts en en démarrant une nouvelle). Les sources complètes pour une version de Linux sans blob est également disponible&nbsp;; vous pouvez en apprendre plus à ce sujet dans le <a class="reference" href="http://directory.fsf.org/project/linux/">répertoire des logiciels libres</a>.

source: Non-functional Data
fr: Données non-fonctionnelles

source: Trademarks
fr: Marques déposées

source: Trademarks are associated with some software. For example, the name of a program may be trademarked, or its interface may display a trademarked logo. Often, the use of these marks will be controlled in some way; in particular, developers are commonly asked to remove references to the trademark from the software when they modify it.
fr: Des marques déposées sont associées à certains logiciels. Par exemple, le nom d'un programme peut être une marque déposée, ou son interface peut afficher un logo déposé. Souvent, l'utilisation de ces marques sera contrôlée d'une certaine manière&nbsp;; en particulier, il est souvent demandé aux développeurs de retirer les références à la marque déposée du logiciel lorsqu'ils le modifient.

source: In extreme cases, these restrictions may effectively render the program nonfree. It is unfair for someone to ask you to remove a trademark from modified code if that trademark is scattered all throughout the original source. As long as the practical requirements are reasonable, however, free system distributions may include these programs, either with or without the trademarks.
fr: Dans des cas extrêmes, ces restrictions peuvent effectivement rendre le programme non-libre. Il est injuste de demander à quelqu'un de retirer la marque déposée du code modifié si celle-ci est disséminée dans tout le code source original. Tant que les conditions sont raisonnables, cependant, les distributions système libres peuvent inclure ces programmes avec ou sans marques déposées.

source: Similarly, the distribution itself may hold particular trademarks. It is not a problem if modification requires removal of these trademarks, as long as they can readily be removed without losing functionality.
fr: De même, la distribution elle-même peut avoir une marque déposée propre. Ce n'est pas un problème pour ces marques d'être dans la distribution, tant qu'elles peuvent être retirées sans perte de fonctionnalités du système.

source: However, it is unacceptable to use trademarks to restrict verbatim copying and redistribution of the whole distribution, or any part.
fr: Cependant, il est inacceptable d'utiliser les marques déposées pour restreindre la copie intégrale et la redistribution de toute la distribution, ou quelle que partie que ce soit.

source: All the documentation in a free system distribution must be released under an appropriate free license. Additionally, it must take care not to recommend nonfree software.
fr: Toute la documentation dans une distribution système libre doit être publiée sous une licence libre appropriée. De plus, elle doit faire attention à ne pas recommander de logiciels non-libres.

source: In general, something that helps people who already use nonfree software to use the free software better with it is acceptable, but something that encourages users of the free software to install nonfree software is harmful.
fr: En général, quelque chose qui aide les utilisateurs qui utilisent déjà des logiciels non-libres à mieux utiliser le logiciel libre avec celui-ci est acceptable, mais quelque chose qui encourage les utilisateurs de logiciels libres à installer des logiciels non-libres est néfaste.

source: For example, a free system distribution may have documentation for users setting up dual boot systems. It could explain how to access filesystems of the proprietary operating system, import settings from it, and so on. That would be helping people install a free system distribution on a machine which already has proprietary software, which is good.
fr: Par exemple, une distribution système libre peut avoir de la documentation pour les utilisateurs désirant réaliser des systèmes à double démarrage. Elle peut expliquer comment accéder aux systèmes de fichiers d'un système d'exploitation propriétaire, comment importer les paramètres à partir de celui-ci, etc. Ceci aiderait les personnes à installer une distribution système libre sur une machine ayant déjà un logiciel propriétaire, ce qui est bien.

source: What would be unacceptable is for the documentation to give people instructions for installing a nonfree program on the system, or mention conveniences they might gain by doing so.
fr: Ce qui serait inacceptable, ce serait de la documentation indiquant aux utilisateurs comment installer un programme non-libre sur le système ou de mentionner les avantages que cela pourra apporter en le faisant.

source: For a borderline case, a clear and serious exhortation not to use the nonfree program would clearly make it acceptable.
fr: Pour des cas limites, une exhortation claire et sérieuse de ne pas utiliser le programme non-libre, la rendrait clairement acceptable.

source: Patents
fr: Brevets

source: It is effectively impossible for free software developers and distributors to know whether or not a given piece of software infringes any patents: there are too many of them, they vary from country to country, they're often worded so as to make it hard to tell what they do or don't cover, and it isn't easy to tell which ones are valid. Therefore, we don't generally ask free system distributions to exclude software because of possible threats from patents. On the other hand, we also don't object if a distributor chooses to omit some software in order to avoid patent risk.
fr: Il est en fait impossible pour les développeurs de logiciels libres et les distributeurs de savoir si une partie donnée du logiciel enfreint des brevets&nbsp;: il y en a beaucoup trop, ils varient d'un pays à l'autre, et ils sont souvent formulés d'une manière qui obscurcit l'application qui doit en être faite. Par conséquent, nous ne demandons générelement pas à ce que les distributions système libres excluent des logiciels à cause des menaces potentielles de brevets. D'un autre côté, ce n'est pas un problème non plus si un distributeur choisit d'exclure un logiciel pour minimiser les risques de procès contre lui pour violation de brevets.

source: Commitment to Correct Mistakes
fr: Engagement à corriger les erreurs

source: Name Confusion
fr: Confusion de noms

source: Final Notes
fr: Notes

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.

source: Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
fr: Cette page peut-être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:
