Repository: gitGNU/gnu_www-fr
Catalog: home.*.po
Languages: fr

source: The GNU Operating System
fr: Le système d'exploitation GNU

source: Since 1983, developing the free Unix style operating system GNU, so that computer users can have the freedom to share and improve the software they use.
fr: Depuis 1983, d&eacute;veloppement du syst&egrave;me d'exploitation libre de style Unix, GNU, pour que les utilisateurs d'ordinateurs puissent avoir la libert&eacute; de partager et d'am&eacute;liorer les logiciels qu'ils utilisent.

source: What's New
fr: Quoi de neuf&nbsp;?

source: New Free Software
fr: Nouveaux logiciels libres

source: Richard Stallman announced in September 1983 the plan to develop a free software Unix-like operating system called GNU. GNU is the only operating system developed specifically for the sake of users' freedom.
fr: Richard Stallman a annoncé en septembre 1983 le projet de développer un système d'exploitation libre de type Unix appelé GNU. GNU est le seul système d'exploitation développé spécifiquement pour la liberté des utilisateurs.

source: What is GNU?
fr: Qu'est-ce que GNU&nbsp;?

source: The GNU Project was launched in 1984 to develop a complete Unix-like operating system which is <a href="/philosophy/free-sw.html">free software</a>: the GNU system.
fr: Le projet GNU a &eacute;t&eacute; lanc&eacute; en 1984 pour d&eacute;velopper un syst&egrave;me d'exploitation complet de style Unix, qui soit un <a href="/philosophy/free-sw.fr.html">logiciel libre</a>&nbsp;:le syst&egrave;me GNU.

source: GNU's kernel isn't finished, so GNU is used with the kernel Linux. The combination of GNU and Linux is the <b>GNU/Linux operating system</b>, now used by millions.
fr: Le noyau de GNU n'est pas termin&eacute;, donc GNU utilise le noyau Linux. La combinaison de GNU et de Linux est le syst&egrave;me d'exploitation GNU/Linux, maintenant utilis&eacute; par des millions de gens.

source: Sometimes this combination is incorrectly called <a href="/gnu/linux-and-gnu.html">Linux</a>. There are many variants or &ldquo;distributions&rdquo; of GNU/Linux.
fr: Parfois cette combinaison est appelée à tort <a href="/gnu/linux-and-gnu.fr.html">Linux</a>. Il existe beaucoup de variantes ou «&nbsp;distributions&nbsp;» de GNU/Linux.

source: <span class="highlight">We recommend the <a href="/links/links.html#FreeGNULinuxDistributions">GNU/Linux distributions</a> that are 100% free software; in other words, entirely freedom-respecting</span>.
fr: <span class="highlight">Nous recommandons d'utiliser les <a href="/links/links.fr.html#FreeGNULinuxDistributions">distributions GNU/Linux</a> qui sont 100% libres&nbsp;; en d'autres termes, qui respectent totalement la libert&eacute;</span>.

source: The name &ldquo;GNU&rdquo; is a recursive acronym for &ldquo;GNU's Not Unix&rdquo;; it is pronounced <em>g-noo</em>, as one syllable with no vowel sound between the <em>g</em> and the <em>n</em>.
fr: Le nom &laquo;&nbsp;GNU&nbsp;&raquo; est un acronyme r&eacute;cursif pour &laquo;&nbsp;GNU's Not Unix&nbsp;&raquo; (NdT&nbsp;: GNU n'est pas Unix)&nbsp;; il se prononce <em>gnou</em>.

source: What is Free Software?
fr: Qu'est-ce qu'un logiciel libre&nbsp;?

source: &ldquo;<a href="/philosophy/free-sw.html">Free software</a>&rdquo; is a matter of liberty, not price. To understand the concept, you should think of &ldquo;free&rdquo; as in &ldquo;free speech&rdquo;, not as in &ldquo;free beer&rdquo;.
fr: Un &laquo;&nbsp;<a href="/philosophy/free-sw.fr.html">logiciel libre</a>&nbsp;&raquo; se r&eacute;f&egrave;re &agrave; la libert&eacute;, pas au prix. Pour comprendre le concept, vous devez pensez &agrave; &laquo;&nbsp;libre&nbsp;&raquo; comme dans &laquo;&nbsp;libert&eacute; d'expression&nbsp;&raquo;, pas comme dans &laquo;&nbsp;bi&egrave;re gratuite&nbsp;&raquo;. (NdT&nbsp;: en anglais, le mot &laquo;&nbsp;free&nbsp;&raquo; veut dire libre, mais aussi gratuit, d'o&ugrave; la confusion possible).

source: Free software is a matter of the users' <span class="highlight">freedom to run, copy, distribute, study, change and improve</span> the software. More precisely, it refers to four kinds of freedom, for the users of the software:
fr: Les logiciels libres donnent aux utilisateurs <span class="highlight">la libert&eacute; d'ex&eacute;cuter, de copier, de distribuer, d'&eacute;tudier, de modifier et d'am&eacute;liorer</span> les logiciels. Plus pr&eacute;cis&eacute;ment, cela se r&eacute;f&egrave;re &agrave; quatre types de libert&eacute; pour les utilisateurs de logiciels&nbsp;:

source: The freedom to run the program, for any purpose (freedom 0).
fr: La libert&eacute; d'ex&eacute;cuter le programme, pour n'importe quel usage (libert&eacute; 0).

source: The freedom to study how the program works, and adapt it to your needs (freedom 1). Access to the source code is a precondition for this.
fr: La libert&eacute; d'&eacute;tudier le fonctionnement du programme et de l'adapter &agrave; vos besoins (libert&eacute; 1). Acc&eacute;der au code source est une condition pour cela.

source: The freedom to redistribute copies so you can help your neighbor (freedom 2).
fr: La libert&eacute; de redistribuer des copies pour aider votre prochain (libert&eacute; 2).

source: The freedom to improve the program, and release your improvements to the public, so that the whole community benefits (freedom 3). Access to the source code is a precondition for this.
fr: La libert&eacute; d'am&eacute;liorer le programme et de rendre publiques vos am&eacute;liorations pour que toute la communaut&eacute; en b&eacute;n&eacute;ficie (libert&eacute; 3). Acc&eacute;der au code source est une condition pour cela.

source: What is the Free Software Foundation?
fr: Qu'est-ce que la Fondation pour le logiciel libre&nbsp;?

source: The <a href="http://www.fsf.org">Free Software Foundation</a> (<abbr title="Free Software Foundation">FSF</abbr>) is the principal organizational sponsor of the GNU Project. The <abbr>FSF</abbr> receives very little funding from corporations or grant-making foundations but relies on support from individuals like you.
fr: La <a href="http://www.fsf.org">Free Software Foundation</a> (<abbr title="Free Software Foundation">FSF</abbr>) est la principale organisation qui soutient le Projet GNU. La <abbr>FSF</abbr> re&ccedil;oit tr&egrave;s peu de financement ou de donations de la part des corporations, mais compte sur le soutien de particuliers tels que vous.

source: Please consider helping the <abbr>FSF</abbr> by <a href="http://member.fsf.org/">becoming an associate member</a>, <a href="http://order.fsf.org/">buying manuals and gear</a> or by <a href="http://donate.fsf.org/">donating money</a>. If you use Free Software in your business, you can also consider <a href="http://patron.fsf.org/">corporate patronage</a> or <a href="http://www.gnu.org/order/">a deluxe distribution of GNU software</a> as a way to support the <abbr>FSF</abbr>.
fr: Veuillez consid&eacute;rer d'aider la <abbr>FSF</abbr> en <a href="http://member.fsf.org/">devenant un membre associ&eacute;</a>, en <a href="http://order.fsf.org/">achetant des manuels et des accessoires</a> ou en <a href="http://donate.fsf.org/">donnant de l'argent</a>. Si vous utilisez des logiciels libres pour votre travail, vous pouvez aussi consid&eacute;rer de <a href="http://patron.fsf.org/">faire un don par votre soci&eacute;t&eacute;</a> ou <a href="http://www.gnu.org/order/">une distribution deluxe des logiciels GNU</a> pour soutenir la <abbr>FSF</abbr>.

source: The GNU project supports the mission of the <abbr>FSF</abbr> to preserve, protect and promote the freedom to use, study, copy, modify, and redistribute computer software, and to defend the rights of Free Software users. We support the <a href="/philosophy/basic-freedoms.html">freedoms of speech, press, and association</a> on the Internet, <a href="http://www.eff.org/privnow/">the right to use encryption software for private communication</a>, and the <a href="/philosophy/protecting.html">right to write software</a> unimpeded by private monopolies. You can also learn more about these issues in the book <a href="/doc/book13.html">Free Software, Free Society</a>.
fr: Le Projet GNU soutient la mission de la <abbr>FSF</abbr> de pr&eacute;servation, de protection et de promotion de la libert&eacute; d'utiliser, d'&eacute;tudier, de copier, de modifier et de redistribuer des logiciels, et de d&eacute;fense des droits des utilisateurs de logiciels libres. Nous soutenons les <a href="/philosophy/basic-freedoms.fr.html">libert&eacute;s d'expression, de la presse et d'association</a> sur Internet, <a href="http://www.eff.org/privnow/">le droit d'utiliser des logiciels de chiffrement pour les communications priv&eacute;es</a>, and the <a href="/philosophy/protecting.fr.html">le droit d'&eacute;crire des logiciels</a>sans entraves des monopoles priv&eacute;s. Vous pouvez en apprendre plus sur ces probl&egrave;mes dans le livre <a href="/doc/book13.fr.html">Free Software, Free Society</a> (NdT&nbsp;: Logiciels libres, soci&eacute;t&eacute; libre).

source: The FSF also has sister organizations in <a href="http://www.fsfeurope.org">Europe</a>, <a href="http://www.fsfla.org/">Latin America</a> and <a href="http://fsf.org.in/">India</a>.
fr: La FSF a aussi des organisations s&oelig;urs en <a href="http://www.fsfeurope.org">Europe</a>,en <a href="http://www.fsfla.org/">Am&eacute;rique latine</a> et en <a href="http://fsf.org.in/">Inde</a>.

source: <a href="/fry/happy-birthday-to-gnu.html">
fr: <a href="/fry/happy-birthday-to-gnu.fr.html">

source: Mr. Stephen Fry <a href="/fry/">introduces you to free software</a>, and reminds you of a very special birthday.
fr: M. Stephen Fry <a href="/fry/happy-birthday-to-gnu.fr.html">vous présente les logiciels libres</a> et vous rappelle un anniversaire très spécial.

source: GNUs Flashes
fr: Infos GNU

source: For other news, as well as for items that used to be in this GNUs Flashes section, see <a href="/server/whatsnew.html">What's New</a> in and about the GNU Project.
fr: Pour d'autres nouvelles, comme pour les &eacute;l&eacute;ments utilis&eacute;s dans cette section infos GNU, consultez <a href="/server/whatsnew.fr.html">Quoi de neuf</a> sur le Projet GNU.

source: Take Action
fr: Agir

source: <strong>Take action:</strong> <a href="http://www.odfolympiad.org/">Support ODF Olympiad</a> and their efforts to bring OpenDocument to schools.
fr: <strong>Agir&nbsp;:</strong> <a href="http://www.odfolympiad.org/">Soutenez ODF Olympiad</a> et leurs efforts pour apporter OpenDocument dans les écoles.

source: <strong>License drafting:</strong> <a href="/server/takeaction.html#licenses">Participate</a> in the drafting of the GFDL and GSFDL.
fr: <strong>R&eacute;daction de licence&nbsp;:</strong> <a href="/server/takeaction.fr.html#licenses">Participez</a> &agrave; la r&eacute;daction de la GFDL et de la GSFDL.

source: <a href="/server/takeaction.html#directory">Add to the Free Software Directory</a>.
fr: <a href="/server/takeaction.fr.html#directory">Ajoutez des logiciels au R&eacute;pertoire des logiciels libres</a>.

source: <strong>High priority projects:</strong> <a href="http://www.fsf.org/campaigns/priority.html">Contribute</a> to these free software projects we are emphasizing: <br /><a href="http://www.fsf.org/campaigns/priority.html#gnash"> Gnash (GNU Flash Player)</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#coreboot"> Coreboot (campaign for a free BIOS)</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#skypereplacement"> free replacement for skype</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#videoediting"> video editing</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#gereplacment"> free replacement for Google Earth</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#gnewsense"> gNewSense (the all free software GNU/Linux system)</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#gnuoctave"> GNU Octave (free software Matlab replacement)</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#opendwgreplacement"> free replacement for OpenDWG libraries</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#reversegdb"> reversible debugging in GDB</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#mesh"> free software drivers for mesh routers</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#oracle">free replacement for Oracle Forms</a>.
fr: <strong>Projets hautement prioritaires&nbsp;:</strong> <a href="http://www.fsf.org/campaigns/priority.html">Contribuez</a> à ces projets de logiciels libres que nous mettons en avant&nbsp;: <br /><a href="http://www.fsf.org/campaigns/priority.html#gnash"> Gnash (lecteur Flash GNU)</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#coreboot"> Coreboot (campagne pour un BIOS libre)</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#skypereplacement"> alternative libre pour skype</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#videoediting"> édition vidéo</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#gereplacment"> alternative libre pour Google Earth</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#gnewsense"> gNewSense (le système GNU/Linux entièrement libre)</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#gnuoctave"> GNU Octave (alternative libre à Matlab)</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#opendwgreplacement"> alternative libre aux bibliothèques OpenDWG</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#reversegdb"> débogage réversible dans GDB</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#mesh"> pilotes libres pour les routeurs mesh</a>, <br /><a href="http://www.fsf.org/campaigns/priority.html#oracle">alternative libre pour les Formulaires Oracle</a>.

source: <strong>US citizens:</strong> <a href="/server/takeaction.html#music-sharing"> Sign EFF's petition</a> in favor of music sharing.
fr: <strong>Citoyens am&eacute;ricains&nbsp;:</strong><a href="/server/takeaction.fr.html#music-sharing"> Signez la p&eacute;tition EFF</a> en faveur du partage de la musique.

source: <strong>US citizens:</strong> <a href="/server/takeaction.html#broadcast">Support Public Knowledge against the "broadcast flag"</a>
fr: <strong>Citoyens am&eacute;ricains&nbsp;:</strong> <a href="/server/takeaction.fr.html#broadcast">Soutenez Public Knowledge contre le &laquo;&nbsp;broadcast flag&nbsp;&raquo;</a>

source: <strong>Worldwide:</strong> <a href="/server/takeaction.html#wipochange">Call on WIPO to change its name and mission</a>.
fr: <strong>Niveau mondial&nbsp;:</strong> <a href="/server/takeaction.fr.html#wipochange">Appelez au changement du nom et des missions de l'<acronym title="Organisation mondiale de la propri&eacute;t&eacute; intellectuelle">OMPI</acronym></a>.

source: <strong>Worldwide:</strong> <a href="/server/takeaction.html#wipo">Raise awareness of dangers of WIPO Broadcast Treaty</a>.
fr: <strong>Niveau mondial&nbsp;:</strong> <a href="/server/takeaction.fr.html#wipo">Sensibilisez aux dangers du trait&eacute; sur la radiodiffusion de l'OMPI</a>.

source: <strong>Fight against software patents:</strong> <a href="http://www.endsoftpatents.org">in the USA</a>, <a href="/server/takeaction.html#swpat">in Europe</a>.
fr: <strong>Combattez les brevets logicielsEn Europe&nbsp;:</strong> <a href="http://www.endsoftpatents.org">aux USA</a>, <a href="/server/takeaction.fr.html#swpat">en Europe</a>.

source: <strong>US citizens:</strong> <a href="/server/takeaction.html#antidmca">Sign petitions against software patents and the DMCA</a>.
fr: <strong>Citoyens am&eacute;ricains&nbsp;:</strong> <a href="/server/takeaction.fr.html#antidmca">Signez les p&eacute;titions contre les brevets logiciels et le <acronym title="Digital Millenium Copyright Act">DMCA</acronym> (NdT&nbsp;: Loi sur le copyright du mill&eacute;naire num&eacute;rique)</a>.

source: <strong>Long-term contribution:</strong> <a href="/server/takeaction.html#unmaint">Take over an unmaintained GNU package:</a> <a href="/software/dbmanual/">dbmanual</a>, <a href="/software/dotgnu-forum/">dotgnu-forum</a>, <a href="/software/ffp/">ffp</a>, <a href="/software/gnuprologjava/">gnuprologjava</a>, <a href="/software/gnutrition/">gnutrition</a>, <a href="/software/gtkeyboard/">gtkeyboard</a>, <a href="/software/oleo/">oleo</a>, <a href="/software/speedx/">speedx</a>, <a href="/software/vmslib/">vmslib</a>, <a href="/software/xmorph/">xmorph</a>.
fr: <strong>Contribution &agrave; long terme&nbsp;:</strong> <a href="/server/takeaction.fr.html#unmaint">Prenez la maintenance d'un paquetage GNU&nbsp;:</a> <a href="/software/dbmanual/">dbmanual</a>, <a href="/software/dotgnu-forum/">dotgnu-forum</a> <a href="/software/ffp/">ffp</a>, <a href="/software/gnuprologjava/">gnuprologjava</a>, <a href="/software/gnutrition/">gnutrition</a>, <a href="/software/gtkeyboard/">gtkeyboard</a>, <a href="/software/oleo/">oleo</a>, <a href="/software/speedx/">speedx</a>, <a href="/software/vmslib/">vmslib</a>, <a href="/software/xmorph/">xmorph</a>.

source: <strong>Long-term contribution:</strong> <a href="/server/takeaction.html#libcdio">Contribute</a> to CD/DVD-recording software development and more in <a href="/software/libcdio/index.html#volunteerswanted">GNU libcdio</a>.
fr: <strong>Contribution &agrave; long terme&nbsp;:</strong> <a href="/server/takeaction.fr.html#libcdio">Contribuez</a> au développement du logiciel d'enregistrement de CD et DVD et plus sur <a href="/software/libcdio/index.html#volunteerswanted">GNU libcdio</a>.

source: <strong>Long-term contribution:</strong> <a href="/server/takeaction.html#gnustep">Contribute</a> as a user and developer to <a href="http://www.gnustep.org">GNUstep</a>, a free object-oriented framework for application development.
fr: <strong>Contribution &agrave; long terme&nbsp;:</strong> <a href="/server/takeaction.fr.html#gnustep">Contribuez</a> en tant qu'utilisateur et d&eacute;veloppeur &agrave; <a href="http://www.gnustep.org">GNUstep</a>, un framework libre orient&eacute; objet pour le d&eacute;veloppement d'application.

source: <strong>Long-term contribution:</strong> Help us translate the gnu.org essays into your native <a href="/server/standards/translations/priorities.html#Languages"> language</a> or <a href="/server/standards/translations/priorities.html#Orphaned"> become a coordinator</a> of a www.gnu.org translation team.
fr: <strong>Contribution &agrave; long terme&nbsp;:</strong> Aidez-nous &agrave; traduire les essais de gnu.org dans votre <a href="/server/standards/translations/priorities.html#Languages">langue</a> ou <a href="/server/standards/translations/priorities.html#Orphaned"> devenez coordinateur</a> d'une &eacute;quipe de traduction de www.gnu.org.

source: <a href="/server/takeaction.html#other">Other Action Items</a>
fr: <a href="/server/takeaction.fr.html#other">Autres actions</a>

source: <a href="http://audio-video.gnu.org/">GNU Audio/Video</a>
fr: <a href="http://audio-video.gnu.org/">GNU&nbsp;Audio/Vidéo</a>

source: <a href="/licenses/gpl.html">GNU GPL</a>
fr: <a href="/licenses/gpl.html">GPL&nbsp;GNU</a>

source: <a href="/licenses/lgpl.html">GNU LGPL</a>
fr: <a href="/licenses/lgpl.html">LGPL&nbsp;GNU</a>

source: <a href="/licenses/gfdl.html">GNU GFDL</a>
fr: <a href="/licenses/gfdl.html">GFDL&nbsp;GNU</a>

source: <a href="/licenses/agpl.html">GNU AGPL</a>
fr: <a href="/licenses/agpl.html">AGPL&nbsp;GNU</a>

source: <a href="/licenses/license-list.html">Free Software Licenses</a>
fr: <a href="/licenses/license-list.fr.html">Licences&nbsp;de&nbsp;logiciels&nbsp;libres</a>

source: <a href="http://directory.fsf.org/GNU/">GNU Packages</a>
fr: <a href="http://directory.fsf.org/GNU/">Paquetages&nbsp;GNU</a>

source: <a href="/manual/manual.html">GNU Manuals</a>
fr: <a href="/manual/manual.html">Manuels&nbsp;GNU</a>

source: <a href="http://lists.gnu.org/">GNU Mailing Lists</a>
fr: <a href="http://lists.gnu.org/">Listes&nbsp;de&nbsp;diffusion&nbsp;GNU</a>

source: <a href="http://ftp.gnu.org/">GNU FTP Site</a>
fr: <a href="http://ftp.gnu.org/">Site&nbsp;FTP&nbsp;de&nbsp;GNU</a>

source: <a href="/prep/ftp.html">GNU FTP Mirror List</a>
fr: <a href="/prep/ftp.html">Liste&nbsp;des&nbsp;miroirs&nbsp;FTP&nbsp;de&nbsp;GNU</a>

source: <a href="http://www.fsf.org/resources/service/">GNU Service Directory</a>
fr: <a href="http://www.fsf.org/resources/service/">Annuaire&nbsp;des&nbsp;services&nbsp;GNU</a>

source: <a href="/links/links.html#FreeGNULinuxDistributions">Free GNU/Linux Distros</a>
fr: <a href="/links/links.html#FreeGNULinuxDistributions">Distros&nbsp;Free&nbsp;GNU/Linux&nbsp;libres</a>

source: <a href="/gnu/gnu-user-groups.html">GNU User Groups</a>
fr: <a href="/gnu/gnu-user-groups.html">Groupes&nbsp;d'utilisateurs&nbsp;GNU</a>

source: <a href="http://savannah.gnu.org/people/?type_id=1">GNU Help Wanted</a>
fr: <a href="http://savannah.gnu.org/people/?type_id=1">Aide&nbsp;demandée&nbsp;pour&nbsp;GNU</a>

source: <a href="/server/standards/">GNU Web Standards</a>
fr: <a href="/server/standards/">Standards&nbsp;Web&nbsp;GNU</a>

source: <a href="/server/">GNU Server Guidelines</a>
fr: <a href="/server/">Guides&nbsp;serveur&nbsp;GNU</a>

source: <a href="/prep/standards/">GNU Coding Standards</a>
fr: <a href="/prep/standards/">Standards&nbsp;de&nbsp;codage&nbsp;GNU</a>

source: <a href="/prep/maintain/">GNU Maintainers' Information</a>
fr: <a href="/prep/maintain/">Informations&nbsp;du&nbsp;mainteneur&nbsp;GNU</a>

source: <a href="/people/">GNU's Who</a>
fr: <a href="/people/">Who's&nbsp;Who&nbsp;de&nbsp;GNU</a>

source: <a href="/thankgnus/thankgnus.html">ThankGNUs</a>
fr: <a href="/thankgnus/thankgnus.html">Merci&nbsp;aux&nbsp;GNU</a>

source: <a href="/graphics/graphics.html">GNU Art</a>
fr: <a href="/graphics/graphics.html">Art&nbsp;GNU</a>

source: <a href="/fun/fun.html">GNU Fun</a>
fr: <a href="/fun/fun.html">Humour&nbsp;GNU</a>

source: More information
fr: D'autres informations

source: <a href="/provide.html">What we provide</a>
fr: <a href="/provide.fr.html">Ce que nous proposons</a>

source: <a href="/philosophy/philosophy.html">Why we exist</a>
fr: <a href="/philosophy/philosophy.fr.html">Pourquoi nous existons</a>

source: <a href="/gnu/gnu-history.html">Where we are going</a>
fr: <a href="/gnu/gnu-history.fr.html">O&ugrave; nous allons</a>

source: <a href="/help/help.html">How you can help us get there</a>
fr: <a href="/help/help.fr.html">Comment vous pouvez nous aider &agrave; y arriver</a>

source: <a href="/people/people.html">Who we are</a>
fr: <a href="/people/people.html">Qui nous sommes</a>

source: <a href="/testimonials/testimonials.html">What users think of GNU software</a>
fr: <a href="/testimonials/testimonials.html">Ce que les utilisateurs pensent des logiciels GNU</a>

source: <a href="http://savannah.gnu.org/">Our project hosting server, savannah.gnu.org</a>
fr: <a href="http://savannah.gnu.org/">Notre serveur d'h&eacute;bergement de projets, savannah.gnu.org</a>

source: <a href="http://lists.gnu.org/">GNU mailing lists</a>
fr: <a href="http://lists.gnu.org/">Listes de diffusion GNU</a>

source: Other areas of the GNU web site: <a href="/manual/manual.html">Software documentation</a>, <a href="/graphics/graphics.html">Graphics and art</a>, <a href="/fun/fun.html">Fun</a>, <a href="/thankgnus/thankgnus.html">ThankGNUs</a>.
fr: Autres domaines du site Web de GNU&nbsp;: <a href="/manual/manual.html">documentation de logiciels</a>, <a href="/graphics/graphics.fr.html">Art et dessins</a>, <a href="/fun/fun.html">Humour</a>, <a href="/thankgnus/thankgnus.html">Merci aux GNU</a>.

source: <a href="#skipgnulist">Skip list of GNU software</a>
fr: <a href="#skipgnulist">Passer&nbsp;la&nbsp;liste&nbsp;des&nbsp;logiciels&nbsp;GNU</a>

source: GNU software
fr: Logiciels&nbsp;GNU
