Repository: gitGNU/gnu_www-fr
Catalog: home.*.po
Languages: fr

source: <a href="/software/which/">Which</a> &mdash; <em class="netscape4">Prints out full path of execuatbles</em>
fr: <a href="/software/which/">Which</a> &mdash; <em class="netscape4">Affichage du chemin complet des exécutables</em>

source: <a href="/software/windowmaker/">Window Maker</a> &mdash; <em class="netscape4">Window manager for X Window System</em>
fr: <a href="/software/windowmaker/">Window Maker</a> &mdash; <em class="netscape4">Gestionnaire de fenêtres pour X Window System</em>

source: <a href="/software/xboard/">Xboard</a> &mdash; <em class="netscape4">Graphical chessboard</em>
fr: <a href="/software/xboard/">Xboard</a> &mdash; <em class="netscape4">Échiquier graphique</em>

source: <a href="/software/xhippo/">Xhippo</a> &mdash; <em class="netscape4">Playlist manager</em>
fr: <a href="/software/xhippo/">Xhippo</a> &mdash; <em class="netscape4">Gestionnaire de listes de lecture</em>

source: <a href="/software/xmorph/">Xmorph</a> &mdash; <em class="netscape4">Image morphing program</em>
fr: <a href="/software/xmorph/">Xmorph</a> &mdash; <em class="netscape4">Programme de transformation d'images</em>

source: <a href="/software/zebra/">Zebra</a> &mdash; <em class="netscape4">Implementation of routing protocols</em>
fr: <a href="/software/zebra/">Zebra</a> &mdash; <em class="netscape4">Mise en œuvre de protocoles de routage</em>

source: <a href="/software/a2ps/">a2ps</a> &mdash; <em class="netscape4">Any to PostScript filter</em>
fr: <a href="/software/a2ps/">a2ps</a> &mdash; <em class="netscape4">Filtre PostScript</em>

source: <a href="/software/acct/">acct</a> &mdash; <em class="netscape4">GNU system accounting utilities</em>
fr: <a href="/software/acct/">acct</a> &mdash; <em class="netscape4">Utilitaire de gestion de compte système GNU</em>

source: <a href="/software/adns/">adns</a> &mdash; <em class="netscape4">Resolver library for C and C++ programs</em>
fr: <a href="/software/adns/">adns</a> &mdash; <em class="netscape4">Bibliothèque de résolution pour les programmes C et C++</em>

source: <a href="/software/aetherspace/">aetherspace</a> &mdash; <em class="netscape4">Software to produce alternative energy systems</em>
fr: <a href="/software/aetherspace/">aetherspace</a> &mdash; <em class="netscape4">Logiciel pour la production de système d'énergie alternatifs</em>

source: <a href="/software/aroundme/">aroundme</a> &mdash; <em class="netscape4">Social networking and team interaction software</em>
fr: <a href="/software/aroundme/">aroundme</a> &mdash; <em class="netscape4">Logiciel de réseau social et d'interaction d'équipe</em>

source: <a href="/software/auctex/">auctex</a> &mdash; <em class="netscape4">Integrated environment for editing LaTeX and TeX files</em>
fr: <a href="/software/auctex/">auctex</a> &mdash; <em class="netscape4">Environnement intégré pour l'édition de fichiers LaTeX et TeX</em>

source: <a href="/software/avl/">avl</a> &mdash; <em class="netscape4">Library for balanced binary trees</em>
fr: <a href="/software/avl/">avl</a> &mdash; <em class="netscape4">Bibliothèque pour les arbres binaires balancés</em>

source: <a href="/software/beacon/">beacon</a> &mdash; <em class="netscape4">Simple date and category-driven Web publishing system</em>
fr: <a href="/software/beacon/">beacon</a> &mdash; <em class="netscape4">Système de publication Web simple basé sur les dates et les catégories</em>

source: <a href="/software/bool/">bool</a> &mdash; <em class="netscape4">Utility for matching boolean queries in text</em>
fr: <a href="/software/bool/">bool</a> &mdash; <em class="netscape4">Utilitaire pour la correspondance de requêtes booléenne sur du texte</em>

source: <a href="/software/ccaudio/">ccaudio</a> &mdash; <em class="netscape4">Library and software for manipulating audio data</em>
fr: <a href="/software/ccaudio/">ccaudio</a> &mdash; <em class="netscape4">Bibliothèque et logiciel de manipulation de données audio</em>

source: <a href="/software/ccrtp/">ccrtp</a> &mdash; <em class="netscape4">RTP stack</em>
fr: <a href="/software/ccrtp/">ccrtp</a> &mdash; <em class="netscape4">Pile RTP</em>

source: <a href="/software/ccscript/">ccscript</a> &mdash; <em class="netscape4">C++ class framework for creating a virtual machine execution system</em>
fr: <a href="/software/ccscript/">ccscript</a> &mdash; <em class="netscape4">Environnement de classes C++ pour la création d'un système d'exécution de machine virtuelle</em>

source: <a href="/software/cflow/">cflow</a> &mdash; <em class="netscape4">Charts control flow within source code</em>
fr: <a href="/software/cflow/">cflow</a> &mdash; <em class="netscape4">Flux de contrôle de graphes dans le code source</em>

source: <a href="/software/cgicc/">cgicc</a> &mdash; <em class="netscape4">C++ class library for writing CGI applications</em>
fr: <a href="/software/cgicc/">cgicc</a> &mdash; <em class="netscape4">Bibliothèque de classes C++ pour l'écriture d'applications CGI</em>

source: <a href="/software/cim/">cim </a> &mdash; <em class="netscape4">Compiler for the programming language Simula</em>
fr: <a href="/software/cim/">cim </a> &mdash; <em class="netscape4">Compilateur pour le langage de développement Simula</em>

source: <a href="/software/classpath/">classpath</a> &mdash; <em class="netscape4">Free core class libraries for the Java programming language</em>
fr: <a href="/software/classpath/">classpath</a> &mdash; <em class="netscape4">Bibliothèque de classes de base libre pour le langage de programmation Java</em>

source: <a href="/software/clisp/">clisp</a> &mdash; <em class="netscape4">ANSI Common Lisp compiler, debugger, and interpreter</em>
fr: <a href="/software/clisp/">clisp</a> &mdash; <em class="netscape4">Compilateur, débogueur et interpréteur ANSI Common Lisp</em>

source: <a href="/software/combine/">combine</a> &mdash; <em class="netscape4">Extensible file matching and filtering</em>
fr: <a href="/software/combine/">combine</a> &mdash; <em class="netscape4">Filtrage et correspondance de fichiers extensible</em>

source: <a href="/software/cons/">cons</a> &mdash; <em class="netscape4">&#39;Make&#39; replacement</em>
fr: <a href="/software/cons/">cons</a> &mdash; <em class="netscape4">Alternative à &#39;Make&#39;</em>

source: <a href="/software/coreutils/">coreutils</a> &mdash; <em class="netscape4">Collection of basic file, shell and text manipulation utilities</em>
fr: <a href="/software/coreutils/">coreutils</a> &mdash; <em class="netscape4">Ensemble d'utilitaires de base pour la manipulation de shell, de texte et de fichier</em>

source: <a href="/software/cssc/">cssc</a> &mdash; <em class="netscape4">Free clone of SCCS</em>
fr: <a href="/software/cssc/">cssc</a> &mdash; <em class="netscape4">Clone libre de SCCS</em>

source: <a href="/software/dap/">dap</a> &mdash; <em class="netscape4">Statistics and graphics package</em>
fr: <a href="/software/dap/">dap</a> &mdash; <em class="netscape4">Paquetage pour les statistiques et les graphiques</em>

source: <a href="/software/ddd/">ddd</a> &mdash; <em class="netscape4">Graphical front end for command line debuggers</em>
fr: <a href="/software/ddd/">ddd</a> &mdash; <em class="netscape4">Interface graphique pour les débogueur en ligne de commande</em>

source: <a href="/software/ddrescue/">ddrescue</a> &mdash; <em class="netscape4">Data recovery tool</em>
fr: <a href="/software/ddrescue/">ddrescue</a> &mdash; <em class="netscape4">Outil de récupération de données</em>

source: <a href="/software/dejagnu/">dejaGnu</a> &mdash; <em class="netscape4">Framework to test programs</em>
fr: <a href="/software/dejagnu/">dejaGnu</a> &mdash; <em class="netscape4">Environnement pour tester les programmes</em>

source: <a href="/software/diction/">diction</a> &mdash; <em class="netscape4">Checks text for readability and bad usage</em>
fr: <a href="/software/diction/">diction</a> &mdash; <em class="netscape4">Vérification de texte pour la lisibilité et le mauvais usage</em>

source: <a href="/software/drgeo/">dr. geo</a> &mdash; <em class="netscape4">Builds geometric figures</em>
fr: <a href="/software/drgeo/">dr. geo</a> &mdash; <em class="netscape4">Construction de figures géométriques</em>

source: <a href="/software/emms/">emms</a> &mdash; <em class="netscape4">Emacs multimedia system</em>
fr: <a href="/software/emms/">emms</a> &mdash; <em class="netscape4">Système multimédia Emacs</em>

source: <a href="/software/enscript/">enscript </a> &mdash; <em class="netscape4">Converts ASCII files to PostScript</em>
fr: <a href="/software/enscript/">enscript </a> &mdash; <em class="netscape4">Conversion de fichiers ASCII en PostScript</em>

source: <a href="/software/ferret/">ferret</a> &mdash; <em class="netscape4">GNU data modeller</em>
fr: <a href="/software/ferret/">ferret</a> &mdash; <em class="netscape4">Modélisateur de données GNU</em>

source: <a href="/software/fhp/">fhp</a> &mdash; <em class="netscape4">m4 macro for creating Web pages</em>
fr: <a href="/software/fhp/">fhp</a> &mdash; <em class="netscape4">Macro m4 pour la création de pages Web</em>

source: <a href="/software/fontutils/">fontutils </a> &mdash; <em class="netscape4">Converts between font formats and creates fonts</em>
fr: <a href="/software/fontutils/">fontutils </a> &mdash; <em class="netscape4">Conversion de formats de polices et création de polices</em>

source: <a href="/software/freeipmi/">freeipmi</a> &mdash; <em class="netscape4">Intelligent platform management system</em>
fr: <a href="/software/freeipmi/">freeipmi</a> &mdash; <em class="netscape4">Système de gestion de plateforme intelligent</em>

source: <a href="/software/fribidi/">fribidi</a> &mdash; <em class="netscape4">Free implementation of the Unicode Bidirectional (BiDi) Algorithm</em>
fr: <a href="/software/fribidi/">fribidi</a> &mdash; <em class="netscape4">Mise en œuvre libre de l'algorithme bidirectionnel Unicode (BiDi)</em>

source: <a href="/software/gpp/">g++</a> &mdash; <em class="netscape4">C++ compiler</em>
fr: <a href="/software/gpp/">g++</a> &mdash; <em class="netscape4">Compilateur C++</em>

source: <a href="/software/gama/">gama</a> &mdash; <em class="netscape4">Geodetic network adjustment program</em>
fr: <a href="/software/gama/">gama</a> &mdash; <em class="netscape4">Programme d'ajustement de réseau géodétique</em>

source: <a href="/software/gawk/">gawk</a> &mdash; <em class="netscape4">String manipulation language</em>
fr: <a href="/software/gawk/">gawk</a> &mdash; <em class="netscape4">Langage de manipulation de chaînes</em>

source: <a href="/software/gcjwebplugin/">gcjwebplugin</a> &mdash; <em class="netscape4">Browser plugin that executes Java applets</em>
fr: <a href="/software/gcjwebplugin/">gcjwebplugin</a> &mdash; <em class="netscape4">Plugin de navigateur exécutant les applets Java</em>

source: <a href="/software/gengen/">gengen</a> &mdash; <em class="netscape4">A parameterized-text-generator generator based on a template</em>
fr: <a href="/software/gengen/">gengen</a> &mdash; <em class="netscape4">Un générateur de texte paramétrable basé sur un modèle</em>

source: <a href="/software/gforth/">gforth</a> &mdash; <em class="netscape4">Free implementation of the ANS Forth language</em>
fr: <a href="/software/gforth/">gforth</a> &mdash; <em class="netscape4">Mise en œuvre libre du langage ANS</em>

source: <a href="/software/gfortran/">gfortran</a> &mdash; <em class="netscape4">Fortran compiler</em>
fr: <a href="/software/gfortran/">gfortran</a> &mdash; <em class="netscape4">Compilateur Fortran</em>

source: <a href="/software/gleem/">gleem</a> &mdash; <em class="netscape4">Library of 3D widgets</em>
fr: <a href="/software/gleem/">gleem</a> &mdash; <em class="netscape4">Bibliothèque de widgets 3D</em>

source: <a href="/software/gmp/">gmp</a> &mdash; <em class="netscape4">The GNU Multiple Precision Arithmetic Library</em>
fr: <a href="/software/gmp/">gmp</a> &mdash; <em class="netscape4">Bibliothèque arithmétique de précision multiple GNU</em>

source: <a href="/software/gnotary/">gnotary</a> &mdash; <em class="netscape4">Project to produce a digital notary service</em>
fr: <a href="/software/gnotary/">gnotary</a> &mdash; <em class="netscape4">Projet pour la production d'un service notarial numérique</em>

source: <a href="/software/gnu-arch/">gnu-arch</a> &mdash; <em class="netscape4">Revision control system</em>
fr: <a href="/software/gnu-arch/">gnu-arch</a> &mdash; <em class="netscape4">Système de contrôle de révision</em>

source: <a href="/software/gnu-crypto/">gnu-crypto</a> &mdash; <em class="netscape4">Project to produce a full set of Java cryptographic tools</em>
fr: <a href="/software/gnu-crypto/">gnu-crypto</a> &mdash; <em class="netscape4">Projet pour la production d'un ensemble complet d'outils cryptographiques Java</em>

source: <a href="/software/gnubg/">gnubg</a> &mdash; <em class="netscape4">Plays and analyzes backgammon games and matches</em>
fr: <a href="/software/gnubg/">gnubg</a> &mdash; <em class="netscape4">Jeu et analyse de jeu de backgammon</em>

source: <a href="/software/gnubiff/">gnubiff</a> &mdash; <em class="netscape4">Mail notification program</em>
fr: <a href="/software/gnubiff/">gnubiff</a> &mdash; <em class="netscape4">Programme de notification de courrier</em>

source: <a href="/software/gnucomm/">gnucomm</a> &mdash; <em class="netscape4">GNU telecommunications project</em>
fr: <a href="/software/gnucomm/">gnucomm</a> &mdash; <em class="netscape4">Projet de télécommunications GNU</em>

source: <a href="/software/git/">gnuit</a> &mdash; <em class="netscape4">Tools for simple, daily file and system management tasks</em>
fr: <a href="/software/git/">gnuit</a> &mdash; <em class="netscape4">Outils simples de gestion de fichiers et de tâches au quotidien</em>

source: <a href="/software/gnulib/">gnulib</a> &mdash; <em class="netscape4">GNU portability library</em>
fr: <a href="/software/gnulib/">gnulib</a> &mdash; <em class="netscape4">Bibliothèque de portabilité GNU</em>

source: <a href="/software/gnumach/">gnumach</a> &mdash; <em class="netscape4">Microkernel of the GNU system</em>
fr: <a href="/software/gnumach/">gnumach</a> &mdash; <em class="netscape4">Micronoyau du système GNU</em>

source: <a href="/software/gnunet/">gnunet</a> &mdash; <em class="netscape4">Anonymous peer-to-peer file-sharing</em>
fr: <a href="/software/gnunet/">gnunet</a> &mdash; <em class="netscape4">Partage de fichiers anonyme en pair-à-pair</em>

source: <a href="/software/gnupg/">gnupg (GPG)</a> &mdash; <em class="netscape4">Complete implementation of the OpenPGP Internet standard</em>
fr: <a href="/software/gnupg/">gnupg (GPG)</a> &mdash; <em class="netscape4">Mise en œuvre complète du standard Internet OpenPGP</em>

source: <a href="/software/gnupod/">gnupod</a> &mdash; <em class="netscape4">Lets you use an iPod under GNU/Linux </em>
fr: <a href="/software/gnupod/">gnupod</a> &mdash; <em class="netscape4">Utilisation d'un iPod sous GNU/Linux </em>

source: <a href="/software/gnuradio/">gnuradio</a> &mdash; <em class="netscape4">Software to create digital radio signals</em>
fr: <a href="/software/gnuradio/">gnuradio</a> &mdash; <em class="netscape4">Logiciel de création de signaux radio numériques</em>

source: <a href="/software/gnuschool/">gnuschool</a> &mdash; <em class="netscape4">Is a web application for educators, students, and school administrators.</em>
fr: <a href="/software/gnuschool/">gnuschool</a> &mdash; <em class="netscape4">Application Web pour les enseignants, étudiants et administrateurs d'école.</em>

source: <a href="/software/gnushogi/">gnushogi</a> &mdash; <em class="netscape4">Japanese version of chess</em>
fr: <a href="/software/gnushogi/">gnushogi</a> &mdash; <em class="netscape4">Version japonaise des échecs</em>

source: <a href="/software/gnuskies/">gnuskies</a> &mdash; <em class="netscape4">Project to create a free version of the xephem program</em>
fr: <a href="/software/gnuskies/">gnuskies</a> &mdash; <em class="netscape4">Projet pour la création d'une version libre du programme xephem</em>

source: <a href="/software/gnusound/">gnusound</a> &mdash; <em class="netscape4">Multitrack sound editor for Gnome</em>
fr: <a href="/software/gnusound/">gnusound</a> &mdash; <em class="netscape4">Éditeur de son multipiste pour Gnome</em>

source: <a href="/software/gnusysutils/">gnusysutils</a> &mdash; <em class="netscape4">Planned group of utilities for system administrators</em>
fr: <a href="/software/gnusysutils/">gnusysutils</a> &mdash; <em class="netscape4">Ensemble d'utilitaires de planification pour administrateurs système</em>

source: <a href="/software/gpaint/">gpaint</a> &mdash; <em class="netscape4">GNOME paint program</em>
fr: <a href="/software/gpaint/">gpaint</a> &mdash; <em class="netscape4">Programme de dessin GNOME</em>

source: <a href="/software/gprolog/">gprolog</a> &mdash; <em class="netscape4">Prolog compiler</em>
fr: <a href="/software/gprolog/">gprolog</a> &mdash; <em class="netscape4">Compilateur Prolog</em>

source: <a href="/software/groff/">groff</a> &mdash; <em class="netscape4">Document formatting system</em>
fr: <a href="/software/groff/">groff</a> &mdash; <em class="netscape4">Système de formatage de document</em>

source: <a href="/software/gss/">gss</a> &mdash; <em class="netscape4">Implementation of the Generic Security Service API</em>
fr: <a href="/software/gss/">gss</a> &mdash; <em class="netscape4">Mise en œuvre de Generic Security Service API</em>

source: <a href="/software/guile-dbi/">guile-dbi</a> &mdash; <em class="netscape4">Guile database abstraction layer</em>
fr: <a href="/software/guile-dbi/">guile-dbi</a> &mdash; <em class="netscape4">Couche d'abstraction de base de données pour Guile</em>

source: <a href="/software/guile-gtk/">guile-gtk</a> &mdash; <em class="netscape4">Guile language bindings for Gtk+ version 1.2</em>
fr: <a href="/software/guile-gtk/">guile-gtk</a> &mdash; <em class="netscape4">Liaisons du langage Guile pour Gtk+ version 1.2</em>

source: <a href="/software/gurgle/">gurgle</a> &mdash; <em class="netscape4">Formerly the GNU Report Generator</em>
fr: <a href="/software/gurgle/">gurgle</a> &mdash; <em class="netscape4">Auparavant, le générateur de rapports GNU</em>

source: <a href="/software/gv/">gv</a> &mdash; <em class="netscape4">Frontend for ghostscript</em>
fr: <a href="/software/gv/">gv</a> &mdash; <em class="netscape4">Frontend pour ghostscript</em>

source: <a href="/software/gvpe/">gvpe</a> &mdash; <em class="netscape4">Secure vpn network among multiple nodes over an untrusted network</em>
fr: <a href="/software/gvpe/">gvpe</a> &mdash; <em class="netscape4">Réseau vpn sécurisé parmi d'autres nœuds dans un réseau non-sécurisé</em>

source: <a href="/software/gzip/">gzip</a> &mdash; <em class="netscape4">Compresses and decompresses files</em>
fr: <a href="/software/gzip/">gzip</a> &mdash; <em class="netscape4">Compression et décompression de fichiers</em>

source: <a href="/software/hOpla/">hOpla</a> &mdash; <em class="netscape4">Link between XML files and SQL databases</em>
fr: <a href="/software/hOpla/">hOpla</a> &mdash; <em class="netscape4">Liaison entre fichiers XML et base de données SQL</em>

source: <a href="/software/halifax/">halifax</a> &mdash; <em class="netscape4">Client applications suite for fax applications</em>
fr: <a href="/software/halifax/">halifax</a> &mdash; <em class="netscape4">Suite applicative client pour applications de fax</em>

source: <a href="/software/hello/">hello</a> &mdash; <em class="netscape4">GNU version of &quot;Hello, world!&quot;</em>
fr: <a href="/software/hello/">hello</a> &mdash; <em class="netscape4">Version GNU de « Hello, world ! »</em>

source: <a href="/software/hp2xx/">hp2xx</a> &mdash; <em class="netscape4">Reads and converts HP-GL files to various formats</em>
fr: <a href="/software/hp2xx/">hp2xx</a> &mdash; <em class="netscape4">Lecture et conversion de fichiers HP-GL en divers formats</em>

source: <a href="/software/hurd/">hurd</a> &mdash; <em class="netscape4">Project GNU&#39;s replacement for the Unix kernel</em>
fr: <a href="/software/hurd/">hurd</a> &mdash; <em class="netscape4">Project GNU d'alternative au noyau Unix</em>

source: <a href="/software/intlfonts/">intlfonts</a> &mdash; <em class="netscape4">Fonts for all characters Emacs 20 can handle</em>
fr: <a href="/software/intlfonts/">intlfonts</a> &mdash; <em class="netscape4">Polices pour tous les caractères que Emacs 20 sait gérer</em>

source: <a href="/software/java2html/">java2html</a> &mdash; <em class="netscape4">Translates Java files to HTML</em>
fr: <a href="/software/java2html/">java2html</a> &mdash; <em class="netscape4">Conversion de fichiers Java en HTML</em>

source: <a href="/software/jel/">jel</a> &mdash; <em class="netscape4">Compiler for simple expressions into Java byte code</em>
fr: <a href="/software/jel/">jel</a> &mdash; <em class="netscape4">Compilateur pour les expressions simples en Java byte code</em>

source: <a href="/software/jwhois/">jwhois</a> &mdash; <em class="netscape4">Internet whois client</em>
fr: <a href="/software/jwhois/">jwhois</a> &mdash; <em class="netscape4">Client whois Internet</em>

source: <a href="/software/libc/">libc</a> &mdash; <em class="netscape4">Library for use with GNU/Hurd and GNU/Linux</em>
fr: <a href="/software/libc/">libc</a> &mdash; <em class="netscape4">Bibliothèque pour l'utilisation avec GNU/Hurd et GNU/Linux</em>

source: <a href="/software/libcdio/">libcdio</a> &mdash; <em class="netscape4">Encapsulates CD-ROM reading and control</em>
fr: <a href="/software/libcdio/">libcdio</a> &mdash; <em class="netscape4">Encapsulation de la lecture et du contrôle de CD-ROM</em>

source: <a href="/software/libextractor/">libextractor</a> &mdash; <em class="netscape4">Extracts metadata information from files</em>
fr: <a href="/software/libextractor/">libextractor</a> &mdash; <em class="netscape4">Extraction d'informations de métadonnées des fichiers</em>

source: <a href="/software/libmicrohttpd/">libmicrohttpd</a> &mdash; <em class="netscape4">GNU library</em>
fr: <a href="/software/libmicrohttpd/">libmicrohttpd</a> &mdash; <em class="netscape4">Bibliothèque GNU</em>

source: <a href="/software/libopts/">libopts</a> &mdash; <em class="netscape4">AutoOpts option parser library that supports stand alone config files</em>
fr: <a href="/software/libopts/">libopts</a> &mdash; <em class="netscape4">Bibliothèque d'analyse de l'option AutoOpts pour les fichiers config indépendants</em>

source: <a href="/software/libsigsegv/">libsigsegv</a> &mdash; <em class="netscape4">Library for handling page faults</em>
fr: <a href="/software/libsigsegv/">libsigsegv</a> &mdash; <em class="netscape4">Bibliothèque pour la manipulation des défauts de page</em>

source: <a href="/software/libtool/">libtool</a> &mdash; <em class="netscape4">Generic library support script</em>
fr: <a href="/software/libtool/">libtool</a> &mdash; <em class="netscape4">Bibliothèque générique de gestion de script</em>

source: <a href="/software/libxmi/">libxmi</a> &mdash; <em class="netscape4">Library for rasterizing 2-D vector graphics</em>
fr: <a href="/software/libxmi/">libxmi</a> &mdash; <em class="netscape4">Bibliothèque pour la rastérisation de graphiques vectoriel 2D</em>

source: <a href="/software/liquidwar6/">liquidwar6</a> &mdash; <em class="netscape4">Liquid War 6 is a unique multiplayer wargame.</em>
fr: <a href="/software/liquidwar6/">liquidwar6</a> &mdash; <em class="netscape4">Liquid War 6 est un jeu de guerre multijoueur.</em>

source: <a href="/software/lsh/">lsh</a> &mdash; <em class="netscape4">Free implementation of the SSH protocol</em>
fr: <a href="/software/lsh/">lsh</a> &mdash; <em class="netscape4">Mise en œuvre libre du protocole SSH</em>

source: <a href="/software/m4/">m4</a> &mdash; <em class="netscape4">Macro processor</em>
fr: <a href="/software/m4/">m4</a> &mdash; <em class="netscape4">Processeur de macro</em>
