Repository: gitGNU/gnu_www-fr
Catalog: home.*.po
Languages: fr

source: <a href="/software/make/">make</a> &mdash; <em class="netscape4">Generates executables and other non-source programs</em>
fr: <a href="/software/make/">make</a> &mdash; <em class="netscape4">Génération d'exécutables et d'autres programmes non-source</em>

source: <a href="/software/marst/">marst</a> &mdash; <em class="netscape4">Algol to C translator</em>
fr: <a href="/software/marst/">marst</a> &mdash; <em class="netscape4">Traducteur Algol vers C</em>

source: <a href="/software/maverik/">maverik</a> &mdash; <em class="netscape4">Virtual reality micro kernel</em>
fr: <a href="/software/maverik/">maverik</a> &mdash; <em class="netscape4">Micronoyau de réalité virtuelle</em>

source: <a href="/software/mcron/">mcron</a> &mdash; <em class="netscape4">Vixie cron replacement</em>
fr: <a href="/software/mcron/">mcron</a> &mdash; <em class="netscape4">Alternative au cron Vixie</em>

source: <a href="/software/mcsim/">mcsim</a> &mdash; <em class="netscape4">Simulation software for designing, analyzing and calibrating mathematical models</em>
fr: <a href="/software/mcsim/">mcsim</a> &mdash; <em class="netscape4">Logiciel pour la simulation, la conception, l'analyse et le calibrage de modèles mathématiques</em>

source: <a href="/software/mdk/">mdk</a> &mdash; <em class="netscape4">Emulator and development environment for Knuth&#39;s MIX computer</em>
fr: <a href="/software/mdk/">mdk</a> &mdash; <em class="netscape4">Émulateur et environnement de développement pour ordinateur Knuth&#39;s MIX</em>

source: <a href="/software/miscfiles/">miscfiles</a> &mdash; <em class="netscape4">Collection of various files</em>
fr: <a href="/software/miscfiles/">miscfiles</a> &mdash; <em class="netscape4">Ensemble de divers fichiers</em>

source: <a href="/software/mit-scheme/">mit-scheme</a> &mdash; <em class="netscape4">MIT/GNU Scheme programming language</em>
fr: <a href="/software/mit-scheme/">mit-scheme</a> &mdash; <em class="netscape4">Langage de programmation Scheme MIT/GNU</em>

source: <a href="/software/moe/">moe </a> &mdash; <em class="netscape4">A powerful and user-friendly text editor</em>
fr: <a href="/software/moe/">moe </a> &mdash; <em class="netscape4">Éditeur de texte puissant et convivial</em>

source: <a href="/software/muse/">muse</a> &mdash; <em class="netscape4">Emacs mode for publishing in various modes</em>
fr: <a href="/software/muse/">muse</a> &mdash; <em class="netscape4">Mode Emacs pour la publication en divers modes</em>

source: <a href="/software/octal/">octal</a> &mdash; <em class="netscape4">Free digital sound workstation for Unix-like systems</em>
fr: <a href="/software/octal/">octal</a> &mdash; <em class="netscape4">Station de travail audio numérique libre pour les systèmes de type Unix</em>

source: <a href="/software/orgadoc/">orgadoc</a> &mdash; <em class="netscape4">Helps organize documentation</em>
fr: <a href="/software/orgadoc/">orgadoc</a> &mdash; <em class="netscape4">Aide à l'organisation de la documentation</em>

source: <a href="/software/osip/">osip</a> &mdash; <em class="netscape4">Library supporting the Session Initiation Protocol</em>
fr: <a href="/software/osip/">osip</a> &mdash; <em class="netscape4">Bibliothèque pour la gestion de Session Initiation Protocol</em>

source: <a href="/software/p2c/">p2c</a> &mdash; <em class="netscape4">Translates Pascal programs into C</em>
fr: <a href="/software/p2c/">p2c</a> &mdash; <em class="netscape4">Traduction de programmes Pascal en C</em>

source: <a href="/software/parted/">parted</a> &mdash; <em class="netscape4">Manipulates disk partitions</em>
fr: <a href="/software/parted/">parted</a> &mdash; <em class="netscape4">Manipulation des partitions de disques</em>

source: <a href="/software/phantomsecurity/">phantom security</a> &mdash; <em class="netscape4">Home security system</em>
fr: <a href="/software/phantomsecurity/">phantom security</a> &mdash; <em class="netscape4">Système de sécurité domestique</em>

source: <a href="/software/phantom_home/">phantom_home</a> &mdash; <em class="netscape4">Home automation system</em>
fr: <a href="/software/phantom_home/">phantom_home</a> &mdash; <em class="netscape4">Système d'automatisation domestique</em>

source: <a href="/software/phpgrabcomics/">phpgrabcomics</a> &mdash; <em class="netscape4">Retrieves and saves comics from the Web</em>
fr: <a href="/software/phpgrabcomics/">phpgrabcomics</a> &mdash; <em class="netscape4">Récupération et conservation de bandes dessinées sur le Web</em>

source: <a href="/software/polyxmass/">polyxmass</a> &mdash; <em class="netscape4">Mass spectrometric framework for simulation and analysis of mass spectrometric data of (bio-)polymers</em>
fr: <a href="/software/polyxmass/">polyxmass</a> &mdash; <em class="netscape4">Environnement de spectromètre de masse pour la simulation et l'analyse de données spectrométiques de (bio-)polymères.</em>

source: <a href="/software/protoize/">protoize</a> &mdash; <em class="netscape4">Creates or removes prototypes from C code</em>
fr: <a href="/software/protoize/">protoize</a> &mdash; <em class="netscape4">Création ou suppression de prototypes dans du code C</em>

source: <a href="/software/rottlog/">rottlog</a> &mdash; <em class="netscape4">Replacement for Red Hat&#39;s &#39;logrotate.&#39;</em>
fr: <a href="/software/rottlog/">rottlog</a> &mdash; <em class="netscape4">Alternative au &#39;logrotate.&#39; de Red Hat</em>

source: <a href="/software/sather/">sather</a> &mdash; <em class="netscape4">Object-oriented language</em>
fr: <a href="/software/sather/">sather</a> &mdash; <em class="netscape4">Langage orienté objet</em>

source: <a href="/software/shishi/">shishi</a> &mdash; <em class="netscape4">Free implementation of the Kerberos 5 network security system</em>
fr: <a href="/software/shishi/">shishi</a> &mdash; <em class="netscape4">Mise en œeuvre libre du système de sécurité réseau Kerberos 5</em>

source: <a href="/software/slib/">slib</a> &mdash; <em class="netscape4">Portable scheme library </em>
fr: <a href="/software/slib/">slib</a> &mdash; <em class="netscape4">Bibliothèque portable Scheme</em>

source: <a href="/software/sourceinstall/">sourceinstaller</a> &mdash; <em class="netscape4">Graphical tool for source package configuration, installation, tracking and removal</em>
fr: <a href="/software/sourceinstall/">sourceinstaller</a> &mdash; <em class="netscape4">Outil graphique pour la configuration, l'installation, le suivi et la suppression de paquetage source</em>

source: <a href="/software/spacechart/">spacechart</a> &mdash; <em class="netscape4">Displays the stars in space in 3D</em>
fr: <a href="/software/spacechart/">spacechart</a> &mdash; <em class="netscape4">Affichage des étoiles de l'espace en 3D</em>

source: <a href="/software/speex/">speex</a> &mdash; <em class="netscape4">Speech compression format</em>
fr: <a href="/software/speex/">speex</a> &mdash; <em class="netscape4">Format de compression Speech</em>

source: <a href="/software/spell/">spell</a> &mdash; <em class="netscape4">Spell checker</em>
fr: <a href="/software/spell/">spell</a> &mdash; <em class="netscape4">Correcteur orthographique</em>

source: <a href="/software/src-highlite/">src-highlite</a> &mdash; <em class="netscape4">Turns source code into a file with syntax highlighting</em>
fr: <a href="/software/src-highlite/">src-highlite</a> &mdash; <em class="netscape4">Conversion de code source en fichier avec coloration syntaxique</em>

source: <a href="/software/stow/">stow</a> &mdash; <em class="netscape4">Manages installation process</em>
fr: <a href="/software/stow/">stow</a> &mdash; <em class="netscape4">Gestion du processus di'nstallation</em>

source: <a href="/software/superopt/">superopt</a> &mdash; <em class="netscape4">Finds the shortest instruction sequence for a given function</em>
fr: <a href="/software/superopt/">superopt</a> &mdash; <em class="netscape4">Recherche de la séquence d'instruction la plus courte pour une fonction donnée</em>

source: <a href="/software/swbis/">swbis</a> &mdash; <em class="netscape4">Extensions to the POSIX packaging standard</em>
fr: <a href="/software/swbis/">swbis</a> &mdash; <em class="netscape4">Extensions au standard de paquetage POSIX</em>

source: <a href="/software/talkfilters/">talkfilters</a> &mdash; <em class="netscape4">Translates English text into dialects</em>
fr: <a href="/software/talkfilters/">talkfilters</a> &mdash; <em class="netscape4">Traduction de texte anglais en dialectes</em>

source: <a href="/software/tramp/">tramp</a> &mdash; <em class="netscape4">Remote file editing software</em>
fr: <a href="/software/tramp/">tramp</a> &mdash; <em class="netscape4">Logiciel d'édition de fichier distant</em>

source: <a href="/software/unrtf/">unrtf</a> &mdash; <em class="netscape4">Converts from RTF to other formats</em>
fr: <a href="/software/unrtf/">unrtf</a> &mdash; <em class="netscape4">Conversion du format RTF vers d'autres formats</em>

source: <a href="/software/userv/">userv</a> &mdash; <em class="netscape4">Security boundary tool</em>
fr: <a href="/software/userv/">userv</a> &mdash; <em class="netscape4">Outil de frontière de sécurité</em>

source: <a href="/software/uucp/">uucp</a> &mdash; <em class="netscape4">File copying program</em>
fr: <a href="/software/uucp/">uucp</a> &mdash; <em class="netscape4">Programme de copie de fichiers</em>

source: <a href="/software/wdiff/">wdiff</a> &mdash; <em class="netscape4">Front end to GNU &#39;diff&#39;</em>
fr: <a href="/software/wdiff/">wdiff</a> &mdash; <em class="netscape4">Frontend pour GNU &#39;diff&#39;</em>

source: <a href="/software/womb/">womb</a> &mdash; <em class="netscape4">Repository for homeless code</em>
fr: <a href="/software/womb/">womb</a> &mdash; <em class="netscape4">Dépôt pour code SDF</em>

source: <a href="/software/xaos/">xaos</a> &mdash; <em class="netscape4">Real-time fractal zoomer</em>
fr: <a href="/software/xaos/">xaos</a> &mdash; <em class="netscape4">Zoom de fractales en temps réel</em>

source: <a href="/software/xlogmaster/">xlogmaster</a> &mdash; <em class="netscape4">Monitors logfiles and devices</em>
fr: <a href="/software/xlogmaster/">xlogmaster</a> &mdash; <em class="netscape4">Surveillance des fichiers journaux et des périphériques</em>

source: <a href="/software/xnee/">xnee</a> &mdash; <em class="netscape4">Records, distributes, and replays X11 protocol data</em>
fr: <a href="/software/xnee/">xnee</a> &mdash; <em class="netscape4">Enregistrement, distribution et relecture des données de protocole X11</em>

source: <a href="http://directory.fsf.org/GNU/">GNU Project Software in the Free Software Directory</a>
fr: <a href="http://directory.fsf.org/GNU/">Logiciels du projet GNU dans le Répertoire des logiciels libres</a>

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution int&eacute;grale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit pr&eacute;serv&eacute;e.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: C&eacute;dric Corazza.<br />R&eacute;vision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: <a href="/server/standards/README.translations.html">Translations</a> of this page
fr: <a href="/server/standards/README.translations.fr.html">Traductions</a> de cette page
