Repository: gitGNU/gnu_www-fr
Catalog: home.*.po
Languages: fr

source: <a href="/software/gts/">GTS</a> &mdash; <em class="netscape4">Functions for 3D surfaces meshed with interconnected triangles</em>
fr: <a href="/software/gts/">GTS</a> &mdash; <em class="netscape4">Fonctions pour surfaces 3D avec triangles interconnectés</em>

source: <a href="/software/GUSS/">GUSS</a> &mdash; <em class="netscape4">Hardware simulator for debugging</em>
fr: <a href="/software/GUSS/">GUSS</a> &mdash; <em class="netscape4">Simulateur matériel pour le débogage</em>

source: <a href="/software/gcal/">Gcal</a> &mdash; <em class="netscape4">Is a program for calculating and printing calendars, and is the GNU implementation of the universally known cal and calendar programs.</em>
fr: <a href="/software/gcal/">Gcal</a> &mdash; <em class="netscape4">Programme GNU pour le calcul et l'impression de calendrier.</em>

source: <a href="/software/gcompris/">Gcompris</a> &mdash; <em class="netscape4">Educational suite for children from 2 to 10 </em>
fr: <a href="/software/gcompris/">Gcompris</a> &mdash; <em class="netscape4">Suite éducative pour les enfants de 2 à 10 ans</em>

source: <a href="/software/gcron/">Gcron</a> &mdash; <em class="netscape4">Replacement for Vixie cron</em>
fr: <a href="/software/gcron/">Gcron</a> &mdash; <em class="netscape4">Alternative au cron Vixie</em>

source: <a href="/software/gdb/">Gdb</a> &mdash; <em class="netscape4">GNU Debugger</em>
fr: <a href="/software/gdb/">Gdb</a> &mdash; <em class="netscape4">Débogueur GNU</em>

source: <a href="/software/gdbm/">Gdbm</a> &mdash; <em class="netscape4">Replacement for the &#39;dbm&#39; and &#39;ndbm&#39; libraries</em>
fr: <a href="/software/gdbm/">Gdbm</a> &mdash; <em class="netscape4">Alternative aux bibliothèques &#39;dbm&#39; et &#39;ndbm&#39;</em>

source: <a href="/software/gengetopt/">Gengetopt</a> &mdash; <em class="netscape4">Generates a C function that parses and validates command line options</em>
fr: <a href="/software/gengetopt/">Gengetopt</a> &mdash; <em class="netscape4">Génération d'une fonction C qui analyse et valide des options de ligne de commande</em>

source: <a href="/software/gettext/">Gettext</a> &mdash; <em class="netscape4">Tools to produce multi-lingual messages</em>
fr: href="/software/gettext/">Gettext</a> &mdash; <em class="netscape4">Outils pour produire des messages multilingues</em>

source: <a href="/software/ggradebook/">Ggradebook</a> &mdash; <em class="netscape4">Fully-featured GNU gradebook</em>
fr: <a href="/software/ggradebook/">Ggradebook</a> &mdash; <em class="netscape4">Cahier de notes GNU</em>

source: <a href="/software/gnats/">Gnats</a> &mdash; <em class="netscape4">Bug tracking system</em>
fr: <a href="/software/gnats/">Gnats</a> &mdash; <em class="netscape4">Système de suivi de bogues</em>

source: <a href="/software/gnatsweb/">Gnatsweb</a> &mdash; <em class="netscape4">Web interface to the GNU bug management system</em>
fr: <a href="/software/gnatsweb/">Gnatsweb</a> &mdash; <em class="netscape4">Interface Web pour le système de suivi de bogues GNU</em>

source: <a href="/software/gnochive/">Gnochive</a> &mdash; <em class="netscape4">GUI frontend for multiple archivers</em>
fr: <a href="/software/gnochive/">Gnochive</a> &mdash; <em class="netscape4">Interface graphique utilisateur pour plusieurs archiveurs</em>

source: <a href="/software/gnome/">Gnome</a> &mdash; <em class="netscape4">The GNU desktop</em>
fr: <a href="/software/gnome/">Gnome</a> &mdash; <em class="netscape4">Le bureau GNU</em>

source: <a href="/software/gnotepad/">Gnotepad+</a> &mdash; <em class="netscape4">HTML and text editor</em>
fr: <a href="/software/gnotepad/">Gnotepad+</a> &mdash; <em class="netscape4">&Eacute;diteur texte et HTML</em>

source: <a href="/software/gnumeric/">Gnumeric</a> &mdash; <em class="netscape4">Math program intended to replace commercial spreadsheets</em>
fr: <a href="/software/gnumeric/">Gnumeric</a> &mdash; <em class="netscape4">Programme mathématique destiné à remplaceur les tableurs commerciaux</em>

source: <a href="/software/gnutrition/">Gnutrition</a> &mdash; <em class="netscape4">Nutrition analysis software</em>
fr: <a href="/software/gnutrition/">Gnutrition</a> &mdash; <em class="netscape4">Logiciel d'analyse de la nutrition</em>

source: <a href="/software/gnuzilla/">Gnuzilla / IceCat</a> &mdash; <em class="netscape4">GNU version of popular web browser</em>
fr: <a href="/software/gnuzilla/">Gnuzilla / IceCat</a> &mdash; <em class="netscape4">Version GNU d'un navigateur Web populaire</em>

source: <a href="/software/goldwater/">Goldwater</a> &mdash; <em class="netscape4">Middleware component of the DotGNU project</em>
fr: <a href="/software/goldwater/">Goldwater</a> &mdash; <em class="netscape4">composant middleware du projet DotGNU</em>

source: <a href="/software/gorm/">Gorm</a> &mdash; <em class="netscape4">Graphic Object Relationship Modeler</em>
fr: <a href="/software/gorm/">Gorm</a> &mdash; <em class="netscape4">Modélisateur graphique de relations entre objets</em>

source: <a href="/software/gperf/">Gperf</a> &mdash; <em class="netscape4">Generates a hash function</em>
fr: <a href="/software/gperf/">Gperf</a> &mdash; <em class="netscape4">Génération d'une fonction hash</em>

source: <a href="/software/greg/">Greg</a> &mdash; <em class="netscape4">Software testing framework </em>
fr: <a href="/software/greg/">Greg</a> &mdash; <em class="netscape4">Environnement de test logiciel</em>

source: <a href="/software/grep/">Grep</a> &mdash; <em class="netscape4">Finds lines that match entered patterns</em>
fr: <a href="/software/grep/">Grep</a> &mdash; <em class="netscape4">Recherche de lignes correspondant au motif saisi</em>

source: <a href="/software/gretl/">Gretl</a> &mdash; <em class="netscape4">Software for econometric analysis</em>
fr: <a href="/software/gretl/">Gretl</a> &mdash; <em class="netscape4">Logiciel d'analyse économique</em>

source: <a href="/software/gtick/">Gtick</a> &mdash; <em class="netscape4">Digital metronome</em>
fr: <a href="/software/gtick/">Gtick</a> &mdash; <em class="netscape4">Métronome numérique</em>

source: <a href="/software/gtkeyboard/">Gtkeyboard</a> &mdash; <em class="netscape4">Graphical keyboard</em>
fr: <a href="/software/gtkeyboard/">Gtkeyboard</a> &mdash; <em class="netscape4">Clavier virtuel</em>

source: <a href="/software/gtypist/">Gtypist</a> &mdash; <em class="netscape4">Typing tutor program</em>
fr: <a href="/software/gtypist/">Gtypist</a> &mdash; <em class="netscape4">Programme d'apprentissage à la dactylographie</em>

source: <a href="/software/guile/">Guile</a> &mdash; <em class="netscape4">GNU extensibility library</em>
fr: <a href="/software/guile/">Guile</a> &mdash; <em class="netscape4">Bibliothèque d'extensibilité GNU</em>

source: <a href="/software/guile-gnome/">Guile-gnome</a> &mdash; <em class="netscape4">Helps Scheme programmers develop visual applications</em>
fr: <a href="/software/guile-gnome/">Guile-gnome</a> &mdash; <em class="netscape4">Aide pour le développement en Scheme d'applications visuelles</em>

source: <a href="/software/httptunnel/">Httptunnel</a> &mdash; <em class="netscape4">Creates a data path in HTTP requests</em>
fr: <a href="/software/httptunnel/">Httptunnel</a> &mdash; <em class="netscape4">Création d'un tunnel pour les requêtes HTTP</em>

source: <a href="/software/hyperbole/">Hyperbole</a> &mdash; <em class="netscape4">Information and text management program</em>
fr: <a href="/software/hyperbole/">Hyperbole</a> &mdash; <em class="netscape4">Programme de gestion de textes et d'informations</em>

source: <a href="/software/idutils/">Idutils</a> &mdash; <em class="netscape4">Tools for indexing</em>
fr: <a href="/software/idutils/">Idutils</a> &mdash; <em class="netscape4">Outils pour l'indexation</em>

source: <a href="/software/indent/">Indent</a> &mdash; <em class="netscape4">C source beautifier</em>
fr: <a href="/software/indent/">Indent</a> &mdash; <em class="netscape4">Embellisseur de code source C</em>

source: <a href="/software/inetutils/">Inetutils</a> &mdash; <em class="netscape4">Collection of common network programs</em>
fr: <a href="/software/inetutils/">Inetutils</a> &mdash; <em class="netscape4">Collection de programmes réseau courants</em>

source: <a href="/software/jacal/">Jacal</a> &mdash; <em class="netscape4">Mathematics program</em>
fr: <a href="/software/jacal/">Jacal</a> &mdash; <em class="netscape4">Programme mathématique</em>

source: <a href="/software/kawa/">Kawa</a> &mdash; <em class="netscape4">Scheme and Emacs Lisp on a Java VM</em>
fr: <a href="/software/kawa/">Kawa</a> &mdash; <em class="netscape4">Scheme et Emacs Lisp surmachine virtuelle Java</em>

source: <a href="/software/less/">Less</a> &mdash; <em class="netscape4">Display paginator</em>
fr: <a href="/software/less/">Less</a> &mdash; <em class="netscape4">Affichage écran par écran</em>

source: <a href="/software/libcvs-perl/">LibCVS</a> &mdash; <em class="netscape4">Provides CVS functionality in library form</em>
fr: <a href="/software/libcvs-perl/">LibCVS</a> &mdash; <em class="netscape4">Fourniture de fonctionnalités CVS sous forme de bibliothèque</em>

source: <a href="/software/libgcrypt/">Libgcrypt</a> &mdash; <em class="netscape4">Cryptographic library</em>
fr: <a href="/software/libgcrypt/">Libgcrypt</a> &mdash; <em class="netscape4">Bibliothèque de cryptographie</em>

source: <a href="/software/libiconv/">Libiconv</a> &mdash; <em class="netscape4">Converts between character encodings</em>
fr: <a href="/software/libiconv/">Libiconv</a> &mdash; <em class="netscape4">Convertisseur d'encodages de caractères</em>

source: <a href="/software/lilypond/">Lilypond</a> &mdash; <em class="netscape4">Music typesetter</em>
fr: <a href="/software/lilypond/">Lilypond</a> &mdash; <em class="netscape4">&Eacute;criture de partition musciale</em>

source: <a href="/software/mailman/">Mailman</a> &mdash; <em class="netscape4">Manages discussion lists</em>
fr: <a href="/software/mailman/">Mailman</a> &mdash; <em class="netscape4">Gestion de listes de discussion</em>

source: <a href="/software/mailutils/">Mailutils</a> &mdash; <em class="netscape4">A set of libraries and programs for handling e-mail messages</em>
fr: <a href="/software/mailutils/">Mailutils</a> &mdash; <em class="netscape4">Ensemble de bibliothèques et de programmes pour la manipulation de courriels</em>

source: <a href="/software/melting/">Melting</a> &mdash; <em class="netscape4">Nearest-neighbor compilation of nucleic acid hybridation</em>
fr: <a href="/software/melting/">Melting</a> &mdash; <em class="netscape4">Calcul du plus proche voisin de l'hybridation de l'acide nucléique</em>

source: <a href="/software/metahtml/">Metahtml</a> &mdash; <em class="netscape4">Programming language for the Web</em>
fr: <a href="/software/metahtml/">Metahtml</a> &mdash; <em class="netscape4">Langage de programmation pour le Web</em>

source: <a href="/software/mc/">Midnight Commander</a> &mdash; <em class="netscape4">Unix file manager</em>
fr: <a href="/software/mc/">Midnight Commander</a> &mdash; <em class="netscape4">Gestionnaire de fichiers Unix</em>

source: <a href="/software/mifluz/">Mifluz </a> &mdash; <em class="netscape4">Full text inverted index query library</em>
fr: <a href="/software/mifluz/">Mifluz </a> &mdash; <em class="netscape4">Bibliothèque de requêtes pour index inversé texte complet</em>

source: <a href="/software/mll2html/">Mll2html</a> &mdash; <em class="netscape4">Converts a mailing lists file to an HTML file</em>
fr: <a href="/software/mll2html/">Mll2html</a> &mdash; <em class="netscape4">Conversion d'un fichier de listes de diffusion en fichier HTML</em>

source: <a href="/software/motti/">Motti</a> &mdash; <em class="netscape4">Multiplayer, networked strategy game</em>
fr: <a href="/software/motti/">Motti</a> &mdash; <em class="netscape4">Jeu de stratégie multijoueur en réseau</em>

source: <a href="/software/mule/">Mule</a> &mdash; <em class="netscape4">Multilingual text editor for Emacs</em>
fr: <a href="/software/mule/">Mule</a> &mdash; <em class="netscape4">&Eacute;diteur de texte multilingue pour Emacs</em>

source: <a href="/software/nana/">Nana</a> &mdash; <em class="netscape4">Library for assertion checking and logging in GNU C/C++</em>
fr: <a href="/software/nana/">Nana</a> &mdash; <em class="netscape4">Bibliothèque pour la vérification et la journalisation d'assertions en GNU C/C++</em>

source: <a href="/software/nano/">Nano</a> &mdash; <em class="netscape4">Pico clone for *NIX</em>
fr: <a href="/software/nano/">Nano</a> &mdash; <em class="netscape4">Clone de Pico pour systèmes de style Unix</em>

source: <a href="/software/nautilus/">Nautilus</a> &mdash; <em class="netscape4">File manager and graphical shell</em>
fr: <a href="/software/nautilus/">Nautilus</a> &mdash; <em class="netscape4">Gestionnaire de fichiers graphique</em>

source: <a href="/software/ncurses/">Ncurses</a> &mdash; <em class="netscape4">Displays and updates text on text-only terminals</em>
fr: <a href="/software/ncurses/">Ncurses</a> &mdash; <em class="netscape4">Affichage et mise à jour de texte sur terminaux texte</em>

source: <a href="/software/ocrad/">Ocrad</a> &mdash; <em class="netscape4">OCR program based on feature extraction</em>
fr: <a href="/software/ocrad/">Ocrad</a> &mdash; <em class="netscape4">Programme <abbr title="Optical Character Recognition">OCR</abbr> basé sur l'extraction de fonctionnalité</em>

source: <a href="/software/octave/">Octave</a> &mdash; <em class="netscape4">High-level language for numerical computations</em>
fr: <a href="/software/octave/">Octave</a> &mdash; <em class="netscape4">Langage de haut niveau pour les calculs numériques</em>

source: <a href="/software/oleo/">Oleo</a> &mdash; <em class="netscape4">Lightweight spreadsheet program</em>
fr: <a href="/software/oleo/">Oleo</a> &mdash; <em class="netscape4">Programme de tableur léger</em>

source: <a href="/software/pcb/">PCB</a> &mdash; <em class="netscape4">Designs printed circuit board layouts </em>
fr: <a href="/software/pcb/">PCB</a> &mdash; <em class="netscape4">Conception de carte de circuits imprimés</em>

source: <a href="/software/phpgroupware/">PHP Groupware</a> &mdash; <em class="netscape4">Groupware suite </em>
fr: <a href="/software/phpgroupware/">PHP Groupware</a> &mdash; <em class="netscape4">Suite groupware</em>

source: <a href="/software/pips/">PIPS</a> &mdash; <em class="netscape4">Converts data between formats</em>
fr: <a href="/software/pips/">PIPS</a> &mdash; <em class="netscape4">Conversion de données en divers formats</em>

source: <a href="/software/pspp/">PSPP</a> &mdash; <em class="netscape4">Statistics package</em>
fr: <a href="/software/pspp/">PSPP</a> &mdash; <em class="netscape4">Paquetage de statistiques</em>

source: <a href="/software/panorama/">Panorama</a> &mdash; <em class="netscape4">Framework for 3D graphics production</em>
fr: <a href="/software/panorama/">Panorama</a> &mdash; <em class="netscape4">Environnement pour la production de graphiques en 3D</em>

source: <a href="/software/paperclips/">Paperclips</a> &mdash; <em class="netscape4">Webserver and dynamic content container</em>
fr: <a href="/software/paperclips/">Paperclips</a> &mdash; <em class="netscape4">Serveur Web et container de contenu dynamique</em>

source: <a href="/software/patch/">Patch</a> &mdash; <em class="netscape4">Applies a patch to a file</em>
fr: <a href="/software/patch/">Patch</a> &mdash; <em class="netscape4">Application de correctif sur un fichier</em>

source: <a href="/software/patchwork/">Patchwork</a> &mdash; <em class="netscape4">Utility for rapid patch development and submission</em>
fr: <a href="/software/patchwork/">Patchwork</a> &mdash; <em class="netscape4">Utilitaire rapide pour le développement et la soumission de correctif</em>

source: <a href="/software/paxutils/">Paxutils</a> &mdash; <em class="netscape4">Tool to manage file archives</em>
fr: <a href="/software/paxutils/">Paxutils</a> &mdash; <em class="netscape4">Outil de gestion de fichiers archive</em>

source: <a href="/software/plotutils/">Plotutils</a> &mdash; <em class="netscape4">Plotting and graphics utilities</em>
fr: <a href="/software/plotutils/">Plotutils</a> &mdash; <em class="netscape4">Utilitaires de traçage et de graphiques</em>

source: <a href="/software/proto/">Proto</a> &mdash; <em class="netscape4">Tools to find function prototypes</em>
fr: <a href="/software/proto/">Proto</a> &mdash; <em class="netscape4">Outils pour la recherche de prototype de fonctions</em>

source: <a href="/software/pth/">Pth</a> &mdash; <em class="netscape4">GNU Portable Threads library</em>
fr: <a href="/software/pth/">Pth</a> &mdash; <em class="netscape4">Bibliothèque portable GNU de threads</em>

source: <a href="/software/ptx/">Ptx</a> &mdash; <em class="netscape4">Index generator</em>
fr: <a href="/software/ptx/">Ptx</a> &mdash; <em class="netscape4">Générateur d'index</em>

source: <a href="/software/qexo/">Qexo</a> &mdash; <em class="netscape4">XQuery to Java compiler</em>
fr: <a href="/software/qexo/">Qexo</a> &mdash; <em class="netscape4">XQuery pour compilateur Java</em>

source: <a href="/software/quagga/">Quagga</a> &mdash; <em class="netscape4">Back-end software for the FSF&#39;s Directory of Free Software</em>
fr: <a href="/software/quagga/">Quagga</a> &mdash; <em class="netscape4">Logiciel pour la gestion du répertoire des logiciels libres</em>

source: <a href="/software/queue/">Queue</a> &mdash; <em class="netscape4">Batch processing and local rsh replacement system</em>
fr: <a href="/software/queue/">Queue</a> &mdash; <em class="netscape4">Alternative pour le remplacement local de rsh et le traitement par lots</em>

source: <a href="/software/rcs/">RCS</a> &mdash; <em class="netscape4">Version control and project management software</em>
fr: <a href="/software/rcs/">RCS</a> &mdash; <em class="netscape4">Logiciel de contrôle de version et de gestion de projet</em>

source: <a href="/software/radius/">Radius</a> &mdash; <em class="netscape4">Remote authentication and accounting system</em>
fr: <a href="/software/radius/">Radius</a> &mdash; <em class="netscape4">Système de gestion de comptes et d'authentification distante</em>

source: <a href="/software/readline/">Readline</a> &mdash; <em class="netscape4">Lets users edit command lines as they are typed in</em>
fr: <a href="/software/readline/">Readline</a> &mdash; <em class="netscape4">Logiciel d'édition de ligne de commande lors de la saisie</em>

source: <a href="/software/recode/">Recode</a> &mdash; <em class="netscape4">Front end to the &#39;recode&#39; translation library</em>
fr: <a href="/software/recode/">Recode</a> &mdash; <em class="netscape4">Logiciel pour la bibliothèque de traduction &#39;recode&#39;</em>

source: <a href="/software/sxml/">SXML</a> &mdash; <em class="netscape4">Defines and implements a mark-up language</em>
fr: <a href="/software/sxml/">SXML</a> &mdash; <em class="netscape4">Définition et mise en œeuvre d'un langage de balises</em>

source: <a href="/software/screen/">Screen</a> &mdash; <em class="netscape4">Runs separate screens on a single terminal</em>
fr: <a href="/software/screen/">Screen</a> &mdash; <em class="netscape4">Exécution de plusieurs écrans sur un même terminal</em>

source: <a href="/software/sed/">Sed</a> &mdash; <em class="netscape4">A stream-oriented non-interactive text editor</em>
fr: <a href="/software/sed/">Sed</a> &mdash; <em class="netscape4">Un éditeur de texte non interactif orienté flux</em>

source: <a href="/software/serveez/">Serveez</a> &mdash; <em class="netscape4">Server framework</em>
fr: <a href="/software/serveez/">Serveez</a> &mdash; <em class="netscape4">Environnement serveur</em>

source: <a href="/software/shmm/">Shared Memory Manager</a> &mdash; <em class="netscape4">access all shared memory</em>
fr: <a href="/software/shmm/">Shared Memory Manager</a> &mdash; <em class="netscape4">Accès à toutes les mémoires partagées</em>

source: <a href="/software/sharutils/">Sharutils</a> &mdash; <em class="netscape4">Creates and helps unpack shell archives</em>
fr: <a href="/software/sharutils/">Sharutils</a> &mdash; <em class="netscape4">Création et aide à la décompression d'archives shell</em>

source: <a href="/software/shtool/">Shtool</a> &mdash; <em class="netscape4">The GNU portable shell tool</em>
fr: <a href="/software/shtool/">Shtool</a> &mdash; <em class="netscape4">Outil de shell GNU portable</em>

source: <a href="/software/smarteiffel/">SmartEiffel</a> &mdash; <em class="netscape4">Eiffel compiler</em>
fr: <a href="/software/smarteiffel/">SmartEiffel</a> &mdash; <em class="netscape4">Compilateur Eiffel</em>

source: <a href="/software/snug/">Snug</a> &mdash; <em class="netscape4">Project to develop a free version of Java Swing</em>
fr: <a href="/software/snug/">Snug</a> &mdash; <em class="netscape4">Projet de développement d'une version libre de Java Swing</em>

source: <a href="/software/sovix/">Sovix</a> &mdash; <em class="netscape4">PHP-based, semantic website revision system</em>
fr: <a href="/software/sovix/">Sovix</a> &mdash; <em class="netscape4">Système de révision de site Web sémantique basé sur PHP</em>

source: <a href="/software/speedx/">SpeedX</a> &mdash; <em class="netscape4">Racing game</em>
fr: <a href="/software/speedx/">SpeedX</a> &mdash; <em class="netscape4">Jeu de courses</em>

source: <a href="/software/termutils/">Termutils</a> &mdash; <em class="netscape4">Programs for controlling terminals</em>
fr: <a href="/software/termutils/">Termutils</a> &mdash; <em class="netscape4">Programmes pour le contrôle de terminaux</em>

source: <a href="/software/texinfo/">Texinfo</a> &mdash; <em class="netscape4">Produces manuals, ASCII text, and on-line documentation</em>
fr: <a href="/software/texinfo/">Texinfo</a> &mdash; <em class="netscape4">Production de manuels, de texte ASCII et de docuentation en ligne</em>

source: <a href="/software/thales/">Thales</a> &mdash; <em class="netscape4">IRC to MySQL gateway</em>
fr: <a href="/software/thales/">Thales</a> &mdash; <em class="netscape4">Passerelle IRC pour MySQL</em>

source: <a href="/software/libobjects/">The GNU Objective C Class Library</a> &mdash; <em class="netscape4">The GNU Objective C Class Library (libobjects) is a library of general-purpose, non-graphical Objective C objects</em>
fr: <a href="/software/libobjects/">The GNU Objective C Class Library</a> &mdash; <em class="netscape4">Bibliothèque de classes GNU Objective C Class Library (libobjects). C'est une bibliothèque générique pour objets Objective C non-graphiques</em>

source: <a href="/software/time/">Time</a> &mdash; <em class="netscape4">Reports the user, system, and real time used by a process</em>
fr: <a href="/software/time/">Time</a> &mdash; <em class="netscape4">Rapport sur un processus : utilisateur, système et temps réel</em>

source: <a href="/software/toutdoux/">ToutDoux</a> &mdash; <em class="netscape4">Project manager</em>
fr: <a href="/software/toutdoux/">ToutDoux</a> &mdash; <em class="netscape4">Gestionnaire de projet</em>

source: <a href="/software/units/">Units</a> &mdash; <em class="netscape4">Unit conversion and calculation</em>
fr: <a href="/software/units/">Units</a> &mdash; <em class="netscape4">Calcul et conversion d'unités</em>

source: <a href="/software/vcdimager/">VCD Imager</a> &mdash; <em class="netscape4">Free software (Super) video CD authoring solution</em>
fr: <a href="/software/vcdimager/">VCD Imager</a> &mdash; <em class="netscape4">Solution libre de création de CD (Super) vidéo</em>

source: <a href="/software/wget/">Wget</a> &mdash; <em class="netscape4">Retrieves files from the Web</em>
fr: <a href="/software/wget/">Wget</a> &mdash; <em class="netscape4">Récupération de fichiers du Web</em>
