Repository: gitGNU/gnu_www-fr
Catalog: home.*.po
Languages: fr

source: <a href="/software/acm/">ACM</a> &mdash; <em class="netscape4">Aerial combat simulation game</em>
fr: <a href="/software/acm/">ACM</a> &mdash; <em class="netscape4">Jeu de simulation de combat Aerial</em>

source: <a href="/software/abdabi/">Abdabi</a> &mdash; <em class="netscape4">Service discovery system for DotGNU</em>
fr: <a href="/software/abdabi/">Abdabi</a> &mdash; <em class="netscape4">Système de découverte de service pour DotGNU</em>

source: <a href="/software/Aetherspace/">Aetherspace</a> &mdash; <em class="netscape4">Project to produce a multiplayer game</em>
fr: <a href="/software/Aetherspace/">Aetherspace</a> &mdash; <em class="netscape4">Projet pour produire un jeu multijoueur</em>

source: <a href="/software/anubis/">Anubis</a> &mdash; <em class="netscape4">Processes outgoing mail</em>
fr: <a href="/software/anubis/">Anubis</a> &mdash; <em class="netscape4">Traitement des courriers sortants</em>

source: <a href="/software/archimedes/">Archimedes</a> &mdash; <em class="netscape4">Software for designing and simulating submicron semiconductor devices</em>
fr: <a href="/software/archimedes/">Archimedes</a> &mdash; <em class="netscape4">Logiciel de conception et de simulation d'appareils semi-conducteurs de taille inférieur au micron</em>

source: <a href="/software/aspell/">Aspell</a> &mdash; <em class="netscape4">Spell checker</em>
fr: <a href="/software/aspell/">Aspell</a> &mdash; <em class="netscape4">Correcteur orthographique</em>

source: <a href="/software/autoconf/">Autoconf</a> &mdash; <em class="netscape4">Produces shell scripts which automatically configure source code</em>
fr: <a href="/software/autoconf/">Autoconf</a> &mdash; <em class="netscape4">Production de scripts shell configurant automatiquement le code source</em>

source: <a href="/software/autogen/">Autogen</a> &mdash; <em class="netscape4">Automated program and text generation</em>
fr: <a href="/software/autogen/">Autogen</a> &mdash; <em class="netscape4">Génération de texte et de programme automatisé</em>

source: <a href="/software/automake/">Automake</a> &mdash; <em class="netscape4">Generates Makefile.in files </em>
fr: <a href="/software/automake/">Automake</a> &mdash; <em class="netscape4">Génération de fichiers Makefile.in</em>

source: <a href="/software/bpel2owfn/">BPEL2oWFN</a> &mdash; <em class="netscape4">translates a web service expressed in BPEL into an oWFN</em>
fr: <a href="/software/bpel2owfn/">BPEL2oWFN</a> &mdash; <em class="netscape4">Traduction d'un Web service exprimé en BPEL vers un oWFN</em>

source: <a href="/software/balsa/">Balsa</a> &mdash; <em class="netscape4">GNOME mail client</em>
fr: <a href="/software/balsa/">Balsa</a> &mdash; <em class="netscape4">Client de messagerie GNOME</em>

source: <a href="/software/barcode/">Barcode</a> &mdash; <em class="netscape4">Converts text strings to printed bars</em>
fr: <a href="/software/barcode/">Barcode</a> &mdash; <em class="netscape4">Conversion de chaînes de texte en code à barres</em>

source: <a href="/software/bash/">Bash</a> &mdash; <em class="netscape4">Shell of the GNU operating system</em>
fr: <a href="/software/bash/">Bash</a> &mdash; <em class="netscape4">Shell du système d'exploitation GNU</em>

source: <a href="/software/bayonne/">Bayonne</a> &mdash; <em class="netscape4">GNU telephony server</em>
fr: <a href="/software/bayonne/">Bayonne</a> &mdash; <em class="netscape4">Serveur téléphonique GNU</em>

source: <a href="/software/bzr/">Bazaar Version Control </a> &mdash; <em class="netscape4">distributed version control</em>
fr: <a href="/software/bzr/">Bazaar Version Control </a> &mdash; <em class="netscape4">Système de contrôle de version distribué</em>

source: <a href="/software/bc/">Bc</a> &mdash; <em class="netscape4">Interactive algebraic language </em>
fr: <a href="/software/bc/">Bc</a> &mdash; <em class="netscape4">Langage algébrique interactif</em>

source: <a href="/software/binutils/">Binutils</a> &mdash; <em class="netscape4">Collection of binary utilities</em>
fr: <a href="/software/binutils/">Binutils</a> &mdash; <em class="netscape4">Collection d'utilitaires binaires</em>

source: <a href="/software/bison/">Bison</a> &mdash; <em class="netscape4">Replacement for the parser generator &#39;yacc&#39;</em>
fr: <a href="/software/bison/">Bison</a> &mdash; <em class="netscape4">Alternative pour le générateur d'analyse &#39;yacc&#39;</em>

source: <a href="/software/calendula/">Calendula</a> &mdash; <em class="netscape4">Fund-raising/contact management software for non-profits</em>
fr: <a href="/software/calendula/">Calendula</a> &mdash; <em class="netscape4">Logiciel de gestion de contacts/collecte de fonds pour les organisations à but non lucratif</em>

source: <a href="/software/cfengine/">Cfengine</a> &mdash; <em class="netscape4">Maintains configuration of a heterogenous UNIX network</em>
fr: <a href="/software/cfengine/">Cfengine</a> &mdash; <em class="netscape4">Maintenance de la configuration d'un réseau hétérogène Unix</em>

source: <a href="/software/chess/">Chess </a> &mdash; <em class="netscape4">Chess game</em>
fr: <a href="/software/chess/">Chess </a> &mdash; <em class="netscape4">Jeu d'échec</em>

source: <a href="/software/commoncpp/">Common C++</a> &mdash; <em class="netscape4">Highly portable C++ class library</em>
fr: <a href="/software/commoncpp/">Common C++</a> &mdash; <em class="netscape4">Bibliothèque de classes C++ hautement portables</em>

source: <a href="/software/cpio/">Cpio</a> &mdash; <em class="netscape4">Archiver that handles various types of cpio and tar archives</em>
fr: <a href="/software/cpio/">Cpio</a> &mdash; <em class="netscape4">Archiveur manipulant divers types d'archive cpio et tar</em>

source: <a href="/software/djgpp/">DJGPP</a> &mdash; <em class="netscape4">GCC, G++, and GNU utilities for DOS </em>
fr: <a href="/software/djgpp/">DJGPP</a> &mdash; <em class="netscape4">Utilitaires GCC, G++ et GNU pour DOS </em>

source: <a href="/software/DMD/">DMD</a> &mdash; <em class="netscape4">Service manager that&#39;s a replacement for SysV-init</em>
fr: <a href="/software/DMD/">DMD</a> &mdash; <em class="netscape4">Gestionnaire de services alternatif à SysV-init</em>

source: <a href="/software/denemo/">Denemo</a> &mdash; <em class="netscape4">Graphical music notation program</em>
fr: <a href="/software/denemo/">Denemo</a> &mdash; <em class="netscape4">Programme de notation musicale graphique</em>

source: <a href="/software/dia/">Dia</a> &mdash; <em class="netscape4">GTK-based diagram drawing program</em>
fr: <a href="/software/dia/">Dia</a> &mdash; <em class="netscape4">Programme de conception de diagramme basé sur GTK</em>

source: <a href="/software/diffutils/">Diffutils</a> &mdash; <em class="netscape4">Finds differences between and among files</em>
fr: <a href="/software/diffutils/">Diffutils</a> &mdash; <em class="netscape4">Recherche des différences entre et parmi les fichiers</em>

source: <a href="/software/dominion/">Dominion</a> &mdash; <em class="netscape4">Multi-player role-playing simulation</em>
fr: <a href="/software/dominion/">Dominion</a> &mdash; <em class="netscape4">Jeu de rôle multijoueur</em>

source: <a href="/software/dcl/">Double Choco Latte</a> &mdash; <em class="netscape4">System for tracking bugs, changes, enhancements, and requests for software</em>
fr: <a href="/software/dcl/">Double Choco Latte</a> &mdash; <em class="netscape4">Système de suivi de bogues pour les logiciels</em>

source: <a href="/software/edma/">EDMA </a> &mdash; <em class="netscape4">Modular development environment </em>
fr: <a href="/software/edma/">EDMA </a> &mdash; <em class="netscape4">Environnement de développement modulaire</em>

source: <a href="/software/EPrints/">EPrints</a> &mdash; <em class="netscape4">Online information archiving system</em>
fr: <a href="/software/EPrints/">EPrints</a> &mdash; <em class="netscape4">Système d'archivage d'informations en ligne</em>

source: <a href="/software/ecc/">Ecc</a> &mdash; <em class="netscape4">Elliptical curve class library</em>
fr: <a href="/software/ecc/">Ecc</a> &mdash; <em class="netscape4">Bibliothèque de classes de courbe elliptique</em>

source: <a href="/software/ed/">Ed</a> &mdash; <em class="netscape4">Line-oriented text editor</em>
fr: <a href="/software/ed/">Ed</a> &mdash; <em class="netscape4">Éditeur de texte orienté ligne</em>

source: <a href="/software/electric/">Electric</a> &mdash; <em class="netscape4">CAD electrical circuit design system </em>
fr: <a href="/software/electric/">Electric</a> &mdash; <em class="netscape4">Système de conception de circuit électrique assisté par ordinateur</em>

source: <a href="/software/emacs/">Emacs</a> &mdash; <em class="netscape4">Extensible, real-time editor</em>
fr: <a href="/software/emacs/">Emacs</a> &mdash; <em class="netscape4">Éditeur en temps réel extensible</em>

source: <a href="/software/epsilon/">Epsilon</a> &mdash; <em class="netscape4">Strongly-typed omega-order programming language</em>
fr: <a href="/software/epsilon/">Epsilon</a> &mdash; <em class="netscape4">Langage de programmation ordonné omega fortement typé</em>

source: <a href="/software/ffp/">Ffp</a> &mdash; <em class="netscape4">Free Film Project</em>
fr: <a href="/software/ffp/">Ffp</a> &mdash; <em class="netscape4">Projet de film libre</em>

source: <a href="/software/findutils/">Findutils</a> &mdash; <em class="netscape4">Tools to find files and to operate on groups of files</em>
fr: <a href="/software/findutils/">Findutils</a> &mdash; <em class="netscape4">Outils pour rechercher des fichiers et opérer sur des groupes de fichiers</em>

source: <a href="/software/Forum/">Forum</a> &mdash; <em class="netscape4">Web-based groupware system</em>
fr: <a href="/software/Forum/">Forum</a> &mdash; <em class="netscape4">Système de groupware basé sur le Web</em>

source: <a href="/software/FreeDink/">FreeDink</a> &mdash; <em class="netscape4">Free enhancement of the Dink Smallwood game engine</em>
fr: <a href="/software/FreeDink/">FreeDink</a> &mdash; <em class="netscape4">Amélioration libre du moteur de jeu Dink Smallwood</em>

source: <a href="/software/freefont/">Freefont</a> &mdash; <em class="netscape4">Free UCS outline fonts</em>
fr: <a href="/software/freefont/">Freefont</a> &mdash; <em class="netscape4">Polices libres UCS</em>

source: <a href="/software/gcc/">GCC</a> &mdash; <em class="netscape4">GNU Compiler Collection</em>
fr: <a href="/software/gcc/">GCC</a> &mdash; <em class="netscape4">Collection de compilateurs GNU</em>

source: <a href="/software/gcl/">GCL</a> &mdash; <em class="netscape4">Compiler and interpreter for Common Lisp</em>
fr: <a href="/software/gcl/">GCL</a> &mdash; <em class="netscape4">Compilateur et interpréteur pour Common Lisp</em>

source: <a href="/software/gift/">GIFT</a> &mdash; <em class="netscape4">Content based image retrieval system</em>
fr: <a href="/software/gift/">GIFT</a> &mdash; <em class="netscape4">Système de récupération d'images basé sur le contenu</em>

source: <a href="/software/gimp/">GIMP</a> &mdash; <em class="netscape4">GNU image manipulation program</em>
fr: <a href="/software/gimp/">GIMP</a> &mdash; <em class="netscape4">Programme de manipulation d'image GNU</em>

source: <a href="/software/glpk/">GLPK</a> &mdash; <em class="netscape4">GNU Linear Programming Kit</em>
fr: <a href="/software/glpk/">GLPK</a> &mdash; <em class="netscape4">Kit de programmation linéaire GNU</em>

source: <a href="/software/glue/">GLUE</a> &mdash; <em class="netscape4">GNU Internet groupware project</em>
fr: <a href="/software/glue/">GLUE</a> &mdash; <em class="netscape4">Projet groupware Internet GNU</em>

source: <a href="/software/glib/">GLib</a> &mdash; <em class="netscape4">Core library that forms the basis of GTK+ and GNOME</em>
fr: <a href="/software/glib/">GLib</a> &mdash; <em class="netscape4">Bibliothèque de base formant la base de GTK+ et GNOME</em>

source: <a href="/software/gnat/">GNAT</a> &mdash; <em class="netscape4">A complete Ada95 compilation system</em>
fr: <a href="/software/gnat/">GNAT</a> &mdash; <em class="netscape4">Un système de compilation complet Ada95</em>

source: <a href="/software/gnowsys/">GNOWSYS</a> &mdash; <em class="netscape4">Hybrid database server with a kernel for semantic computing</em>
fr: <a href="/software/gnowsys/">GNOWSYS</a> &mdash; <em class="netscape4">Serveur de base de données hybride avec un noyau pour la computation sémantique</em>

source: <a href="/software/alive/">GNU Alive</a> &mdash; <em class="netscape4">Automatic login and keep-alive utility for Internet connections.</em>
fr: <a href="/software/alive/">GNU Alive</a> &mdash; <em class="netscape4">Utilitaire de connexion automatique et de maintien de session pour les connexions Internet.</em>

source: <a href="/software/classpathx/">GNU Classspathx</a> &mdash; <em class="netscape4">Unfinished free implementation of the Java extension libraries</em>
fr: <a href="/software/classpathx/">GNU Classpathx</a> &mdash; <em class="netscape4">Mise en œuvre libre, non terminée, des bibliothèques d'extension Java</em>

source: <a href="/software/gnuenterprise/">GNU Enterprise</a> &mdash; <em class="netscape4">Unfinished project to develop a complete ERP system</em>
fr: <a href="/software/gnuenterprise/">GNU Enterprise</a> &mdash; <em class="netscape4">Projet non terminé pour développer un système ERP complet</em>

source: <a href="/software/gfe/">GNU Font Editor</a> &mdash; <em class="netscape4">Graphical font editor</em>
fr: <a href="/software/gfe/">GNU Font Editor</a> &mdash; <em class="netscape4">Éditeur de polices graphique</em>

source: <a href="/software/global/">GNU GLOBAL</a> &mdash; <em class="netscape4">Source code tag system for C, C++, Java, and Yacc</em>
fr: <a href="/software/global/">GNU GLOBAL</a> &mdash; <em class="netscape4">Système de marquage de code source pour C, C++, Java et Yacc</em>

source: <a href="/software/grub/">GNU GRUB</a> &mdash; <em class="netscape4">GNU GRand Unified Bootloader </em>
fr: <a href="/software/grub/">GNU GRUB</a> &mdash; <em class="netscape4">Gestionnaire de démarrage GNU</em>

source: <a href="/software/gnash/">GNU Gnash</a> &mdash; <em class="netscape4">Flash Movie Player</em>
fr: <a href="/software/gnash/">GNU Gnash</a> &mdash; <em class="netscape4">Lecteur de films Flash</em>

source: <a href="/software/libidn/">GNU Libidn</a> &mdash; <em class="netscape4">Internationalized string preparation library</em>
fr: <a href="/software/libidn/">GNU Libidn</a> &mdash; <em class="netscape4">Bibliothèque de préparation de chaînes internationalisée</em>

source: <a href="/software/macchanger/">GNU MAC Changer </a> &mdash; <em class="netscape4">Is a utility to manipulate a MAC address</em>
fr: <a href="/software/macchanger/">GNU MAC Changer </a> &mdash; <em class="netscape4">Utilitaire pour manipuler les adresses MAC</em>

source: <a href="/software/gnumessenger/">GNU Messenger </a> &mdash; <em class="netscape4">Secure messaging system</em>
fr: <a href="/software/gnumessenger/">GNU Messenger </a> &mdash; <em class="netscape4">Système de messagerie sécurisée</em>

source: <a href="/software/gnupdf/">GNU PDF</a> &mdash; <em class="netscape4">set of libraries and programs to manage the PDF file format</em>
fr: <a href="/software/gnupdf/">GNU PDF</a> &mdash; <em class="netscape4">Ensemble de bibliothèques et de programmes pour gérer le format de fichier PDF</em>

source: <a href="/software/gnupoc/">GNU POC</a> &mdash; <em class="netscape4">manages smartcard passwords</em>
fr: <a href="/software/gnupoc/">GNU POC</a> &mdash; <em class="netscape4">Gestionnaire de mots de passe de smartcard</em>

source: <a href="/software/GNUPascal/">GNU Pascal</a> &mdash; <em class="netscape4">Pascal compiler of the GNU Project</em>
fr: <a href="/software/GNUPascal/">GNU Pascal</a> &mdash; <em class="netscape4">Compilateur Pascal du projet GNU</em>

source: <a href="/software/pipo/">GNU Pipo</a> &mdash; <em class="netscape4">A GNU Bulletion Board System</em>
fr: <a href="/software/pipo/">GNU Pipo</a> &mdash; <em class="netscape4">Babillard électronique GNU (BBS)</em>

source: <a href="/software/proxyknife/">GNU Proxyknife</a> &mdash; <em class="netscape4">Validate free proxies for users behind firewalls</em>
fr: <a href="/software/proxyknife/">GNU Proxyknife</a> &mdash; <em class="netscape4">Validation de proxy libres pour les utilisateurs derrière un pare-feu</em>

source: <a href="/software/gnur/">GNU R</a> &mdash; <em class="netscape4">a language and environment for statistical computing and graphics. </em>
fr: <a href="/software/gnur/">GNU R</a> &mdash; <em class="netscape4">Langage et environnement pour le calcul statistique et graphique.</em>

source: <a href="/software/gsasl/">GNU SASL</a> &mdash; <em class="netscape4">SASL network authentication library</em>
fr: <a href="/software/gsasl/">GNU SASL</a> &mdash; <em class="netscape4">Bibliothèque d'authentification réseau SASL</em>

source: <a href="/software/gnusql/">GNU SQL</a> &mdash; <em class="netscape4">Database management system</em>
fr: <a href="/software/gnusql/">GNU SQL</a> &mdash; <em class="netscape4">Système de gestion de base de données</em>

source: <a href="/software/smalltalk/">GNU Smalltalk</a> &mdash; <em class="netscape4">Implementation of the Smalltalk object oriented language</em>
fr: <a href="/software/smalltalk/">GNU Smalltalk</a> &mdash; <em class="netscape4">Implémentation du langage orienté objet Smalltalk</em>

source: <a href="/software/solfege/">GNU Solfege</a> &mdash; <em class="netscape4">Eartraining program for GNOME</em>
fr: <a href="/software/solfege/">GNU Solfege</a> &mdash; <em class="netscape4">Programme d'entraînement auditif pour GNOME</em>

source: <a href="/software/songanizer/">GNU Songanizer</a> &mdash; <em class="netscape4">Script to organize a directory containing ogg and mp3 files.</em>
fr: <a href="/software/songanizer/">GNU Songanizer</a> &mdash; <em class="netscape4">Script pour organiser un répertoire contenant des fichiers ogg et mp3.</em>

source: <a href="/software/GNUTeXmacs/">GNU TeXmacs</a> &mdash; <em class="netscape4">Scientific text editor</em>
fr: <a href="/software/GNUTeXmacs/">GNU TeXmacs</a> &mdash; <em class="netscape4">&Eacute;diteur de texte scientifique</em>

source: <a href="/software/teseq/">GNU Teseq</a> &mdash; <em class="netscape4">a tool for analyzing files that contain control characters and terminal control sequences.</em>
fr: <a href="/software/teseq/">GNU Teseq</a> &mdash; <em class="netscape4">Outil pour l'analyse de fichiers contenant des caractères de contrôle et des séquences de contrôle de terminal.</em>

source: <a href="/software/fdisk/">GNU fdisk</a> &mdash; <em class="netscape4">Is a libparted-based partitioning tool</em>
fr: <a href="/software/fdisk/">GNU fdisk</a> &mdash; <em class="netscape4">Outil de partitionnement basé sur libparted</em>

source: <a href="/software/ghostscript/">GNU ghostscript </a> &mdash; <em class="netscape4">Interpreter for the Postscript and PDF graphics languages</em>
fr: <a href="/software/ghostscript/">GNU ghostscript </a> &mdash; <em class="netscape4">Interpréteur pour les langages graphiques Postscript et PDF</em>

source: <a href="/software/gnugo/">GNU go</a> &mdash; <em class="netscape4">Plays the game of Go</em>
fr: <a href="/software/gnugo/">GNU go</a> &mdash; <em class="netscape4">Jeu de Go</em>

source: <a href="/software/libmatheval/">GNU libmatheval</a> &mdash; <em class="netscape4">Library for evaluating mathematical expressions</em>
fr: <a href="/software/libmatheval/">GNU libmatheval</a> &mdash; <em class="netscape4">Bibliothèque pour l'évaluation d'expressions mathématiques</em>

source: <a href="/software/lightning/">GNU lightning</a> &mdash; <em class="netscape4">Generates assembly language code at run-time</em>
fr: <a href="/software/lightning/">GNU lightning</a> &mdash; <em class="netscape4">Génération de code en langage assembleur à la volée</em>

source: <a href="/software/gnurobots/">GNU robots</a> &mdash; <em class="netscape4">Real-time game</em>
fr: <a href="/software/gnurobots/">GNU robots</a> &mdash; <em class="netscape4">Jeu en temps réel</em>

source: <a href="/software/sauce/">GNU sauce</a> &mdash; <em class="netscape4">Anti-spam server</em>
fr: <a href="/software/sauce/">GNU sauce</a> &mdash; <em class="netscape4">Serveur anti-pourriel</em>

source: <a href="/software/tar/">GNU tar</a> &mdash; <em class="netscape4">Creates tar archives</em>
fr: <a href="/software/tar/">GNU tar</a> &mdash; <em class="netscape4">Création d'archives tar</em>

source: <a href="/software/trueprint/">GNU trueprint</a> &mdash; <em class="netscape4">Prints source code to PostScript printers</em>
fr: <a href="/software/trueprint/">GNU trueprint</a> &mdash; <em class="netscape4">Impression de code source pour imprimantes PostScript</em>

source: <a href="/software/gnucash/">GNUCash</a> &mdash; <em class="netscape4">Personal and small business money-management software </em>
fr: <a href="/software/gnucash/">GNUCash</a> &mdash; <em class="netscape4">Logiciel de gestion financière</em>

source: <a href="/software/gnump3d/">GNUMP3d</a> &mdash; <em class="netscape4">A light-weight audio server</em>
fr: <a href="/software/gnump3d/">GNUMP3d</a> &mdash; <em class="netscape4">Serveur audio allégé</em>

source: <a href="/software/gnumed/">GNUMed</a> &mdash; <em class="netscape4">Software for a paperless medical practice</em>
fr: a href="/software/gnumed/">GNUMed</a> &mdash; <em class="netscape4">Logiciel pour pratique médicale sans papier</em>

source: <a href="/software/gnubik/">GNUbik</a> &mdash; <em class="netscape4">3D Rubik&#39;s cube game</em>
fr: <a href="/software/gnubik/">GNUbik</a> &mdash; <em class="netscape4">Jeu de Rubik&#39;s cube en 3D</em>

source: <a href="/software/gnucap/">GNUcap</a> &mdash; <em class="netscape4">A general purpose circuit simulator</em>
fr: <a href="/software/gnucap/">GNUcap</a> &mdash; <em class="netscape4">Similateur de circuit générique</em>

source: <a href="/software/gnujump/">GNUjump</a> &mdash; <em class="netscape4">SDLjump is a simple game where your goal is to keep jumping to upper falling platforms in order to avoid touching the lower part of the screen.</em>
fr: <a href="/software/gnujump/">GNUjump</a> &mdash; <em class="netscape4">Jeu dont le but est de sauter sur des plateformes en chute libre tout en évitant d'attendre le bas de l'écran.</em>

source: <a href="/software/gnus/">GNUs</a> &mdash; <em class="netscape4">Emacs newsreader</em>
fr: <a href="/software/gnus/">GNUs</a> &mdash; <em class="netscape4">Lecteur de nouvelles Emacs</em>

source: <a href="/software/gnustep/">GNUstep</a> &mdash; <em class="netscape4">A graphical, object oriented programming environment</em>
fr: <a href="/software/gnustep/">GNUstep</a> &mdash; <em class="netscape4">Environnement de programmation graphique orienté objet</em>

source: <a href="/software/gnutls/">GNUtls</a> &mdash; <em class="netscape4">A library implementing TLS 1.0 and SSL 3.0 protocols</em>
fr: <a href="/software/gnutls/">GNUtls</a> &mdash; <em class="netscape4">Bibliothèque mettant en &oelig;uvre les protocoles TLS 1.0 et SSL 3.0</em>

source: <a href="/software/goops/">GOOPS</a> &mdash; <em class="netscape4">Object-oriented extension to &#39;guile&#39;</em>
fr: <a href="/software/goops/">GOOPS</a> &mdash; <em class="netscape4">Extension orientée objet de &#39;guile&#39;</em>

source: <a href="/software/gsl/">GSL</a> &mdash; <em class="netscape4">Routines for numerical computing</em>
fr: <a href="/software/gsl/">GSL</a> &mdash; <em class="netscape4">Routines pour calcul numérique</em>

source: <a href="/software/gtk/">GTK+</a> &mdash; <em class="netscape4">GNU toolkit for X windows development</em>
fr: <a href="/software/gtk/">GTK+</a> &mdash; <em class="netscape4">Ensemble d'outils GNU pour le développement X windows</em>
