Repository: gitGNU/gnu_www-fr
Catalog: keepingup.*.po
Languages: fr

source: Keeping Up With GNU and the FSF - GNU Project - Free Software Foundation (FSF)
fr: Restez informés sur GNU et la FSF - GNU Project - Free Software Foundation (FSF)

source: Keeping Up With GNU and the FSF
fr: Restez informés sur GNU et la FSF

source: This page contains a list of resources to help you keep up to date on what is happening with the GNU Project and the Free Software Foundation.
fr: Cette page contient une liste de ressources pour vous aider à rester informés sur l'actualité du Projet GNU et de la Free Software Foundation.

source: What's New
fr: Quoi de neuf&nbsp;?

source: Find out <a href="/server/whatsnew.html">What's New in and about the GNU Project</a>.
fr: Découvrez les <a href="/server/whatsnew.html">Nouveautés du projet GNU</a>.

source: Take Action
fr: Agir

source: Keep up on what <a href="/server/takeaction.html">you can do</a> to keep software free, and promote the freedoms of speech, press, and association on the Internet.
fr: Restez informés sur <a href="/server/takeaction.html">ce que vous pouvez faire</a> pour que les logiciels soient libres et pour la promotion de la liberté d'expression, de la presse et d'association sur Internet.

source: Coming Events
fr: Événements à venir

source: Find out about <a href="/events.html">Coming FSF and GNU Events</a>.
fr: Découvrez les <a href="/events.html">Événements à venir concernant la FSF et GNU</a>.

source: Press Releases
fr: Communiqués de presse

source: Read the <a href="/press/press.html#releases">Press Releases</a> from the GNU Project and the FSF.
fr: Lisez les <a href="/press/press.html#releases">Communiqués de presse</a> sur le Projet GNU et la FSF.

source: Free Software Directory
fr: Le répertoire des logiciels libres

source: Additions and updates are constantly made to the <a href="http://directory.fsf.org">Free Software Directory</a>. Check the list of recent updates often to see what's new.
fr: Des ajouts et des mises à jour sont faits constamment dans le <a href="http://directory.fsf.org">Répertoire des logiciels libres</a>. Vérifiez régulièrement la liste des mises à jour récentes pour voir les nouveautés.

source: Mailing Lists
fr: Listes de diffusion

source: There are many <a href="http://mail.gnu.org/mailman/listinfo">public mailing lists</a> related to the GNU Project and the FSF. You can subscribe to these lists to keep up with the latest news and developments on GNU Projects/Packages and to get general information about GNU/FSF.
fr: Il y a plusieurs <a href="http://mail.gnu.org/mailman/listinfo">listes de diffusion publiques</a> relatives au Projet GNU et à la FSF. Vous pouvez vous abonner à ces listes pour vous tenir au courant des dernières nouvelles et des développements sur les projets et paquetages de GNU et pour obtenir des informations générales sur GNU et la FSF.

source: These are some that are good for general info:
fr: Certaines sont indiquées pour des informations générales&nbsp;:

source: <a href="http://mail.gnu.org/mailman/listinfo/info-fsf"> info-fsf</a>: Free Software Foundation announcements and information.
fr: <a href="http://mail.gnu.org/mailman/listinfo/info-fsf"> info-fsf</a>&nbsp;: Annonces et informations de la Free Software Foundation.

source: <a href="http://mail.gnu.org/mailman/listinfo/info-gnu"> info-gnu</a>: Announcements and requests for help from the GNU project and the Free Software Foundation.
fr: <a href="http://mail.gnu.org/mailman/listinfo/info-gnu"> info-gnu</a>&nbsp;: Annonces et demandes d'aide pour le Projet GNU et la Free Software Foundation.

source: <a href="http://mail.gnu.org/mailman/listinfo/info-gnu-events"> info-gnu-events</a>: Announcements of GNU and FSF events.
fr: <a href="http://mail.gnu.org/mailman/listinfo/info-gnu-events"> info-gnu-events</a>&nbsp;: Annonces sur le événements de GNU et de la FSF.

source: <a href="http://mail.gnu.org/mailman/listinfo/info-press"> info-press</a>: GNU press announcements.
fr: <a href="http://mail.gnu.org/mailman/listinfo/info-press"> info-press</a>&nbsp;: Communiqués de presse de GNU.

source: There are several gnu.* <a href="/prep/mailinglists.html"> usenet newsgroups</a> that are good sources of information. This group is useful in keeping up with what's going on with GNU:
fr: Il existe plusieurs <a href="/prep/mailinglists.html">groupes de discussion usenet</a> gnu.* qui sont de bonnes sources d'information. Ce groupe est utile pour rester informé de ce qui se passe chez GNU:

source: News
fr: Nouvelles

source: You can get news about GNU in spanish at <a href="http://gnuticias.es.gnu.org">GNUticias</a>
fr: Vous pouvez obtenir des nouvelles de GNU en espagnol sur <a href="http://gnuticias.es.gnu.org">GNUticias</a>

source: Please inquire about GNU by Email: <a href="mailto:gnu@gnu.org">gnu@gnu.org</a>, Voice: +1-617-542-5942, or Fax: +1-617-542-2652.
fr: Vous pouvez vous renseigner sur GNU par courriel&nbsp;: <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>, téléphone&nbsp;: +1-617-542-5942 ou fax&nbsp;: +1-617-542-2652.

source: Please send broken links and other web page suggestions to <a href="/people/webmeisters.html">The GNU Webmasters</a> at <a href="mailto:webmasters@gnu.org">webmasters@gnu.org</a>
fr: Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Verbatim copying and distribution of this entire article is permitted worldwide, without royalty, in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution int&eacute;grale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit pr&eacute;serv&eacute;e.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: C&eacute;dric Corazza.<br /> R&eacute;vision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Derni&egrave;re mise-&agrave;-jour&nbsp;:

source: Translations of this page
fr: <a href="/server/standards/README.translations.fr.html">Traductions</a> de cette page
