Repository: gitGNU/gnu_www-fr
Catalog: provide.*.po
Languages: fr

source: What we provide - GNU Project - Free Software Foundation (FSF)
fr: Ce que nous proposons - GNU Project - Free Software Foundation (FSF)

source: What's New
fr: Quoi de neuf&nbsp;?

source: What We Provide
fr: Ce que nous proposons

source: What the FSF provides to computer users, above all, is the chance to use a computer in freedom &mdash; using <a href="/philosophy/free-sw.html">free software</a>.
fr: Ce que la FSF propose avant tout aux utilisateurs d'ordinateurs, c'est la chance d'utiliser un ordinateur en toute libert&eacute; en utilisant des <a href="/philosophy/free-sw.fr.html">logiciels libres</a>.

source: Since 1985 the FSF has sponsored the development of the free software operating system <a href="/gnu/gnu-history.html">GNU</a>. The <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> variant of GNU is already widely used. The GNU/Hurd system, based on our <a href="/software/hurd/hurd.html">GNU Hurd</a> kernel, is ready for wizards and enthusiasts to try.
fr: Depuis 1985, la FSF a sponsoris&eacute; le d&eacute;veloppement du syst&egrave;me d'exploitation libre <a href="/gnu/gnu-history.fr.html">GNU</a>. La variante <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a> de GNU est d&eacute;j&agrave; largement utilis&eacute;e. Le syst&egrave;me GNU/Hurd, bas&eacute; sur notre noyau <a href="/software/hurd/hurd.html">GNU Hurd</a>, est pr&ecirc;t &agrave; &ecirc;tre essay&eacute; par les sorciers et les enthousiastes.

source: More concretely, the things you can obtain from the FSF include&hellip;
fr: Plus concr&egrave;tement, les choses que vous pouvez obtenir de la FSF sont&hellip;

source: <a href="http://directory.fsf.org/GNU/">Software</a>
fr: <a href="http://directory.fsf.org/GNU/">Logiciels</a>

source: <a href="/doc/doc.html">Documentation and books on free software philosophy</a>
fr: <a href="/doc/doc.html">Documentation et livres sur la philosophie du logiciel libre</a>

source: <a href="http://www.gnu.org/gear/gear.html">T-shirts and other GNU Gear</a>
fr: <a href="http://www.gnu.org/gear/gear.html">T-shirts et autres accessoires GNU</a>

source: There are various ways to get the software:
fr: Il existe plusieurs fa&ccedil;ons d'obtenir les logiciels&nbsp;:

source: <a href="/order/deluxe.html">Deluxe distributions</a>
fr: <a href="/order/deluxe.html">Distributions Deluxe</a>

source: <a href="http://order.fsf.org/">On-line order form</a>
fr: <a href="http://order.fsf.org/">Formulaire de commande en ligne</a>

source: <a href="/software/software.html#HowToGetSoftware">Other ways to get GNU Software</a>
fr: <a href="/software/software.fr.html#HowToGetSoftware">Autres moyens d'obtenir les logiciels GNU</a>

source: Please inquire about GNU by Email: <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>, Voice: +1-617-542-5942, or Fax: +1-617-542-2652.
fr: Vous pouvez vous renseigner sur GNU par courriel&nbsp;: <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>, téléphone&nbsp;: +1-617-542-5942 ou fax&nbsp;: +1-617-542-2652.

source: Please send broken links and other web page suggestions to <a href="/people/webmeisters.html">The GNU Webmasters</a> at <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution int&eacute;grale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit pr&eacute;serv&eacute;e

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: C&eacute;dric Corazza.<br /> R&eacute;vision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Derni&egrave;re mise-&agrave;-jour&nbsp;:

source: <a href="/server/standards/README.translations.html">Translations</a> of this page
fr: <a href="/server/standards/README.fr.translations.html">Traductions</a> de cette page
