Repository: gitGNU/gnu_www-fr
Catalog: education/misc/edu-misc.*.po
Languages: fr

source: Education Miscellaneous Materials - GNU Project - Free Software Foundation
fr: Documents divers sur l'éducation - Projet GNU - Free Software Foundation

source: Education Miscellaneous Materials
fr: Documents divers sur l'éducation

source: <a href="/education/edu-contents.html">Education Contents</a>
fr: <a href="/education/edu-contents.html">Table des matières</a>

source: <a href="/education/edu-cases.html">Case Studies</a>
fr: <a href="/education/edu-cases.html">Études de cas</a>

source: <a href="/education/edu-resources.html">Educational Resources</a>
fr: <a href="/education/edu-resources.html">Ressources pédagogiques</a>

source: <a href="/education/edu-projects.html">Education Projects</a>
fr: <a href="/education/edu-projects.html">Projets pédagogiques</a>

source: <a href="/education/edu-team.html">The Education Team</a>
fr: <a href="/education/edu-team.html">L'équipe éducation</a>

source: In these pages we keep various kinds of materials that we use in our Education pages such as pictures, transcriptions and translations of videos, and similar.
fr: Ces pages contiennent divers documents qui vont avec les pages de la section « Éducation » : images, transcriptions et traductions de vidéos, et autres documents du même genre.

source: Pictures
fr: Images

source: Case Studies
fr: Études de cas

source: Ambedkar Community Computer Center (AC3) - Bangalore - India
fr: Centre informatique communautaire Ambedkar (AC3) - Bangalore - Inde

source: RMS with Indian youth, jpeg <a href="/education/misc/ambedkar-sm.jpg">97 KB</a>, <a href="/education/misc/ambedkar.jpg">400 KB</a>
fr: RMS avec un jeune Indien, jpeg <a href="/education/misc/ambedkar-sm.jpg">97 KB</a>, <a href="/education/misc/ambedkar.jpg">400 KB</a>

source: Vocational Higher Secondary School Irimpanam (VHSS Irimpanam)
fr: Lycée professionnel d'Irimpanam (VHSS Irimpanam)

source: Students at a Free Software event, jpeg <a href="/education/misc/irimpanam-school-sm.jpg">65 KB</a>, <a href="/education/misc/irimpanam-school.jpg">245 KB</a>
fr: Élèves à une exposition sur le logiciel libre, <a href="/education/misc/irimpanam-school-sm.jpg">65 KB</a>, <a href="/education/misc/irimpanam-school.jpg">245 KB</a>

source: Tux Paint interface in Malayalam, jpeg <a href="/education/misc/tuxpaint-sm.jpg">46 KB</a>, <a href="/education/misc/tuxpaint.jpg">193 KB</a>
fr: Interface de Tux Paint en malayalam, jpeg <a href="/education/misc/tuxpaint-sm.jpg">46 KB</a>, <a href="/education/misc/tuxpaint.jpg">193 KB</a>

source: Software
fr: Logiciel

source: Tux Paint interface, jpeg, <a href="/education/misc/tuxpaint-start-sm.jpg">38 KB</a>, <a href="/education/misc/tuxpaint-start.jpg">100 KB</a>
fr: Interface de Tux Paint, <a href="/education/misc/tuxpaint-start-sm.jpg">38 KB</a>, <a href="/education/misc/tuxpaint-start.jpg">100 KB</a>

source: Tux Paint interface Italian, jpeg, <a href="/education/misc/tuxpaint-start-sm.it.jpg">70 KB</a>, <a href="/education/misc/tuxpaint-start.it.jpg">100 KB</a>
fr: Interface de Tux Paint en italien, jpeg, <a href="/education/misc/tuxpaint-start-sm.it.jpg">70 KB</a>, <a href="/education/misc/tuxpaint-start.it.jpg">100 KB</a>

source: Tux Paint interface in Malayalam with stamps, jpeg, <a href="/education/misc/tuxpaint-stamps-sm.jpg">65 KB</a>, <a href="/education/misc/tuxpaint-stamps.jpg">298 KB</a>
fr: Interface de Tux Paint en malayalam avec des tampons, jpeg, <a href="/education/misc/tuxpaint-stamps-sm.jpg">65 KB</a>, <a href="/education/misc/tuxpaint-stamps.jpg">298 KB</a>

source: Appooppanthaady flower, jpeg, <a href="/education/misc/appooppanthaady-sm.jpg">9 KB</a>, <a href="/education/misc/appooppanthaady.jpg">22 KB</a>
fr: Fleur <cite>Appooppanthaady</cite>, jpeg, <a href="/education/misc/appooppanthaady-sm.jpg">9 KB</a>, <a href="/education/misc/appooppanthaady.jpg">22 KB</a>

source: Anthoorium flower, jpeg, <a href="/education/misc/anthoorium-sm.jpg">7 KB</a>, <a href="/education/misc/anthoorium.jpg">25 KB</a>
fr: Fleur <cite>Anthoorium</cite>, <a href="/education/misc/anthoorium-sm.jpg">7 KB</a>, <a href="/education/misc/anthoorium.jpg">25 KB</a>

source: GCompris interface, jpeg <a href="/education/misc/gcompris-sm.jpg">44 KB</a>, <a href="/education/misc/gcompris.jpg">198 KB</a>
fr: Interface de GCompris, jpeg <a href="/education/misc/gcompris-sm.jpg">44 KB</a>, <a href="/education/misc/gcompris.jpg">198 KB</a>

source: Videos
fr: Vidéos

source: Richard Stallman on Education:
fr: Richard Stallman et l'éducation :

source: <a href="http://audio-video.gnu.org/video/rms-education-es.ogv"> Original in Spanish</a>, 20.7 MB.
fr: <a href="http://audio-video.gnu.org/video/rms-education-es.ogv">original en espagnol</a>, 20.7 MB.

source: With <a href="http://audio-video.gnu.org/video/rms-education-es-sub-en.ogv"> English Subtitles</a>, 19 MB.
fr: Avec des <a href="http://audio-video.gnu.org/video/rms-education-es-sub-en.ogv">sous-titres en anglais</a>, 19 MB.

source: How GIMP Changed Mani's Life - We Use GNU/Linux:
fr: Comment GIMP a changé la vie de Mani - Nous utilisons GNU/Linux :

source: <a href="http://audio-video.gnu.org/video/we_use_gnu-linux_low.ogv"> Low resolution</a>, 15 MB.
fr: <a href="http://audio-video.gnu.org/video/we_use_gnu-linux_low.ogv">Basse résolution</a>, 15 MB.

source: <a href="http://audio-video.gnu.org/video/we_use_gnu-linux_high.ogv"> High resolution</a>, 146 MB.
fr: <a href="http://audio-video.gnu.org/video/we_use_gnu-linux_high.ogv">Haute résolution</a>, 146 MB.

source: Video Transcriptions, Descriptions and Translations
fr: Transcriptions, descriptions et traductions de vidéos

source: Richard Stallman's video on education:
fr: Vidéo de Richard Stallman sur l'éducation :

source: <a href="/education/misc/rms-education-es-translation-to-pt-br.txt">Brazilian Portuguese</a> | <a href="/education/misc/rms-education-es-translation-to-en.txt">English</a> | <a href="/education/misc/rms-education-es-transcription.fr.txt">French</a> | <a href="/education/misc/rms-education-es-transcription.de.txt">German</a> | <a href="/education/misc/rms-education-es-transcription.it.txt">Italian</a> | <a href="/education/misc/rms-education-es-transcription.txt">Spanish</a> |
fr: <a href="/education/misc/rms-education-es-translation-to-pt-br.txt">portugais brésilien</a> | <a href="/education/misc/rms-education-es-translation-to-en.txt">anglais</a> | <a href="/education/misc/rms-education-es-transcription.fr.txt">français</a> | <a href="/education/misc/rms-education-es-transcription.de.txt">allemand</a> | <a href="/education/misc/rms-education-es-transcription.it.txt">italien</a> | <a href="/education/misc/rms-education-es-transcription.txt">espagnol</a> |

source: <a href="/education/misc/we_use_gnu-linux_description.en.txt">English</a> |
fr: <a href="/education/misc/we_use_gnu-linux_description.en.txt">anglais</a> | <a href="/education/misc/we_use_gnu-linux_description.fr.txt">français</a> |

source: Video Subtitles in SubRip Format
fr: Sous-titres de vidéos au format SubRip

source: <a href="/education/misc/rms-education-es-sub.pt-br.srt">Brazilian Portuguese</a> | <a href="/education/misc/rms-education-es-sub.en.srt">English</a> | <a href="/education/misc/rms-education-es-sub.pt.srt">European Portuguese</a> | <a href="/education/misc/rms-education-es-sub.de.srt">German</a> | <a href="/education/misc/rms-education-es-sub.it.srt">Italian</a> | <a href="/education/misc/rms-education-es-sub.es.srt">Spanish</a> |
fr: <a href="/education/misc/rms-education-es-sub.pt-br.srt">portugais brésilien</a> | <a href="/education/misc/rms-education-es-sub.en.srt">anglais</a> | <a href="/education/misc/rms-education-es-sub.pt.srt">portugais européen</a> | <a href="/education/misc/rms-education-es-sub.de.srt">allemand</a> | <a href="/education/misc/rms-education-es-sub.it.srt">italien</a> | <a href="/education/misc/rms-education-es-sub.es.srt">espagnol</a> | <a href="/education/misc/rms-education-es-sub.fr.srt">français</a> |

source: Freedom in Practice at Irimpanam School
fr: La liberté en pratique à l'école d'Irimpanam

source: <a href="/education/misc/irimpanam.en.srt">English</a>
fr: <a href="/education/misc/irimpanam.en.srt">anglais</a>

source: Pronunciation in Malayalam: Appooppanthaady flower, ogg. <a href="/education/misc/appooppanthady.ogg">35 KB</a>
fr: Prononciation en malayalam : fleur <cite>Appooppanthaady</cite>, ogg, <a href="/education/misc/appooppanthady.ogg">35 KB</a>

source: Pronunciation in Malayalam: Anthoorium flower, ogg, <a href="/education/misc/anthoorium.ogg">42 KB</a>
fr: Prononciation en malayalam : fleur <cite>Anthoorium</cite>, ogg, <a href="/education/misc/anthoorium.ogg">42 KB</a>.

source: Pronunciation in Malayalam: Adeenia flower, ogg, <a href="/education/misc/adeenia.ogg">30 KB</a>
fr: Prononciation en malayalam : fleur <cite>Adeenia</cite>, ogg, <a href="/education/misc/adeenia.ogg">30 KB</a>.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF.

source: Please send broken links and other corrections or suggestions to <a href="mailto:education@gnu.org">&lt;education@gnu.org&gt;</a>.
fr: Veuillez indiquer (en anglais) les liens orphelins et autres corrections ou suggestions à <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Nous faisons le maximum pour proposer des traductions fidèles et de bonne qualité, mais nous ne sommes pas parfaits. Merci d'adresser vos commentaires sur cette page, ainsi que vos suggestions d'ordre général sur les traductions, à <a href="mailto:web-translators@gnu.org"> &lt;web-translators@gnu.org&gt;</a>.</p> <p>Pour tout renseignement sur la coordination et la soumission des traductions de nos pages web, reportez-vous au <a href="/server/standards/README.translations.html">guide de traduction</a>.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
fr: Cette page peut être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States</a>.

source: Updated:
fr: Dernière mise à jour&nbsp;:
