<?xml version="1.0" encoding="utf-8" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr">

<head>
<title>Ressources de d&eacute;veloppement GNU - GNU Project - Free Software Foundation (FSF)</title>
<meta http-equiv="content-type" content='text/html; charset=utf-8' />
<link rel="stylesheet" type="text/css" href="/gnu.css" />
<link rev="made" href="webmasters@gnu.org" />
</head>

<!-- This document is in XML, and xhtml 1.0 -->
<!-- Please make sure to properly nest your tags -->
<!-- and ensure that your final document validates -->
<!-- consistent with W3C xhtml 1.0 and CSS standards -->
<!-- See validator.w3.org -->

<body>

<p><a href="#translations">Traductions</a> de cette page</p>

<h4>Table des Mati&egrave;res</h4>

<ul>
  <li><a href="devel.html#Introduction"
       name="TOCIntroduction">Introduction</a>
  <li><a href="devel.html#CVS" name="TOCCVS">CVS et Savannah</a>
  <li><a href="devel.html#LoginAccounts"
       name="TOCLoginAccounts">Comptes de Connexion</a>
  <li><a href="devel.html#MailLists" name="TOCMailLists">Listes d'Exp&eacute;dition</a>
  <li><a href="devel.html#WebServer" name="TOCWebServer">Serveur Web</a>
  <li><a href="devel.html#FTP" name="TOCFTP">FTP</a>
</ul>

<h4><a href="devel.html#TOCIntroduction" name="Introduction">Introduction</a></h4>

<p>
Cette page d&eacute;crit les services de d&eacute;veloppement disponibles pour les
d&eacute;veloppeurs GNU sur les machines du Projet GNU. Si vous souhaitez utiliser
un de ces services pour le d&eacute;veloppement d'un paquetage GNU, veuillez contactez
l'adresse indiqu&eacute;e pour le service particulier. Pour les d&eacute;tails complets
sur les privil&egrave;ges et responsabilit&eacute;s d'un mainteneur GNU, veuillez voir les
<a href="/prep/maintain_toc.html">Informations pour les mainteneurs des documents GNU</a>
.  (Les <a href="/prep/standards_toc.html">Normes de la Programmation GNU</a>
peuvent &eacute;galement &ecirc;tre d'int&eacute;r&ecirc;t.)
</p>
<p>
Avec l'abondance d'ordinateurs peu co&ucirc;teux qui peuvent faire tourner
<a href="/gnu/linux-and-gnu.html">GNU/Linux</a>, ainsi qu'avec des acc&egrave;s Internet
toujours plus accessibles, beaucoup de volontaires GNU ont aujourd'hui
les installations informatiques dont ils ont besoin.
Cependant,ily a encore plus d'avantages &agrave; avoir des serveurs
o&ugrave; les volontaires peuvent travailler ensemble sans devoir rendre leurs
propres machines accessibles aux autres.
</p>
<p>
Pour cette raison, la F&eacute;d&eacute;ration du Logiciel Libre (FSF) encourage les projets
de logiciel GNU &agrave; utiliser les machines &agrave; <code>gnu.org</code> comme plaque tournante.
L'utilisation de ces machines b&eacute;n&eacute;fie aussi au Projet GNU indirectement, en augmentant
la conscience publique de GNU, et en &eacute;tendant l'id&eacute;e de travailler en
commun pour le b&eacute;n&eacute;fice de chacun.
</p>

<h4><a href="devel.html#TOCCVS" name="CVS">CVS et Savannah</a></h4>

<p>
Nous fournissons des acc&egrave;s CVS pour beaucoup de paquetage GNU; si vous
d&eacute;veloppez un paquetage GNU et que vous voulez garder le d&eacute;p&ocirc;t sur les
machines de <em>gnu.org</em>, <a href="http://savannah.gnu.org/">Savannah</a>
offre une fa&ccedil;on facile de le cr&eacute;er et manager. Premi&egrave;rement
<a href="https://savannah.gnu.org/account/register.php">cr&eacute;ez votre
compte</a> et ensuite <a href="http://savannah.gnu.org/register/">enregistrer
votre paquetage GNU</a>. Apr&egrave;s quelques heures le d&eacute;p&ocirc;t CVS sera cr&eacute;&eacute;.
Vous pourrez &eacute;crire dessus et manager vous-m&ecirc;me la liste des
personnes qui y auront acc&egrave;s en &eacute;criture.
</p>
<p>
Un certain nombre de projets <a href="http://savannah.gnu.org/search/index.php?type_of_search=soft&words=%%%">emploient d&eacute;j&agrave;</a> Savannah dans ce but.
</p>


<h4><a href="devel.html#TOCLoginAccounts"
name="LoginAccounts">Comptes de Connexion</a></h4>

<p>
Nous donnons acc&egrave;s aux machines de GNU aux personnes qui en ont besoin
pour travailler sur les logiciels GNU.  Avoir un compte est &agrave; la fois un privil&egrave;ge
et une responsabilit&eacute;, et il doit &ecirc;tre utilis&eacute; uniquement pour votre travail
sur GNU. Veuillez lire les <a href="README.accounts.html">m&eacute;thodes d'acc&egrave;s
aux machines de GNU</a> afin d'obtenir un compte.
</p>

<h4><a href="devel.html#TOCMailLists" name="MailLists">Listes d'Exp&eacute;dition</a></h4>

<p>
Nous g&eacute;rons des listes d'exp&eacute;dition pour les paquetages de logiciels GNU comme n&eacute;cessaire,
incluant &agrave; la fois une gestion manuelle et une automatique.
</p>
<p>
Lorsqu'un paquetage GNU est enregistr&eacute; sur <a href="http://savannah.gnu.org/">Savannah</a>, une interface web autorise les d&eacute;veloppeurs &agrave; cr&eacute;er et
manager les listes d'exp&eacute;dition attach&eacute;es &agrave; ce paquetage.
</p>
<p>
Si, pour quelques raisons, enregistrer le paquetage GNU sur Savannah n'est pas
impossible ou souhaitable, demandez &agrave; <a
href="mailto:new-mailing-list@gnu.org"><em>new-mailing-list@gnu.org</em></a>
de cr&eacute;er des listes pour vous, ou cr&eacute;er les vous-m&ecirc;me si vous &ecirc;tes s&ucirc;r
de savoir comment faire.
</p>
<p>
En g&eacute;n&eacute;ral, chaque paquetage de logiciel GNU devrait poss&eacute;der une liste
de rapport de bug avec le nom canonique <code>bug-<em>name</em>@gnu.org</code>,
ainsi que d'autres alias qui peuvent &ecirc;tre utiles.  Certains paquetages partagent
la liste <code>bug-gnu-utils@gnu.org</code> mais nous encourageons dor&eacute;navant
aux paquetages d'ouvrir leurs propres listes.
</p>
<p>
Les paquetages peuvent obtenir d'autres listes pour faire des annonces, demander
de l'aide, poster un code source en relation, discuter entre utilisateurs, ou
tout ce que le mainteneur du paquetage pense &ecirc;tre utile.
</p>
<p>
Les archives des listes d'exp&eacute;dition, pour les listes g&eacute;r&eacute;es automatiquement, sont disponible &agrave;
<a href="http://mail.gnu.org/">http://mail.gnu.org</a>, ainsi qu'&agrave; travers
le manageur de liste.  Les archives pour les listes g&eacute;r&eacute;es manuellement sont
g&eacute;n&eacute;ralement garder dans <code>/com/archive</code> sur les machines de GNU.
</p>
<p>
Lorsqu'une liste d'exp&eacute;dition devient assez grande pour la justifier, nous pouvons ouvrir
un newsgroup <code>gnu.*</code> avec un acc&egrave;s bi-directionnel &agrave; la liste d'exp&eacute;dition.
</p>

<h4><a href="devel.html#TOCWebServer" name="WebServer">Serveur Web</a></h4>

<p>
Notre serveur web principal est adress&eacute; &agrave; <a
href="http://www.gnu.org/">http://www.gnu.org/</a>, et a des <a
href="/server/list-mirrors.html">miroirs</a> &agrave; travers le monde.  Nous
aimerions h&eacute;berger sur ce serveur les pages d'&agrave; peu pr&egrave;s tous
les paquetages de logiciel GNU.
</p>
<p>
La machine qui sert de serveur pour le site <code>www.gnu.org</code> est
s&eacute;par&eacute; du reste des machines de GNU. Les sites sont stock&eacute;s dans un d&eacute;p&ocirc;t CVS
sur <code>subversions.gnu.org</code>. Tout mainteneur de paquetage GNU
enregistr&eacute; sur <a href="http://savannah.gnu.org/">Savannah</a> est
garant de l'acc&eacute;s en &eacute;criture dans le r&eacute;pertoire <code>/software/package</code>.
Pour voir un exemple, sur comment y acc&eacute;der, <a
href="http://savannah.gnu.org/cvs/?group_id=2">examinez la page CVS
du paquetage GNU mifluz</a>.
</p>

<h4><a href="devel.html#TOCFTP" name="FTP">FTP</a></h4>

<p>
Nous pouvont aussi fournir un site FTP pour chaque paquetage de lociciel GNU
sur <a
href="http://ftp.gnu.org/"><code>http://ftp.gnu.org/</code></a>, qui poss&egrave;de
<a href="/order/ftp.html">des miroirs &agrave; travers le monde</a>.
</p>
<p>
Nous utilisons un serveur diff&eacute;rent pour les r&eacute;alisations de test,
de sorte que les visiteurs ne les installent pas, pensant qu'elles sont pr&ecirc;tes
pour une premi&egrave;re utilisation.
. Ce serveur est 
<a href="ftp://alpha.gnu.org/"><code>ftp://alpha.gnu.org/</code></a>.
</p>
<p>
Le document des <a
href="/prep/maintain_toc.html">Informations pour les mainteneurs GNU</a>
a des d&eacute;tails complets sur la proc&eacute;dure d'envoi vers le FTP.
</p>

<hr />

<!-- All pages on the GNU web server should have the section about    -->
<!-- verbatim copying.  Please do NOT remove this without talking     -->
<!-- with the webmasters first. --> 
<!-- Please make sure the copyright date is consistent with the document -->
<!-- and that it is like this "2001, 2002" not this "2001-2002." -->

<div class="translations">
<p><a id="translations"></a>
<b>Traductions de cette page</b>:<br />

<!-- Please keep this list alphabetical, and in the original -->
<!-- language if possible, otherwise default to English -->
<!-- If you do not have it English, please comment what the -->
<!-- English is.  If you add a new language here, please -->
<!-- advise web-translators@gnu.org and add it to -->
<!--    - in /home/www/bin/nightly-vars either TAGSLANG or WEBLANG -->
<!--    - in /home/www/html/server/standards/README.translations.html -->
<!--      one of the lists under the section "Translations Underway" -->
<!--    - if there is a translation team, you also have to add an alias -->
<!--      to mail.gnu.org:/com/mailer/aliases -->
<!-- Please also check you have the 2 letter language code right versus -->
<!--     http://www.w3.org/WAI/ER/IG/ert/iso639.htm -->

[
  <a href="provide.sq.html">Albanian</a>	<!-- Albanian -->
| <a href="provide.cn.html">&#x7b80;&#x4f53;&#x4e2d;&#x6587;</a>	<!-- Chinese (Simplified) -->
| <a href="provide.zh.html">&#x7e41;&#x9ad4;&#x4e2d;&#x6587;</a>	<!-- Chinese (Traditional) -->
| <a href="provide.cs.html">&#x010c;esky</a>	<!-- Czech -->
| <a href="provide.html">English</a>
| <a href="provide.es.html">Espa&#x00f1;ol</a>	<!-- Spanish -->
| <a href="provide.fr.html">Fran&#x00e7;ais</a>	<!-- French -->
| <a href="provide.pt.html">Portugu&#x0ea;s</a>	<!-- Portuguese -->
]
</p>
</div>

<div class="copyright">
  <p>Retourner &agrave; la  <a href="http://www.gnu.org/home.html">page d'accueil du projet GNU</a>.</p>
  <p>Veuillez envoyer vos questions sur la FSF &amp; GNU :<a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Autres <a href="/home.fr.html#ContactInfo">moyens pour contacter</a> la FSF.<br />
     Veuillez envoyer les liens morts, corrections et suggestions &agrave; <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
  </p>
  <p>Copyright &copy; 1996, 1997, 1998, 1999, 2000, 2001, 2003, 2004 Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110, USA<br />
     La reproduction exacte et la distribution int&eacute;grale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit pr&eacute;serv&eacute;e.
  </p>
  <p>Derni&egrave;re mise-&agrave;-jour : <!-- timestamp start -->$Date$ Author: Arnaud Le Saux $<!-- timestamp end --></p>
                      <!-- MAJ faite avec la version anglaise du : Date: 2005/07/05 19:35:32 , Author: johnsu01 -->
</div>

</body>
</html>
