Repository: gitGNU/gnu_www-fr
Catalog: software/reliability.*.po
Languages: fr

source: Free Software is More Reliable! - GNU Project - Free Software Foundation (FSF)
fr: Le logiciel libre est plus fiable&nbsp;! - GNU Project - Free Software Foundation (FSF)

source: Free Software is More Reliable!
fr: Le logiciel libre est plus fiable&nbsp;!

source: Apologists for <a href="/philosophy/categories.html#ProprietarySoftware">proprietary software</a> like to say, &ldquo;<a href="/philosophy/free-sw.html">free software</a> is a nice dream, but we all know that only the proprietary system can produce reliable products. A bunch of hackers just can't do this.&rdquo;
fr: Ceux qui font l'apologie du <a href="/philosophy/categories.fr.html#ProprietarySoftware">logiciel propri&eacute;taire</a> aiment dire, &laquo;&nbsp;le <a href="/philosophy/free-sw.fr.html">logiciel libre</a> est un beau r&ecirc;ve, mais nous savons tous que seul un syst&egrave;me propri&eacute;taire peut produire des produits fiables. Un groupe de hackers ne peut faire la m&ecirc;me chose&nbsp;&raquo;.

source: Empirical evidence disagrees, however; scientific tests, described below, have found GNU software to be <em>more</em> reliable than comparable proprietary software.
fr: Cependant, l'&eacute;vidence empirique ne concorde pas, des tests scientifiques ont montr&eacute; que le logiciel libre est <em>plus</em> fiable qu'un logiciel propri&eacute;taire comparable.

source: This should not be a surprise; there are good reasons for the high reliability of GNU software, good reasons to expect free software will often (though not always) have high reliability.
fr: Cela ne devrait pas &ecirc;tre une surprise. Il y a de bonnes raisons pour la haute fiabilit&eacute; des logiciels GNU, de bonne raisons de s'attendre &agrave; ce que le logiciel libre aura souvent (bien que pas toujours) une haute fiabilit&eacute;.

source: GNU Utilities Safer!
fr: Les logiciels GNU plus s&ucirc;rs&nbsp;!

source: Barton P. Miller and his colleagues tested the reliability of Unix utility programs in 1990 and 1995. Each time, GNU's utilities came out considerably ahead. They tested seven commercial Unix systems as well as GNU. By subjecting them to a random input stream, they could &ldquo;crash (with core dump) or hang (infinite loop) over 40% (in the worst case) of the basic utility programs&hellip;&rdquo;
fr: Barton P. Miller et ses coll&egrave;gues ont test&eacute; la fiabilit&eacute; des programmes utilitaires Unix en 1990 et 1995. Chaque fois, les utilitaires GNU arriv&egrave;rent en t&ecirc;te de fa&ccedil;on consid&eacute;rable. Ils test&egrave;rent sept syst&egrave;mes Unix commerciaux ainsi que le syst&egrave;me GNU. En leur soumettant un flux d'entr&eacute;es al&eacute;atoires, ils ont pu &laquo;&nbsp;planter (avec un core dump) ou bloquer (boucle infinie) plus de 40% (dans le pire des cas) des programmes utilitaires de base&hellip;&nbsp;&raquo;

source: These researchers found that the commercial Unix systems had a failure rate that ranged from 15% to 43%. In contrast, the failure rate for GNU was only 7%.
fr: Ces chercheurs trouv&egrave;rent que les syst&egrave;mes Unix commerciaux avaient un taux d'&eacute;chec de 15% &agrave; 43%. Par contraste, le taux d'&eacute;chec pour le syst&egrave;me GNU &eacute;tait seulement de 7%.

source: Miller also said that, &ldquo;the three commercial systems that we compared in both 1990 and 1995 noticeably improved in reliability, but still had significant rates of failure (the basic utilities from GNU/Linux still were noticeably better than those of the commercial systems).&rdquo;
fr: Miller disait &eacute;galement&nbsp;: &laquo;&nbsp;les trois syst&egrave;mes commerciaux que nous avons compar&eacute;s, &agrave; la fois en 1990 et en 1995, se sont am&eacute;lior&eacute;s sensiblement en fiabilit&eacute;, mais ils ont toujours des taux d'&eacute;chec significatifs (les utilitaires de base de GNU/Linux &eacute;taient toujours sensiblement meilleurs que les utilitaires des syst&egrave;mes commerciaux)&nbsp;&raquo;.

source: Why Free Software is More Reliable
fr: Pourquoi le logiciel libre est plus fiable

source: It is no fluke that the GNU utilities are so reliable. There are good reasons why free software tends to be of high quality.
fr: Ce n'est pas le fait du hasard si les utilitaires de GNU sont si fiables. Il y a de bonnes raisons pour lesquelles le logiciel libre tend vers un tr&egrave;s haut niveau de qualit&eacute;.

source: One reason is that free software gets the whole community involved in working together to fix problems. Users not only report bugs, they even fix bugs and send in fixes. Users work together, conversing by email, to get to the bottom of a problem and make the software work trouble-free.
fr: Une raison est que le logiciel libre b&eacute;n&eacute;ficie des efforts de l'ensemble de la communaut&eacute; qui travaille dans le but de corriger les probl&egrave;mes. Les utilisateurs ne se contentent pas seulement de signaler les bogues, mais ils les corrigent aussi et envoient leurs corrections. Les utilisateurs travaillent ensemble, communiquant par l'interm&eacute;diaire du courrier &eacute;lectronique, pour venir &agrave; bout des probl&egrave;mes et rendent le travail avec les logiciels plus serein.

source: Another is that developers really care about reliability. Free software packages do not always compete commercially, but they still compete for a good reputation, and a program which is unsatisfactory will not achieve the popularity that developers hope for. What's more, an author who makes the source code available for all to see puts his reputation on the line, and had better make the software clean and clear, on pain of the community's disapproval.
fr: Une autre raison est que les d&eacute;veloppeurs se soucient vraiment de la fiabilit&eacute;. Les paquetages de logiciels libres ne cherchent pas toujours la comp&eacute;tition sur le march&eacute;, mais ils se battent toujours pour une bonne r&eacute;putation, et un programme qui n'est pas satisfaisant ne r&eacute;ussira pas &agrave; obtenir la popularit&eacute; que ses concepteurs veulent lui donner. Qui plus est, un auteur qui met son code source &agrave; la disposition de tous met sa r&eacute;putation en jeu, et il vaudrait mieux pour lui que son logiciel soit propre et &eacute;l&eacute;gant, sous peine de subir le m&eacute;contentement de la communaut&eacute;.

source: Cancer Clinic Relies on Free Software!
fr: La Clinique du cancer fait confiance aux logiciels libres&nbsp;!

source: According to Dr. G.W. Wettstein <a href="mailto:greg@wind.rmcc.com"> &lt;greg@wind.rmcc.com&gt;</a>:
fr: Selon le Dr. G.W. Wettstein <a href="mailto:greg@wind.rmcc.com">&lt;greg@wind.rmcc.com&gt;</a>&nbsp;:

source: The proper care of our cancer patients would not be what it is today without [GNU/]Linux &hellip; The tools that we have been able to deploy from free software channels have enabled us to write and develop innovative applications which &hellip; do not exist through commercial avenues.
fr: &laquo;&nbsp;le soin apport&eacute; &agrave; nos patients atteints de cancer ne serait pas ce qu'il est aujourd'hui sans [GNU]/Linux&hellip; Les outils que nous avons &eacute;t&eacute; capables de d&eacute;ployer &agrave; partir de logiciels libres nous ont permis d'&eacute;crire et de d&eacute;velopper des applications innovantes qui &hellip; ne peuvent exister &agrave; partir de voies commerciales&nbsp;&raquo;.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Frédéric Couchet.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
