Repository: gitGNU/gnu_www-fr
Catalog: software/software.*.po
Languages: fr

source: Software - GNU Project - Free Software Foundation
fr: Logiciels - GNU Project - Free Software Foundation

source: Download GNU
fr: Téléchargez GNU

source: Download distributions
fr: Téléchargez des distributions

source: GNU and Linux
fr: GNU et Linux

source: <span class="highlight">If you're looking for a whole system to install, see our <a href="/distros/free-distros.html">list of GNU/Linux distributions which are entirely free software</a>.</span>
fr: <span class="highlight">Si vous cherchez à installer un système complet, consultez notre <a href="/distros/free-distros.html">liste de distributions GNU/Linux qui sont entièrement libres</a>.</span>

source: If you're looking for a whole system to install, see our <a href="/distros/free-distros.html">list of GNU/Linux distributions which are entirely free software</a>.
fr: Si vous cherchez à installer un système complet, consultez notre <a href="/distros/free-distros.fr.html">liste de distributions GNU/Linux qui sont entièrement libres</a>.

source: To look for individual free software packages, both <acronym title="GNU's Not Unix!">GNU</acronym> and non-GNU, please see the <a href="http://directory.fsf.org/">Free Software Directory</a>: a categorized, searchable database of free software. The Directory is actively maintained by the <a href="http://www.fsf.org/">Free Software Foundation</a> and includes links to program home pages where available, as well as entries for <a href="http://directory.fsf.org/wiki/GNU/">all GNU packages</a>. Another list of <a href="#allgnupkgs">all GNU packages</a> is below. <a href="/doc/doc.html">Free software documentation links</a> are listed separately.
fr: Pour chercher des paquetages de logiciels libres, <acronym title="GNU's Not Unix!">GNU</acronym> et non-GNU, veuillez consulter le <a href="http://directory.fsf.org/">répertoire des logiciels libres</a>&nbsp;: une base de données classée en catégories, de logiciels libres. Le répertoire est activement maintenu par la <a href="http://www.fsf.org/">Fondation pour le logiciel libre</a> et comprend des liens vers les pages d'accueil des programmes quand celles-ci existent, ainsi que des entrées vers <a href="http://directory.fsf.org/wiki/GNU/">tous les paquetages GNU</a>. Une autre liste de <a href="#allgnupkgs">tous les paquetages GNU </a> se trouve ci-dessous. Les <a href="/doc/doc.html">liens vers la documentation des logiciels libres</a> sont listés séparément.

source: We also maintain a list of <a href="http://www.fsf.org/campaigns/priority.html">high-priority free software projects</a>. Please help with these projects if you can. For other ways to contribute to GNU, including taking over unmaintained GNU packages and helping with development, see the <a href="/help/help.html">GNU help wanted</a> page.
fr: Nous maintenons également une liste de <a href="http://www.fsf.org/campaigns/priority.html">projets de logiciels libres de haute priorité</a>. Veuillez aider ces projets si vous le pouvez. Pour d'autres moyens de contribuer à GNU, consultez la page GNU <a href="/help/help.html">on cherche de l'aide</a>.

source: If you are developing a GNU package, or you are thinking of starting, you may be interested in <a href="/software/devel.html">GNU Software Developer Resources</a>. If you'd like to make your software an official GNU package, see the <a href="/help/evaluation.html">evaluation information and submission form</a>. For information on the licenses used for GNU software, and on other free software licenses, see our <a href="/licenses/licenses.html">Licenses</a> page.
fr: Si vous développez un paquetage GNU, ou si vous pensez commencer à le faire, vous serez peut-être intéressé par les <a href="/software/devel.html">Ressources développeurs pour les logiciels GNU</a>. Si vous voulez faire de votre logiciel un paquetage GNU officiel, veuillez consulter le <a href="/help/evaluation.html">formulaire des informations d'évaluation et de soumission</a>. Pour des informations sur les licences utilisées pour les logiciels <acronym title="GNU's Not Unix!">GNU</acronym>, et sur les autres licences de logiciels libres, veuillez consulter notre page des <a href="/licenses/licenses.fr.html">Licences</a>.

source: Finally, here is <a href="/software/for-windows.html">a short list of free software for Microsoft Windows</a>, for the Windows user who would like to try free software.
fr: Enfin, voici une <a href="/software/for-windows.html">courte liste de logiciels libres pour Microsoft Windows</a>, pour les utilisateurs de Windows qui veulent essayer des logiciels libres.

source: How to get GNU software
fr: Comment obtenir des logiciels GNU

source: GNU software is available by several different methods:
fr: Les logiciels GNU peuvent être obtenus de différentes manières&nbsp;:

source: <a href="/order/ftp.html">Download it from the web or via FTP</a>: we provide source code for all GNU software, free of charge. (Please also make a <a href="/help/donate.html">donation</a> to the FSF, if you can, to help us write more free software.)
fr: <a href="/order/ftp.html">En les obtenant par <acronym title="File Transfer Protocol">FTP</acronym></a>&nbsp;: nous fournissons le code source pour tous les logiciels GNU, gratuitement. (Veuillez faire aussi un <a href="/help/donate.html">don</a> à la FSF, si vous le pouvez, pour nous aider à écrire plus de logiciels libres).

source: Get a copy from a friend. (Likewise please make a donation if you can.)
fr: En obtenant une copie par un ami. (De même, veuillez faire un don si vous le pouvez).

source: Download a <a href="/distros/free-distros.html">wholly free GNU/Linux distribution</a>.
fr: En téléchargeant une <a href="/distros/free-distros.html">distribution GNU/Linux entièrement libre</a>.

source: Buy a computer with a wholly free GNU/Linux system preinstalled from <a href="/links/companies.html">one of the companies</a> that offers this.
fr: En achetant un ordinateur avec un système GNU/Linux totalement libre préinstallé chez <a href="/links/companies.fr.html">une de ces sociétés</a> qui peut offrir cela.

source: Get the development sources for a package and build them, to help with development. Many GNU packages keep their development sources at the GNU hosting site <a href="http://savannah.gnu.org/">savannah.gnu.org</a>. Some packages use other source repositories, or have none at all. Each package's web pages should give the specifics.
fr: Récupérez les sources de développement pour un paquetage et construisez-les pour aider au développement. De nombreux paquetages GNU font héberger leurs sources par le site de GNU <a href="http://savannah.gnu.org/">savannah.gnu.org</a>. Certains paquetages utilisent d'autres dépôts de sources ou n'en ont pas du tout. Chaque page Web des paquetages devrait donner leurs spécificitép.

source: <a name="allgnupkgs" id="allgnupkgs">All GNU packages</a>
fr: <a name="allgnupkgs" id="allgnupkgs">Tous les paquetages GNU</a>

source: Here is a list of all current GNU packages, using their package identifiers (rather than long names) for brevity, and sorted alphabetically. If you have corrections to or questions about this list, please email <a href="mailto:maintainers@gnu.org">&lt;maintainers@gnu.org&gt;</a>.
fr: Voici une liste de tous les paquetages GNU actuels, qui utilisent leur propre identifiant de paquetage (plutôt que des noms longs) pour des questions de brièveté, et rangés dans l'ordre alphabétique. Si vous avez des corrections ou des questions concernant cette liste, merci d'envoyer un message électroniqueà <a href="mailto:maintainers@gnu.org">&lt;maintainers@gnu.org&gt;</a>.

source: There are also comprehensive lists of <a href="/manual/manual.html">documentation for GNU packages</a> (arranged by category), and <a href="/graphics/package-logos.html">GNU package logos</a>.
fr: Il existe aussi des listes de <a href="/manual/manual.html">documentation pour des paquetages GNU</a> (arrangé par catégories), et de <a href="/graphics/package-logos.html">logos de paquetage GNU</a>.

source: Decommissioned GNU packages
fr: Paquetages GNU déclassés

source: GNU packages are occasionally decommissioned, generally because they've been superseded by, or integrated into, other packages. If you have time and interest in resurrecting any of these, please contact &lt;<tt>maintainers@gnu.org</tt>&gt;. Here is the list; we leave the old project pages up (when they existed): <a href="aroundme/">aroundme</a>, <a href="gnu3dkit/">3dkit</a>, <a href="abcsh/">abcsh</a>, <a href="awacs/">awacs</a>, <a href="cfs-el/">cfs-el</a>, <a href="checker/">checker</a>, <a href="cons/">cons</a>, <a href="dgs/">dgs</a> (display&nbsp;ghostscript), <a href="dld/">dld</a>, <a href="http://directory.fsf.org/project/DrGenius/">dr.genius</a>, <a href="elib/">elib</a>, <a href="ffp/">ffp</a>, <a href="fhp/">fhp</a>, <a href="free/">free&nbsp;(gnu.free)</a>, <a href="gcron/">gcron</a> (see <a href="mcron/">mcron</a>), <a href="gfe/">gfe</a>, <a href="http://directory.fsf.org/GNU/ggv.html">ggv</a> (see <a href="gv/">gv</a>), <a href="http://www.ideacode.com//assets/gicqd/">gicqd</a>, <a href="http://directory.fsf.org/project/giptables/">giptables</a>, <a href="http://directory.fsf.org/project/gnochive/">gnochive</a>, gnotary, <a href="http://directory.fsf.org/project/gnotepad/">gnotepad+</a>, gnubios, gnucad, <a href="gnufi/">gnufi</a>, gnupedia (see <a href="http://wikipedia.org">wikipedia</a>), <a href="gnusql">gnusql</a>, <a href="gnustep-db/">gnustep-db</a>, <a href="gnuts/">gnuts</a>, <a href="goose/">goose</a>, <a href="gphoto/">gphoto</a>, <a href="graphics/">graphics</a>, grover, <a href="gtkeditor/">gtkeditor</a>, <a href="gtkeyboard/">gtkeyboard</a>, <a href="guss/">guss</a>, <a href="hegemonie/">hegemonie</a>, <a href="lengualibre">lengualibre</a>, leonardo, libopts (see <a href="autogen/">autogen</a>), mana, <a href="messenger/">messenger</a>, <a href="mgcp/">mgcp</a>, <a href="mll2html/">mll2html</a>, <a href="obst/">obst</a>, <a href="octal/">octal</a>, p2c, <a href="patchwork/">patchwork</a>, <a href="pips/">pips</a>, <a href="poc/">poc</a>, <a href="rat/">rat</a>, <a href="songanizer/">songanizer</a>, <a href="sweater/">sweater</a>, <a href="toutdoux/">toutdoux</a>, <a href="webpublish/">webpublish</a>, <a href="xbase/">xbase</a>, <a href="xinfo/">xinfo</a>, <a href="xmhtml/">xmhtml</a>, <a href="zebra/">zebra</a>.
fr: De temps en temps, des paquetages GNU sont déclassés, généralement parce qu'ils sont périmés ou qu'ils ont été intégrés dans d'autres paquetages. Si vous avez du temps et si vous êtes intéressàs pour les ressusciter, merci de contacter &lt;<tt>maintainers@gnu.org</tt>&gt;. Voici une liste&nbsp;; nous conservons les anciennes pages des projets (quand elles existent)&nbsp;: <a href="aroundme/">aroundme</a>, <a href="gnu3dkit/">3dkit</a>, <a href="abcsh/">abcsh</a>, <a href="awacs/">awacs</a>, <a href="cfs-el/">cfs-el</a>, <a href="checker/">checker</a>, <a href="cons/">cons</a>, <a href="dgs/">dgs</a> (afficher&nbsp;ghostscript), <a href="dld/">dld</a>, <a href="http://directory.fsf.org/project/DrGenius/">dr.genius</a>, <a href="elib/">elib</a>, <a href="ffp/">ffp</a>, <a href="fhp/">fhp</a>, <a href="free/">free&nbsp;(gnu.free)</a>, <a href="gcron/">gcron</a> (voir <a href="mcron/">mcron</a>), <a href="gfe/">gfe</a>, <a href="http://directory.fsf.org/GNU/ggv.html">ggv</a> (see <a href="gv/">gv</a>), <a href="http://www.ideacode.com//assets/gicqd/">gicqd</a>, <a href="http://directory.fsf.org/project/giptables/">giptables</a>, <a href="http://directory.fsf.org/project/gnochive/">gnochive</a>, gnotary, <a href="http://directory.fsf.org/project/gnotepad/">gnotepad+</a>, gnubios, gnucad, <a href="gnufi/">gnufi</a>, gnupedia (see <a href="http://wikipedia.org">wikipedia</a>), <a href="gnusql">gnusql</a>, <a href="gnustep-db/">gnustep-db</a>, <a href="gnuts/">gnuts</a>, <a href="goose/">goose</a>, <a href="gphoto/">gphoto</a>, <a href="graphics/">graphics</a>, grover, <a href="gtkeditor/">gtkeditor</a>, <a href="gtkeyboard/">gtkeyboard</a>, <a href="guss/">guss</a>, <a href="hegemonie/">hegemonie</a>, <a href="lengualibre">lengualibre</a>, leonardo, libopts (see <a href="autogen/">autogen</a>), mana, <a href="messenger/">messenger</a>, <a href="mgcp/">mgcp</a>, <a href="mll2html/">mll2html</a>, <a href="obst/">obst</a>, <a href="octal/">octal</a>, p2c, <a href="patchwork/">patchwork</a>, <a href="pips/">pips</a>, <a href="poc/">poc</a>, <a href="rat/">rat</a>, <a href="songanizer/">songanizer</a>, <a href="sweater/">sweater</a>, <a href="toutdoux/">toutdoux</a>, <a href="webpublish/">webpublish</a>, <a href="xbase/">xbase</a>, <a href="xinfo/">xinfo</a>, <a href="xmhtml/">xmhtml</a>, <a href="zebra/">zebra</a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.

source: Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
fr: Cette page peut-être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:
