Repository: gitGNU/gnu_www-fr
Catalog: philosophy/sco/sco-v-ibm.*.po
Languages: fr

source: FSF Statement on SCO v. IBM
fr: D&eacute;claration de la FSF sur le proc&egrave;s SCO contre IBM

source: FSF Statement on SCO v. IBM lawsuit
fr: D&eacute;claration de la FSF sur le proc&egrave;s SCO contre IBM

source: SCO, IBM, GPL, infringement, violation, FSF, GNU, Linux, freedom, software
fr: SCO, IBM, GPL, infraction, violation, FSF, GNU, Linux, liberté, logiciel

source: FSF Statement on <cite>SCO v. IBM</cite>
fr: D&eacute;claration de la FSF sur le proc&egrave;s <cite>SCO contre IBM</cite>

source: by <strong>Eben Moglen</strong>
fr: par <strong>Eben Moglen</strong>

source: June 25, 2003
fr: le 25 juin 2003

source: The lawsuit brought by the SCO Group against IBM has generated many requests for comment by FSF. The Foundation has refrained from making official comments on the litigation because only the plaintiff's allegations have been reported; comment on unverified allegations would ordinarily be premature. More disturbing than the lawsuit itself, however, have been public statements by representatives of SCO, which have irresponsibly suggested doubts about the legitimacy of free software overall. These statements require response.
fr: Le proc&egrave;s engag&eacute; par le groupe SCO contre IBM a provoqu&eacute; beaucoup de demandes de r&eacute;actions de la FSF. La Fondation s'est abstenue de faire des commentaires officiels sur le proc&egrave;s car seules les all&eacute;gations du plaignant sont connues; r&eacute;agir sur des all&eacute;gations non v&eacute;rifi&eacute;es serait pr&eacute;matur&eacute;. Ce qui est plus g&ecirc;nant que le proc&egrave;s lui-m&ecirc;me, cependant, ce sont les d&eacute;clarations publiques des repr&eacute;sentants de SCO, qui ont, de mani&egrave;re irresponsable, distill&eacute; des doutes sur la l&eacute;galit&eacute; du logiciel libre en g&eacute;n&eacute;ral. Ces d&eacute;clarations n&eacute;cessitent une r&eacute;ponse.

source: SCO's lawsuit asserts that IBM has breached contractual obligations between the two companies, and also that IBM has incorporated trade secret information concerning the design of the Unix operating system into what SCO calls generally &ldquo;Linux.&rdquo; This latter claim has recently been expanded in extra-judicial statements by SCO employees and officers to include suggestions that &ldquo;Linux&rdquo; includes material copied from Unix in violation of SCO's copyrights. An allegation to this effect was contained in letters apparently sent by SCO to 1500 of the world's largest companies warning against use of free software on grounds of possible infringement liability.
fr: La plainte de SCO repose sur l'affirmation que IBM a rompu ses obligations contractuelles entre les deux soci&eacute;t&eacute;s et a introduit des informations couvertes par le secret commercial concernant la conception du syst&egrave;me d'exploitation Unix dans ce que SCO appelle globalement &laquo;Linux&raquo;. Cette derni&egrave;re revendication a r&eacute;cemment &eacute;t&eacute; &eacute;tendue par les d&eacute;clarations, hors proc&eacute;dure, d'employ&eacute;s et de cadres de SCO pour y inclure des sous-entendus indiquant que &laquo;&nbsp;Linux&nbsp;&raquo; contiendrait du code copi&eacute; &agrave; partir d'Unix en violation des copyrights de SCO. Une all&eacute;gation de ce genre &eacute;tait pr&eacute;sente dans des lettres envoy&eacute;es apparemment par SCO &agrave; 1500 des plus grandes soci&eacute;t&eacute;s dans le monde, les alertant sur la possibilit&eacute; de violation de copyright en utilisant des logiciels libres.

source: It is crucial to clarify certain confusions that SCO's spokesmen have shown no disposition to dispel. In the first place, SCO has used &ldquo;Linux&rdquo; to mean &ldquo;all free software,&rdquo; or &ldquo;all free software constituting a Unix-like operating system.&rdquo; This confusion, which the Free Software Foundation warned against in the past, is here shown to have the misleading consequences the Foundation has often predicted. &ldquo;Linux&rdquo; is the name of the kernel most often used in free software systems. But the operating system as a whole contains many other components, some of them products of the Foundation's GNU Project, others written elsewhere and published under free software licenses; the totality is GNU, the free operating system on which we have been working since 1984. Approximately half GNU's components are copyrighted works of the Free Software Foundation, including the C-compiler GCC, the GDB debugger, the C library Glibc, the bash shell, among other essential parts. The combination of GNU and the Linux kernel produces the GNU/Linux system, which is widely used on a variety of hardware and which <em>taken as a whole</em> duplicates the functions once only performed by the Unix operating system.
fr: Il est crucial de clarifier certaines confusions que les porte-paroles de SCO n'&eacute;taient pas dispos&eacute;s &agrave; dissiper. Tout d'abord, SCO a utilis&eacute; &laquo;&nbsp;Linux&nbsp;&raquo; pour dire &laquo;&nbsp;tous les logiciels libres&nbsp;&raquo;, ou &laquo;&nbsp; tous les logiciels libres constituant un syst&egrave;me d'exploitation de type Unix&nbsp;&raquo;. Cette confusion, qu'avait soulev&eacute; la Free Software Foundation par le pass&eacute;, r&eacute;v&egrave;le ici les cons&eacute;quences f&acirc;cheuses qu'avait souvent pr&eacute;dit la Fondation. &laquo;&nbsp;Linux&nbsp;&raquo; est le nom du noyau le plus souvent utilis&eacute; dans les syst&egrave;mes d'exploitation libres. Mais le syst&egrave;me d'exploitation dans son ensemble contient beaucoup d'autres composants, certains d'entre eux provenant du Projet GNU de la Fondation, d'autres ont &eacute;t&eacute; &eacute;crits par ailleurs et publi&eacute;s sous des licences de logiciel libre&nbsp;; l'ensemble est GNU, le syst&egrave;me d'exploitation libre sur lequel nous travaillons depuis 1984. Environ la moiti&eacute; des composants GNU sont sous copyright de la Free Software Foundation, y compris le compilateur C GCC, le d&eacute;bogueur GDB, la biblioth&egrave;que C Glibc, le shell bash, entre autres composants essentiels. La combinaison de GNU et du noyau Linux produit le syst&egrave;me GNU/Linux, qui est largement utilis&eacute; sur une grande vari&eacute;t&eacute; de mat&eacute;riel et qui <cite>pris dans son ensemble</cite> r&eacute;alise les m&ecirc;mes fonctions qui furent autrefois r&eacute;alis&eacute;es uniquement par le syst&egrave;me d'exploitation Unix.

source: SCO's confusing use of names makes the basis of its claims unclear: has SCO alleged that trade secrets of Unix's originator, AT&amp;T&mdash;of which SCO is by intermediate transactions the successor in interest&mdash;have been incorporated by IBM in the kernel, Linux, or in parts of GNU? If the former, there is no justification for the broad statements urging the Fortune 1500 to be cautious about using free software, or GNU programs generally. If, on the other hand, SCO claims that GNU contains any Unix trade secret or copyrighted material, the claim is almost surely false. Contributors to the GNU Project promise to follow the Free Software Foundation's rules for the project, which specify&mdash;among other things&mdash;that contributors must not enter into non-disclosure agreements for technical information relevant to their work on GNU programs, and that they must not consult or make any use of source code from non-free programs, including specifically Unix. The Foundation has no basis to believe that GNU contains any material about which SCO or anyone else could assert valid trade secret or copyright claims. Contributors could have made misrepresentations of fact in their copyright assignment statements, but failing willful misrepresentation by a contributor, which has never happened so far as the Foundation is aware, there is no significant likelihood that our supervision of the freedom of our free software has failed. The Foundation notes that despite the alarmist statements SCO's employees have made, the Foundation has not been sued, nor has SCO, despite our requests, identified any work whose copyright the Foundation holds-including all of IBM's modifications to the kernel for use with IBM's S/390 mainframe computers, assigned to the Foundation by IBM&mdash;that SCO asserts infringes its rights in any way.
fr: La confusion dans l'utilisation de ces noms de SCO, rend sa revendication floue&nbsp;: est-ce que SCO pr&eacute;tend que les secrets commerciaux du cr&eacute;ateur d'Unix, AT&amp;T &mdash;&nbsp;dont SCO est par l'interm&eacute;diaire de transactions, le successeur b&eacute;n&eacute;ficiaire&nbsp;&mdash; ont &eacute;t&eacute; introduits par IBM dans le noyau, Linux, ou dans des parties de GNU&nbsp;? Dans le premier cas, il n'y a aucune justification pour ces d&eacute;clarations pressant les 1500 soci&eacute;t&eacute;s du classement de Fortune, d'&ecirc;tre prudentes quant &agrave; l'utilisation de logiciels libres, ou des programmes GNU plus g&eacute;n&eacute;ralement. Si, d'autre part, SCO revendique que GNU contient des secrets commerciaux d'Unix ou du code sous copyright, il est pratiquement s&ucirc;r que la revendication est fausse. Les contributeurs du Projet GNU ont promis de suivre les r&egrave;gles de la Free Software Foundation pour le projet, qui sp&eacute;cifient &mdash;&nbsp;entre autres choses&nbsp;&mdash; que les contributeurs ne doivent pas violer les accords de non-divulgation pour les informations techniques ayant un rapport avec leur travaux sur les programmes GNU, et ils ne doivent pas consulter ou faire usage de code source provenant de programmes non-libres, y compris, et sp&eacute;cifiquement Unix. La Fondation n'a pas de raison de croire que GNU contienne du code pour lequel SCO, ou quiconque, pourrait revendiquer des secrets commerciaux ou des copyrights valides. Les contributeurs auraient pu travestir les faits dans leurs d&eacute;clarations de cession de copyright, mais &agrave; d&eacute;faut de travestissement volontaire par un contributeur, ce qui n'est jamais arriv&eacute; depuis que la Fondation en est consciente, il n'y a pas de probabilit&eacute; significative que notre contr&ocirc;le de la libert&eacute; de nos logiciels libres ait &eacute;chou&eacute;. La Fondation remarque, qu'en d&eacute;pit des d&eacute;clarations alarmistes qu'ont fait les employ&eacute;s de SCO, la Fondation n'a pas &eacute;t&eacute; poursuivie, pas plus que SCO, en d&eacute;pit de nos requ&ecirc;tes, n'a identifi&eacute; d'&oelig;uvre dont le copyright est d&eacute;tenue par la Fondation &mdash;&nbsp;y compris toutes les modifications d'IBM sur le noyau pour l'utilisation sur les ordinateurs centraux S/390 d'IBM, c&eacute;d&eacute;s &agrave; la Fondation par IBM&nbsp;&mdash; et qui violeraient, ainsi que l'affirme SCO, ses droits d'une quelconque mani&egrave;re que ce soit.

source: Moreover, there are straightforward legal reasons why SCO's assertions concerning claims against the kernel or other free software are likely to fail. As to its trade secret claims, which are the only claims actually made in the lawsuit against IBM, there remains the simple fact that SCO has for years distributed copies of the kernel, Linux, as part of GNU/Linux free software systems. Those systems were distributed by SCO in full compliance with GPL, and therefore included complete source code. So SCO itself has continuously published, as part of its regular business, the material which it claims includes its trade secrets. There is simply no legal basis on which SCO can claim trade secret liability in others for material it widely and commercially published itself under a license that specifically permitted unrestricted copying and distribution.
fr: De plus, il y a des raisons purement juridiques, qui font que les assertions de SCO concernant les revendications sur le noyau ou d'autres logiciels libres, &eacute;choueront probablement. Quant aux revendications de secrets commerciaux, qui sont en fait les seules revendications faites dans le proc&egrave;s contre IBM, il demeure le simple fait que SCO a distribu&eacute; pendant des ann&eacute;es des copies du noyau, Linux, comme composant des syst&egrave;mes d'exploitation libres GNU/Linux. Ces syst&egrave;mes ont &eacute;t&eacute; distribu&eacute;s par SCO, en totale conformit&eacute; avec la GPL, et par cons&eacute;quent, y &eacute;taient inclus le code source complet. Donc, SCO elle-m&ecirc;me, a distribu&eacute; sans discontinuer, comme partie int&eacute;grante de son commerce habituel, le mat&eacute;riel dont il revendique qu'il comprend ses secrets commerciaux. Il n'y a tout simplement pas de fondement juridique sur lequel SCO puisse revendiquer la responsabilit&eacute; d'autres, pour le mat&eacute;riel qu'elle a publi&eacute; largement et de fa&ccedil;on commerciale elle-m&ecirc;me, sous une licence qui permet sp&eacute;cifiquement la copie et la distribution illimit&eacute;e.

source: The same fact stands as an irrevocable barrier to SCO's claim that &ldquo;Linux&rdquo; violates SCO's copyright on Unix source code. Copyright, as the United States Supreme Court has repeatedly emphasized, covers <em>expressions</em>, not <em>ideas</em>. Copyright on source code covers not how a program works, but only the specific language in which the functionality is expressed. A program written from scratch to express the function of an existing program in a new way does not infringe the original program's copyright. GNU and Linux duplicate some aspects of Unix functionality, but are independent bodies, not copies of existing expressions. But even if SCO could show that some portions of its Unix source code were copied into the kernel, the claim of copyright infringement would fail, because SCO has itself distributed the kernel under GPL. By doing so, SCO licensed everyone everywhere to copy, modify, and redistribute that code. SCO cannot now turn around and argue that it sold people code under GPL, guaranteeing their right to copy, modify and redistribute anything included, but that it somehow did not license the copying and redistribution of any copyrighted material of their own which that code contained.
fr: Le m&ecirc;me fait demeure, telle une barri&egrave;re irr&eacute;vocable, pour la revendication de SCO sur le fait que &laquo;&nbsp;Linux&nbsp;&raquo; violerait le copyright de SCO sur le code source d'Unix. Le copyright, ainsi que l'a pr&eacute;cis&eacute; &agrave; plusieurs reprises la Cour supr&ecirc;me des &Eacute;tats-Unis, s'applique aux <cite>expressions</cite>, non aux <cite>id&eacute;es</cite>. Le copyright sur le code source ne couvre pas la mani&egrave;re dont fonctionne un programme, mais seulement le langage sp&eacute;cifique dans lequel la fonctionnalit&eacute; est formul&eacute;e. Un programme &eacute;crit &agrave; partir de rien pour formuler la fonction d'un programme existant d'une nouvelle mani&egrave;re, n'enfreint pas le copyright du programme original. GNU et Linux reproduisent quelques aspects de la fonctionnalit&eacute; d'Unix, mais sont des entit&eacute;s ind&eacute;pendantes, non des copies d'expressions existantes. Mais m&ecirc;me si SCO pouvait montrer que des portions de son code source d'Unix &eacute;taient copi&eacute;es dans le noyau, la revendication de violation de copyright &eacute;chouerait, car SCO a elle-m&ecirc;me distribu&eacute; le noyau sous la GPL. En faisant cela, SCO a permis &agrave; quiconque, o&ugrave; qu'il se trouve, ce copier, modifier et redistribuer ce code. SCO ne peut pas &agrave; pr&eacute;sent faire volte-face et dire qu'elle a vendu aux gens du code sous la GPL, garantissant leur droit de copier, modifier et redistribuer tout ce qui &eacute;tait contenu, mais que d'une fa&ccedil;on ou d'une autre, cela ne permettait pas de copier et de redistribuer toute partie &eacute;tant sous copyright leur appartenant, pr&eacute;sente dans le code.

source: In the face of these facts, SCO's public statements are at best misleading and irresponsible. SCO has profited handily from the work of free software contributors throughout the world. Its current public statement constitute a gross abuse of the principles of the free software community, by a participant who has employed all our work for its own economic benefit. The Free Software Foundation calls upon SCO to retract its ill-advised and irresponsible statements, and to proceed immediately to separate its commercial disagreements with IBM from its obligations and responsibilities to the free software community.
fr: Au vu de ces faits, les d&eacute;clarations publiques de SCO sont au mieux trompeuses et irresponsables. SCO a profit&eacute; commod&eacute;ment du travail des contributeurs de logiciels libres de par le monde. Sa d&eacute;claration publique actuelle constitue un abus grossier des principes de la communaut&eacute; du logiciel libre, par un acteur qui a utilis&eacute; tout notre travail pour son b&eacute;n&eacute;fice &eacute;conomique propre. La Free Software Foundation en appelle &agrave; SCO pour retirer ses d&eacute;clarations peu judicieuses et irresponsables, et de proc&eacute;der imm&eacute;diatement &agrave; la s&eacute;paration de ses d&eacute;saccords commerciaux avec IBM, de ses obligations envers la communaut&eacute; du logiciel libre.

source: <em> Eben Moglen is General Counsel to FSF, and serves on its board of directors. </em>
fr: <em>Eben Moglen est le Conseiller g&eacute;n&eacute;ral de la FSF, et si&egrave;ge &agrave; son conseil d'administration</em>

source: <a href="/philosophy/sco/sco.html">Other Texts to Read related to SCO</a>.
fr: <a href="/philosophy/sco/sco.fr.html">Autres textes à lire relatifs à SCO</a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying of this article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
