Repository: gitGNU/gnu_www-fr
Catalog: philosophy/sco/sco-without-fear.*.po
Languages: fr

source: SCO: Without Fear and Without Research
fr: SCO&nbsp;: sans peur et sans recherche

source: by <strong>Eben Moglen</strong>
fr: par <strong>Eben Moglen</strong>

source: Monday 24 November 2003
fr: Lundi 24 novembre 2003

source: There's a traditional definition of a shyster: a lawyer who, when the law is against him, pounds on the facts; when the facts are against him, pounds on the law; and when both the facts and the law are against him, pounds on the table. The SCO Group's continuing attempts to increase its market value at the expense of free software developers, distributors and users through outlandish legal theories and unsubstantiated factual claims show that the old saying hasn't lost its relevance.
fr: Voici la d&eacute;finition traditionnelle d'un avocat v&eacute;reux&nbsp;: un juriste qui, quand la loi est contre lui, mart&egrave;le les faits&nbsp;; quand les faits sont contre lui, mart&egrave;le la loi; et quand les faits et la loi sont tous deux contre lui, il mart&egrave;le du poing sur la table. Les tentatives du groupe SCO pour accro&icirc;tre ses parts de march&eacute; au d&eacute;triment des d&eacute;veloppeurs de logiciels libres, des distributeurs et des utilisateurs au travers de th&eacute;ories juridiques fumeuses et de r&eacute;clamations fallacieuses montrent que le vieil adage n'a pas perdu de sa valeur.

source: Just The Facts
fr: Les faits

source: SCO continues to claim in public statements about its lawsuit against IBM that it can show infringement of its copyrights in Unix Sys V source code by the free software operating system kernel called Linux. But on the one occasion when SCO has publicly shown what it claimed were examples of code from Linux taken from Unix Sys V, its demonstration backfired, showing instead SCO's cavalier attitude toward copyright law and its even greater sloppiness at factual research.
fr: Le groupe SCO continue &agrave; clamer publiquement dans ses proc&eacute;dures judiciaires contre IBM qu'il peut montrer les violations de ses droits sur le code source d'Unix Sys V par le noyau nomm&eacute; Linux, d'un syst&egrave;me d'exploitation libre. Mais lors de l'occasion o&ugrave; le groupe SCO a montr&eacute; publiquement ce qu'il revendiquait comme &eacute;tant des exemples de code Linux tir&eacute;s de Unix Sys V, sa d&eacute;monstration a tourn&eacute; court, en d&eacute;montrant plut&ocirc;t son attitude cavali&egrave;re envers la loi sur le copyright et m&ecirc;me sa propre incurie en guise de recherche de faits.

source: On August 18, 2003, SCO's CEO, Darl McBride, offered a slide presentation of supposed examples of infringing literal copying from Sys V to Linux at a public speech in Las Vegas. Within hours the free software and open source communities had analyzed SCO's supposed best evidence, and the results were not encouraging for those investors and others who hope SCO knows what it is talking about.<a href="#foot17">[1]</a>
fr: Le 18 ao&ucirc;t 2003, le PDG de SCO, Darl McBride, a donn&eacute; une conf&eacute;rence de presse &agrave; Las Vegas o&ugrave; il a montr&eacute; des transparents sens&eacute;s contenir des exemples de plagiats flagrants de Sys V par Linux. En quelques heures, les communaut&eacute;s du logiciel libre et de &laquo;&nbsp;l'open source&nbsp;&raquo; ont analys&eacute; la pr&eacute;tendue meilleure preuve de SCO et les r&eacute;sultats ne furent pas encourageants pour les investisseurs et ceux qui esp&eacute;raient que SCO savait de quoi il parlait.<a href="#foot17">[1]</a>

source: In Las Vegas Mr.&nbsp;McBride offered two examples of code from the Linux program that were supposedly copied from Sys V. The first implements the &ldquo;Berkeley Packet Filter&rdquo; (BPF) firewall. Indeed, the Linux kernel program contains a BPF implementation, but it is the original work of Linux developer Jay Schulist. Nor did SCO ever hold an ownership interest in the original BPF implementation, which as the very name shows was originally part of BSD Unix, and which was copied, perfectly legally, into SCO's Sys V Unix from BSD. Because the BPF implementations in Sys V and Linux have a common intellectual ancestor and perform the same function, SCO's &ldquo;pattern-matching&rdquo; search of the two code bases turned up an apparent example of copying. But SCO didn't do enough research to realize that the work they were claiming was infringed wasn't their own (probably because they had &ldquo;carelessly&rdquo; removed the original copyright notice).
fr: &Agrave; Las Vegas Mr&nbsp;McBride a montr&eacute; deux exemples de code Linux suppos&eacute;s copi&eacute;s &agrave; partir de Sys V. Le premier impl&eacute;mente le pare-feu &laquo;&nbsp;Berkeley Packet Filter&nbsp;&raquo;. Effectivement, le noyau Linux contient une impl&eacute;mentation de BPF, mais c'est le travail original d'un d&eacute;veloppeur de Linux, Jay Schulist. En outre, SCO n'a jamais eu le moindre droit de propri&eacute;t&eacute; sur l'impl&eacute;mentation originelle de BPF, qui comme son nom m&ecirc;me l'indique, fait partie de BSD Unix, et qui fut copi&eacute;, tout &agrave; fait l&eacute;galement, d'Unix BSD dans le Sys V de SCO. Comme les impl&eacute;mentations de BPF par Linux et par Sys V ont une origine intellectuelle commune et comme ils remplissent la m&ecirc;me fonction, la recherche de SCO utilisant la &laquo;&nbsp;co&iuml;ncidence de mod&egrave;le&nbsp;&raquo; sur les deux bases de code a cru trouver un exemple apparent de plagiat. Mais SCO n'a pas effectu&eacute; suffisamment de recherches pour s'apercevoir que le travail qu'ils revendiquaient comme plagi&eacute; n'&eacute;tait pas le leur, probablement parce qu'ils avaient supprim&eacute; &laquo;&nbsp;par m&eacute;garde&nbsp;&raquo; la mention de copyright originelle.

source: Mr.&nbsp;McBride's second example was only slightly less unconvincing. Mr McBride showed several dozen lines of memory allocation code from &ldquo;Linux,&rdquo; which was identical to code from Sys V. Once again, however, it turned out that SCO had relied on &ldquo;pattern-matching&rdquo; in the source code without ascertaining the actual history and copyright status of the work as to which it claimed ownership and infringement. The C code shown in the slides was first incorporated in Unix Version 3, and was written in 1973; it descends from an earlier version published by Donald Knuth in his classic <cite>The Art of Computer Programming</cite> in 1968. AT&amp;T claimed this code, among other portions of its Unix OS, as infringed by the University of California in the BSD litigation, and was denied a preliminary injunction on the ground that it could not show a likelihood of success on its copyright claim, because it had published the code without copyright notices and therefore, under pre-1976 US copyright law, had put the code in the public domain. In 2002, SCO's predecessor Caldera released this code again under a license that permitted free copying and redistribution. Silicon Graphics, Inc. (SGI) then used the code in the variant of the Linux program for &ldquo;Trillium&rdquo; 64-bit architecture computers it was planning to sell but never shipped. In incorporating the code, SGI violated the terms of Caldera's license by erroneously removing Caldera's (incorrect) copyright notice.
fr: Le second exemple de M. McBride fut &agrave; peine plus convaincant. M. McBride a montr&eacute; plusieurs douzaines de lignes de code d'allocation de m&eacute;moire provenant de Linux, qui &eacute;taient identiques au code provenant de Sys V. Encore une fois, il est apparu que le groupe SCO avait r&eacute;alis&eacute; une recherche par &laquo;&nbsp;co&iuml;ncidence de mod&egrave;le&nbsp;&raquo; sur le code source sans se pr&eacute;occuper de l'historique et du statut actuel des droits sur le travail dont il revendique la propri&eacute;t&eacute; et le plagiat. Le code en langage C montr&eacute; dans les transparents, &eacute;crit en 1973, fut d'abord incorpor&eacute; dans Unix version 3&nbsp;; il provient d'une version pr&eacute;c&eacute;dente publi&eacute;e par Donald Knuth dans son classique <em>The Art of Computer Programming</em> en 1968. AT&amp;T a attaqu&eacute; l'Universit&eacute; de Caroline pour plagiat de ce code, ainsi que d'autres portions de code de leur Unix, lors du litige sur BSD. AT&amp;T fut d&eacute;bout&eacute; en premi&egrave;re instance sur le fait que le code a &eacute;t&eacute; publi&eacute; sans mention de copyright et par cons&eacute;quent, selon la loi sur le copyright pr&eacute;c&eacute;dant 1976, plac&eacute; dans le domaine public. En 2002, Caldera, le pr&eacute;d&eacute;cesseur de SCO, a publi&eacute; une version sous une licence qui permettait la copie et la libre redistribution. Silicon Graphics, Inc. (SGI) a utilis&eacute; par la suite ce code dans une variante du programme Linux pour &laquo;&nbsp;Trillium&nbsp;&raquo;, une architecture 64 bits qu'il &eacute;tait pr&eacute;vu de commercialiser mais qui ne l'a jamais &eacute;t&eacute;. En incorporant ce code, SGI a viol&eacute; les termes de la licence Caldera en supprimant par erreur la mention de copyright (incorrecte) de Caldera.

source: Thus SCO's second example was of supposedly impermissible copying of code that was in the public domain to begin with, and which SCO itself had released under a free software license after erroneously claiming copyright. SGI had complicated matters by improperly removing the inaccurate copyright notice. So how many PCs and Intel-architecture servers around the world contained this supposedly infringing code? Zero. <em>No version of the Linux program for Intel architectures had ever contained it.</em> No SGI hardware for which this code was written ever shipped. HP, which sells 64-bit Itanium servers, has removed the code from the IA-64 branch of the Linux code tree; it was technically redundant anyway. But SCO's research went no farther than discovering a supposed instance of &ldquo;copying,&rdquo; without asking whether SCO had any rights in what had been copied, and certainly without providing the audience to whom it was speaking any indication that the &ldquo;Linux&rdquo; it was talking about was a variant for rare computers from which the supposedly-offending code had already been removed.
fr: Ainsi, le second exemple de SCO &eacute;tait une copie suppos&eacute;e interdite de code tomb&eacute; dans le domaine public pour commencer, et que SCO lui-m&ecirc;me avait publi&eacute; sous une licence de logiciel libre apr&egrave;s avoir par erreur revendiqu&eacute; le copyright. SGI a compliqu&eacute; les choses en supprimant inconsid&eacute;r&eacute;ment la mention de copyright inexacte. Combien de PC et de serveurs &agrave; architecture Intel autour du monde contiennent ce code suppos&eacute; plagi&eacute;&nbsp;? Z&eacute;ro. <em>Aucune version de programme Linux pour architecture Intel n'en a jamais contenu</em>. Aucun mat&eacute;riel SGI pour lequel ce code a &eacute;t&eacute; &eacute;crit n'a &eacute;t&eacute; vendu. HP, qui a vendu des serveurs 64-bit Itanium, a supprim&eacute; le code de la branche IA-64 de l'arbre du code Linux. Il &eacute;tait par ailleurs techniquement redondant. Mais les recherches de SCO n'all&egrave;rent pas suffisamment loin pour d&eacute;couvrir plus qu'une suppos&eacute;e instance de copie, sans m&ecirc;me se demander si SCO avait le moindre droit sur ce qui avait &eacute;t&eacute; copi&eacute;. De plus SCO n'a donn&eacute; &agrave; personne la moindre indication sur le &laquo;&nbsp;Linux&nbsp;&raquo; dont il &eacute;tait question&nbsp;: une variante d&eacute;di&eacute; &agrave; de rares ordinateurs pour qui le code suppos&eacute; litigieux avait d&eacute;j&agrave; &eacute;t&eacute; supprim&eacute;.

source: What the Las Vegas &ldquo;examples&rdquo; actually demonstrated was that SCO's factual claims were irresponsibly inflated when they weren't being kept artfully &ldquo;secret.&rdquo; With the facts running against them even when the facts were of their own choosing, it was unsurprising that after August SCO turned to the law. But the law was not on their side either.
fr: Ce que les exemples de Las Vegas ont effectivement montr&eacute; est que les revendications factuelles de SCO avaient &eacute;t&eacute; mont&eacute;es en &eacute;pingle de mani&egrave;re irresponsable quand elles n'ont pas &eacute;t&eacute; gard&eacute;es artificiellement secr&egrave;tes. Avec des faits qui se retournaient contre eux, m&ecirc;me quand ils &eacute;taient choisis par eux, il n'est pas &eacute;tonnant qu'apr&egrave;s ao&ucirc;t, SCO se soit tourn&eacute; vers la loi. Mais la loi n'&eacute;tait pas de leur c&ocirc;t&eacute; non plus.

source: Making Up the Law
fr: La loi

source: SCO's legal situation contains an inherent contradiction. SCO claims, in the letters it has sent to large corporate users of free software and in public statements demanding that that users of recent versions of the kernel take licenses, that the Linux program contains material over which SCO holds copyright. It also has brought trade secret claims against IBM, alleging that IBM contributed material covered by non-disclosure licenses or agreements to the Linux kernel. But it has distributed and continues to distribute Linux under GPL. It has therefore published its supposed trade secrets and copyrighted material, under a license that gives everyone permission to copy, modify, and redistribute. If the GPL means what it says, SCO loses its trade secret lawsuit against IBM, and cannot carry out its threats against users of the Linux kernel.
fr: L&eacute;galement, la situation de SCO est intrins&egrave;quement contradictoire. Publiquement et dans une lettre largement diffus&eacute;e chez les utilisateurs de logiciels libres en entreprise, SCO demande &agrave; ce que chaque utilisateur des r&eacute;centes versions du noyau ach&egrave;te une licence, parce que Linux contiendrait des &eacute;l&eacute;ments dont SCO d&eacute;tiendrait les droits (copyright). Si la licence GPL signifie bien ce qu'elle dit, SCO a perdu sa proc&eacute;dure contre IBM pour pratiques commerciales d&eacute;loyales et ne pourra pas mettre &agrave; ex&eacute;cution ses menaces contre les utilisateurs du noyau Linux.

source: But if the GPL is not a valid and effective copyright permission, by what right is SCO distributing the copyrighted works of Linux's contributors, and the authors of all the other copyrighted software it currently purports to distribute under GPL? IBM's counterclaim against SCO raises that question with respect to IBM's contributions to the Linux kernel. Under GPL section 6, no redistributor of GPL'd code can add any terms to the license; SCO has demanded that parties using the Linux kernel buy an additional license from it, and conform to additional terms. Under GPL section 4, anyone who violates GPL automatically loses the right to distribute the work as to which it is violating. IBM therefore rightly claims that SCO has no permission to distribute the kernel, and is infringing not only its copyrights, but those of all kernel contributors. Unless SCO can show that the GPL is a valid form of permission, and that it has never violated that permission's terms, it loses the counterclaim, and should be answerable in damages not only to IBM but to all kernel contributors.
fr: Et si la licence GPL ne constitue pas une permission de &laquo;&nbsp;copyright&nbsp;&raquo; valide, de quel droit SCO distribue-t-il le travail publi&eacute; sous licence GPL de tous les contributeurs de Linux et de tous les auteurs de programmes prot&eacute;g&eacute;s par la m&ecirc;me licence&nbsp;? La contre-attaque d'IBM &eacute;l&egrave;ve le d&eacute;bat en regard de la contribution d'IBM au noyau Linux. D'apr&egrave;s la section 6 de la licence GPL, aucun redistributeur de code plac&eacute; sous la licence GPL ne peut ajouter de termes &agrave; la licence. Or SCO a demand&eacute; &agrave; ce que tous les utilisateurs du noyau Linux ach&egrave;tent une licence additionnelle conform&eacute;ment aux termes ajout&eacute;s &agrave; la licence GPL. D'apr&egrave;s la section 4 de la licence GPL, quiconque viole la licence GPL perd automatiquement le droit de redistribution du code qui a fait l'objet de cette violation. C'est pourquoi IBM r&eacute;torque &agrave; juste titre que SCO n'a aucune autorisation pour distribuer le noyau, que non seulement elle viole ses droits, mais aussi ceux de tous les contributeurs du noyau. &Agrave; moins que SCO ne puisse montrer, d'une part que la GPL constitue une forme d'autorisation valide et que d'autre part elle n'a jamais viol&eacute; les termes de cette autorisation, elle perd la contre-attaque&nbsp;: IBM et tous les contributeurs du noyau sont en droit d'exiger des dommages et int&eacute;r&ecirc;ts.

source: IBM's counterclaim painted SCO into a corner on the subject of the GPL. Not only the facts but also the law are now fundamentally against SCO's increasingly desperate position. SCO and its predecessor, Caldera, have benefited enormously from the protections of the GPL. Thanks to the GPL, SCO has been able, for example, to use the invaluable work of compiler designers and implementers around the world who have made GCC the premier cross-platform C compiler. Customer applications run on SCO's Sys V Unix because of GCC, to which SCO contributed modifications particular to its system, and for which it assigned copyright to the Free Software Foundation. Caldera and SCO could not have marketed a usable operating system product without the contributions of the free software community. SCO was happy to take the benefits, but it has unethically sought to avoid its responsibilities. The law does not permit SCO to have it both ways.
fr: Cette riposte d'IBM a renvoy&eacute; SCO dans ses cordes sur le sujet de la licence GPL. Non seulement les faits, mais aussi la loi sont fondamentalement contre SCO et aggravent sa position d&eacute;j&agrave; d&eacute;sesp&eacute;r&eacute;e. SCO et son pr&eacute;d&eacute;cesseur, Caldera, ont &eacute;norm&eacute;ment b&eacute;n&eacute;fici&eacute; des protections de la licence GPL. Gr&acirc;ce &agrave; la GPL, SCO a pu, par exemple, utiliser le travail d'une valeur incalculable de tous les concepteurs et impl&eacute;menteurs de compilateur du monde entier, qui ont fait de GCC le premier compilateur C multi-plateforme. Les applications tournent sous l'Unix Sys V de SCO gr&acirc;ce &agrave; GCC, pour qui SCO a contribu&eacute; par des modifications sp&eacute;cifiques &agrave; son syst&egrave;me et pour qui elle a abandonn&eacute; ses droits &agrave; la Free Software Foundation (FSF). Caldera et SCO n'auraient pas pu commercialiser un syst&egrave;me d'exploitation sans les contributions de la communaut&eacute; des logiciels libres. Le groupe SCO &eacute;tait content d'en tirer profit, mais il a honteusement cherch&eacute; &agrave; fuir ses responsabilit&eacute;s. La loi ne permet pas ce double-jeu.

source: So now it has become time for SCO and its lawyers to pound the table. SCO's response to IBM's counterclaim has been a round of absurd attacks on the GPL, its users, and its author, the Free Software Foundation. The GPL, SCO's answer to IBM's counterclaim alleges, violates not just federal statutes but also the United States Constitution. How a private copyright holder can violate the US Constitution by giving others permission to copy, modify and redistribute its work SCO does not deign to say. Legal theories aren't secrets; if SCO's lawyers had anything to offer in support of this novel proposition, they would offer it. Not one case decided in the long history of US copyright affords support to this ridiculous conception of an unconstitutional copyright license. No lawyer of my reasonably broad acquaintance, no matter what his or her view of the GPL may be, takes this moonshine seriously. After failing on the facts, failing on the law, and raising no more than derisive laughter from pounding the table, even the proverbial shyster is out of luck. What will we see next from SCO, an attack on the umpire?
fr: Ainsi le temps est venu pour SCO et ses avocats de taper du poing sur la table. La r&eacute;ponse de SCO &agrave; la riposte d'IBM fut une suite d'attaques absurdes contre la licence GPL, ses utilisateurs et son auteur, la Free Software Foundation. D'apr&egrave;s SCO et pour r&eacute;pondre aux arguments d'IBM, la licence GPL viole non seulement les lois f&eacute;d&eacute;rales, mais aussi la Constitution des &Eacute;tat-Unis. Comment un d&eacute;tenteur de droits priv&eacute;s peut-il violer la Constitution des &Eacute;tat-Unis en accordant aux autres le droit de copier, modifier et redistribuer son travail, SCO ne daigne pas le dire. Les th&eacute;ories l&eacute;gales ne sont pas des secrets, si les avocats de SCO avaient quelque chose d'autre &agrave; offrir pour &eacute;tayer leurs assertions, ils l'auraient dit. Aucun cas de jurisprudence ne permet d'&eacute;tayer cette conception ridicule d'une licence de &laquo;&nbsp;copyright&nbsp;&raquo; inconstitutionnelle. Aucun juriste de ma connaissance (raisonnablement importante), quel que soit son point vue sur la licence GPL, ne prendrait au s&eacute;rieux cette idiotie. Quand les faits vous font d&eacute;faut, quand la loi vous fait d&eacute;faut, et quand taper du poing sur la table ne vous am&egrave;ne que des rires de d&eacute;rision, m&ecirc;me l'avocat v&eacute;reux le plus caricatural se retrouve sans ressources. &Agrave; quoi faut-il s'attendre de la part de SCO&nbsp;; &agrave; une attaque contre le juge&nbsp;?

source: Footnotes
fr: Notes

source: The most complete review of the SCO Las Vegas presentation was written by Bruce Perens, and is available at <a href="http://www.perens.com/SCO/SCOSlideShow.html"> http://www.perens.com/SCO/SCOSlideShow.html</a>.
fr: Le resum&eacute; complet par Bruce Perens de la pr&eacute;sentation de SCO &agrave; Las Vegas, est accessible sur <a href="http://www.perens.com/SCO/SCOSlideShow.html">http://www.perens.com/SCO/SCOSlideShow.html</a>.

source: <em> Eben Moglen is General Counsel to FSF, and serves on its board of directors. </em>
fr: <em>Eben Moglen est professeur de droit &agrave; la Columbia University Law School. Il conseille gracieusement la Free Software Foundation</em>.

source: <a href="/philosophy/sco/sco.html">Other Texts to Read related to SCO</a>.
fr: <a href="/philosophy/sco/sco.fr.html">Autres textes à lire relatifs à SCO</a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.
