Repository: gitGNU/gnu_www-fr
Catalog: philosophy/sco/sco-preemption.*.po
Languages: fr

source: SCO Scuttles Sense, Claiming GPL Invalidity
fr: SCO &agrave; contresens, revendiquant l'invalidit&eacute; de la GPL

source: by <strong>Eben Moglen</strong>
fr: par <strong>Eben Moglen</strong>

source: Monday 18 August 2003
fr: Lundi 18 ao&ucirc;t 2003

source: Now that the tide has turned, and SCO is facing the dissolution of its legal position, claiming to &ldquo;enforce its intellectual property rights&rdquo; while actually massively infringing the rights of others, the company and its lawyers have jettisoned even the appearance of legal responsibility. Last week's Wall Street Journal carried statements by Mark Heise, outside counsel for SCO, challenging the &ldquo;legality&rdquo; of the Free Software Foundation's GNU General Public License (GPL). The GPL both protects against the baseless claims made by SCO for license fees to be paid by users of free software, and also prohibits SCO from its ongoing distribution of the Linux kernel, a distribution which infringes the copyrights of thousands of contributors to the kernel throughout the world. As IBM's recently-filed counterclaim for copyright infringement and violation of the GPL shows, the GPL is the bulwark of the community's legal defense against SCO's misbehavior. So naturally, one would expect SCO to bring forward the best possible arguments against the GPL and its application to the current situation. But there aren't any best arguments; there aren't even any good arguments, and what SCO's lawyer actually said was arrant, unprofessional nonsense.
fr: Maintenant que le vent a tourn&eacute;, et que SCO affronte la dissolution de sa position juridique, en revendiquant l'application de ses &laquo;&nbsp;droits de propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; alors qu'elle viole en fait massivement les droits d'autres, la soci&eacute;t&eacute; et ses avocats ont baiss&eacute; le masque de l'apparence de responsabilit&eacute; l&eacute;gale. Le Wall Street Journal de la semaine derni&egrave;re a rapport&eacute; des d&eacute;clarations de Mark Heise, avocat conseil externe de SCO, r&eacute;cusant la &laquo;&nbsp;l&eacute;galit&eacute;&nbsp;&raquo; de la General Public License GNU (GPL) de la Free Software Foundation. La GPL prot&egrave;ge des revendications sans fondements faites par SCO pour que les utilisateurs de logiciel libre paient une redevance, et elle interdit &eacute;galement &agrave; SCO de continuer sa distribution du noyau Linux, une distribution qui viole les droits d'auteur de milliers de contributeurs du noyau de par le monde. Comme le montre la r&eacute;cente demande de d&eacute;dommagements de IBM pour violation de droits d'auteur et de la GPL, la GPL est le bouclier juridique de la communaut&eacute; contre la mauvaise conduite de SCO. Donc naturellement, on s'attendrait &agrave; ce que SCO avance les meilleurs arguments possible contre la GPL et son application &agrave; la situation actuelle. Mais il n'y a pas de meilleurs arguments, pas plus que de bons arguments, et ce que l'avocat de SCO a dit est en fait d&eacute;nu&eacute; de sens et non professionnel.

source: According to the Journal, Mr Heise announced that SCO would challenge the GPL's &ldquo;legality&rdquo; on the ground that the GPL permits licensees to make unlimited copies of programs it covers, while copyright law only allows a single copy to be made. The GPL, the Journal quoted Mr Heise as saying, &ldquo;is preempted by federal copyright law.&rdquo;
fr: Selon le Journal, M. Heise a annonc&eacute; que SCO r&eacute;cuserait la &laquo;l&eacute;galit&eacute;&raquo; de la GPL sur la base que la GPL permet aux d&eacute;tenteurs de la licence de faire des copies illimit&eacute;es des programmes qu'elle couvre, alors que le loi sur les droits d'auteur n'autorise de faire qu'une seule copie. La GPL, note le Journal en citant M. Heise &laquo;est soumise &agrave; la loi f&eacute;d&eacute;rale&raquo;.

source: This argument is frivolous, by which I mean that it would be a violation of professional obligation for Mr Heise or any other lawyer to submit it to a court. If it were true, no copyright license could permit the licensee to make multiple copies of the licensed program. That would make not just the GPL &ldquo;illegal.&rdquo; Mr Heise's supposed theory would also invalidate the BSD, Apache, AFL, OSL, MIT/X11, and all other free software licenses. It would invalidate the Microsoft Shared Source license. It would also eliminate Microsoft's method for the distribution of the Windows operating system, which is pre-loaded by hard drive manufacturers onto disk drives they deliver by the hundreds of thousands to PC manufacturers. The licenses under which the disk drive and PC manufacturers make multiple copies of Microsoft's OS would also, according to Mr Heise, violate the law. Redmond will be surprised.
fr: Cet argument est frivole, en cela je veux dire que ce serait une faute professionnelle pour M. Heise ou tout autre avocat de soumettre cela &agrave; un tribunal. Si c'&eacute;tait vrai, aucune licence de droits d'auteur ne pourrait permettre de faire de multiples copies d'un programme sous licence. Cela rendrait &laquo;&nbsp;ill&eacute;gale&nbsp;&raquo; pas seulement la GPL. La th&eacute;orie suppos&eacute;e de M. Heise invaliderait &eacute;galement les licences BSD, Apache, AFL, OSL, MIT/X11, et toutes les autres licences de logiciels libre. Cela invaliderait la licence Microsoft Shared Source. Cela &eacute;liminerait &eacute;galement la m&eacute;thode de distribution de Microsoft pour son syst&egrave;me d'exploitation Windows, qui est pr&eacute;charg&eacute; par les fabricants de disques durs sur les disques durs qu'ils livrent par centaines de milliers aux fabricants de PC. Les licences sous lesquelles les fabricants de disques durs et de PC font de multiples copies du syst&egrave;me d'exploitation de Microsoft, selon M. Heise, violeraient &eacute;galement la loi. Redmond serait surpris.

source: Of course, Mr Heise's statement is nothing but moonshine, based on an intentional misreading of the Copyright Act that would fail on any law school copyright examination. Mr Heise is referring to section 117 of the US Copyright Act, which is entitled &ldquo;Limitation on exclusive rights: computer programs,&rdquo; and which provides that:
fr: Bien s&ucirc;r, les d&eacute;clarations de M. Heise ne sont rien d'autre que des fadaises, bas&eacute;es sur la mauvaise lecture intentionnelle de la loi sur les droits d'auteur, et qui seraient recal&eacute;es dans n'importe quel examen sur les droits d'auteur d'une &eacute;cole de droit. M. Heise se r&eacute;f&egrave;re &agrave; la section 117 de la loi am&eacute;ricaine sur les droits d'auteur, qui est intitul&eacute;e &laquo;&nbsp;Limitation sur les droits exclusifs&nbsp;: programmes pour ordinateurs&nbsp;&raquo; et qui stipule que&nbsp;:

source: (a) Notwithstanding the provisions of section 106, it is not an infringement for the owner of a copy of a computer program to make or authorize the making of another copy or adaptation of that computer program provided:
fr: (a) Nonobstant les dispositions de la section 106, ce n'est pas une infraction pour le propri&eacute;taire d'une copie d'un programme pour ordinateur de faire ou d'autoriser &agrave; faire une autre copie ou une adaptation du programme pour ordinateur &agrave; condition&nbsp;:

source: (1) that such a new copy or adaptation is created as an essential step in the utilization of the computer program in conjunction with a machine and that it is used in no other manner, or
fr: (1) qu'une telle nouvelle copie ou adaptation soit cr&eacute;&eacute;e comme &eacute;tant une &eacute;tape importante dans l'utilisation de ce programme pour ordinateur conjointement avec une machine et qu'elle est n'utilis&eacute;e en aucune autre mani&egrave;re, ou

source: (2) that such new copy or adaptation is for archival purposes only and that all archival copies are destroyed in the event that continued possession of the computer program should cease to be rightful.
fr: (2) qu'une telle nouvelle copie ou adaptation soit r&eacute;alis&eacute;e pour des besoins d'archivage seulement et que toutes les copies archiv&eacute;es soient d&eacute;truites dans le cas o&ugrave; la poursuite de la possession du programme pour ordinateur cesserait d'&ecirc;tre l&eacute;gitime.

source: As the language makes absolutely clear, section 117 says that although the Act generally prohibits making any copy of a copyrighted work without license, in the case of computer programs one can both make and even alter the work for certain purposes <em>without any license at all</em>. The claim that this provision sets a limit on what copyright owners may permit through licensing their exclusive right is utterly bogus. It has no support in statutory language, legislative history, case law, or the constitutional policy that lies behind the copyright system. Were this argument actually presented to a court it would certainly fail.
fr: Comme le clarifie la formulation, la section 117 dit&nbsp;: bien que la loi interdise g&eacute;n&eacute;ralement la r&eacute;alisation de toute copie prot&eacute;g&eacute;e par droits d'auteur sans licence, dans le cas des programmes pour ordinateur, on peut faire des copies et m&ecirc;me modifier l'oeuvre dans certains cas <span style="font-style: italic;">sans licence du tout</span>. La revendication que la disposition d&eacute;finisse une limite &agrave; ce que des propri&eacute;taires de droits d'auteur peuvent autoriser par une licence de leur droit exclusif est totalement bidon. Elle n'a pas de fondement dans le langage juridique, dans l'histoire l&eacute;gislative, des proc&egrave;s, ou la politique constitutionnelle qui sous-tend le syst&egrave;me des droits d'auteur. Si ces arguments&nbsp; &eacute;taient en fait pr&eacute;sent&eacute;s dans un tribunal, ils seraient certainement rejet&eacute;s.

source: The release of this astounding statement is actually good news for developers and users of free software. It shows that SCO has no defense whatever against the GPL; already it has resorted to nonsense to give investors the impression that it can evade the inevitable day of reckoning. Far from marking the beginning of a significant threat to the vitality of the GPL, the day SCO scuttled sense altogether confirmed the strength of the GPL, and its importance in protecting freedom.
fr: La publication de cette d&eacute;claration stup&eacute;fiante est en fait une bonne nouvelle pour les d&eacute;veloppeurs et les utilisateurs de logiciels libres. Elle montre que SCO n'a pas l'ombre d'une d&eacute;fense contre la GPL&nbsp;; elle a d&eacute;j&agrave; eu recours au non-sens pour donner l'impression aux investisseurs qu'elle pourrait &eacute;chapper &agrave; l'in&eacute;vitable jour du jugement. Loin de marquer le d&eacute;but d'une menace significative pour la vitalit&eacute; de la GPL, le jour o&ugrave; SCO a&nbsp; bafou&eacute; le bon sens, elle a confirm&eacute; la force de la GPL, et son importance dans la protection de la libert&eacute;.

source: <em> Eben Moglen is professor of law at Columbia University Law School. He serves without fee as General Counsel of the Free Software Foundation. </em>
fr: <em>Eben Moglen est professeur de droit &agrave; Columbia University Law School. Il sert b&eacute;n&eacute;volement la Free Software Foundation en tant qu'avocat conseil g&eacute;n&eacute;ral.</em>

source: <a href="/philosophy/sco/sco.html">Other Texts to Read related to SCO</a>.
fr: <a href="/philosophy/sco/sco.fr.html">Autres textes à lire relatifs à SCO</a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2003 Eben Moglen <br /> Verbatim copying of this article is permitted in any medium, provided this notice is preserved.
fr: Copyright &copy; 2003 Eben Moglen <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
