Repository: gitGNU/gnu_www-fr
Catalog: philosophy/sco/sco-without-fear.*.po
Languages: fr

source: Copyright &copy; 2003 Eben Moglen <br /> Verbatim copying of this article is permitted in any medium, provided this notice is preserved.
fr: Copyright &copy; 2003 Eben Moglen <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Laurent Bertaud et Jérôme Dominguez.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
