Repository: gitGNU/gnu_www-fr
Catalog: philosophy/sco/subpoena.*.po
Languages: fr

source: The SCO Subpoena of FSF
fr: L'assignation de la FSF par SCO

source: by <strong>Bradley M. Kuhn</strong>
fr: par <strong>Bradley M. Kuhn</strong>

source: Tuesday 18 May 2004
fr: Mardi 18 mai 2004

source: Late last year, we were subpoenaed by SCO as part of the ongoing dispute between SCO and IBM. Today, <a href="sco-subpoena.pdf">we made that subpoena available on our website</a>. This is a broad subpoena that effectively asks for every single document about the GPL and enforcement of the GPL since 1999. They also demand every document and email that we have exchanged with Linus Torvalds, IBM, and other players in the community. In many cases, they are asking for information that is confidential communication between us and our lawyers, or between us and our contributors.
fr: &Agrave; la fin de l'ann&eacute;e derni&egrave;re, nous avons &eacute;t&eacute; assign&eacute;s par SCO en tant que partie dans le litige en cours entre SCO et IBM. Aujourd'hui, <a href="sco-subpoena.pdf">nous rendons cette assignation disponible sur notre site Web</a>. Il s'agit d'une assignation &eacute;tendue qui demande en fait chaque document sur la GPL et la mise en application de la GPL depuis 1999. Ils demandent &eacute;galement chaque document et courriel que nous avons &eacute;chang&eacute;s avec Linus Torvalds, IBM, et d'autres acteurs de la communaut&eacute;. Dans beaucoup de cas, ils demandent des informations qui sont des communications confidentielles entre nous et nos avocats, ou entre nous et nos contributeurs.

source: As the SCO lawsuit drags on, we will have to make some tough decisions about how to answer this subpoena. We are certain that we will not produce all the material requested; we will not betray our legally protected confidences, particularly when they relate to our work upholding the integrity of the GPL. However, regardless of whether we dispute the whole subpoena in court, or provide those documents which we are able to determine are reasonable and relevant to produce, there is much work for FSF. If we fight the subpoena, it means substantial legal fees associated with litigation. If we produce materials, it means substantial effort to gather the relevant documents. Even though we'll be reimbursed for the direct costs, the indirect costs in staff time will be ours to bear.
fr: Alors que la poursuite judiciaire de SCO s'&eacute;ternise, nous devrons prendre de dures d&eacute;cisions sur la fa&ccedil;on de r&eacute;pondre &agrave; cette assignation. Nous sommes certains que nous ne produirons pas tout ce qui est demand&eacute;; nous ne trahirons pas nos conversations couvertes par le secret professionnel, particuli&egrave;rement quand elles se rapportent &agrave; notre travail pour renforcer l'int&eacute;grit&eacute; de la GPL. Cependant, sans tenir compte du fait que nous contestions ou non toute l'assignation au tribunal, ou que nous fournissions ou non ces documents que nous jugerions raisonnables ou appropri&eacute;s de produire, il y a beaucoup de travail pour la FSF. Si nous contestons l'assignation, cela signifiera des frais judiciaires consid&eacute;rables li&eacute;s au contentieux. Si nous produisons les documents, cela signifie un effort important pour rassembler les documents appropri&eacute;s. M&ecirc;me si nous &eacute;tions rembours&eacute;s pour les co&ucirc;ts directs, les co&ucirc;ts indirects en termes de temps de travail du personnel seront &agrave; notre charge.

source: Meanwhile, the leaked SCO documents have confirmed what we long believed: Microsoft, having found that the smear campaign against GPL was not succeeding, has instead bought their FUD at a bargain price from a third party. The &ldquo;license&rdquo; that Microsoft bought for SCO's &ldquo;technology&rdquo; was, more than anything else, a fee for the service of attacking the Free Software Movement and its lowest-level program, the kernel named Linux. Now that there has once been a &ldquo;SCO&rdquo;, there will always be some &ldquo;SCO&rdquo; to come and attack our movement and our work.
fr: Pendant ce temps, les documents de SCO qui ont &eacute;t&eacute; divulgu&eacute;s ont confirm&eacute; ce que nous pensions depuis longtemps&nbsp;: Microsoft, trouvant que la campagne de calomnies contre la GPL n'&eacute;tait pas un succ&egrave;s, a au lieu de cela n&eacute;goci&eacute; leur &laquo;&nbsp;<abbr title="Fear, Uncertainty and Doubt">FUD</abbr>&nbsp;<sup><a href="#TransNote1">1</a></sup>&nbsp;&raquo; aupr&egrave;s d'une tierce partie. La &laquo;&nbsp;licence&nbsp;&raquo; que Microsoft a achet&eacute;e pour la &laquo;&nbsp;technologie&nbsp;&raquo; de SCO &eacute;tait, plus que toute autre chose, une r&eacute;tribution pour attaquer le Mouvement du logiciel libre et son programme de plus bas niveau, le noyau appel&eacute; Linux. Maintenant qu'il y a eu un &laquo;&nbsp;SCO&nbsp;&raquo;, il y aura toujours d'autres &laquo;SCO&raquo; pour attaquer notre mouvement et notre travail.

source: Even though we believe that SCO has no basis to make the claims they make, that does not mean our community should assume it has nothing to learn from these events. Early in the lawsuit, we at FSF were unsure if SCO would attack only the kernel Linux, or the entire GNU/Linux operating system. As copyright holder on most major components of the GNU/Linux system, we of course feared that even while our copyright assignment process is the best and most diligent in the whole Free Software world, we would still be required to expend great effort in showing a judge how exactly we did this job. We are grateful for SCO's tactical error of attacking one of the deepest pockets on earth, IBM, who has the checkbook needed to efficiently fight such a nuisance lawsuit.
fr: M&ecirc;me si nous pensons que SCO n'a pas de fondement pour faire les revendications qu'il a faites, cela ne signifie pas que notre communaut&eacute; doive supposer qu'il n'y a rien &agrave; apprendre de ces &eacute;v&egrave;nements. Au d&eacute;but de l'affaire, &agrave; la FSF, nous ne savions pas si SCO attaquerait seulement le noyau Linux, ou le syst&egrave;me d'exploitation complet GNU/Linux. En tant que d&eacute;tenteur du copyright de la plupart des composants majeurs du syst&egrave;me GNU/Linux, nous avions bien s&ucirc;r peur que, m&ecirc;me si notre processus de cession de copyright est le meilleur et le plus appliqu&eacute; dans l'ensemble du monde du logiciel libre, nous aurions &eacute;t&eacute; contraints de d&eacute;ployer beaucoup d'efforts pour montrer &agrave; un juge comment nous proc&eacute;dions exactement. Nous sommes reconnaissants de l'erreur tactique de SCO d'attaquer une des poches les plus remplies de la plan&egrave;te, IBM, qui a le carnet de ch&egrave;ques appropri&eacute; pour combattre efficacement un telle nuisance judiciaire.

source: However, this does not mean FSF's work is done. In addition to answering and/or disputing the subpoena, we must also educate the community about why it is that Linux was attacked and GNU was not. For more than a decade, FSF has urged projects to build a process whereby the legal assembly of the software is as sound as the software development itself. Many Free Software developers saw the copyright assignment process used for most GNU components as a nuisance, but we arduously designed and redesigned the process to remove the onerousness. Now the SCO fiasco has shown the community the resilience and complete certainty that a good legal assembly process can create. (SCO, after all, eventually dropped their claims against GNU as a whole and focused on the Linux project which, for all its wonderful technical achievements, has a rather loose legal assembly process.) We have just begun a project here at FSF to document and codify our process, so that it can be disseminated in the form of a policy manual and accompanying software, to all other Free Software projects who wish to solidify their legal assembly process. Distilling nearly two decades of organizational know-how into easy-to-understand software and documentation is no easy task, and we will rely greatly on your financial support to aid us in carrying out this momentous task.
fr: Cependant, cela ne signifie pas que le travail de la FSF est termin&eacute;. En plus de r&eacute;pondre et/ou de contester l'assignation, nous devons &eacute;galement &eacute;duquer la communaut&eacute; sur la raison qui fait que c'&eacute;tait Linux qui &eacute;tait attaqu&eacute; et pas GNU. Depuis plus de dix ans, la FSF a press&eacute; les projets &agrave; b&acirc;tir un processus o&ugrave; le montage juridique du logiciel est aussi solide que le d&eacute;veloppement lui-m&ecirc;me. Beaucoup de d&eacute;veloppeurs de logiciel libre voient le processus de cession de copyright utilis&eacute; pour la plupart des composants GNU comme une nuisance, mais nous avons d&eacute;fini et red&eacute;fini avec ardeur le processus pour lui retirer sa lourdeur. Maintenant, le fiasco de SCO a montr&eacute; &agrave; la communaut&eacute; la r&eacute;sistance et la totale certitude qu'un bon processus de montage l&eacute;gal peut cr&eacute;er. (SCO, apr&egrave;s tout, a peut-&ecirc;tre abandonn&eacute; ses revendications contre GNU dans son ensemble et s'est concentr&eacute; sur le projet Linux qui, pour toutes ses formidables r&eacute;alisations techniques, a un processus de montage juridique plut&ocirc;t faible). Nous venons juste de commencer un projet &agrave; la FSF pour documenter et codifier notre processus, de sorte qu'il puisse &ecirc;tre r&eacute;pandu sous la forme d'un guide accompagnant le logiciel, pour tous les autres projets de logiciels libres qui souhaitent consolider leur processus de montage juridique. Distiller pr&egrave;s de deux d&eacute;cennies de savoir faire organisationnel dans un logiciel et une documentation facile &agrave; comprendre n'est pas une t&acirc;che facile, et nous comptons grandement sur votre soutien financier pour nous aider &agrave; accomplir cette t&acirc;che capitale.

source: As always, we at FSF look to the long-term future. SCO is a blip&mdash;a precursor to the challenges Free Software will face. We strive to be ahead of that curve and lead the way for a legally certain future for Free Software.
fr: Comme toujours, &agrave; la FSF, nous visons le long terme. SCO est une petite anomalie passag&egrave;re &mdash;&nbsp;un pr&eacute;curseur des d&eacute;fis auxquels devra faire face le logiciel libre. Nous nous effor&ccedil;ons d'&ecirc;tre en avance sur ce tournant et d'ouvrir la voie pour un avenir juridique s&ucirc;r pour le logiciel libre.

source: We need your support to continue this work. We ask that if you are not yet <a href="http://member.fsf.org">an associate member of FSF, that you join now</a>. If you join before 15 June 2004, you will receive a complimentary print copy of Lawrence Lessig's new book, <cite>Free Culture</cite>. We are happy to celebrate the addition of Professor Lessig to our board of directors by sharing his latest written work with you as we continue our work.
fr: Nous avons besoin de votre soutien pour continuer ce travail. Nous vous demandons, si vous n'&ecirc;tes pas encore <a href= "http://member.fsf.org">un membre affili&eacute; &agrave; la FSF, de la rejoindre maintenant</a>. Si vous nous rejoignez avant le 15 juin 2004, vous recevrez gracieusement un exemplaire imprim&eacute; du nouveau livre de Lawrence Lessig, <cite>Free Culture</cite>. Nous sommes heureux de f&ecirc;ter l'arriv&eacute;e du Professeur Lessig &agrave; notre conseil d'administration en partageant avec vous son dernier ouvrage, en continuant notre œuvre.

source: If you already an associate member, please encourage a friend to join!
fr: Si vous &ecirc;tes d&eacute;j&agrave; un membre affili&eacute;, veuillez encourager un ami &agrave; nous rejoindre&nbsp;!

source: <a href="/philosophy/sco/sco.html">Other Texts to Read related to SCO</a>.
fr: <a href="/philosophy/sco/sco.fr.html">Autres textes à lire relatifs à SCO</a>.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;: <ol><li id="TransNote1">FUD&nbsp;: Peur, incertitude et doute. Sorte de rumeur destin&eacute;e &agrave; semer la confusion dans les esprits.</li></ol>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: C&eacute;dric Corazza.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
