Repository: gitGNU/gnu_www-fr
Catalog: help/directory.*.po
Languages: fr

source: Helping with the Free Software Directory
fr: Contribuer au répertoire de logiciels libres

source: The <a href="http://directory.fsf.org/">Free Software Directory</a>, one of the FSF's major initiatives, needs volunteers to improve it. Here are some ways you can get involved, progressing from simple to complex.
fr: Le <a href="http://directory.fsf.org/">répertoire de logiciels libres</a>, une des principales initiatives de la FSF, a besoin de volontaires pour être amélioré. Voici plusieurs façons de vous impliquer, de la plus simple à la plus compliquée.

source: Reporting Errors
fr: Rapporter des erreurs

source: If you note an error in the database, please report it by sending email to <a href="mailto:bug-directory@gnu.org"> &lt;bug-directory@gnu.org&gt;</a>. Please include the name of the project and the field that is incorrect. It would be appreciated if you could also include the correct information. However, this isn't required. You can also use the &ldquo;file a bug&rdquo; button on the Directory web pages.
fr: Si vous notez une erreur dans la base de données, signalez-là en envoyant un courriel à <a href="mailto:bug-directory@gnu.org">&lt;bug-directory@gnu.org&gt;</a>. Merci d'y inclure le nom du projet et le champ qui est incorrect. Il serait apprécié que vous donniez également l'information correcte. Cependant, ceci n'est pas obligatoire. Vous pouvez aussi utiliser le bouton <em>file a bug</em> (« Signaler un bogue ») dans les pages web du répertoire.

source: Reporting New Releases
fr: Rapporter de nouvelles versions

source: One piece of information which is especially hard to keep up to date is the version information. If you are an author or avid user of a particular project, please report new releases as above.
fr: L'information particulièrement difficile à garder à jour est l'information de version. Si vous êtes un auteur ou le fervent utilisateur d'un projet particulier, veuillez reporter chaque nouvelle version comme indiqué ci-dessus.

source: Adding Entries
fr: Ajouter des entrées

source: To add an entry for a program not already in the database, it is best to use the <a href="http://directory.fsf.org/wiki/Form:Submit">web submission form</a>. But if you don't want to do that, please provide as much of the following information as you can via email to <a href="mailto:bug-directory@gnu.org"> &lt;bug-directory@gnu.org&gt;</a>.
fr: Pour ajouter une entrée pour un programme qui n'existe pas dans la base de données, il est préférable d'utiliser le <a href="http://directory.fsf.org/wiki/Form:Submit">formulaire en ligne<a>. Mais si vous ne voulez pas procéder ainsi, veuillez donner autant d'informations que possible par courriel à l'adresse <a href="mailto:bug-directory@gnu.org">&lt;bug-directory@gnu.org&gt;</a>.

source: Project title and homepage
fr: Titre du projet et page d'accueil

source: Link to the source code
fr: Lien vers le code source

source: Please list all licenses, including documentation license
fr: Merci de lister toutes les licences, notamment la licence de la documentation

source: A short description of what the program does
fr: Une courte description de ce que fait le programme

source: Current version and maturity level
fr: La version courante et le niveau de maturité

source: Maintainers' names/contact (we will make this info public)
fr: Nom(s) et moyens de contact du (des) mainteneur(s) (nous rendrons ces informations publiques)

source: Any help resources or community resources, such as mailing list archives, IRC or bug lists
fr: Toute ressource d'aide ou communautaire, telles que les archives des listes de diffusion du projet, le canal IRC ou la liste des bogues

source: Any developer resources, such as bug reporting lists and public VCS checkout command
fr: Toute ressource pour le développeur, telles que les listes de rapports de bogues et la commande d'extraction du CVS public

source: All known dependencies
fr: Toutes les dépendances connues

source: Indicate all applicable interface styles: Command Line, Console, Daemon, X Window, Web, Email
fr: Indiquer tous les styles d'interface applicables&nbsp;: ligne de commande, console, démon, X Window, web, courriel

source: To be listed in the Free Software Directory, packages should meet all of these requirements (we may change the criteria if necessary):
fr: Pour être listés dans le répertoire des logiciels libres, les paquets doivent satisfaire à toutes ces exigences (nous pouvons être amenés à les modifier si nécessaire)&nbsp;:

source: The software is at least of beta quality; users consider it usable and useful. (We also list GNU packages that are in early development, but they are marked as not ready for general use.)
fr: Le logiciel est au moins de qualité beta&nbsp;; les utilisateurs le considèrent utile et utilisable. (Nous listons aussi les paquets GNU qui sont au début de leur développement, mais ils sont marqués comme impropres à un usage général.)

source: It is licensed under a free software license as defined in <a href="/philosophy/free-sw.html">the free software definition</a> and listed as a <a href="/licenses/license-list.html">free software license</a>.
fr: Il est sous une licence de logiciel libre telle que définie dans <a href="/philosophy/free-sw.fr.html">la définition d'un logiciel libre</a> et listée en tant que <a href="/licenses/license-list.fr.html">licence de logiciel libre</a>.

source: It does not rely on non-free software, either for significant functionality or normal performance. (Software which depends on a non-free platform is not usable in the Free World.)
fr: Il ne repose pas sur un logiciel non libre, aussi bien pour une fonctionnalité significative que pour un fonctionnement normal. (Un logiciel qui dépend d'une plate-forme non libre n'est pas utilisable dans le monde libre.)

source: It runs on the GNU system or the GNU/Linux system.
fr: Il fonctionne sur le système GNU ou le système GNU/Linux.

source: Our aim is to list all free software meeting the criteria, but of course that is a moving target.
fr: Notre but est de lister tous les logiciels répondant aux critères, mais bien sûr ce but est changeant.

source: Help with Maintenance
fr: Aider à la maintenance

source: The Free Software Directory is now based on a wiki infrastructure. Thus, it is now much easier for anyone to help maintain the Directory by reviewing submitted items, updating stale information, and so on. Please see the <a href="http://directory.fsf.org/wiki/Free_Software_Directory:Participate">Free Software Directory participation</a> page for more.
fr: Le répertoire de logiciels libres est maintenant basé sur une infrastructure wiki. Ainsi, il est plus facile d'aider à maintenir le répertoire à jour, en vérifiant les données envoyées, en mettant à jour les informations obsolètes, et ainsi de suite. Veuillez consulter la page expliquant comment <a href="http://directory.fsf.org/wiki/Free_Software_Directory:Participate">participer au répertoire de logiciels libres</a> pour plus d'informations.

source: In whatever form, thanks for your help!
fr: Sous quelque forme que ce soit, merci de votre aide&nbsp;!

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.

source: Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
fr: Cette page peut-être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Sébastien Miquée.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:
