Repository: gitGNU/gnu_www-fr
Catalog: help/help.*.po
Languages: fr

source: How you can help the GNU Project - GNU Project - Free Software Foundation (FSF)
fr: Comment vous pouvez aider le Projet GNU - GNU Project - Free Software Foundation (FSF)

source: A guide to helping the GNU operating system
fr: Un guide pour aider le Projet GNU

source: The GNU Volunteer Coordinators <a href="mailto:gvc@gnu.org">&lt;gvc@gnu.org&gt;</a> can assist you if you wish to help the GNU Project. They will be able to put you in touch with other people interested in or working on similar projects. When you have selected a task from our task lists, please let them know you're interested in working on it.
fr: Les coordinateurs des volontaires de GNU <a href="mailto:gvc@gnu.org">&lt;gvc@gnu.org&gt;</a> peuvent vous assister si vous d&eacute;sirez aider le Projet GNU. Ils seront &agrave; m&ecirc;me de vous mettre en contact avec d'autres personnes int&eacute;ress&eacute;es ou travaillant sur des projets similaires. Lorsque vous avez choisi une t&acirc;che sur nos listes, faites-leur savoir votre d&eacute;sir de participation.

source: Please let the GNU Volunteer Coordinators <a href="mailto:gvc@gnu.org">&lt;gvc@gnu.org&gt;</a> know if you take on any task from this list. We want to keep track of what tasks our volunteers are working on.
fr: Veuillez faire savoir aux coordonnateurs volontaires de GNU <a href="mailto:gvc@gnu.org">&lt;gvc@gnu.org&gt;</a> si vous prenez une t&acirc;che de cette liste. Nous voulons pourvoir suivre ce sur quoi travaillent les volontaires.

source: For general questions about the GNU project, mail <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a> and for questions and suggestions about this web site, mail <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Pour les questions d'ordre g&eacute;n&eacute;ral sur le Projet GNU, &eacute;crivez &agrave; <a href="mailto:gnu@gnu.org">gnu@gnu.org</a> (en anglais) et pour les questions et suggestions relatives &agrave; ce site web, envoyez un courriel &agrave; <a href="mailto:webmasters@gnu.org">webmasters@gnu.org</a>.

source: How to help the GNU Project
fr: Comment aider le Projet GNU

source: This list is ordered roughly with the more urgent items near the top. Please note that many things on this list link to larger, expanded lists.
fr: Cette liste est grossi&egrave;rement class&eacute;e en pla&ccedil;ant les &eacute;l&eacute;ments les plus urgents en t&ecirc;te de liste. Veuillez noter que beaucoup de choses sur cette liste sont li&eacute;es &agrave; des listes encore plus grandes.

source: Organize a new Free Software Activist Group to promote use of free software in your country, region or city.
fr: Organisez un nouveau groupe d'activistes du logiciel libre pour promouvoir l'utilisation des logiciels libres dans votre pays, r&eacute;gion ou ville.

source: Set an example by switching to a <em>completely</em> <a href="/software/software.html">free software</a> operating system. The easiest way to do that is to install and use one of the <a href="/distros/free-distros.html"> free GNU/Linux distributions</a>.
fr: Donnez l'exemple en basculant vers un syst&egrave;me d'exploitation <em>compl&egrave;tement</em> <a href="/software/software.fr.html">libre</a>. La mani&egrave;re la plus simple de faire cela est d'installer et d'utiliser une des <a href="/distros/free-distros.html">distributions GNU/Linux libres</a>.

source: Write free software:
fr: &Eacute;crivez du logiciel libre&nbsp;:

source: Contribute to the <a href="http://www.fsf.org/campaigns/priority.html">high priority free software projects</a>.
fr: Contribuez aux <a href="http://www.fsf.org/campaigns/priority.html">projets de logiciels libres hautement prioritaires</a>.

source: The <a href="http://savannah.gnu.org/people/?type_id=1">GNU Help Wanted</a> list is the general task list for GNU software packages. You might also consider taking over one of the <a href="/server/takeaction.html#unmaint">unmaintained GNU packages</a>.
fr: La liste <a href="http://savannah.gnu.org/people/?type_id=1">GNU Help Wanted</a> est la liste des t&acirc;ches g&eacute;n&eacute;rales pour les paquetages logiciels GNU. Vous pourriez aussi consid&eacute;rer de reprendre un des <a href="/server/takeaction.fr.html#unmaint">paquetages GNU non maintenus</a>.

source: When writing software for GNU, please follow the <a href="/prep/standards/">GNU Coding Standards</a> and <a href="/prep/maintain/">Information for Maintainers of GNU Software</a> documents.
fr: Si vous &eacute;crivez des logiciels pour GNU, veuillez suivre les <a href="/prep/standards/">standards de codage GNU</a> et les documents <a href="/prep/maintain/">d’information pour les mainteneurs de logiciels GNU</a>.

source: To offer software you have written to GNU, please see this <a href="/help/evaluation.html">GNU software evaluation</a> information.
fr: Pour offrir un logiciel que vous avez &eacute;crit &agrave; GNU, veuillez consulter cette information sur <a href="/help/evaluation.html">l'&eacute;valuation des logiciels GNU</a>.

source: We are sometimes offered software which already does substantially the same task as an existing GNU package. Although of course we appreciate all offers, we'd naturally like to encourage programmers to spend their time writing free software to do new jobs, not already-solved ones. So, before starting a new program, please check the <a href="http://directory.fsf.org/">Free Software Directory</a> for free software that does the job already.
fr: On nous offre parfois des logiciels qui r&eacute;alisent d&eacute;j&agrave; substantiellement les m&ecirc;mes tâches qu'un paquetage existant de GNU. Bien que nous appr&eacute;cions bien s&ucirc;r toutes les offres, nous aimerions encourager les programmeurs &agrave; passer leur temps &agrave; &eacute;crire des logiciels libres pour r&eacute;aliser de nouvelles t&acirc;ches, et pas des t&acirc;ches d&eacute;j&agrave; r&eacute;solues. Aussi, avant de d&eacute;marrer l'&eacute;criture d'un nouveau programme, veuillez v&eacute;rifier dans le <a href="http://directory.fsf.org/">R&eacute;pertoire des logiciels libres</a> si un logiciel libre ne r&eacute;alise pas d&eacute;j&agrave; cette t&acirc;che.

source: We can offer <a href="/software/devel.html">some resources</a> to help GNU software developers.
fr: Nous pouvons offrir <a href="/software/devel.html">des ressources</a> pour aider les d&eacute;veloppeurs de logiciels GNU.

source: Write documentation for GNU software, using these <a href="/doc/potentialauthors.html">resources, tips, and hints</a>.
fr: &Eacute;crivez de la documentation pour les logiciels GNU en utilisant ces <a href="/doc/potentialauthors.html">ressources, trucs et astuces</a>.

source: Volunteer as a &ldquo;Freedom Verifier&rdquo; to check whether a given distribution contains only free software, so it can be included on the <a href="/distros/free-distros.html">list of free distributions</a>.
fr: Devenez volontaire en tant que &laquo;&nbsp;V&eacute;rificateur de libert&eacute;&nbsp;&raquo; pour v&eacute;rifier qu'une distribution donn&eacute;e ne contienne que des logiciels libres, pour figurer dans la <a href="/distros/free-distros.html">liste des distributions libres</a>.

source: Translate the GNU Web site into other languages. More information about the issue can be found at the <a href="/server/standards/README.translations.html">Guide to Translating the www.gnu.org Web Pages</a>. Write to <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a> if you want to help.
fr: Traduisez le site Web de GNU en d'autres langues. Plus d'informations sont disponibles dans le <a href="/server/standards/README.translations.fr.html">Guide de traduction des pages Web de www.gnu.org</a>. &Eacute;crivez &agrave; <a href="mailto:web-translators@gnu.org">web-translators@gnu.org</a> si vous voulez aider.

source: Tell others about the GNU Project and the Free Software Foundation by:
fr: Parlez &agrave; d'autres du Projet GNU et de la Fondation pour le logiciel libre&nbsp;:

source: informing your friends about the GNU <a href="/philosophy/philosophy.html">philosophy</a> and <a href="/software/software.html">software</a>.
fr: en informant vos amis sur la <a href="/philosophy/philosophy.fr.html">philosophie</a> de GNU et sur les <a href="/software/software.fr.html">logiciels</a>.

source: informing your friends that the &ldquo;Linux&rdquo; operating system is really <a href="/gnu/linux-and-gnu.html">GNU/Linux</a>: that is, the GNU system, plus Linux, the kernel. Simply making a consistent and unfailing distinction between GNU/Linux (the whole system) and Linux (the kernel) when you write or speak about the system will <a href="/gnu/why-gnu-linux.html">help us greatly</a>, while taking very little time once you have unlearned the old habit.
fr: en informant vos amis que le syst&egrave;me d'exploitation &laquo;&nbsp;Linux&nbsp;&raquo; est en fait <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a>&nbsp;: c'est-&agrave;-dire le syst&egrave;me GNU, plus Linux, le noyau. Rester consistant et faire la distinction entre GNU/Linux (le syst&egrave;me entier) et Linux (le noyau) quand vous &eacute;crivez ou quand vous parlez du syst&egrave;me nous <a href="/gnu/why-gnu-linux.fr.html">aidera beaucoup</a> tout en vous prenant tr&egrave;s peu de temps une fois que vous aurez d&eacute;sappris l'ancienne habitude.

source: by both <a href="/help/linking-gnu.html">adding a link to GNU's home page</a> to your home pages, and suggesting that others do likewise.
fr: en <a href="/help/linking-gnu.html">ajoutant un lien vers la page d'accueil de GNU</a> dans vos pages personnelles et en sugg&eacute;rant &agrave; d'autres d'en faire autant.

source: When you are talking with people that don't value freedom and community, you can show them the many practical advantages of free software (see <a href="http://www.dwheeler.com/oss_fs_why.html">Why Open Source / Free Software? Look at the Numbers!</a> for some useful evidence). But keep mentioning the ethical issues too! Don't change your voice into an open-source voice just to cater to others.
fr: Quand vous parlez &agrave; des gens qui n'accordent pas de valeur &agrave; la libert&eacute; et &agrave; la communaut&eacute;, vous pouvez leur montrer tous les avantages pratiques des logiciels libres (voir <a href="http://www.dwheeler.com/oss_fs_why.html">Pourquoi open source / Logiciels libres&nbsp;? Regardez les chiffres&nbsp;!</a> pour des preuves utiles). Mais mentionnez la dimension &eacute;thique aussi&nbsp;! Ne changez pas votre parole pour une parole open-source juste pour satisfaire les autres.

source: Help the FSF raise funds by:
fr: Aidez la FSF &agrave; collecter des fonds&nbsp;:

source: making a <a href="http://donate.fsf.org/">donation</a> to the FSF.
fr: en faisant un <a href="http://donate.fsf.org/">don</a> &agrave; la FSF.

source: becoming an <a href="http://member.fsf.org/">Associate Member</a> of the FSF.
fr: en devenant un <a href="http://member.fsf.org/">Membre associ&eacute;</a> de la FSF.

source: choosing the FSF as a beneficiary in your <a href="http://www.affero.com/ca/fsf">Affero page</a>, linking to your FSF Affero page in your email signature, software project, and writings.
fr: en choisissant la FSF comme b&eacute;n&eacute;ficiaire dans votre <a href="http://www.affero.com/ca/fsf">page Affero</a>, en indiquant dans votre signature de courriel, dans votre projet logiciel, et dans vos &eacute;crits, le lien vers votre page Affero FSF.

source: <a href="http://order.fsf.org/">ordering</a> manuals, t-shirts, stickers and gear from the FSF.
fr: en <a href="http://order.fsf.org/">commandant</a> des manuels, des t-shirts, des autocollants et des accessoires &agrave; la FSF.

source: convincing your office to <a href="http://order.fsf.org/">order</a> manuals and t-shirts from the FSF.
fr: en convaincant votre bureau de <a href="http://order.fsf.org/">commander</a> des manuels et des t-shirts &agrave; la FSF.

source: <a href="/philosophy/selling.html">selling free software</a> and donating a part of the proceeds to the <a href="/fsf/fsf.html">Free Software Foundation</a> or some other free software development project. By funding development, you can advance the world of free software.
fr: en <a href="/philosophy/selling.fr.html">vendant des logiciels libres</a> et en donnant une partie des revenus &agrave; la <a href="/fsf/fsf.html">Fondation pour le logiciel libre</a> ou &agrave; un autre projet de d&eacute;veloppement de logiciel libre. En finan&ccedil;ant le d&eacute;veloppement, vous pouvez faire avancer le monde des logiciels libres.

source: <strong>Distributing free software is an opportunity to raise funds for development. Don't waste it!</strong>
fr: <strong>Distribuer du logiciel libre est une opportunit&eacute; pour lever des fonds pour le d&eacute;veloppement. Ne la g&acirc;chez pas&nbsp;!</strong>

source: Volunteer to make sure that essays from our <a href="/philosophy/philosophy.html">philosophy page</a> and other GNU URLs are on and/or linked from WWW directory, portal, and various hierarchical web index sites, such as Yahoo!, dmoz.org, and Google. Get these sites to add detailed entries about our different web pages. Make sure that essays from our <a href="/philosophy/philosophy.html">philosophy page</a> and other GNU URLs are linked to often in the appropriate categories. If you'd like to help us with this task, please contact the GNU Volunteer Coordinators <a href="mailto:gvc@gnu.org">&lt;gvc@gnu.org&gt;</a>.
fr: Devenez volontaire pour vous assurez que les essais de la <a href="/philosophy/philosophy.fr.html">page philosophie</a> et les autres URL de GNU soient r&eacute;f&eacute;renc&eacute;es dans les annuaires, portails, et divers index hi&eacute;rarchiques de sites Web comme Yahoo!, dmoz.org, et Google. Obtenez que ces sites ajoutent des entr&eacute;es d&eacute;taill&eacute;es sur nos diff&eacute;rentes pages Web. Assurez-vous que les essais de notre <a href="/philosophy/philosophy.fr.html">page philosophie</a> et les autres URL de GNU soient li&eacute;es dans les cat&eacute;gories appropri&eacute;es. Si vous voulez nous aider dans cette t&acirc;ches, veuillez contacter les coordinateurs volontaires de GNU <a href="mailto:gvc@gnu.org">&lt;gvc@gnu.org&gt;</a>.

source: Donate <a href="/help/help-hardware.html">hardware</a> to the FSF.
fr: Donnez du <a href="/help/help-hardware.html">mat&eacute;riel</a> &agrave; la FSF.

source: Take on one of the <a href="/server/tasks.html">jobs</a> we need done for this <a href="/server/server.html">web server</a>.
fr: Prenez un des <a href="/server/tasks.html">travaux</a> dont nous avons besoin pour ce <a href="/server/server.html">serveur Web</a>.

source: If you or your company work supporting or developing free software in some way, you can list yourself (or your company) in the <a href="/prep/service.html">GNU Service Directory</a>.
fr: Si vous ou votre soci&eacute;t&eacute; travaillez &agrave; soutenir ou d&eacute;velopper des logiciels libres de quelque mani&egrave;re que ce soit, vous pouvez &ecirc;tre list&eacute; (ou votre soci&eacute;t&eacute;) dans l'<a href="/prep/service.html">Annuaire de service de GNU</a>.

source: If you run a company that needs to hire people to work with free software, you can advertise on our <a href="http://www.fsf.org/resources/jobs/">Free Software Job Page</a>.
fr: Si vous dirigez une soci&eacute;t&eacute; qui a besoin d'embaucher des gens pour travailler sur des logiciels libres, vous pouvez faire une annonce sur notre <a href="http://www.fsf.org/resources/jobs/">Page des emplois dans le logiciel libre</a>.

source: Offer to contact companies looking for additional job postings to put on our <a href="http://www.fsf.org/resources/jobs/">Free Software Job Page</a>. If you would be interested in this, please contact <a href="mailto:job-page@fsf.org">&lt;job-page@fsf.org&gt;</a>.
fr: Offrez de contacter des soci&eacute;t&eacute;s qui cherchent &agrave; faire des publication d'offre d'emploi additionnelles &agrave; les faire sur notre <a href="http://www.fsf.org/resources/jobs/">Page des emplois dans le logiciel libre</a>. Si vous &ecirc;tes int&eacute;ress&eacute;s par cela, veuillez contacter <a href="mailto:gnu@gnu.org">gnu@gnu.org</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
