Repository: gitGNU/gnu_www-fr
Catalog: licenses/fdl-howto-opt.*.po
Languages: fr

source: How to Use the Optional Features of the GFDL - GNU Project - Free Software Foundation (FSF)
fr: Comment utiliser les dispositifs optionnels de la GFDL - GNU Project - Free Software Foundation (FSF)

source: How to Use the Optional Features of the GFDL
fr: Comment utiliser les dispositifs optionnels de la GFDL

source: by <a href="http://www.stallman.org/">Richard Stallman</a>
fr: par <a href="http://www.stallman.org/">Richard Stallman</a>

source: The <a href="/licenses/fdl.html">GNU FDL</a> (GNU Free Documentation License) includes two optional features, <a href="#SEC1"><strong>invariant sections</strong></a> and <a href="#SEC2"><strong>cover texts</strong></a>, which you can use if you wish. The manual's license notice should say whether you are using these features.
fr: La licence <a href="/licenses/fdl.html">GNU FDL</a> (GNU Free Documentation License) contient deux dispositifs optionnels, &agrave; savoir les <a href="#SEC1"><strong>sections inalt&eacute;rables</strong></a> et les <a href="#SEC2"><strong>textes de couverture</strong></a>, que vous pouvez utiliser si vous le souhaitez. La mention de la licence du manuel doit indiquer si vous utilisez ces dispositifs.

source: The simplest case is that you do not use these features. Then the license notice should say so, like this:
fr: Le cas le plus simple est quand vous ne souhaitez pas utiliser ces dispositifs. Dans ce cas, la mention de la licence devrait l'indiquer, comme suit&nbsp;:

source: But if you want to use these features, here is an explanation of what they are intended for and how to use them.
fr: Mais si vous souhaitez utiliser ces dispositifs, voici une explication de ce pour quoi ils sont pr&eacute;vus et de comment les utiliser.

source: Invariant sections
fr: Sections inalt&eacute;rables

source: The idea of invariant sections is that they give you a way to express nontechnical personal opinions about the topic.
fr: Le but des sections inalt&eacute;rables est de vous fournir un moyen d'exprimer un point de vue non-technique sur le sujet.

source: The classical example of an invariant nontechnical section in a free manual is the <a href="/gnu/manifesto.html">GNU Manifesto</a>, which is included in the GNU Emacs Manual. The GNU Manifesto says nothing about how to edit with Emacs, but it explains the reason why I wrote GNU Emacs&mdash;to be an essential part of the GNU operating system, which would give computer users freedom to cooperate in a community. Since the GNU Manifesto presents the principles of the GNU Project, rather than features of GNU Emacs, we decided that others should not remove or change it when redistributing the Emacs Manual, and we wrote that requirement into the license. In effect, we made the GNU Manifesto into an invariant section, though without using that term. To do this today using the GNU FDL, we would write the license notice like this:
fr: L'exemple usuel d'une section non-technique inalt&eacute;rable dans un manuel libre est le <a href="/gnu/manifesto.fr.html">manifeste GNU</a> [GNU Manifesto], inclus dans le manuel de GNU Emacs. Le manifeste GNU ne dit rien quant &agrave; la fa&ccedil;on d'&eacute;diter avec Emacs, mais il explique les raisons pour lesquelles j'ai &eacute;crit GNU Emacs, &agrave; savoir pour qu'il soit une partie primordiale du syst&egrave;me d'exploitation GNU, qui donnerait aux utilisateurs informatiques la libert&eacute; de coop&eacute;rer au sein d'une communaut&eacute;. Puisque le manifeste GNU pr&eacute;sente les principes fondateurs du projet GNU, plut&ocirc;t que les fonctionnalit&eacute;s de GNU Emacs, nous avons d&eacute;cid&eacute; que d'autres ne pourraient pas le retirer ou le modifier lors du partage du manuel d'Emacs, et nous avons inclus cette exigence dans la licence. De fait, nous avons fait du manifeste GNU une section inalt&eacute;rable, sans pour autant utiliser ce terme. Si nous avions &agrave; le faire aujourd'hui en utilisant la licence GNU FDL, nous &eacute;cririons la licence comme suit&nbsp;:

source: This says that the section &ldquo;GNU Manifesto&rdquo; is the only invariant section.
fr: Cette mention indique que la section &laquo;&nbsp;Manifeste GNU&nbsp;&raquo; est la seule section inalt&eacute;rable.

source: The old Emacs Manual license did not allow others who modify and redistribute the manual to add new invariant sections. But while formulating a more general version of the concept for the GNU FDL, I felt that it would be more morally consistent if those who modify a manual can write invariant sections, just as the first authors can. The FDL permits this.
fr: L'ancienne licence du manuel d'Emacs ne permettait pas &agrave; d'autres gens qui modifiaient et redistribuaient le manuel de rajouter de nouvelles sections inalt&eacute;rables. Mais au moment de r&eacute;diger une version plus g&eacute;n&eacute;rale du concept de la licence GNU FDL, il m'a sembl&eacute; plus coh&eacute;rent d'un point de vue moral de permettre l'ajout de sections inalt&eacute;rables par ceux qui font des modifications &agrave; un document, au m&ecirc;me titre que les cr&eacute;ateurs de ce document. La licence FDL le permet.

source: But that feature requires a safeguard to prevent it from being abused to endanger the free status of the manual. Person B who modifies a manual that was written by person A should not be able to make any of person A's documentation invariant, for that would deny person C the permission to modify it further. Likewise, if person B adds documentation for additional subtopics, this added documentation must not be invariant; the documentation itself must be modifiable by others. The FDL's conditions on adding invariant sections provide this safeguard.
fr: Mais cette possibilit&eacute; requiert un garde-fou afin de pr&eacute;venir tout abus &eacute;ventuel qui porterait atteinte au statut &laquo;&nbsp;libre&nbsp;&raquo; du document. Une personne B, modifiant un manuel qui a &eacute;t&eacute; &eacute;crit par une personne A, ne devrait pas &ecirc;tre en mesure de rendre inalt&eacute;rable la documentation r&eacute;dig&eacute;e par A, dans la mesure o&ugrave; cela retirerait &agrave; une personne C le droit de modifier plus encore la documentation de A. De m&ecirc;me, si cette personne B ajoute des &eacute;l&eacute;ments &agrave; des sous-parties additionnelles, ces ajouts ne doivent pas &ecirc;tre inalt&eacute;rables&nbsp;: la documentation doit pouvoir &ecirc;tre modifiable par d'autres. Les conditions d'ajouts de sections inalt&eacute;rables dans la licence FDL tiennent compte de ces garde-fous.

source: There is no need for a manual to have any invariant sections. The simplest case is to have none at all. You do not have to list the GNU FDL itself as an invariant section, because the FDL explicitly says that the FDL itself may not be changed. The FDL also distinguishes certain section titles, &ldquo;History&rdquo; and &ldquo;Dedications&rdquo; and others. You should not list these sections as invariant, because the FDL already gives the rules for these sections.
fr: Un manuel n'a pas forc&eacute;ment besoin de sections inalt&eacute;rables. Le cas le plus simple est de ne pas en avoir du tout. Vous n'avez pas besoin de lister la licence GNU FDL elle-m&ecirc;me comme &eacute;tant une section inalt&eacute;rable, dans la mesure o&ugrave; la FDL stipule explicitement qu'elle-m&ecirc;me ne peut &ecirc;tre alt&eacute;r&eacute;e. La licence FDL distingue aussi certaine sections, comme celles intitul&eacute;es &laquo;&nbsp;Histoire&nbsp;&raquo;, &laquo;&nbsp;Implications&nbsp;&raquo;,&nbsp;&hellip; Vous n'avez pas &agrave; les indiquer comme &eacute;tant des sections inalt&eacute;rables, car la FDL fournit d&eacute;j&agrave; des r&egrave;gles concernant ces sections.

source: Cover texts
fr: Textes de couverture

source: A cover text is a short piece of text that you insist must be printed on the cover of the manual when the manual is published, even if someone else is publishing it. You can specify a &ldquo;front-cover text&rdquo; which has to be printed on the front cover, and you can specify a &ldquo;back-cover text&rdquo; which has to be printed on the back cover. You can specify one of each.
fr: Un texte de couverture est une courte portion de texte pour laquelle vous insistez pour qu'elle soit imprim&eacute;e sur la couverture du manuel lors de sa publication, m&ecirc;me lorsque quelqu'un d'autre est &agrave; l'origine de cette publication. Vous pouvez d&eacute;finir un &laquo;&nbsp;texte de premi&egrave;re page de couverture&nbsp;&raquo;, qui doit &ecirc;tre imprim&eacute; sur la premi&egrave;re de couverture, ainsi qu'un &laquo;&nbsp;texte de derni&egrave;re page de couverture&nbsp;&raquo;, qui doit &ecirc;tre imprim&eacute; sur la quatri&egrave;me de couverture. Vous pouvez en d&eacute;finir un de chaque.

source: Cover texts are a new feature, so I cannot cite past examples of their use, but the intended purpose is simple. They are meant to give the original publisher of an edition a way to ask or encourage people to buy the copies they publish rather than those of some other reprinter. For example, we could imagine specifying this as a back-cover text:
fr: Les textes de couverture sont une nouvelle possibilit&eacute;, il m'est donc impossible de citer tel exemple de son utilisation par le pass&eacute;. Mais le but recherch&eacute; est simple&nbsp;: ces textes sont l&agrave; pour permettre au premier &eacute;diteur d'encourager les gens &agrave; acheter les copies qu'il publie, plut&ocirc;t que celles d'un &eacute;diteur suivant. Par exemple, nous pourrions envisager un texte de derni&egrave;re page de couverture comme suit&nbsp;:

source: Free Manuals Inc. paid Alyssa P. Hacker to write this manual and asks for your support through buying the Free Manuals edition.
fr: Free Manuals Inc. paid Alyssa P. Hacker to write this manual and asks for your support through buying the Free Manuals edition. Voici la traduction de la mention ci-dessus&nbsp;: Les Manuels Libres SA ont pay&eacute; Alyssa P. Hacker pour r&eacute;diger le pr&eacute;sent ouvrage et vous invitent &agrave; les soutenir en achetant l'&eacute;dition issue des Manuels Libres SA.

source: This might help Free Manuals Inc. succeed in the business of publishing free manuals&mdash;at least, that is the plan. To specify this back-cover text, Free Manuals Inc. would write the license notice like this:
fr: Ceci pourrait aider les Manuels Libres SA &agrave; r&eacute;ussir son entreprise de publication d'ouvrages libres. En tout cas, telle est la volont&eacute;. En vue de sp&eacute;cifier ce texte de quatri&egrave;me page de couverture, la SA des Manuels Libres devrait r&eacute;diger la clause de la licence comme suit&nbsp;:

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Marc Chauvet.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
