Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-faq.*.po
Languages: fr

source: Yes. If two parties try to work together to get around the requirements of the GPL, they can both be pursued for copyright infringement. This is especially true since the definition of convey explicitly includes activities that would make someone responsible for secondary infringement.
fr: Oui. Si deux parties essaient de travailler ensemble pour contourner les obligations de la GPL, elles peuvent toutes deux &ecirc;tre poursuivies pour infraction sur le copyright. C'est particuli&egrave;rement vrai puisque la d&eacute;finition de la transmission exclut explicitement les activit&eacute;s qui rendraient quelqu'un responsable en second lieud'infraction.

source: This is acceptable as long as the source checkout process does not become burdensome or otherwise restrictive. Anybody who can download your object code should also be able to check out source from your version control system, using a publicly available free software client. Users should be provided with clear and convenient instructions for how to get the source for the exact object code they downloaded&mdash;they may not necessarily want the latest development code, after all.
fr: Ceci est acceptable tant que la r&eacute;cup&eacute;ration des sources ne devient pas p&eacute;nible ou restrictive. Quiconque peut t&eacute;l&eacute;charger votre code objet doit aussi &ecirc;tre en mesure de r&eacute;cup&eacute;rer les sources &agrave; partir de votre syst&egrave;me de contr&ocirc;le de version, en utilisant un logiciel client gratuit disponible publiquement. Les utilisateurs doivent obtenir des instructions claires et ad&eacute;quates sur la fa&ccedil;on d'obtenir les sources sur le code objet pr&eacute;cis qu'ils ont t&eacute;l&eacute;charg&eacute; &mdash; ils peuvent ne pas vouloir n&eacute;cessairement les derniers d&eacute;veloppement du code apr&egrave;s tout.

source: No. The definition of Installation Information, which must be provided with source when the software is conveyed inside a User Product, explicitly says: &ldquo;The information must suffice to ensure that the continued functioning of the modified object code is in no case prevented or interfered with solely because modification has been made.&rdquo; If the device uses remote attestation in some way, the Installation Information must provide you some means for your modified software to report itself as legitimate.
fr: Non. La d&eacute;finition des informations d'installation, qui doivent &ecirc;tre fournies avec les sources du logiciel qui est transmis dans un produit utilisateur dit explicitement&nbsp;: &laquo;&nbsp;Les informations doivent suffire &agrave; assurer que le fonctionnement continu du code objet modifi&eacute; n'est en aucun cas emp&ecirc;ch&eacute; ou n'interf&egrave;re seulement parce qu'une modification a &eacute;t&eacute; faite.&nbsp;&raquo; Si l'appareil utilise une quelconque attestation &agrave; distance, les informations d'installation doivent vous fournir des moyens pour que votre logiciel modifi&eacute; soit authentifi&eacute; comme l&eacute;gitime.

source: This refers to rules about traffic you can send over the network. For example, if there is a limit on the number of requests you can send to a server per day, or the size of a file you can upload somewhere, your access to those resources may be denied if you do not respect those limits.
fr: Ceci se r&eacute;f&egrave;re au trafic que vous pouvez envoyer par le r&eacute;seau. Par exemple, s'il y a une limite sur le nombre de requ&ecirc;tes que vous pouvez envoyer &agrave; un serveur par jour, ou la taille d'un fichier que vous pouvez t&eacute;l&eacute;charger vers une destination, votre acc&egrave;s &agrave; ces ressources peut &ecirc;tre refus&eacute; si vous ne respectez pas ces limites.

source: These rules do not include anything that does not pertain directly to data traveling across the network. For instance, if a server on the network sent messages for users to your device, your access to the network could not be denied merely because you modified the software so that it did not display the messages.
fr: Ces r&egrave;gles n'incluent pas quoi que ce soit qui ne se rapportent pas directement aux donn&eacute;es voyageant sur le r&eacute;seau. Par exemple, si un serveur du r&eacute;seau envoie des messages aux utilisateurs pour votre appareil, votre acc&egrave;s au r&eacute;seau ne pourrait pas &ecirc;tre refus&eacute; simplement parce que vous avez modifi&eacute; le logiciel pour qu'il n'affiche pas les messages.

source: This includes the kind of service many device manufacturers provide to help you install, use, or troubleshoot the product. If a device relies on access to web services or similar technology to function properly, those should normally still be available to modified versions, subject to the terms in section 6 regarding access to a network.
fr: Ceci inclut le genre de service que beaucoup de fabricants fournissent pour vous aider &agrave; installer, utiliser ou d&eacute;panner le produit. Si un appareil repose sur l'acc&egrave;s aux services Web ou des technologies similaires pour fonctionner correctement, celles-ci doivent encore &ecirc;tre disponibles pour les versions modifi&eacute;es, en accord avec les termes de la section 6 concernant l'acc&egrave;s &agrave; un r&eacute;seau.

source: This simply means that the following terms prevail over anything else in the license that may conflict with them. For example, without this text, some people might have claimed that you could not combine code under GPLv3 with code under AGPLv3, because the AGPL's additional requirements would be classified as &ldquo;further restrictions&rdquo; under section 7 of GPLv3. This text makes clear that our intended interpretation is the correct one, and you can make the combination.
fr: Ceci signifie simplement que les termes suivants pr&eacute;valent sur toute autre chose dans la licence qui peut entre en conflit avec eux. Par exemple, sans ce texte, certaines personnes auraient pu revendiquer que vous ne pourriez pas combiner du code sous GPLv3 avec du code sous AGPLv3, car les conditions additionnelles de l'AGPL seraient consid&eacute;r&eacute;es comme &laquo;&nbsp;further restrictions&nbsp;&raquo; (des restrictions suppl&eacute;mentaires) dans la section 7 de la GPLv3. Ce texte rend clair que l'interpr&eacute;tation voulue est correcte et que vous pouvez faire la combinaison.

source: This text only resolves conflicts between different terms of the license. When there is no conflict between two conditions, then you must meet them both. These paragraphs don't grant you carte blanche to ignore the rest of the license&mdash;instead they're carving out very limited exceptions.
fr: Ce texte r&eacute;soud seulement des conflits entre les diff&eacute;rents termes de la licence. Quand il n'y a pas de conflit entre deux conditions, vous devez alors satisfaire les deux. Ces paragraphes ne vous donne pas carte blanche pour ignorer le reste de la licence (ils pr&eacute;cisent plut&ocirc;t des exceptions tr&egrave;s limit&eacute;es).

source: &ldquo;Corresponding Source&rdquo; is defined in section 1 of the license, and you should provide what it lists. So, if your modified version depends on libraries under other licenses, such as the Expat license or GPLv3, the Corresponding Source should include those libraries (unless they are System Libraries). If you have modified those libraries, you must provide your modified source code for them.
fr: La «&nbsp;Source correspondante&nbsp;» est définie dans la section 1 de la licence, et vous devez fournir ce qu'elle liste. Donc, si votre version modifiée dépend de bibliothèques sous d'autres licences, comme la licence Expat ou la GPLv3, la Source correspondante doit inclure ces bibliothèques (à moins que ce soit des bibliothèques système). Si vous avez modifié ces bibliothèques, vous devez produire votre code source modifié pour celles-ci.

source: The last sentence of the first paragraph of section 13 is only meant to reinforce what most people would have naturally assumed: even though combinations with code under GPLv3 are handled through a special exception in section 13, the Corresponding Source should still include the code that is combined with the Program this way. This sentence does not mean that you <em>only</em> have to provide the source that's covered under GPLv3; instead it means that such code is <em>not</em> excluded from the definition of Corresponding Source.
fr: La dernière phrase du premier paragraphe de la section 13 est seulement faite pour réaffirmer ce que la plupart des gens auraient naturellement supposé&nbsp;: même si les combinaisons de code sous GPLv3 sont traitées par l'exception spéciale de la section 13, la Source correspondante doit quand même inclure le code qui est combiné avec le Programme de cette façon. Cette phrase ne signifie pas que vous devez <em>seulement</em> fournir la source couverte par la GPLv3&nbsp; mais plutôt qu'un tel code n'est <em>pas</em> exclus de la définition de la Source correspondante.

source: If the program is expressly designed to accept user requests and send responses over a network, then it meets these criteria. Common examples of programs that would fall into this category include web and mail servers, interactive web-based applications, and servers for games that are played online.
fr: Si le programme est express&eacute;ment con&ccedil;u pour accepter les requ&ecirc;tes des utilisateurs et envoyer des r&eacute;ponse sur un r&eacute;seau, alors il remplit les conditions. Des exemples communs de programmes qui tomberaient dans cette cat&eacute;gorie comprennent les serveur de messagerie et les serveurs Web, les applications interactives en ligne et les serveurs pour les jeux en ligne.

source: If a program is not expressly designed to interact with a user through a network, but is being run in an environment where it happens to do so, then it does not fall into this category. For example, an application is not required to provide source merely because the user is running it over SSH, or a remote X session.
fr: Si un programme n'est pas express&eacute;ment con&ccedil;u pour interagir avec un utilisateur sur un r&eacute;seau, mais est ex&eacute;cut&eacute; dans un environnement o&ugrave; il lui arrive de le faire, alors il ne tombe pas dans cette cat&eacute;gorie. Par exemple, une application n'est pas forc&eacute;e de fournir les sources simplement parce que l'utilisateur l'ex&eacute;cute via SSH ou une session X distante.

source: They're effectively identical. The definition of &ldquo;Legal Entity&rdquo; in the Apache License 2.0 is very standard in various kinds of legal agreements&mdash;so much so that it would be very surprising if a court did not interpret the term in the same way in the absence of an explicit definition. We fully expect them to do the same when they look at GPLv3 and consider who qualifies as a licensee.
fr: Ils sont en fait identiques. La d&eacute;finition de &laquo;&nbsp;Legal Entity&nbsp;&raquo; (entit&eacute; l&eacute;gale) de la licence Apache 2.0 est tr&egrave;s standard dans divers types d'accords l&eacute;gaux (&agrave; tel point qu'il serait surprenant qu'un tribunal n'interpr&egrave;te pas le terme de la m&ecirc;me fa&ccedil;on en l'absence de d'une d&eacute;finition explicite). Nous nous attendons totalement &agrave; la m&ecirc;me chose quand ils regardent la GPLv3 et consid&egrave;rent qui est qualifi&eacute; de licenci&eacute;.

source: The term &ldquo;the Program&rdquo; means one particular work that is licensed under GPLv3 and is received by a particular licensee from an upstream licensor or distributor. The Program is the particular work of software that you received in a given instance of GPLv3 licensing, as you received it.
fr: Le terme &laquo;&nbsp;le Programme&nbsp;&raquo; signifie un travail particulier qui est sous licence GPLv3 et qui a été reçu par un licencié particulier d'un licenceur ou d'undistributeur. Le Programme est l'&oelig;uvre logicielle particulière que vous avez reçu couverte par la GPLv3.

source: &ldquo;The Program&rdquo; cannot mean &ldquo;all the works ever licensed under GPLv3&rdquo;; that interpretation makes no sense for a number of reasons. We've published an <a href="/licenses/gplv3-the-program.html">analysis of the term &ldquo;the Program&rdquo;</a> for those who would like to learn more about this.
fr: &laquo;&nbsp;Le Programme&nbsp;&raquo; ne peut pas signifier &laquo;&nbsp;toutes les &oelig;uvres jamais licenciées sous la GPLv3&nbsp;&raquo;; cette interprétation n'a pas de sens pour de nombreuses raisons. Nous avons publié une <a href="/licenses/gplv3-the-program.fr.html">analyse du terme &laquo;&nbsp;le Programme&nbsp;&raquo;</a> pour ceux qui voudraient en apprendre plus sur ce sujet.

source: Nothing. The GPL does not place any conditions on this activity.
fr: Rien. La GPL n'a pas de conditions pour cette activité.

source: This should not be required in any typical server-client relationship. AGPLv3 requires a program to offer source code to &ldquo;all users interacting with it remotely through a computer network.&rdquo; In most server-client architectures, it simply wouldn't be reasonable to argue that the server operator is a &ldquo;user&rdquo; interacting with the client in any meaningful sense.
fr: Ceci ne doit pas être requis pour toute relation typique client-serveur. L'AGPLv3 requiert qu'un programme offre le code source à «&nbsp;tous les utilisateurs qui inter-agissent avec lui à distance via un réseau informatique&nbsp;». Dans la plupart des architectures client-serveur, il ne serait tout simplement pas raisonnable d'arguer que l'opérateur du serveur est un «&nbsp;utilisateur&nbsp;» inter-agissant avec le client de quelque façon que ce soit.

source: Consider HTTP as an example. All HTTP clients expect servers to provide certain functionality: they should send specified responses to well-formed requests. The reverse is not true: servers cannot assume that the client will do anything in particular with the data they send. The client may be a web browser, an RSS reader, a spider, a network monitoring tool, or some special-purpose program. The server can make absolutely no assumptions about what the client will do&mdash;so there's no meaningful way for the server operator to be considered a user of that software.
fr: Prenons HTTP comme exemple. Tous les clients HTTP attendent que les serveurs fournissent certaines fonctionnalités&nbsp;: ils peuvent envoyer des réponses spécifiées à des requêtes bien formées. L'inverse n'est pas vrai&nbsp;: les serveurs ne peuvent pas supposer que le client fera quelque chose de particulier avec les données qu'ils envoient. Le client peut être un navigateur Web, un lecteur de flux RSS, un robot, un outil de supervision réseau ou un autre programme spécifique. Le serveur ne peut faire absolument aucune supposition sur ce que le client fera&mdash;il n'y a donc aucun moyen sensé pour que l'opérateur du serveur soit considéré comme un utilisateur du logiciel.

source: The various GNU licenses enjoy broad compatibility between each other. The only time you may not be able to combine code under two of these licenses is when you want to use code that's <em>only</em> under an older version of a license with code that's under a newer version.
fr: Les diverses licences GNU sont pleinement compatibles entre-elles. La seule fois o&ugrave; vous ne pourrez pas combiner de code sous deux de ces licences est quand vous voudrez utiliser du code &eacute;tant couvert <em>seulement</em> par une plus ancienne version de licence avec du code couvert par une version plus r&eacute;cente.

source: Below is a detailed compatibility matrix for various combinations of the GNU licenses, to provide an easy-to-use reference for specific cases. It assumes that someone else has written some software under one of these licenses, and you want to somehow incorporate code from that into a project that you're releasing (either your own original work, or a modified version of someone else's GPLed software). Find the license for your own work in a column at the top of the table, and the license for the other code in a row on the left. The cell where they meet will tell you whether or not this combination is permitted.
fr: Vous trouverez ci-dessous une matrice de compatibilit&eacute; d&eacute;taill&eacute;e des diverses combinaisons de licences GNU, pour avoir une r&eacute;f&eacute;rence facile &agrave; utiliser pour des cas sp&eacute;cifiques. Elle pr&eacute;sume que quelqu'un d'autre a &eacute;crit du logiciel couvert par une de ces licences, et vous voulez incorporer du code de ce logiciel dans un projet que vous publiez (soit de votre cr&eacute;ation, soit une version modifi&eacute;e d'un logiciel de quelqu'un d'autre couvert par la GPL). Trouvez la licence pour votre propre travail dans une colonne au sommet du tableau, et la licence pour l'autre code dans une ligne sur la gauche. La cellule d'intersection vous dira si cette combinaison est permise ou pas.

source: When we say &ldquo;copy code,&rdquo; we mean just that: you're taking a section of code from one source, with or without modification, and inserting it into your own program, thus forming a work based on the first section of code. &ldquo;Use a library&rdquo; means that you're not copying any source directly, but instead interacting with it through linking, importing, or other typical mechanisms that bind the sources together when you compile or run the code.
fr: Quand nous disons &laquo;&nbsp;Copier du code&nbsp;&raquo;, nous voulons seulement dire que vous prenez une section du code, avec ou sans modification et que vous l'ins&eacute;rez dans votre propre programme, formant par cons&eacute;quent un travail bas&eacute; sur la premi&egrave;re section du code. &laquo;&nbsp;Utiliser une biblioth&egrave;que&nbsp;&raquo; signifie que vous ne copiez pas du code directement, mais que vous inter-agissez avec par une liaison, un import ou d'autres m&eacute;canismes typiques qui lient les sources ensemble quand vous compilez ou ex&eacute;cutez le code.

source: <a href="#matrix-skip-target">Skip compatibility matrix</a>
fr: <a href="#matrix-skip-target">Passez la matrice de compatibilit&eacute;</a>

source: I want to release a project under:
fr: Je veux publier un projet sous&nbsp;:

source: GPLv2 only
fr: GPLv2 seulement

source: GPLv2 or later
fr: GPLv2 ou sup&eacute;rieure

source: GPLv3 or later
fr: GPLv3 ou sup&eacute;rieure

source: LGPLv2.1 only
fr: LGPLv2.1 seulement

source: LGPLv2.1 or later
fr: LGPLv2.1 ou sup&eacute;rieure

source: LGPLv3 or later
fr: LGPLv3 ou sup&eacute;rieure

source: I want to copy code under:
fr: Je veux copier du code sous&nbsp;:

source: NO
fr: NON

source: I want to use a library under:
fr: Je veux utiliser une biblioth&egrave;que sous&nbsp;:

source: <a href="#matrix-skip-target">Skip footnotes</a>
fr: <a href="#matrix-skip-target">Passez les notes</a>

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Vincent Veyron, Olivier Berger.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
