Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-faq.*.po
Languages: fr

source: Frequently Asked Questions about the GNU Licenses - GNU Project - Free Software Foundation (FSF)
fr: Foire aux questions sur les licences GNU - GNU Project - Free Software Foundation (FSF)

source: Frequently Asked Questions about the GNU Licenses
fr: Foire aux questions sur les licences GNU

source: This page contains answers to commonly-asked questions about the <a href="/licenses/licenses.html">GNU licenses</a>.
fr: Cette page contient les r&eacute;ponses aux questions les plus courantes sur <a href="/licenses/licenses.fr.html">les licences GNU</a>.

source: Table of Contents
fr: Table des mati&egrave;res

source: Basic questions about the GNU Project, the Free Software Foundation, and its licenses
fr: Questions de base sur le projet GNU, la Fondation pour le logiciel libre et ses licences

source: <a href="#WhatDoesGPLStandFor">What does &ldquo;GPL&rdquo; stand for?</a>
fr: <a href="#WhatDoesGPLStandFor">Que veut dire &laquo;&nbsp;GPL&nbsp;&raquo;&nbsp;?</a>

source: <a href="#DoesFreeSoftwareMeanUsingTheGPL">Does free software mean using the GPL?</a>
fr: <a href="#DoesFreeSoftwareMeanUsingTheGPL">Est-ce que logiciel libre signifie utiliser la GPL&nbsp;?</a>

source: <a href="#WhyUseGPL">Why should I use the GNU GPL rather than other free software licenses?</a>
fr: <a href="#WhyUseGPL">Pourquoi devrais-je utiliser la GNU GPL plut&ocirc;t que d'autres licences de logiciel libre&nbsp;?</a>

source: <a href="#DoesAllGNUSoftwareUseTheGNUGPLAsItsLicense">Does all GNU software use the GNU GPL as its license?</a>
fr: <a href="#DoesAllGNUSoftwareUseTheGNUGPLAsItsLicense">Est-ce que tous les logiciels GNU utilisent la GNU GPL comme licence&nbsp;?</a>

source: <a href="#DoesUsingTheGPLForAProgramMakeItGNUSoftware">Does using the GPL for a program make it GNU software?</a>
fr: <a href="#DoesUsingTheGPLForAProgramMakeItGNUSoftware">Est-ce que le fait d'utiliser la GPL pour un programme en fait un logiciel GNU&nbsp;?</a>

source: <a href="#GPLOtherThanSoftware">Can I use the GPL for something other than software?</a>
fr: <a href="#GPLOtherThanSoftware">Puis-je utiliser la GPL pour autre chose que des logiciels&nbsp;?</a>

source: <a href="#WhyNotGPLForManuals">Why don't you use the GPL for manuals?</a>
fr: <a href="#WhyNotGPLForManuals">Pourquoi n'utilisez-vous pas la GPL pour les manuels&nbsp;?</a>

source: <a href="#GPLTranslations">Are there translations of the GPL into other languages?</a>
fr: <a href="#GPLTranslations">Existe-t-il des traductions de la GPL dans d'autres langues&nbsp;?</a>

source: <a href="#WhySomeGPLAndNotLGPL">Why are some GNU libraries released under the ordinary GPL rather than the Lesser GPL?</a>
fr: <a href="#WhySomeGPLAndNotLGPL">Pourquoi certaines biblioth&egrave;ques GNU sont-elles distribu&eacute;es sous GPL normale, plut&ocirc;t que sous GPL amoindrie (<i>Lesser GPL</i>)&nbsp;?</a>

source: <a href="#WhoHasThePower">Who has the power to enforce the GPL?</a>
fr: <a href="#WhoHasThePower">Qui a la capacit&eacute; de faire respecter la GPL&nbsp;?</a>

source: <a href="#AssignCopyright">Why does the FSF require that contributors to FSF-copyrighted programs assign copyright to the FSF? If I hold copyright on a GPL'ed program, should I do this, too? If so, how?</a>
fr: <a href="#AssignCopyright">Pourquoi la FSF requiert-elle que les contributeurs de programmes sous copyright de la FSF transf&egrave;rent le copyright &agrave; la FSF&nbsp;? Si je d&eacute;tiens le copyright d'un programme sous GPL, devrais-je faire la m&ecirc;me chose&nbsp;? Si oui, comment&nbsp;?</a>

source: <a href="#ModifyGPL">Can I modify the GPL and make a modified license?</a>
fr: <a href="#ModifyGPL">Puis-je modifier la GPL et faire une licence modifi&eacute;e&nbsp;?</a>

source: <a href="#SeparateAffero">Why did you decide to write the GNU Affero GPLv3 as a separate license?</a>
fr: <a href="#SeparateAffero">Pourquoi avez-vous d&eacute;cider d'&eacute;crire la GNU Affero GPLv3 comme une licence distincte&nbsp;?</a>

source: General understanding of the GNU licenses
fr: Compr&eacute;hension g&eacute;n&eacute;rale des licences GNU

source: <a href="#WhyDoesTheGPLPermitUsersToPublishTheirModifiedVersions">Why does the GPL permit users to publish their modified versions?</a>
fr: <a href="#WhyDoesTheGPLPermitUsersToPublishTheirModifiedVersions">Pourquoi la GPL permet-elle aux utilisateurs de publier leur versions modifi&eacute;es&nbsp;?</a>

source: <a href="#GPLRequireSourcePostedPublic">Does the GPL require that source code of modified versions be posted to the public?</a>
fr: <a href="#GPLRequireSourcePostedPublic">Est-ce que la GPL requiert que le code source des versions modifi&eacute;es soit port&eacute; &agrave; la connaissance du public&nbsp;?</a>

source: <a href="#GPLAndNonfreeOnSameMachine">Can I have a GPL-covered program and an unrelated non-free program on the same computer?</a>
fr: <a href="#GPLAndNonfreeOnSameMachine">Puis-je avoir un programme couvert par la GPL et un programme non-libre ind&eacute;pendant sur le m&ecirc;me ordinateur&nbsp;?</a>

source: <a href="#CanIDemandACopy">If I know someone has a copy of a GPL-covered program, can I demand he give me a copy?</a>
fr: <a href="#CanIDemandACopy">Si je connais quelqu'un qui a une copie d'un programme couvert par la GPL, puis-je lui demander de me donner une copie&nbsp;?</a>

source: <a href="#WhatDoesWrittenOfferValid">What does &ldquo;written offer valid for any third party&rdquo; mean in GPLv2? Does that mean everyone in the world can get the source to any GPL'ed program no matter what?</a>
fr: <a href="#WhatDoesWrittenOfferValid">Que veut dire &laquo;&nbsp;offre &eacute;crite valide pour n'importe quel tiers&nbsp;&raquo; (<i>written offer valid for any third party</i>)&nbsp;? Cela signifie-t-il que n'importe qui peut obtenir les sources de n'importe quel programme sous GPL dans tous les cas&nbsp;?</a>

source: <a href="#TheGPLSaysModifiedVersions">The GPL says that modified versions, if released, must be &ldquo;licensed &hellip; to all third parties.&rdquo; Who are these third parties?</a>
fr: <a href="#TheGPLSaysModifiedVersions">La GPL dit que les versions modifi&eacute;es, si elles sont diffus&eacute;es, doivent &ecirc;tre &laquo;&nbsp;donner une licence &hellip; pour tout tiers&nbsp;&raquo; (<i>&laquo;&nbsp;licensed &hellip; to all third parties.&nbsp;&raquo;</i>). Qui sont ces tiers&nbsp;?</a>

source: <a href="#DoesTheGPLAllowMoney">Does the GPL allow me to sell copies of the program for money?</a>
fr: <a href="#DoesTheGPLAllowMoney">Est-ce que la GPL m'autorise &agrave; vendre des copies payantes de mon programme&nbsp;?</a>

source: <a href="#DoesTheGPLAllowDownloadFee">Does the GPL allow me to charge a fee for downloading the program from my site?</a>
fr: <a href="#DoesTheGPLAllowDownloadFee">La GPL me permet-elle de demander de l'argent pour le t&eacute;l&eacute;chargement d'un programme sur mon site&nbsp;?</a>

source: <a href="#DoesTheGPLAllowRequireFee">Does the GPL allow me to require that anyone who receives the software must pay me a fee and/or notify me?</a>
fr: <a href="#DoesTheGPLAllowRequireFee">Est-ce que la GPL m'autorise &agrave; exiger que quiconque re&ccedil;oit le logiciel doive me payer un montant et/ou me le signaler&nbsp;?</a>

source: <a href="#DoesTheGPLRequireAvailabilityToPublic">If I distribute GPL'd software for a fee, am I required to also make it available to the public without a charge?</a>
fr: <a href="#DoesTheGPLRequireAvailabilityToPublic">Si je distribue un programme couvert par la GPL contre r&eacute;mun&eacute;ration, suis-je oblig&eacute; de le rendre &eacute;galement disponible au public gratuitement&nbsp;?</a>

source: <a href="#DoesTheGPLAllowNDA">Does the GPL allow me to distribute a copy under a nondisclosure agreement?</a>
fr: <a href="#DoesTheGPLAllowNDA">La GPL me permet-elle de distribuer une copie sous accord de non divulgation&nbsp;?</a>

source: <a href="#DoesTheGPLAllowModNDA">Does the GPL allow me to distribute a modified or beta version under a nondisclosure agreement?</a>
fr: <a href="#DoesTheGPLAllowModNDA">La GPL me permet-elle de distribuer une version modifi&eacute;e ou beta sous accord de non divulgation&nbsp;?</a>

source: <a href="#DevelopChangesUnderNDA">Does the GPL allow me to develop a modified version under a nondisclosure agreement?</a>
fr: <a href="#DevelopChangesUnderNDA">La GPL me permet-elle de d&eacute;velopper une version modifi&eacute;e sous accord de non divulgation&nbsp;?</a>

source: <a href="#WhyMustIInclude">Why does the GPL require including a copy of the GPL with every copy of the program?</a>
fr: <a href="#WhyMustIInclude">Pourquoi la GPL exige-t-elle d'inclure une copie de la GPL avec chaque copie du programme&nbsp;?</a>

source: <a href="#WhatIfWorkIsShort">What if the work is not much longer than the license itself?</a>
fr: <a href="#WhatIfWorkIsShort">Et si le programme n'est gu&egrave;re plus long que la licence elle-m&ecirc;me&nbsp;?</a>

source: <a href="#RequiredToClaimCopyright">Am I required to claim a copyright on my modifications to a GPL-covered program?</a>
fr: <a href="#RequiredToClaimCopyright">Dois-je revendiquer un copyright pour mes modifications sur un programme couvert par la GPL&nbsp;?</a>

source: <a href="#CombinePublicDomainWithGPL">If a program combines public-domain code with GPL-covered code, can I take the public-domain part and use it as public domain code?</a>
fr: <a href="#CombinePublicDomainWithGPL">Si un programme combine du code du domaine public et du code couvert sous GPL, Puis-je prendre la partie d&eacute;pendant du domaine public et l'utiliser comme tel&nbsp;?</a>

source: <a href="#IWantCredit">I want to get credit for my work. I want people to know what I wrote. Can I still get credit if I use the GPL?</a>
fr: <a href="#IWantCredit">Je veux que mon travail soit reconnu. Je veux que les gens sachent ce que j'ai &eacute;crit. Puis-je encore &ecirc;tre reconnu si j'utilise la GPL&nbsp;?</a>

source: <a href="#GPLOmitPreamble">Can I omit the preamble of the GPL, or the instructions for how to use it on your own programs, to save space?</a>
fr: <a href="#GPLOmitPreamble">Puis-je &ocirc;ter le pr&eacute;ambule de la GPL, ou les instructions sur la fa&ccedil;on de l'utiliser dans vos propres programmes, pour &eacute;conomiser de l'espace&nbsp;?</a>

source: <a href="#WhatIsCompatible">What does it mean to say that two licenses are &ldquo;compatible&rdquo;?</a>
fr: <a href="#WhatIsCompatible">Que signifie le fait que deux licences sont &laquo;&nbsp;compatibles&nbsp;&raquo;&nbsp;?</a>

source: <a href="#WhatDoesCompatMean">What does it mean to say a license is &ldquo;compatible with the GPL&rdquo;?</a>
fr: <a href="#WhatDoesCompatMean">Que veut dire le fait qu'une licence soit &laquo;&nbsp;compatible avec la GPL&nbsp;&raquo; (<i>&laquo;&nbsp;compatible with the GPL&nbsp;&raquo;</i>)&nbsp;?</a>

source: <a href="#OrigBSD">Why is the original BSD license incompatible with the GPL?</a>
fr: <a href="#OrigBSD">Pourquoi la licence BSD originale est-elle incompatible avec la GPL&nbsp;?</a>

source: <a href="#MereAggregation">What is the difference between an &ldquo;aggregate&rdquo; and other kinds of &ldquo;modified versions&rdquo;?</a>
fr: <a href="#MereAggregation">Quelle est la diff&eacute;rence entre <i>&laquo;&nbsp;aggregation&nbsp;&raquo;</i> et d'autres types de <i>&laquo;&nbsp;versions modifiées&nbsp;&raquo;</i>&nbsp;?</a>

source: <a href="#GPLCommercially">If I use a piece of software that has been obtained under the GNU GPL, am I allowed to modify the original code into a new program, then distribute and sell that new program commercially?</a>
fr: <a href="#GPLCommercially">Si j'utilise un morceau de logiciel que j'ai obtenu sous GNU GPL, ai-je le droit de modifier le code original pour cr&eacute;er un nouveau programme, puis de commercialiser ce programme&nbsp;?</a>

source: <a href="#NoMilitary">I'd like to license my code under the GPL, but I'd also like to make it clear that it can't be used for military and/or commercial uses. Can I do this?</a>
fr: <a href="#NoMilitary">Je voudrais mettre mon code sous licence GPL, mais je voudrais aussi qu'il soit clair qu'il ne peut pas &ecirc;tre utilis&eacute; pour des usages militaires ou commerciaux. Puis-je faire cela&nbsp;?</a>

source: <a href="#GPLHardware">Can I use the GPL to license hardware?</a>
fr: <a href="#GPLHardware">Puis-je utiliser la GPL pour mettre sous licence du mat&eacute;riel&nbsp;?</a>

source: <a href="#Prelinking">Does prelinking a GPLed binary to various libraries on the system, to optimize its performance, count as modification?</a>
fr: <a href="#Prelinking">Est-ce que la pr&eacute;-liaison de binaires sous GPL &agrave; diverses biblith&egrave;ques du syst&egrave;me, pour optimiser les performances, compte comme une modification&nbsp;?</a>

source: <a href="#LGPLJava">How does the LGPL work with Java?</a>
fr: <a href="#LGPLJava">Comment la LGPL fonctionne avec Java&nbsp;?</a>

source: <a href="#WhyPropagateAndConvey">Why did you invent the new terms &ldquo;propagate&rdquo; and &ldquo;convey&rdquo; in GPLv3?</a>
fr: <a href="#WhyPropagateAndConvey">Pourquoi avoir invent&eacute; les nouveaux mots &laquo;&nbsp;propagate&nbsp;&raquo;(propager) et &laquo;&nbsp;convey&nbsp;&raquo; (transmettre) dans la GPLv3&nbsp;?</a>

source: <a href="#ConveyVsDistribute">Is &ldquo;convey&rdquo; in GPLv3 the same thing as what GPLv2 means by &ldquo;distribute&rdquo;?</a>
fr: <a href="#ConveyVsDistribute">Est-ce que &laquo;&nbsp;convey&nbsp;&raquo; (transmettre) dans la GPLv3 est la même chose que &laquo;&nbsp;distribute&nbsp;&raquo; (distribuer) dans la GPLv2&nbsp;?</a>

source: <a href="#NoDistributionRequirements">If I only make copies of a GPL-covered program and run them, without distributing or conveying them to others, what does the license require of me?</a>
fr: <a href="#NoDistributionRequirements">Si je fais seulement des copies d'un programme couvert par la GPL et que je les exécute, sans les distribuer ou les transmettre à d'autres, que m'impose de faire la licence&nbsp;?</a>

source: <a href="#v3MakingAvailable">GPLv3 gives &ldquo;making available to the public&rdquo; as an example of propagation. What does this mean? Is making available a form of conveying?</a>
fr: <a href="#v3MakingAvailable">La GPLv3 donne comme exemple de propagation &laquo;&nbsp;la mise &agrave; disposition du public&nbsp;&raquo;. Que cela signifie-t-il&nbsp;? La mise &agrave; disposition est-elle une forme de transmission&nbsp;?</a>

source: <a href="#PropagationNotConveying">Since distribution and making available to the public are forms of propagation that are also conveying in GPLv3, what are some examples of propagation that do not constitute conveying?</a>
fr: <a href="#PropagationNotConveying">Puisque la distribution et la mise &agrave; disposition du public sont des formes de propagation qui transmettent aussi la GPLv3, quels sont les exemples de propagation qui ne constituent pas une transmission&nbsp;?</a>

source: <a href="#BitTorrent">How does GPLv3 make BitTorrent distribution easier?</a>
fr: <a href="#BitTorrent">Comment la GPLv3 rend la distribution par BitTorrent plus facile&nbsp;?</a>

source: <a href="#Tivoization">What is tivoization? How does GPLv3 prevent it?</a>
fr: <a href="#Tivoization">Qu'est-ce que la &laquo;&nbsp;tivoisation&nbsp;&raquo;&nbsp;? Comment la GPLv3 l'emp&ecirc;che&nbsp;?</a>

source: <a href="#DRMProhibited">Does GPLv3 prohibit DRM?</a>
fr: <a href="#DRMProhibited">La GPLv3 interdit-elle les <acronym title="Digital Rights Management">DRM</acronym> (gestion des droits num&eacute;riques)&nbsp;?</a>

source: <a href="#v3VotingMachine">Does GPLv3 require that voters be able to modify the software running in a voting machine?</a>
fr: <a href="#v3VotingMachine">La GPLv3 n&eacute;cessite-t-elle que les votants puissent modifier le logiciel utilis&eacute; dans une machine &agrave; voter&nbsp;?</a>

source: <a href="#v3PatentRetaliation">Does GPLv3 have a &ldquo;patent retaliation clause&rdquo;?</a>
fr: <a href="#v3PatentRetaliation">La GPLv3 a-t-elle une &laquo;&nbsp;patent retaliation clause&nbsp;&raquo; (clause de r&eacute;torsion de brevets)&nbsp;?</a>

source: <a href="#v3Notwithstanding">In GPLv3 and AGPLv3, what does it mean when it says &ldquo;notwithstanding any other provision of this License&rdquo;?</a>
fr: <a href="#v3Notwithstanding">Dans la GPLv3 et l'AGPLv3, que signifie &laquo;&nbsp;notwithstanding any other provision of this License&nbsp;&raquo; (nonobstant toute autre clause de la Licence)&nbsp;?</a>

source: <a href="#AGPLv3InteractingRemotely">In AGPLv3, what counts as &ldquo; interacting with [the software] remotely through a computer network?&rdquo;</a>
fr: <a href="#AGPLv3InteractingRemotely">Dans l'AGPLv3, qu'est-ce qui compte pour &laquo;&nbsp;interacting with [the software] remotely through a computer network&nbsp;&raquo; (interagissant avec [le logiciel] &agrave; distance par l'interm&eacute;diaire d'une r&eacute;seau)&nbsp;?</a>

source: <a href="#ApacheLegalEntity">How does GPLv3's concept of &ldquo;you&rdquo; compare to the definition of &ldquo;Legal Entity&rdquo; in the Apache License 2.0?</a>
fr: <a href="#ApacheLegalEntity">Comment se situe le concept de &laquo;&nbsp;you&nbsp;&raquo; de la GPLv3 apr rapport &agrave; la d&eacute;finition de &laquo;&nbsp;Legal Entity&nbsp;&raquo; de la licence Apache 2.0&nbsp;?</a>

source: <a href="#v3TheProgram">In GPLv3, what does &ldquo;the Program&rdquo; refer to? Is it every program ever released under GPLv3?</a>
fr: <a href="#v3TheProgram">Dans la In GPLv3, à quoi se réfère &laquo;&nbsp;le Programme&nbsp;&raquo;&nbsp;? Est-ce chaque programme publié sous la GPLv3&nbsp;?</a>

source: <a href="#AGPLv3ServerAsUser">If some network client software is released under AGPLv3, does it have to be able to provide source to the servers it interacts with?</a>
fr: <a href="#AGPLv3ServerAsUser">Si des logiciels clients réseau sont publiés sous licence AGPLv3, doivent-ils être en mesure de fournir le source des serveurs avec lesquels ils inter-agissent&nbsp;?</a>

source: Using GNU licenses for your programs
fr: Utiliser les licences GNU pour vos programmes

source: <a href="#v3HowToUpgrade">How do I upgrade from (L)GPLv2 to (L)GPLv3?</a>
fr: <a href="#v3HowToUpgrade">Comment mettre à jour à partir de la (L)GPLv2 vers la (L)GPLv3&nbsp;?</a>

source: <a href="#CouldYouHelpApplyGPL">Could you give me step by step instructions on how to apply the GPL to my program?</a>
fr: <a href="#CouldYouHelpApplyGPL">Pourriez-vous me donner des instructions d&eacute;taill&eacute;es sur la fa&ccedil;on d'appliquer la GPL &agrave; mon programme&nbsp;?</a>

source: <a href="#HowIGetCopyright">How do I get a copyright on my program in order to release it under the GPL?</a>
fr: <a href="#HowIGetCopyright">Comment obtenir un copyright sur mon programme de fa&ccedil;on &agrave; le distribuer sous la GPL&nbsp;?</a>

source: <a href="#WhatIfSchool">What if my school might want to make my program into its own proprietary software product?</a>
fr: <a href="#WhatIfSchool">Et si mon &eacute;cole d&eacute;cidait de mettre mon programme dans son propre logiciel propri&eacute;taire&nbsp;?</a>

source: <a href="#ReleaseUnderGPLAndNF">I would like to release a program I wrote under the GNU GPL, but I would like to use the same code in non-free programs.</a>
fr: <a href="#ReleaseUnderGPLAndNF">Je voudrais diffuser sous GNU GPL un programme que j'ai &eacute;crit, mais j'aimerais utiliser le m&ecirc;me code dans un programme non-libre.</a>

source: <a href="#CanDeveloperThirdParty">Can the developer of a program who distributed it under the GPL later license it to another party for exclusive use?</a>
fr: <a href="#CanDeveloperThirdParty">Le d&eacute;veloppeur d'un programme qui l'a distribu&eacute; sous GPL peut-il ensuite &eacute;tablir avec un tiers une licence pour son usage exclusif&nbsp;?</a>

source: <a href="#GPLUSGov">Can the US Government release a program under the GNU GPL?</a>
fr: <a href="#GPLUSGov">Le gouvernement am&eacute;ricain peut-il publier un programme couvert par la GNU GPL&nbsp;?</a>

source: <a href="#GPLUSGovAdd">Can the US Government release improvements to a GPL-covered program?</a>
fr: <a href="#GPLUSGovAdd">Le gouvernement am&eacute;ricain peut-il publier des am&eacute;liorations d'un programme couvert par la GPL&nbsp;?</a>

source: <a href="#VersionThreeOrLater">Why should programs say &ldquo;Version&nbsp;3 of the GPL or any later version&rdquo;?</a>
fr: <a href="#VersionTwoOrLater">Pourquoi les programmes doivent-ils se r&eacute;f&eacute;rer &agrave; &laquo;&nbsp;la version 3 de la GPL ou toute version ult&eacute;rieure&nbsp;&raquo; (<i>&laquo;Version 3 of the GPL or any later version&nbsp;&raquo;</i>)&nbsp;?</a>

source: <a href="#GPLOutput">Is there some way that I can GPL the output people get from use of my program? For example, if my program is used to develop hardware designs, can I require these these designs must be free?</a>
fr: <a href="#GPLOutput">Y a-t-il un moyen de mettre sous GPL le r&eacute;sultat que les utilisateurs obtiennent en se servant de mon programme&nbsp;? Par exemple, si mon programme sert &agrave; produire des &eacute;l&eacute;ments de conception de composants mat&eacute;riels, puis-je exiger que ces &eacute;l&eacute;ments de conception soient libres&nbsp;?</a>

source: <a href="#FontException">How does the GPL apply to fonts?</a>
fr: <a href="#FontException">Comment la GPL s'applique t-elle aux polices&nbsp;?</a>

source: <a href="#WMS">What license should I use for website maintenance system templates?</a>
fr: <a href="#WMS">Quelle licence dois-je utiliser pour des mod&egrave;les de syst&egrave;me de maintenance de sites Web&nbsp;?</a>

source: <a href="#NonFreeTools">Can I release a program under the GPL which I developed using non-free tools?</a>
fr: <a href="#NonFreeTools">Puis-je publier un programme sous licence GPL que j'ai d&eacute;velopp&eacute; en utilisant des outils non-libres&nbsp;?</a>

source: <a href="#GiveUpKeys">I use public key cryptography to sign my code to assure its authenticity. Is it true that GPLv3 forces me to release my private signing keys?</a>
fr: <a href="#GiveUpKeys">J'utilise une cl&eacute; de chiffrement publique pour signer mon code pour assurer son authenticit&eacute;. Est-il vrai que la GPLv3 m'oblige &agrave; publier mes cl&eacute;s de signature priv&eacute;es&nbsp;?</a>

source: <a href="#v3InternationalDisclaimers">The warranty and liability disclaimers in GPLv3 seem specific to U.S. law. Can I add my own disclaimers to my own code?</a>
fr: <a href="#v3InternationalDisclaimers">Les clauses de garantie et de responsabilit&eacute; dans la GPLv3 semblent sp&eacute;cifiques &agrave; la loi am&eacute;ricaine. Puis-je ajouter mes propres clauses &agrave; mon code&nbsp;?</a>

source: <a href="#NonvisualLegalNotices">My program has interactive user interfaces that are non-visual in nature. How can I comply with the Appropriate Legal Notices requirement in GPLv3?</a>
fr: <a href="#NonvisualLegalNotices">Mon programme a des interfaces utilisateur interactives qui ne sont pas de nature visuelles. Comment puis-je me conformer aux notices l&eacute;gales appropri&eacute;es de la GPLv3&nbsp;?</a>

source: Distribution of programs released under the GNU licenses
fr: Distribution de programmes couverts par les licences GNU

source: <a href="#ModifiedJustBinary">Can I release a modified version of a GPL-covered program in binary form only?</a>
fr: <a href="#ModifiedJustBinary">Puis-je publier une version modifi&eacute;e d'un programme sous GPL sous forme binaire uniquement&nbsp;?</a>
