Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-faq.*.po
Languages: fr

source: Second, replace all your existing v2 license notices (usually at the top of each file) with the new recommended text available on <a href="/licenses/gpl-howto.html">the GNU licenses howto</a>. It's more future-proof because it no longer includes the FSF's postal mailing address.
fr: Ensuite, remplacez toutes vos notices de licences v2 existantes (généralement, au début de chaque fichier) avec le nouveau texte recommandé disponible dans <a href="/licenses/gpl-howto.fr.html">Comment utiliser les licences GNU pour vos logiciels&nbsp;?</a>. Ce sera plus sûr à l'avenir car il n'inclut plus l'adesse postale de la FSF.

source: Of course, any descriptive text (such as in a README) which talks about the package's license should also be updated appropriately.
fr: Bien sûr, tout texte descriptif (comme dans le fichier README), qui parle de la licence du paquetage doit être aussi mis à jour de façon appropriée.

source: Because GPLv2 was written before peer-to-peer distribution of software was common, it is difficult to meet its requirements when you share code this way. The best way to make sure you are in compliance when distributing GPLv2 object code on BitTorrent would be to include all the corresponding source in the same torrent, which is prohibitively expensive.
fr: Parce que la GPLv2 a &eacute;t&eacute; &eacute;crite avant que la distribution pair-&agrave;-pair de logiciels ne soit courante, il est difficile de respecter ses conditions quand on partage du code de cette fa&ccedil;on. La meilleure mani&egrave;re pour s'assurer que vous &ecirc;tes en conformit&eacute; en distribuant du code sous GPLv2 avec BitTorrent serait d'inclure toutes les sources correspondantes dans le m&ecirc;me torrent, ce qui serait beaucoup trop co&ucirc;teux.

source: GPLv3 addresses this problem in two ways. First, people who download this torrent and send the data to others as part of that process are not required to do anything. That's because section 9 says &ldquo;Ancillary propagation of a covered work occurring solely as a consequence of using peer-to-peer transmission to receive a copy likewise does not require acceptance [of the license].&rdquo;
fr: La GPLv3 corrige ce probl&egrave;me de deux mani&egrave;res. D'abord, les personnes qui t&eacute;l&eacute;chargent ce torrent et envoient les donn&eacute;es &agrave; d'autres pendant le processus ne sont pas requis de faire quoi que ce soit. C'est parce que la section 9 dit&nbsp;: &laquo;&nbsp;Ancillary propagation of a covered work occurring solely as a consequence of using peer-to-peer transmission to receive a copy likewise does not require acceptance [of the license].&nbsp;&raquo; (&laquo;&nbsp;La propagation domestique d'un travail couvert n'intervenant que comme une cons&eacute;quence de l'utilisation de la transmission pair-&agrave;-pair pour recevoir une copie ne n&eacute;cessite pareillement aucune acceptation [de la licence].&nbsp;&raquo;).

source: Second, section 6(e) of GPLv3 is designed to give distributors&mdash;people who initially seed torrents&mdash;a clear and straightforward way to provide the source, by telling recipients where it is available on a public network server. This ensures that everyone who wants to get the source can do so, and it's almost no hassle for the distributor.
fr: Ensuite, la section 6(e) de la GPLv3 est con&ccedil;ue pour donner aux distributeurs &mdash; les personnes qui initient les torrents &mdash; un moyen clair et simple de fournir les sources, en disant au destinataires o&ugrave; elles sont disponibles sur un serveur public. Ceci assure que quiconque veut obtenir les sources peut le faire et ce n'est pratiquement pas d&eacute;rangeant pour le distributeur.

source: Some devices utilize free software that can be upgraded, but are designed so that users are not allowed to modify that software. There are lots of different ways to do this; for example, sometimes the hardware checksums the software that is installed, and shuts down if it doesn't match an expected signature. The manufacturers comply with GPLv2 by giving you the source code, but you still don't have the freedom to modify the software you're using. We call this practice tivoization.
fr: Certains appareils utilisent les logiciels libres qui peuvent &ecirc;tre mis &agrave; jour, mais sont con&ccedil;us pour que les utilisateurs ne soient pas autoris&eacute;s &agrave; modifier ces logiciels. Il y a beaucoup de fa&ccedil;ons diff&eacute;rentes de faire ceci&nbsp;; par exemple, parfois le mat&eacute;riel lance des contr&ocirc;les sur les logiciels install&eacute;s et s'&eacute;teint s'il ne trouve pas les sugnatures attendues. Les fabricants se conforment &agrave; la GPLv2 en vous donnant les sources, mais vous n'avez toujours pas la libert&eacute; de modifier les logiciels que vous utilisez. Nous appelons cette pratique &laquo;&nbsp;tivoisation&nbsp;&raquo;.

source: When people distribute User Products that include software under GPLv3, section 6 requires that they provide you with information necessary to modify that software. User Products is a term specially defined in the license; examples of User Products include portable music players, digital video recorders, and home security systems.
fr: Quand des personnes distribuent des &laquo;&nbsp;produits utilisateur&nbsp;&raquo; qui incluent des logiciels sous GPLv3, la section 6 n&eacute;cessite qu'ils fournissent les informations n&eacute;cessaires pour modifier les logiciels. Les &laquo;&nbsp;produits utilisateur&nbsp;&raquo; est un terme sp&eacute;cialement d&eacute;fini dans la licence&nbsp;; des exemples de &laquo;&nbsp;produits utilisateur&nbsp;&raquo; incluent les lecteurs musicaux portables, les enregistreurs vid&eacute;o num&eacute;riques et les syst&egrave;mes de s&eacute;curit&eacute; domestiques.

source: It does not; you can use code released under GPLv3 to develop any kind of DRM technology you like. However, if you do this, section 3 says that the system will not count as an effective technological &ldquo;protection&rdquo; measure, which means that if someone breaks the DRM, he will be free to distribute his software too, unhindered by the DMCA and similar laws.
fr: Non&nbsp;; vous pouvez utiliser du code publi&eacute; sous GPLv3 pour d&eacute;velopper toutes sortes de technologies DRM que vous voulez. Cependant, si vous faites cela, la section 3 dit que ce syst&egrave;me ne comptera pas comme une mesure de &laquo;&nbsp;protection&nbsp;&raquo; technologique r&eacute;elle, ce qui signifie que si quelqu'un casse les DRM, il sera libre de distribuer son logiciel aussi, sans les entraves de la <acronym title="Digital Millenium Copyright Act">DMCA</acronym> et lois similaires.

source: As usual, the GNU GPL does not restrict what people do in software, it just stops them from restricting others.
fr: Comme d'habitude, la GNU GPL ne restreint pas ce que les gens font dans les logiciels, elle les emp&ecirc;che juste de restreindre les autres.

source: Any material that can be copyrighted can be licensed under the GPL. GPLv3 can also be used to license materials covered by other copyright-like laws, such as semiconductor masks. So, as an example, you can release a drawing of a hardware design under the GPL. However, if someone used that information to create physical hardware, they would have no license obligations when distributing or selling that device: it falls outside the scope of copyright and thus the GPL itself.
fr: Tout mat&eacute;riel qui peut &ecirc;tre mis sous copyright peut &ecirc;tre mis sous licence GPL. La GPLv3 peut aussi &ecirc;tre utilis&eacute;e pour licencier du mat&eacute;riel couvert par d'autres lois similaires &agrave; la loi sur le copyright, comme les masques de semi-conducteur. Par exemple, vous pouvez publier les sch&eacute;mas d'une conception mat&eacute;rielle sous la GPL. Cependant, si quelqu'un utilise cette information pour cr&eacute;er un appareil, il n'aura aucune obligation de licence pour la distribution ou la vente de cet appareil&nbsp;: cela tombe en dehors de la port&eacute;e du copyright at par cons&eacute;quent, de la GPL elle-m&ecirc;me.

source: No. The only time you would be required to release signing keys is if you conveyed GPLed software inside a User Product, and its hardware checked the software for a valid cryptographic signature before it would function. In that specific case, you would be required to provide anyone who owned the device, on demand, with the key to sign and install modified software on his device so that it will run. If each instance of the device uses a different key, then you need only give each purchaser the key for his instance.
fr: Non. La seule fois o&ugrave; vous seriez oblig&eacute; de publier les cl&eacute;s de signature est si vous transmettez du logiciel sous GPL &agrave; l'int&eacute;rieur d'un &laquo;&nbsp;produit utilisateur&nbsp;&raquo; et que le mat&eacute;riel fasse une v&eacute;rification du logiciel pour y chercher une signature de chiffrement valide avant de fonctionner. Dans ce cas sp&eacute;cifique, vous seriez oblig&eacute; de fournir &agrave; tout d&eacute;tenteur de l'appareil, &agrave; la demande, la cl&eacute; pour signer et installer le logiciel modifi&eacute; sur son appareil pour qu'il puisse fonctionner. Si chaque appareil utilise une cl&eacute; diff&eacute;rente, alors vous devrez donner &agrave; chaque acheteur la cl&eacute; pour son appareil.

source: No. Companies distributing devices that include software under GPLv3 are at most required to provide the source and Installation Information for the software to people who possess a copy of the object code. The voter who uses a voting machine (like any other kiosk) doesn't get possession of it, not even temporarily, so the voter also does not get possession of the binary software in it.
fr: Non. Les soci&eacute;t&eacute;s distribuant des appareils contenant du logiciel sous GPLv3 sont au moins oblig&eacute;es de fournir les sources et les informations d'installation pour le logiciel aux personnes qui poss&egrave;dent une copie du code objet. Le votant qui utilise une machine &agrave; voter (comme tout autre kiosque) ne la poss&egrave;de pas, pas m&ecirc;me temporairement, donc le votant ne poss&egrave;de pas non le logiciel &agrave; l'int&eacute;rieur.

source: Note, however, that voting is a very special case. Just because the software in a computer is free does not mean you can trust the computer for voting. We believe that computers cannot be trusted for voting. Voting should be done on paper.
fr: Notez cependant que voter est un cas tr&egrave;s sp&eacute;cial. Parce que le logiciel dans un ordinateur est libre ne signifie pas que vous pouvez faire confiance aux ordinateurs pour voter. Nous croyons que l'on ne peut pas faire confiance aux ordinateurs pour voter. Voter doit &ecirc;tre fait avec du papier.

source: In effect, yes. Section 10 prohibits people who convey the software from filing patent suits against other licensees. If someone did so anyway, section 8 explains how they would lose their license and any patent licenses that accompanied it.
fr: Oui, en effet. La section 10 interdit aux gens qui transmettent le logiciel de d&eacute;poser des suites de brevets sous d'autres licences. Si quelqu'un le faisait cependant, la section 8 explique comment il perdrait leur licence et toutes autres licences de brevets l'accompagnant.

source: If the snippets are small enough that you can incorporate them under fair use or similar laws, then yes. Otherwise, no.
fr: Si les snippets sont suffisamment petits pour que vous les incorporiez en accord avec la loi du &laquo;&nbsp;fair use&nbsp;&raquo; (usage raisonnable) ou de lois similaires, alors oui. Autrement, non.

source: This means that all the permissions and conditions you have to convey source code also apply when you convey object code: you may charge a fee, you must keep copyright notices intact, and so on.
fr: Ceci signifie que toutes les permissions et conditions que vous avez pour transmettre le code source s'applique aussi quand vous trasmettez du code objet&nbsp;: vous pouvez faire payer, vous devez garder les notices de copyright intactes, etc.

source: No. When you convey GPLed software, you must follow the terms and conditions of one particular version of the license. When you do so, that version defines the obligations you have. If users may also elect to use later versions of the GPL, that's merely an additional permission they have&mdash;it does not require you to fulfill the terms of the later version of the GPL as well.
fr: Non. Quand vous transmettez du logiciel sous GPL, vous devez suivre les termes et condition d'une version en particulier de la licence. En faisant cela, cette version definit les obligations que vous avez. Si les utilisateurs peuvent aussi choisir d'utiliser les versions ult&eacute;rieures de la GPL, c'est juste une permission suppl&eacute;mentaire qu'ils ont (cela ne n&eacute;cessite pas que vous satisfaisiez les termes de la version ult&eacute;rieure de la GPL.

source: Do not take this to mean that you can threaten the community with your patents. In many countries, distributing software under GPLv2 provides recipients with an implicit patent license to exercise their rights under the GPL. Even if it didn't, anyone considering enforcing their patents aggressively is an enemy of the community, and we will defend ourselves against such an attack.
fr: N'allez pas imaginer que vous pouvez menacer la communaut&eacute; avec vos brevets. Dans beaucoup de pays, la distribution de logiciel sous GPLv2 donnent aux destinataires une licence de brevet implicite pour exercer leurs droits sous la GPL. M&ecirc;me si ce n'&eacute;tait pas le cas, quiconque consid&eacute;rant de faire appliquer ses brevets agressivement est un ennemi de la communaut&eacute;, et nous nous d&eacute;fendrons nous-m&ecirc;mes contre une telle attaque.

source: The &ldquo;contributor version&rdquo; is only your version of the library.
fr: La &laquo;&nbsp;version contributeur&nbsp;&raquo; est seulement votre version de la biblioth&egrave;que.

source: No. Some of the requirements in GPLv3, such as the requirement to provide Installation Information, do not exist in GPLv2. As a result, the licenses are not compatible: if you tried to combine code released under both these licenses, you would violate section 6 of GPLv2.
fr: Non. Certaines conditions de la GPLv3, comme la fourniture d'informations d'installation, n'existe pas dans la GPLv2. Par cons&eacute;quent, les licences ne sont pas compatibles&nbsp;: Si vous essayez de combiner du code publi&eacute; &agrave; la fois sous ces deux licences, vous violeriez la section 6 de la GPLv2.

source: However, if code is released under GPL &ldquo;version 2 or later,&rdquo; that is compatible with GPLv3 because GPLv3 is one of the options it permits.
fr: Cependant, si le code est publi&eacute; sous GPL &laquo;&nbsp;version 2 or later,&nbsp;&raquo; (version 2 ou suivantes), c'est compatible avec la GPLv3 car la GPLv3 est une des options qu'elle permet.

source: To cure a violation means to adjust your practices to comply with the requirements of the license.
fr: Soigner une violation signifie d'ajuster vos pratiques pour se conformer aux conditions de la licence.

source: Yes. Section 7 gives you permission to add your own disclaimers, specifically 7(a).
fr: Oui. La section 7 vous donne la permission d'ajouter vos propres clauses, sp&eacute;cifiquement 7(a).

source: All you need to do is ensure that the Appropriate Legal Notices are readily available to the user in your interface. For example, if you have written an audio interface, you could include a command that reads the notices aloud.
fr: Tout ce que vous avez &agrave; faire est de vous assurer que les notices l&eacute;gales appropri&eacute;es soient imm&eacute;diatement disopnibles dans votre interface utilisateur. Par exemple, si vous avez &eacute;crit une interface audio, vous pourriez inclure une commande qui lisent les notices pour l'utilisateur.

source: As long as you're both using the software in your work at the company, rather than personally, then the answer is no. The copies belong to the company, not to you or the coworker. This copying is propagation, not conveying, because the company is not making copies available to others.
fr: Tant que vous utilisez tous les deux le logiciel dans votre soci&eacute;t&eacute; plut&ocirc;t que personnellement, la r&eacute;ponse est non. Les copies appartiennent &agrave; la soci&eacute;t&eacute;, pas &agrave; vous ou &agrave; votre coll&egrave;gue. Cette copie est une propagation, pas une transmission, car la soci&eacute;t&eacute; ne fait pas de copies disponibles pour les autres.

source: Yes. Just as devices do not need to be warranted if users modify the software inside them, you are not required to provide a warranty that covers all possible activities someone could undertake with GPLv3-covered software.
fr: Oui. Tout comme les appareils n'ont pas besoin d'&ecirc;tre garantis si les utilisateurs modifient le logiciel &agrave; l'int&eacute;rieur, vous n'avez pas obligation &agrave; fournir une garantie qui couvre toutes les activit&eacute;s possibles que quelqu'un pourrait faire avec un logiciel couvert par la GPLv3.

source: Early drafts of GPLv3 allowed licensors to add an Affero-like requirement to publish source in section 7. However, some companies that develop and rely upon free software consider this requirement to be too burdensome. They want to avoid code with this requirement, and expressed concern about the administrative costs of checking code for this additional requirement. By publishing the GNU Affero GPLv3 as a separate license, with provisions in it and GPLv3 to allow code under these licenses to link to each other, we accomplish all of our original goals while making it easier to determine which code has the source publication requirement.
fr: Les premiers jets de la GPLv3 autorisaient les d&eacute;tenteurs de licence &agrave; ajouter une condition similaire &agrave; la licence Affero pour publier les sources dans la section 7. Cependant, certaines soci&eacute;t&eacute;s qui d&eacute;veloppent et reposent sur les logiciels libres consid&eacute;rent cette condition comme trop contraignante. Ils veulent &eacute;viter du code avec cette condition et ont exprim&eacute; leur inqui&eacute;tude sur les co&ucirc;ts administratifs pour v&eacute;rifier le code pour cette condition suppl&eacute;mentaire. En publiant la GNU Affero GPLv3 s&eacute;par&eacute;ment, avec des clauses dans celle-ci et la GPLv3 autorisant le code sous ces licences d'&ecirc;tre li&eacute; entre eux, nous avons accompli tous nos buts originaux tout en rendant plus facile la d&eacute;termination du code ayant obligation de publication des sources.

source: The term &ldquo;distribute&rdquo; used in GPLv2 was borrowed from United States copyright law. Over the years, we learned that some jurisdictions used this same word in their own copyright laws, but gave it different meanings. We invented these new terms to make our intent as clear as possible no matter where the license is interpreted. They are not used in any copyright law in the world, and we provide their definitions directly in the license.
fr: Le terme &laquo;&nbsp;distribute&nbsp;&raquo; utilis&eacute; dans la GPLv2 &eacute;tait emprunt&eacute; de la loi sur le copyright des &Eacute;tats-Unis. Au fil des ann&eacute;es, nous avons appris que certaines juridictions utilisaient ce m&ecirc;me mot dans leurs propres lois sur le droit d'auteur, mais lui donnaient des significations diff&eacute;rentes. Nous avons invent&eacute; ces nouveaux termes pour rendre nos intentions aussi claires que possible quelque soit la fa&ccedil;on dont la licence est interpr&eacute;t&eacute;e. Ils ne sont utilis&eacute;s dans aucune loi sur les droits d'auteur dans le monde et nous avons fourni leurs d&eacute;finitions directement dans la licence.

source: No, because those two goals contradict each other. The GNU GPL is designed specifically to prevent the addition of further restrictions. GPLv3 allows a very limited set of them, in section 7, but any other added restriction can be removed by the user.
fr: Non, car ces deux buts se contredisent entre eux. La GNU GPL est con&ccedil;ue sp&eacute;cifiquement pour emp&ecirc;cher l'addition d'autres restrictions. La GPLv3 autorise un ensemble tr&egrave;s limit&eacute; d'entre-elles, dans la section 7, mais toute autre restriction ajout&eacute;e peut-&ecirc;tre retir&eacute;e par l'utilisateur.

source: Yes, more or less. During the course of enforcing GPLv2, we learned that some jurisdictions used the word &ldquo;distribute&rdquo; in their own copyright laws, but gave it different meanings. We invented a new term to make our intent clear and avoid any problems that could be caused by these differences.
fr: Oui, plus ou moins. En faisant respecter la GPLv2, nous avons appris que certaines juridictions utilisaient le mot &laquo;&nbsp;distribuer&nbsp;&raquo; dans leurs propres lois sur les droits d'auteur, mais lui donnaient des significations diff&eacute;rentes. Nous avons invent&eacute; un nouveau terme pour rendre nos intentions claires et &eacute;viter tout probl&egrave;me pouvant &ecirc;tre caus&eacute; par ces diff&eacute;rences.

source: One example of &ldquo;making available to the public&rdquo; is putting the software on a public web or FTP server. After you do this, some time may pass before anybody actually obtains the software from you&mdash;but because it could happen right away, you need to fulfill the GPL's obligations right away as well. Hence, we defined conveying to include this activity.
fr: Un exemple de &laquo;&nbsp;mise &agrave; disposition du public&nbsp;&raquo; est de mettre le logiciel sur un serveur Web ou FTP. Apr&egrave;s avoir fait cela, un certain temps peut se passer avant que quelqu'un n'obtienne en fait le logiciel de votre part &mdash; mais parce que cela peut arriver, vous devez remplir les obligations de la GPL. Par cons&eacute;quent, nous avons d&eacute;fini la transmission pour y inclure cette activit&eacute;.

source: Making copies of the software for yourself is the main form of propagation that is not conveying. You might do this to install the software on multiple computers, or to make backups.
fr: Faire des copies de logiciels pour vous-m&ecirc;me est la forme principale de propagation qui n'est pas une transmission. Vous pourriez faire ceci pour installer des logiciels sur plusieurs ordinateurs ou pour faire des sauvegardes.

source: No. Prelinking is part of a compilation process; it doesn't introduce any license requirements above and beyond what other aspects of compilation would. If you're allowed to link the program to the libraries at all, then it's fine to prelink with them as well. If you distribute prelinked object code, you need to follow the terms of section 6.
fr: Non. La pr&eacute;-liaison fait partie d'un processus de compilation&nbsp;; cela n'introduit aucune condition de licence suppl&eacute;mentaire que ne le ferait la compilation. Si vous &ecirc;tes autoris&eacute; &agrave; lier le programme aux biblioth&egrave;ques, alors vous pouvez le pr&eacute;-lier &agrave; celles-ci aussi. Si vous distribuez du code objet pr&eacute;-li&eacute;, vous devez suivre les termes de la section 6.

source: No. In the jurisdictions where we have investigated this issue, this sort of loan would not count as conveying. The laptop's owner would not have any obligations under the GPL.
fr: Non. Dans les juridictions o&ugrave; nous avons enqu&ecirc;t&eacute; sur ce probl&egrave;me, cette sorte de pr&ecirc;t ne compterait pas pour une transmission. Le propri&eacute;taire du portable n'aurait aucune obligation sous la GPL.
