Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-faq.*.po
Languages: fr

source: Note that people who make modified versions of <var>[name of your program]</var> are not obligated to grant this special exception for their modified versions; it is their choice whether to do so. The GNU General Public License gives permission to release a modified version without this exception; this exception also makes it possible to release a modified version which carries forward this exception.
fr: Note that people who make modified versions of <var>[name of your program]</var> are not obligated to grant this special exception for their modified versions; it is their choice whether to do so. The GNU General Public License gives permission to release a modified version without this exception; this exception also makes it possible to release a modified version which carries forward this exception. Traduction&nbsp;: Veuillez remarquer que les personnes qui font des versions modifi&eacute;es de <var>[nom de votre programme]</var> ne sont pas oblig&eacute;es d'accorder cette exception particuli&egrave;re pour leurs versions modifi&eacute;es; ils leur appartient de le faire ou pas. La Licence publique g&eacute;n&eacute;rale GNU donne la permission de publier une version modifi&eacute;e sans cette exception; cette exception rend &eacute;galement possible de publier une version modifi&eacute;e quiperp&eacute;tue cette exception.

source: Under the Berne Convention, everything written is automatically copyrighted from whenever it is put in fixed form. So you don't have to do anything to &ldquo;get&rdquo; the copyright on what you write&mdash;as long as nobody else can claim to own your work.
fr: Selon la Convention de Berne, tout &eacute;crit est automatiquement sous copyright d&egrave;s qu'il est plac&eacute; sous une forme fixe. Donc vous n'avez rien &agrave; faire pour &laquo;&nbsp;obtenir&nbsp;&raquo; un copyright sur ce que vous &eacute;crivez&mdash;d&egrave;s lors que personne d'autre ne peut pr&eacute;tendre poss&eacute;der votre travail.

source: However, registering the copyright in the US is a very good idea. It will give you more clout in dealing with an infringer in the US.
fr: C'est toutefois une excellente id&eacute;e d'enregistrer votre copyright aux &Eacute;tat-Unis. Cela vous donnera plus d'influence pour traiter avec une violation aux &Eacute;tats-Unis.

source: The case when someone else might possibly claim the copyright is if you are an employee or student; then the employer or the school might claim you did the job for them and that the copyright belongs to them. Whether they would have a valid claim would depend on circumstances such as the laws of the place where you live, and on your employment contract and what sort of work you do. It is best to consult a lawyer if there is any possible doubt.
fr: Il se peut que quelqu'un d'autre puisse r&eacute;clamer le copyright si vous &ecirc;tes un employ&eacute; ou un &eacute;tudiant; alors, l'employeur ou l'&eacute;cole peuvent pr&eacute;tendre que vous avez effectu&eacute; le travail pour eux, et que le copyright leur appartient. La validit&eacute; de leurs pr&eacute;tentions d&eacute;pend des circonstances telles que les lois de votre lieu de r&eacute;sidence, votre contrat d'embauche et le genre de travail que vous faites. Le mieux est de consulter un avocat s'il y a le moindre doute.

source: If you think that the employer or school might have a claim, you can resolve the problem clearly by getting a copyright disclaimer signed by a suitably authorized officer of the company or school. (Your immediate boss or a professor is usually NOT authorized to sign such a disclaimer.)
fr: Si vous pensez que l'employeur ou l'&eacute;cole peuvent avoir des droits, vous pouvez r&eacute;soudre le probl&egrave;me clairement en obtenant une renonciation au copyright sign&eacute;e par un officiel autoris&eacute; de l'entreprise ou de l'&eacute;cole. (Votre sup&eacute;rieur hi&eacute;rarchique imm&eacute;diat ou votre professeur ne sont g&eacute;n&eacute;ralement PAS autoris&eacute;s &agrave; signer de telles renonciations).

source: Many universities nowadays try to raise funds by restricting the use of the knowledge and information they develop, in effect behaving little different from commercial businesses. (See &ldquo;The Kept University&rdquo;, Atlantic Monthly, March 2000, for a general discussion of this problem and its effects.)
fr: De nombreuses universit&eacute;s essaient aujourd'hui d'attirer des fonds en restreignant l'utilisation des connaissances et informations qu'elles d&eacute;veloppent, se comportant en cela de mani&egrave;re peu diff&eacute;rente des soci&eacute;t&eacute;s commerciales. (Voir &laquo;&nbsp;The Kept University&nbsp;&raquo;, Atlantic Monthly, Mars 2000, pour une discussion g&eacute;n&eacute;rale de ce probl&egrave;me et de ses effets).

source: If you see any chance that your school might refuse to allow your program to be released as free software, it is best to raise the issue at the earliest possible stage. The closer the program is to working usefully, the more temptation the administration might feel to take it from you and finish it without you. At an earlier stage, you have more leverage.
fr: Si vous pensez qu'il existe une probabilit&eacute; que votre &eacute;cole refuse de vous autoriser &agrave; distribuer votre programme sous GPL, il vaut mieux soulever le probl&egrave;me le plus t&ocirc;t possible. Plus le programme sera proche d'un fonctionnement utile, et plus la tentation sera grande pour l'administration de vous le prendre et de le finir sans vous. À un stade moins avanc&eacute;, vous avez plus de marge de man&oelig;uvre.

source: So we recommend that you approach them when the program is only half-done, saying, &ldquo;If you will agree to releasing this as free software, I will finish it.&rdquo; Don't think of this as a bluff. To prevail, you must have the courage to say, &ldquo;My program will have liberty, or never be born.&rdquo;
fr: Aussi nous vous recommandons de les aborder quand le programme est seulement &agrave; moiti&eacute; r&eacute;alis&eacute;, en disant&nbsp;: &laquo;&nbsp;Si vous me laissez le distribuer sous licence libre, je le termine&nbsp;&raquo;. N'y pensez pas comme &agrave; du bluff. Pour que votre opinion pr&eacute;vale, vous devez avoir le courage de dire&nbsp;: &laquo;&nbsp;Mon programme sera libre, ou ne sera pas&nbsp;&raquo;.

source: See the page of <a href="/licenses/gpl-howto.html">GPL instructions</a>.
fr: Voir la page des <a href="/licenses/gpl-howto.fr.html">instructions pour la GPL</a>.

source: The GNU GPL does not give users permission to attach other licenses to the program. But the copyright holder for a program can release it under several different licenses in parallel. One of them may be the GNU GPL.
fr: La GNU GPL ne donne pas le droit aux utilisateurs d'attacher d'autres licences au programme. Mais le d&eacute;tenteur du copyright sur un programme peut le publier sous diff&eacute;rentes licences en parall&egrave;le. L'une d'entre-elles peut &ecirc;tre la GNU GPL.

source: The license that comes in your copy, assuming it was put in by the copyright holder and that you got the copy legitimately, is the license that applies to your copy.
fr: La licence qui se trouve dans votre copie, en supposant qu'elle y ait &eacute;t&eacute; mise par le d&eacute;tenteur du copyright et que vous aillez acquis cette copie de fa&ccedil;on l&eacute;gitime, est la licence qui s'applique &agrave; votre copie.

source: To release a non-free program is always ethically tainted, but legally there is no obstacle to your doing this. If you are the copyright holder for the code, you can release it under various different non-exclusive licenses at various times.
fr: Il est toujours &eacute;thiquement discutable de publier un logiciel non-libre, mais il n'y a pas d'obstacle l&eacute;gal &agrave; ce que vous agissiez ainsi. Si vous &ecirc;tes le d&eacute;tenteur du copyright pour le code, vous pouvez le publier sous diff&eacute;rentes licences non-exclusives &agrave; diff&eacute;rents moments.

source: Strictly speaking, the GPL is a license from the developer for others to use, distribute and change the program. The developer itself is not bound by it, so no matter what the developer does, this is not a &ldquo;violation&rdquo; of the GPL.
fr: Strictement parlant, la GPL est une licence de la part du d&eacute;veloppeur &agrave; l'attention des tiers qui voudraient utiliser, distribuer et modifier le programme. Le d&eacute;veloppeur lui-m&ecirc;me n'est pas contraint par elle, donc quelque soit ce que fait le d&eacute;veloppeur, ce n'est pas une &laquo;&nbsp;violation&nbsp;&raquo; de la GPL.

source: However, if the developer does something that would violate the GPL if done by someone else, the developer will surely lose moral standing in the community.
fr: Toutefois, si le d&eacute;veloppeur devait entreprendre une action qui violerait la GPL si quelqu'un d'autre faisait la m&ecirc;me chose, alors il perdrait s&ucirc;rement de son autorit&eacute; morale dans la communaut&eacute;.

source: No, because the public already has the right to use the program under the GPL, and this right cannot be withdrawn.
fr: Non, parce que le public d&eacute;tient d&eacute;j&agrave; le droit d'utiliser le programme sous la GPL, et ce droit ne peut &ecirc;tre retir&eacute;.

source: Yes, because the copyright on the editors and tools does not cover the code you write. Using them does not place any restrictions, legally, on the license you use for your code.
fr: Oui, parce que le copyright sur l'&eacute;diteur de texte et les outils ne couvre pas le code que vous &eacute;crivez.

source: Some programs copy parts of themselves into the output for technical reasons&mdash;for example, Bison copies a standard parser program into its output file. In such cases, the copied text in the output is covered by the same license that covers it in the source code. Meanwhile, the part of the output which is derived from the program's input inherits the copyright status of the input.
fr: Certains programmes recopient des parties d'eux-m&ecirc;mes dans leur r&eacute;sultat pour des raisons techniques&mdash;par exemple, Bison copie un programme standard d'analyse dans son fichier r&eacute;sultat. Dans de tels cas, le texte copi&eacute; dans le r&eacute;sultat est couvert par la m&ecirc;me licence qui le couvre dans le code source. Entre temps, la partie du r&eacute;sultat qui vient des donn&eacute;es fournies au programme h&eacute;rite du m&ecirc;me copyright que ces donn&eacute;es.

source: As it happens, Bison can also be used to develop non-free programs. This is because we decided to explicitly permit the use of the Bison standard parser program in Bison output files without restriction. We made the decision because there were other tools comparable to Bison which already permitted use for non-free programs.
fr: Il se trouve que Bison peut aussi &ecirc;tre utilis&eacute; pour d&eacute;velopper des programmes non-libres. C'est parce que nous avons d&eacute;cid&eacute; d'autoriser explicitement l'utilisation sans restrictions du programme standard d'analyse dans les fichiers produits par Bison. Nous avons pris cette d&eacute;cision parce qu'il existait d&eacute;j&agrave; d'autres outils comparables &agrave; Bison qui autorisaient d&eacute;j&agrave; une utilisation pour des programmes non-libres.

source: Yes, you do. &ldquo;Fair use&rdquo; is use that is allowed without any special permission. Since you don't need the developers' permission for such use, you can do it regardless of what the developers said about it&mdash;in the license or elsewhere, whether that license be the GNU GPL or any other free software license.
fr: <i>N.d.T.&nbsp;: La notion de &laquo;&nbsp;</i>fair use<i>&nbsp;&raquo; (lit. &laquo;&nbsp;utilisationcorrecte&nbsp;&raquo;) est d&eacute;termin&eacute;e pr&eacute;cis&eacute;ment dans la l&eacute;gislation des&Eacute;tats-Unis d'Am&eacute;rique. Nous l'avons donc laiss&eacute;e telle-quelle dans latraduction. Il vous appartient de v&eacute;rifier si une telle notion existe&eacute;galement dans votre syst&egrave;me juridique.</i> Oui. Le <i>&laquo;&nbsp;fair use&nbsp;&raquo;</i> est une utilisation autoris&eacute;e sans permission sp&eacute;ciale. Puisque vous n'avez pas besoin de la permission du d&eacute;veloppeur pour un tel usage, vous pouvez le faire, quoiqu'en ait dit le d&eacute;veloppeur&mdash;dans la licence ou ailleurs, que cette licence soit la GNU GPL ou tout autre licence de logiciel libre.

source: Note, however, that there is no world-wide principle of fair use; what kinds of use are considered &ldquo;fair&rdquo; varies from country to country.
fr: Notez cependant qu'il n'existe pas de principe universel de <i>fair use</i>; les types d'utilisation relevant du <i>&laquo;&nbsp;fair use&nbsp;&raquo;</i> varientselon les pays.

source: If the program is written by US federal government employees in the course of their employment, it is in the public domain, which means it is not copyrighted. Since the GNU GPL is based on copyright, such a program cannot be released under the GNU GPL. (It can still be <a href="/philosophy/free-sw.html">free software</a>, however; a public domain program is free.)
fr: Si le programme est &eacute;crit par des employ&eacute;s du gouvernement f&eacute;d&eacute;ral am&eacute;ricain, dans le cadre de leur travail, il est dans le domaine public, ce qui veut dire qu'il n'y a pas de droit d'auteur. Puisque la GPL GNU est bas&eacute;e sur le copyright, un tel programme ne peut &ecirc;tre publi&eacute; en l'utilisant. (Il peut &ecirc;tre un <a href="/philosophy/free-sw.fr.html">logiciel libre</a> cependant; un programme du domaine public est libre).

source: However, when a US federal government agency uses contractors to develop software, that is a different situation. The contract can require the contractor to release it under the GNU GPL. (GNU Ada was developed in this way.) Or the contract can assign the copyright to the government agency, which can then release the software under the GNU GPL.
fr: Cependant, quand une agence du gouvernement f&eacute;d&eacute;ral am&eacute;ricain utilise des sous-traitants pour d&eacute;velopper un logiciel, c'est une situation diff&eacute;rente. Le contrat peut requ&eacute;rir que le sous-traitant le publie sous la GPL GNU. (GNU Ada a &eacute;t&eacute; d&eacute;velopp&eacute; de cette fa&ccedil;on). Ou un contrat peut donner le droit d'auteur &agrave; l'agence gouvernementale, qui peut alors publier le logiciel sous la GPL GNU.

source: Yes. If the improvements are written by US government employees in the course of their employment, then the improvements are in the public domain. However, the improved version, as a whole, is still covered by the GNU GPL. There is no problem in this situation.
fr: Oui. Si les am&eacute;liorations sont &eacute;crites par les employ&eacute;s du gouvernement, alors les am&eacute;liorations sont dans le domaine public. Cependant, la version am&eacute;lior&eacute;e, en son entier, est toujours couverte par la GPL GNU. Il n'y a pas de probl&egrave;me dans ce cas.

source: If the US government uses contractors to do the job, then the improvements themselves can be GPL-covered.
fr: Si le gouvernement utilise des sous-traitants pour faire le travail, alors les am&eacute;liorations elles-m&ecirc;mes peuvent &ecirc;tre couvertes par la GPL.

source: In general this is legally impossible; copyright law does not give you any say in the use of the output people make from their data using your program. If the user uses your program to enter or convert his own data, the copyright on the output belongs to him, not you. More generally, when a program translates its input into some other form, the copyright status of the output inherits that of the input it was generated from.
fr: En g&eacute;n&eacute;ral, ceci est juridiquement impossible; les lois du <i>copyright</i> ne vous donnent aucun droit sur l'utilisation qui est faite du r&eacute;sultat du programme par les gens qui lui ont fourni leurs donn&eacute;es. Si l'utilisateur se sert de votre programme pour saisir ou convertir ses propres donn&eacute;es, c'est &agrave; lui et non &agrave; vous qu'appartient le copyright du produit obtenu. Plus g&eacute;n&eacute;ralement, quand un programme transforme les donn&eacute;es qu'il re&ccedil;oit sous une forme diff&eacute;rente, le statut du copyright du r&eacute;sultat h&eacute;rite de celui qui couvrait les donn&eacute;es ayant servi &agrave; le g&eacute;n&eacute;rer.

source: So the only way you have a say in the use of the output is if substantial parts of the output are copied (more or less) from text in your program. For instance, part of the output of Bison (see above) would be covered by the GNU GPL, if we had not made an exception in this specific case.
fr: Par cons&eacute;quent, le seul moyen pour que vous ayez des droits sur le r&eacute;sultat est que des parties substantielles de ce r&eacute;sultat soient copi&eacute;es (plus ou moins) &agrave; partir du texte pr&eacute;sent dans votre programme. Par exemple, une partie du r&eacute;sultat produit par Bison (voir ci-dessus) serait couverte par la GNU GPL si nous n'avions cr&eacute;&eacute; une exception pour ce cas particulier.

source: You could artificially make a program copy certain text into its output even if there is no technical reason to do so. But if that copied text serves no practical purpose, the user could simply delete that text from the output and use only the rest. Then he would not have to obey the conditions on redistribution of the copied text.
fr: Vous pourriez artificiellement forcer un programme &agrave; copier un certain texte dans son r&eacute;sultat, m&ecirc;me s'il n'y a pas de raison technique de le faire. Mais si ce texte ne sert &agrave; rien en pratique, l'utilisateur pourrait simplement le supprimer du r&eacute;sultat et n'utiliser que le reste. Il n'aurait plus alors &agrave; respecter les conditions de redistribution du texte copi&eacute;.

source: Only when the program copies part of itself into the output.
fr: Seulement quand le programme copie des portions de lui-m&ecirc;me dans le r&eacute;sultat.

source: The GPL says that the whole combined program has to be released under the GPL. So your module has to be available for use under the GPL.
fr: La GPL dit que l'ensemble du programme combin&eacute; doit &ecirc;tre publi&eacute; sous la GPL. Votre module doit donc &ecirc;tre disponible pour utilisation sous GPL.

source: But you can give additional permission for the use of your code. You can, if you wish, release your program under a license which is more lax than the GPL but compatible with the GPL. The <a href="/licenses/license-list.html">license list page</a> gives a partial list of GPL-compatible licenses.
fr: Mais vous pouvez donner des permissions suppl&eacute;mentaires pour l'utilisation de votre code. Vous pouvez, si vous le voulez, distribuer votre programme sous une licence plus l&acirc;che que la GPL, mais qui est compatible avec elle. La <a href="/philosophy/license-list.fr.html">page de liste des licences</a> donne une liste partielle des licencescompatibles avec la GPL.

source: Yes, because the program as it is actually run includes the library.
fr: Oui, parce que le programme tel qu'il est effectivement ex&eacute;cut&eacute; inclus la biblioth&egrave;que.

source: When the interpreter just interprets a language, the answer is no. The interpreted program, to the interpreter, is just data; a free software license like the GPL, based on copyright law, cannot limit what data you use the interpreter on. You can run it on any data (interpreted program), any way you like, and there are no requirements about licensing that data to anyone.
fr: Quand l'interpr&eacute;teur interpr&egrave;te juste un langage, la r&eacute;ponse est non. Le programme interpr&eacute;t&eacute; est juste des donn&eacute;es, pour l'interpr&eacute;teur; une licence de logiciel libre comme la GPL, bas&eacute;e sur la l&eacute;gislation du copyright, ne peut mettre de limites &agrave; quelles donn&eacute;es vous pouvez prendre pour utiliser l'interpr&eacute;teur. Vous pouvez l'ex&eacute;cuter sur n'importe quelle donn&eacute;e (programme interpr&eacute;t&eacute;), de la fa&ccedil;on dont vous le souhaitez, et il n'y a aucune exigence sur le fait d'appliquer licence &agrave; des tiers sur ces donn&eacute;es.

source: However, when the interpreter is extended to provide &ldquo;bindings&rdquo; to other facilities (often, but not necessarily, libraries), the interpreted program is effectively linked to the facilities it uses through these bindings. So if these facilities are released under the GPL, the interpreted program that uses them must be released in a GPL-compatible way. The JNI or Java Native Interface is an example of such a binding mechanism; libraries that are accessed in this way are linked dynamically with the Java programs that call them. These libraries are also linked with the interpreter. If the interpreter is linked statically with these libraries, or if it is designed to <a href="#GPLPluginsInNF">link dynamically with these specific libraries</a>, then it too needs to be released in a GPL-compatible way.
fr: Cependant, lorsque l'interpr&eacute;teur est &eacute;tendu pour fournir des &laquo;&nbsp;bindings&nbsp;&raquo; (interfaces) vers d'autres dispositifs (souvent, mais pas n&eacute;cessairement, des biblioth&egrave;ques), le programme interpr&eacute;t&eacute; est effectivement li&eacute; aux dispositifs qu'il utilise &agrave; travers ces interfaces. Donc si ces dispositifs sont diffus&eacute;s sous GPL, le programme interpr&eacute;t&eacute; qui les utilise doit &ecirc;tre diffus&eacute; d'une mani&egrave;recompatible avec la GPL. La JNI ou Java Native Interface est un exemple d'un tel dispositif; les biblioth&egrave;ques auxquelles on acc&egrave;de de cette fa&ccedil;on sont li&eacute;es dynamiquement avec les programmes Java qui les appellent. Ces biblioth&egrave;ques sont aussi li&eacute;es &agrave; l'interpr&eacute;teur. Si l'interpr&eacute;teur est li&eacute; statiquement &agrave; ces biblioth&egrave;ques, ou s'il est con&ccedil;u pour <a href="#GPLPluginsInNF"> se lier dynamiquement &agrave; ces biblioth&egrave;ques sp&eacute;cifiques</a>, alors il doit &ecirc;tre aussi publi&eacute; de mani&egrave;re compatible avec la GPL.

source: Another similar and very common case is to provide libraries with the interpreter which are themselves interpreted. For instance, Perl comes with many Perl modules, and a Java implementation comes with many Java classes. These libraries and the programs that call them are always dynamically linked together.
fr: Un autre cas similaire et tr&egrave;s courant est la fourniture de biblioth&egrave;ques avec l'interpr&eacute;teur qui sont elles-m&ecirc;mes interpr&eacute;t&eacute;es. Par exemple, Perl est fourni avec de nombreux modules Perl, t une impl&eacute;mentation de Java est fournie avec de nombreuses classes Java. Ces biblioth&egrave;ques et les programmes qui les appellent sont toujours li&eacute;s ensemble dynamiquement.

source: A consequence is that if you choose to use GPL'd Perl modules or Java classes in your program, you must release the program in a GPL-compatible way, regardless of the license used in the Perl or Java interpreter that the combined Perl or Java program will run on.
fr: Une cons&eacute;quence est que si vous choisissez d'utiliser des modules Perl ou des classes Java sous GPL dans votre programme, vous devez diffuser le programme d'une fa&ccedil;on compatible avec la GPL, ind&eacute;pendamment de la licence utilis&eacute;e dans l'interpr&eacute;teur Perl ou Java sur lequel va s'ex&eacute;cuter le programme combin&eacute; Perl ou Java.
