Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-faq.*.po
Languages: fr

source: Although we will not raise legal objections to your making a modified license in this way, we hope you will think twice and not do it. Such a modified license is almost certainly <a href="#WhatIsCompatible"> incompatible with the GNU GPL</a>, and that incompatibility blocks useful combinations of modules. The mere proliferation of different free software licenses is a burden in and of itself.
fr: Bien que nous n'objecterons pas de raisons juridiques pour modifier la licence de cette mani&egrave;re, nous esp&eacute;rons que vous y r&eacute;fl&eacute;chirez &agrave; deux fois et que vous ne le ferez pas. Une telle licence modifi&eacute;e est presque s&ucirc;rement <a href="#WhatIsCompatible"> incompatible avec la GPL GNU</a>, et cette incompatibilit&eacute; bloque des combinaisons utiles de modules. La prolif&eacute;ration de diff&eacute;rentes licences de logiciels libres est un fardeau en soi.

source: You are allowed to sell copies of the modified program commercially, but only under the terms of the GNU GPL. Thus, for instance, you must make the source code available to the users of the program as described in the GPL, and they must be allowed to redistribute and modify it as described in the GPL.
fr: Vous &ecirc;tes autoris&eacute; &agrave; vendre des copies du programme modifi&eacute;, mais uniquement selon les termes de la GNU GPL. Ainsi, par exemple, vous devez rendre le code source disponible pour les utilisateurs du programme comme pr&eacute;cis&eacute; par la GPL, et ils doivent &ecirc;tre autoris&eacute;s &agrave; le redistribuer et &agrave; le modifier, comme pr&eacute;vu &eacute;galement par la GPL.

source: These requirements are the condition for including the GPL-covered code you received in a program of your own.
fr: Ces conditions sont indispensables pour inclure dans votre programme le code sous GPL que vous avez re&ccedil;u.

source: You can apply the GPL to any kind of work, as long as it is clear what constitutes the &ldquo;source code&rdquo; for the work. The GPL defines this as the preferred form of the work for making changes in it.
fr: Vous pouvez appliquer la GPL &agrave; n'importe quel type d'&oelig;uvre, du moment qu'il n'y a pas d'incertitude sur ce qui constitue le &laquo;&nbsp;code source&nbsp;&raquo; de l'&oelig;uvre. Ce que la GPL d&eacute;finit par la forme privil&eacute;gi&eacute;e de l'&oelig;uvre permettant d'y apporter des modifications.

source: However, for manuals and textbooks, or more generally any sort of work that is meant to teach a subject, we recommend using the GFDL rather than the GPL.
fr: Toutefois, pour les manuels et les ouvrages, et plus g&eacute;n&eacute;ralement toute &oelig;uvre ayant pour but d'enseigner un sujet, nous recommandons l'utilisation de la GFDL, plut&ocirc;t que de la GPL.

source: <a href="/licenses/lgpl-java.html">See this article for details.</a> It works as designed, intended, and expected.
fr: <a href="/licenses/lgpl-java.fr.html">Voir cet article pour les d&eacute;tails</a>. Cela fonctionne comme c'est con&ccedil;u, voulu et attendu.

source: Yes. Y was required to release its version under the GNU GPL, as a consequence of basing it on X's version V1. Nothing required Y to agree to any other license for its code. Therefore, X must get Y's permission before releasing that code under another license.
fr: Oui. Y avait l'obligation de distribuer sa version sous GNU GPL, du fait qu'elle est bas&eacute;e sur la version V1 de X. Rien n'oblige Y &agrave; &ecirc;tre d'accord avec toute autre licence pour son code. Par cons&eacute;quent, X doit obtenir la permission de Y avant de distribuer ce code sous une autre licence.

source: You cannot incorporate GPL-covered software in a proprietary system. The goal of the GPL is to grant everyone the freedom to copy, redistribute, understand, and modify a program. If you could incorporate GPL-covered software into a non-free system, it would have the effect of making the GPL-covered software non-free too.
fr: Vous ne pouvez pas incorporer un logiciel couvert par la GPL dans un syst&egrave;me propri&eacute;taire. L'objectif de la GPL est d'accorder &agrave; tous la libert&eacute; de copier, redistribuer, comprendre, et modifier un programme. Si vous pouviez incorporer des logiciels sous GPL dans un syst&egrave;me non-libre, cela aurait pour effet de rendre &eacute;galement non-libre les logiciels sous GPL.

source: A system incorporating a GPL-covered program is an extended version of that program. The GPL says that any extended version of the program must be released under the GPL if it is released at all. This is for two reasons: to make sure that users who get the software get the freedom they should have, and to encourage people to give back improvements that they make.
fr: Un syst&egrave;me qui incorpore un programme plac&eacute; sous GPL est une version &eacute;tendue de ce programme. La GPL dit que toute version &eacute;tendue du programme doit &ecirc;tre distribu&eacute;e sous GPL d&egrave;s qu'elle est seulement diffus&eacute;e. Il y a deux raisons &agrave; cela&nbsp;: s'assurer que les utilisateursqui obtiennent le programme disposent de la libert&eacute; &agrave; laquelle ils ont droit, et encourager les gens &agrave; donner en &eacute;change les am&eacute;liorationsqu'ils ont pu apporter.

source: However, in many cases you can distribute the GPL-covered software alongside your proprietary system. To do this validly, you must make sure that the free and non-free programs communicate at arms length, that they are not combined in a way that would make them effectively a single program.
fr: Toutefois, dans de nombreux cas, vous pouvez distribuer un logiciel sous GPL &agrave; c&ocirc;t&eacute; de votre syst&egrave;me propri&eacute;taire. Pour que cette op&eacute;ration soit l&eacute;gale, vous devez vous assurer que les programmes libres et non-libres communiquent de suffisamment loin, et qu'ils ne sont pas combin&eacute;s de fa&ccedil;on &agrave; cr&eacute;er de fait un seul et m&ecirc;me programme.

source: The difference between this and &ldquo;incorporating&rdquo; the GPL-covered software is partly a matter of substance and partly form. The substantive part is this: if the two programs are combined so that they become effectively two parts of one program, then you can't treat them as two separate programs. So the GPL has to cover the whole thing.
fr: La diff&eacute;rence entre ceci et &laquo;&nbsp;l'incorporation&nbsp;&raquo; du logiciel sous GPL est une question &agrave; la fois de fond et de forme. Essentiellement&nbsp;: si les deux programmes sont combin&eacute;s de telle fa&ccedil;on qu'ils forment les deux parties d'un m&ecirc;me programme, alors vous ne pouvez les traiter comme des programmes s&eacute;par&eacute;s. La GPL doit alors couvrir l'ensemble.

source: If the two programs remain well separated, like the compiler and the kernel, or like an editor and a shell, then you can treat them as two separate programs&mdash;but you have to do it properly. The issue is simply one of form: how you describe what you are doing. Why do we care about this? Because we want to make sure the users clearly understand the free status of the GPL-covered software in the collection.
fr: Si les deux programmes demeurent bien s&eacute;par&eacute;s, comme par exemple le compilateur et le noyau, ou comme un &eacute;diteur de texte et un shell, vous pouvez alors les traiter comme des programmes s&eacute;par&eacute;s&mdash;mais vous devez faire cela comme il faut. Se pose alors simplement la question de la forme&nbsp;: comment vous d&eacute;crivez ce que vous faites. Pourquoi cela nous importe-t-il&nbsp;? Parce que nous voulons &ecirc;tre s&ucirc;r que l'utilisateur comprenne bien le statut libre du logiciel de cet ensemble qui est sous GPL.

source: If people were to distribute GPL-covered software calling it &ldquo;part of&rdquo; a system that users know is partly proprietary, users might be uncertain of their rights regarding the GPL-covered software. But if they know that what they have received is a free program plus another program, side by side, their rights will be clear.
fr: Si quelqu'un distribue un logiciel sous GPL en l'identifiant comme &eacute;tant &laquo;&nbsp;une partie&nbsp;&raquo; d'un syst&egrave;me dont les utilisateurs savent qu'il estpartiellement propri&eacute;taire, ces derniers pourraient ne pas avoir une id&eacute;e claire de leurs droits concernant le logiciel GNU. Mais s'ils savent que ce qu'ils ont re&ccedil;u correspond &agrave; un programme libre plus un autre programme, c&ocirc;te &agrave; c&ocirc;te, leurs droits sont clairs.

source: No. The X11 license is compatible with the GPL, so you can add a module to the GPL-covered program and put it under the X11 license. But if you were to incorporate them both in a larger program, that whole would include the GPL-covered part, so it would have to be licensed <em>as a whole</em> under the GNU GPL.
fr: Non. La licence X11 est compatible avec la GPL, donc vous pouvez incorporer un module au programme couvert par la GPL et le mettre sous licence X 11. Mais si vous les incorporez dans un programme plus gros, cet ensemble incluerait la partie couverte par la GPL, donc <em>cet ensemble</em> devrait &ecirc;tre sous licence GPL.

source: The fact that proprietary module A communicates with GPL-covered module C only through X11-licensed module B is legally irrelevant; what matters is the fact that module C is included in the whole.
fr: Le fait qu'un module propri&eacute;taire A communique avec un module C couvert par la GPL par le seul biais d'un module B sous licence X 11 n'est pas l&eacute;galement recevable&nbsp;; ce qui importe, c'est que le module C est inclus dans l'ensemble.

source: There are two reasons for this.
fr: Il y a deux raisons &agrave; cela.

source: First, a general one. If we permitted company A to make a proprietary file, and company B to distribute GPL-covered software linked with that file, the effect would be to make a hole in the GPL big enough to drive a truck through. This would be carte blanche for withholding the source code for all sorts of modifications and extensions to GPL-covered software.
fr: D'abord une raison d'ordre g&eacute;n&eacute;ral. Si nous autorisions la soci&eacute;t&eacute; A &agrave; cr&eacute;er un fichier propri&eacute;taire, et la soci&eacute;t&eacute; B &agrave; distribuer un logiciel sous GPL li&eacute; &agrave; ce fichier, cela aurait pour effet de cr&eacute;er une faille dans la GPL suffisante pour qu'un camion passe &agrave; travers. On aurait alors <i>carte blanche</i> pour faire de la r&eacute;tention sur le code source pour toute sorte de modifications et d'extensions &agrave; des logiciels sous GPL.

source: Giving all users access to the source code is one of our main goals, so this consequence is definitely something we want to avoid.
fr: L'un de nos objectifs principaux &eacute;tant de donner acc&egrave;s au code source &agrave; tous les utilisateurs, c'est l&agrave; une cons&eacute;quence que nous essayons &agrave; tout prix d'&eacute;viter.

source: More concretely, the versions of the programs linked with the Money Guzzler libraries would not really be free software as we understand the term&mdash;they would not come with full source code that enables users to change and recompile the program.
fr: Plus sp&eacute;cifiquement, les versions du programme li&eacute;es avec les biblioth&egrave;ques de Pompe-A-Fric ne seraient pas vraiment des logiciels libres au sens o&ugrave; nous l'entendons&mdash;elles ne comprendraient pas l'int&eacute;gralit&eacute; du code source qui permet aux utilisateurs de modifier et de recompiler le programme.

source: If a program P is released under the GPL that means *any and every part of it* can be used under the GPL. If you integrate module Q, and release the combined program P+Q under the GPL, that means any part of P+Q can be used under the GPL. One part of P+Q is Q. So releasing P+Q under the GPL says that Q any part of it can be used under the GPL. Putting it in other words, a user who obtains P+Q under the GPL can delete P, so that just Q remains, still under the GPL.
fr: Si un programme P est publi&eacute; sous la GPL cela signifie que *toute et chaque partie de celui-ci* peut &ecirc;tre utilis&eacute;e sous la GPL. Si vous int&eacute;grez le module Q, et publiez le programme combin&eacute; P+Q sous la GPL, cela signifie que chaque partie de P+Q peut &ecirc;tre utilis&eacute;e sous la GPL. Une partie de P+Q est Q. Aussi, publier P+Q sous la GPL signifie que Q, une partie de celui-ci, peut &ecirc;tre utilis&eacute; sous la GPL. En le formulant autrement, un utilisateur qui obtient P+Q sous la GPL peut supprimer P, de sorte que seul Q demeure, toujours sous la GPL.

source: If the license of module Q permits you to give permission for that, then it is GPL-compatible. Otherwise, it is not GPL-compatible.
fr: Si la licence du module Q vous permet d'autoriser cela, alors elle est compatible avec la GPL. Sinon, elle est incompatible.

source: If the license for Q says in no uncertain terms that you must do certain things (not compatible with the GPL) when you redistribute Q on its own, then it does not permit you to distribute Q under the GPL. It follows that you can't release P+Q under the GPL either. So you cannot link or combine P with Q.
fr: Si la licence de Q dit en des termes incertains que vous devez faire certaines choses (incompatibles avec la GPL) quand vous redistribuer Q lui-m&ecirc;me, alors cela ne vous permet pas de distribuer Q sous la GPL. Il s'ensuit que vous ne pouvez pas publier P+Q sous la GPL non plus. Donc vous ne pouvez pas lier ou combiner P avec Q.

source: No. The whole point of the GPL is that all modified versions must be <a href="/philosophy/free-sw.html"> free software</a>&mdash;which means, in particular, that the source code of the modified version is available to the users.
fr: Non. Tout le propos de la GPL est que toutes les versions modifi&eacute;es doivent &ecirc;tre des <a href="/philosophy/free-sw.fr.html">logiciels libres</a> &mdash; ce qui signifie, en particulier, que le code source de la version modifi&eacute;e est disponible pour les utilisateurs.

source: Yes. The general rule is, if you distribute binaries, you must distribute the complete corresponding source code too. The exception for the case where you received a written offer for source code is quite limited.
fr: Oui. La r&egrave;gle g&eacute;n&eacute;rale est que si vous distribuez des binaires, vous devez aussi distribuer le code source complet correspondant. L'exception pour le cas o&ugrave; vous recevez une offre &eacute;crite pour le code source est tout &agrave; fait limit&eacute;e.

source: Version 3 of the GPL allows this; see option 6(b) for the full details. Under version 2, you're certainly free to offer source via FTP, and most users will get it from there. However, if any of them would rather get the source on physical media by mail, you are required to provide that.
fr: La version 3 de la GPL permet ceci&nbsp;; consulter l'option 6(b) pour plus de détails. Sous la version 2, vous êtes certainement libre d'offrir les sources via FTP, et la plupart desutilisateurs l'obtiendra de cette manière. Cependant, si certains d'entre eux préfèrent obtenir les sources sur un support physique par courrier, vous devez leur fournir cela.

source: If you distribute binaries via FTP, <a href="#AnonFTPAndSendSources">you should distribute source via FTP.</a>
fr: Si vous distribuez les binaires par FTP, <a href="#AnonFTPAndSendSource">vous devriez distribuer le source par FTP.</a>

source: Yes, you can. The offer must be open to everyone who has a copy of the binary that it accompanies. This is why the GPL says your friend must give you a copy of the offer along with a copy of the binary&mdash;so you can take advantage of it.
fr: Oui. L'offre doit &ecirc;tre ouverte &agrave; toute personne qui a une copie de l'ex&eacute;cutable qui l'accompagne. C'est pourquoi la GPL dit que votre ami doit vous donner une copie de l'offre avec la copie de l'ex&eacute;cutable &mdash; pour que vous puissiez en b&eacute;n&eacute;ficier.

source: Yes. Section 6(d) allows this. However, you must provide clear instructions people can follow to obtain the source, and you must take care to make sure that the source remains available for as long as you distribute the object code.
fr: Oui. La section 6(d) autorise cela. Cependant, vous devez fournir des instructions claires que les utilisateurs peuvent suivre pour obtenir le code source, et vous devez vous assurer que le code source demeure disponible tant que vous distribuez le code objet.

source: No, you must supply the source code that corresponds to the binary. Corresponding source means the source from which users can rebuild the same binary.
fr: Non, vous devez fournir le code source qui correspond au fichier binaire. Le code source correspondant est celui &agrave; partir duquel l'utilisateur peut recompiler le m&ecirc;me fichier binaire.

source: Part of the idea of free software is that users should have access to the source code for *the programs they use*. Those using your version should have access to the source code for your version.
fr: Pour partie, l'id&eacute;e du logiciel libre est que les utilisateurs aient acc&egrave;s au code source pour *les programmes qu'ils utilisent*. Ceux qui utilisent votre version devraient avoir acc&egrave;s au code source de votre version.

source: A major goal of the GPL is to build up the Free World by making sure that improvement to a free program are themselves free. If you release an improved version of a GPL-covered program, you must release the improved source code under the GPL.
fr: Un objectif majeur de la GPL est de construire le Monde Libre en s'assurant que les am&eacute;liorations apport&eacute;es &agrave; un programme libre sont elles-m&ecirc;mes libres. Si vous distribuez une version am&eacute;lior&eacute;e d'un logiciel plac&eacute; sous GPL, vous devez distribuer le code source am&eacute;lior&eacute; sous GPL.

source: This is a well-meaning request, but this method of providing the source doesn't really do the job.
fr: L'intention est louable, mais cette m&eacute;thode pour fournir le code source ne convient pas vraiment.

source: A user that wants the source a year from now may be unable to get the proper version from another site at that time. The standard distribution site may have a newer version, but the same diffs probably won't work with that version.
fr: Un utilisateur qui souhaite r&eacute;cup&eacute;rer le code source dans un an peut se trouver dans l'incapacit&eacute; d'obtenir la bonne version aupr&egrave;s de la FSF &agrave; ce moment l&agrave;. Nous pourrions avoir une version plus r&eacute;cente, mais les diff&eacute;rences en question ne correspondraient probablement plus avec cette version.

source: So you need to provide complete sources, not just diffs, with the binaries.
fr: Vous devez donc fournir le code source complet, pas seulement les diff&eacute;rences, avec les fichiers binaires.

source: If you make object code available on a network server, you have to provide the Corresponding Source on a network server as well. The easiest way to do this would be to publish them on the same server, but if you'd like, you can alternatively provide instructions for getting the source from another server, or even a <a href="#SourceInCVS">version control system</a>. No matter what you do, the source should be just as easy to access as the object code, though. This is all specified in section 6(d) of GPLv3.
fr: Si vous rendez le code objet disponible sur un serveur r&eacute;seau, vous devrez fournir le code source correspondant sur un serveur r&eacute;seau &eacute;galement. Le moyen le plus simple de le faire est de les publier sur le même serveur, mais vous pourriez aussi donner des instructions pour obtenir le code source &agrave; partir d'un autre serveur, ou m&ecirc;me &agrave; partir d'un <a href="#SourceInCVS">syst&egrave;me de contr&ocirc;le de version</a>. Peu importe ce que vous faites, le code source doit &ecirc;tre aussi facile d'acc&egrave;s que le code objet cependant. Tout ceci est sp&eacute;cifi&eacute; dans la section 6(d) de la GPLv3.

source: The sources you provide must correspond exactly to the binaries. In particular, you must make sure they are for the same version of the program&mdash;not an older version and not a newer version.
fr: Les sources que vous fournirez doivent correspondre exactement aux fichiers binaires. Vous devez tout particuli&egrave;rement vous assurer qu'elles sont celles de la m&ecirc;me version du programme&mdash;pas une version plus ancienne ou plus r&eacute;cente.

source: You don't have to make sure of this. As long as you make the source and binaries available so that the users can see what's available and take what they want, you have done what is required of you. It is up to the user whether to download the source.
fr: Vous n'avez pas &agrave; vous en assurer. Du moment que vous mettez &agrave; disposition des utilisateurs &agrave; la fois les sources et les binaires, afin qu'ils puissent voir ce qui est disponible et prendre ce qui les int&eacute;resse, vous avez fait ce que l'on attend de vous. C'est &agrave; l'utilisateur de d&eacute;cider s'il veut t&eacute;l&eacute;charger les sources.

source: Our requirements for redistributors are intended to make sure the users can get the source code, not to force users to download the source code even if they don't want it.
fr: Nos exigences vis-&agrave;-vis des redistributeurs ont pour but de s'assurer que les utilisateurs peuvent obtenir le code source, pas de forcer les utilisateurs &agrave; le t&eacute;l&eacute;charger m&ecirc;me s'ils ne le d&eacute;sirent pas.

source: The GPL permits anyone to make a modified version and use it without ever distributing it to others. What this company is doing is a special case of that. Therefore, the company does not have to release the modified sources.
fr: La GPL permet &agrave; quiconque de faire une version modifi&eacute;e sans avoir &agrave; la redistribuer &agrave; d'autres. Ce que fait cette soci&eacute;t&eacute; en est un cas particulier. Par cons&eacute;quent, la soci&eacute;t&eacute; n'est pas oblig&eacute;e de publier les sources modifi&eacute;es.

source: It is essential for people to have the freedom to make modifications and use them privately, without ever publishing those modifications. However, putting the program on a server machine for the public to talk to is hardly &ldquo;private&rdquo; use, so it would be legitimate to require release of the source code in that special case. Developers who wish to address this might want to use the <a href="/licenses/agpl.html">GNU Affero GPL</a> for programs designed for network server use.
fr: Il est essentiel pour les gens d'avoir la libert&eacute; defaire des modifications et de les utiliser de fa&ccedil;on priv&eacute;e, sans avoir &agrave; publier les modifications.Cependant, mettre le programme sur un serveur accessible au public peut &ecirc;tre difficilement qualifi&eacute; d'utilisation &laquo;&nbsp;priv&eacute;e&nbsp;&raquo;, c'est pourquoi il serait l&eacute;gitime de r&eacute;clamer la publication du code source dans ce cas particulier. Les d&eacute;veloppeurs qui souhaitent corriger cela, pourraient vouloir utiliser la <a href="/licenses/agpl.html">GPL GNU Affero</a> pour des programmes con&ccedil;us pour une utilisation sur des serveurs en r&eacute;seau.
