Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-faq.*.po
Languages: fr

source: However, if you link non-free libraries with the source code, that would be an issue you need to deal with. It does not preclude releasing the source code under the GPL, but if the libraries don't fit under the &ldquo;system library&rdquo; exception, you should affix an explicit notice giving permission to link your program with them. <a href="#GPLIncompatibleLibs">Our FAQ about using GPL-incompatible libraries</a> provides more information about how to do that.
fr: Toutefois, si vous liez des biblioth&egrave;ques non-libres &agrave; ce code source, ce serait un probl&egrave;me que vous devez prendre en compte. Cela n'emp&ecirc;che pas de publier le code source sous licence GPL, mais si les biblioth&egrave;ques ne correspondent pas &agrave; l'exception &laquo;&nbsp;biblioth&egrave;que syst&egrave;me&nbsp;&raquo;, vous devrez ajouter une notice explicite donnant la permission de lier votre programme avec elles. <a href="#GPLIncompatibleLibs">Notre FAQ sur l'utilisation des bibliothèques incompatibles avec la GPL</a> fournit plus d'informations sur la manière de faire cela.

source: It would be useful to have translations of the GPL into languages other than English. People have even written translations and sent them to us. But we have not dared to approve them as officially valid. That carries a risk so great we do not dare accept it.
fr: Il serait utile d'avoir des traductions de la GPL dans d'autres langues que l'anglais. Certains ont m&ecirc;me &eacute;crit des traductions et nous les ont faites parvenir. Mais nous ne nous sommes pas risqu&eacute;s &agrave; les annoncer comme officiellement valides. Cela comporte un trop grand risque, que nous ne sommes pas pr&ecirc;t &agrave; prendre.

source: A legal document is in some ways like a program. Translating it is like translating a program from one language and operating system to another. Only a lawyer skilled in both languages can do it&mdash;and even then, there is a risk of introducing a bug.
fr: Un document l&eacute;gal ressemble parfois &agrave; un programme. Le traduire est comme de porter un logiciel d'un langage et d'un syst&egrave;me d'exploitation vers un autre. Seul un juriste comp&eacute;tent dans les deux langues peut le faire&mdash;et m&ecirc;me alors subsiste le risque d'introduire un bug.

source: If we were to approve, officially, a translation of the GPL, we would be giving everyone permission to do whatever the translation says they can do. If it is a completely accurate translation, that is fine. But if there is an error in the translation, the results could be a disaster which we could not fix.
fr: Si nous devions approuver, officiellement, une traduction de la GPL, nous donnerions &agrave; quiconque l'autorisation de faire tout ce que la traduction dit que l'on peut faire. Si la traduction est parfaitement exacte, tout va bien. Mais s'il existe une erreur dans la traduction, le r&eacute;sultat pourrait en &ecirc;tre un d&eacute;sastre que nous ne pourrions r&eacute;parer.

source: If a program has a bug, we can release a new version, and eventually the old version will more or less disappear. But once we have given everyone permission to act according to a particular translation, we have no way of taking back that permission if we find, later on, that it had a bug.
fr: Lorsqu'un programme contient un bug, l'on peut distribuer une nouvelle version, et &eacute;ventuellement, l'ancienne version dispara&icirc;tra plus ou moins. Mais une fois que l'on a donn&eacute; &agrave; tout le monde la permission d'agir selon les termes d'une certaine traduction, il n'y a plus aucun moyen de reprendre cette permission, si l'on d&eacute;couvre, ult&eacute;rieurement, qu'elle avait un bug.

source: Helpful people sometimes offer to do the work of translation for us. If the problem were a matter of finding someone to do the work, this would solve it. But the actual problem is the risk of error, and offering to do the work does not avoid the risk. We could not possibly authorize a translation written by a non-lawyer.
fr: Des gens qui souhaitent nous aider nous proposent parfois de faire pour nous le travail de traduction. Si le probl&egrave;me &eacute;tait de trouver quelqu'un pour accomplir la t&acirc;che, cela le r&eacute;soudrait. Mais en fait le vrai probl&egrave;me est le risque d'erreur, et le fait d'offrir de faire le travail ne l'&eacute;vite pas. Nous ne pourrions en aucun cas autoriser une traduction non &eacute;crite par un juriste.

source: Therefore, for the time being, we are not approving translations of the GPL as globally valid and binding. Instead, we are doing two things:
fr: Par cons&eacute;quent, pour le moment, nous n'approuvons pas les traductions de la GPL comme globalement valides ni contractuelles. Au lieu de cela, nous faisons deux choses&nbsp;:

source: Referring people to unofficial translations. This means that we permit people to write translations of the GPL, but we don't approve them as legally valid and binding.
fr: Nous dirigeons les gens vers des traductions non-officielles. Cela signifie que nous autorisons les gens &agrave; &eacute;crire des traductions de la GPL, mais que nous les approuvons pas comme l&eacute;galement valides et contractuelles.

source: An unapproved translation has no legal force, and it should say so explicitly. It should be marked as follows:
fr: Une traduction non-approuv&eacute;e n'a pas de valeur l&eacute;gale, et devrait le d&eacute;clarer explicitement. Cela devrait &ecirc;tre &eacute;crit comme suit&nbsp;:

source: This translation of the GPL is informal, and not officially approved by the Free Software Foundation as valid. To be completely sure of what is permitted, refer to the original GPL (in English).
fr: This translation of the GPL is informal, and not officially approved by the Free Software Foundation as valid. To be completely sure of what is permitted, refer to the original GPL (in English). Traduction&nbsp;: Cette traduction de la GPL est informelle, et n'est pas approuv&eacute;e officiellement comme valide par la Free Software Foundation. Pour &ecirc;tre tout-&agrave;-fait s&ucirc;r de ce qui est autoris&eacute;, se ref&eacute;rer &agrave; la GPL originale (en anglais).

source: But the unapproved translation can serve as a hint for how to understand the English GPL. For many users, that is sufficient.
fr: Mais la traduction non-officielle peut tr&egrave;s bien servir d'aide &agrave; la compr&eacute;hension de la GPL en anglais. Pour beaucoup d'utilisateurs, c'est suffisant.

source: However, businesses using GNU software in commercial activity, and people doing public ftp distribution, should need to check the real English GPL to make sure of what it permits.
fr: Toutefois, les entreprises qui utilisent des logiciels GNU dans leurs activit&eacute;s commerciales, et les gens faisant une distribution publique par ftp, devraient v&eacute;rifier la v&eacute;ritable GPL en anglais pour s'assurer de ce qu'elle autorise.

source: Publishing translations valid for a single country only.
fr: Nous publions des traductions valides pour seulement un pays.

source: We are considering the idea of publishing translations which are officially valid only for one country. This way, if there is a mistake, it will be limited to that country, and the damage will not be too great.
fr: Nous consid&eacute;rons l'id&eacute;e de publier des traductions qui soient officiellement valides pour un pays seulement. De cette fa&ccedil;on, si une erreur est faite, l'effet sera limit&eacute; &agrave; ce pays, et le dommage pas trop important.

source: It will still take considerable expertise and effort from a sympathetic and capable lawyer to make a translation, so we cannot promise any such translations soon.
fr: Il faudra quand m&ecirc;me pour faire une traduction une dose consid&eacute;rable d'expertise et d'efforts de la part d'un juriste &agrave; la fois acquis &agrave; la cause et comp&eacute;tent, aussi ne pouvons-nous promettre de telles traductions dans un futur proche.

source: When the interpreter just interprets a language, the answer is yes. The interpreted program, to the interpreter, is just data; the GPL doesn't restrict what tools you process the program with.
fr: Quand un interpr&eacute;teur interpr&egrave;te seulement un langage, la r&eacute;ponse est oui. Le programme interpr&eacute;t&eacute; est juste des donn&eacute;es, pourl'interpr&eacute;teur; la GPL ne restreint pas les outils avec lesquels vous traitez le programme.

source: However, when the interpreter is extended to provide &ldquo;bindings&rdquo; to other facilities (often, but not necessarily, libraries), the interpreted program is effectively linked to the facilities it uses through these bindings. The JNI or Java Native Interface is an example of such a facility; libraries that are accessed in this way are linked dynamically with the Java programs that call them.
fr: Cependant, lorsque l'interpr&eacute;teur est &eacute;tendu pour fournir des &laquo;&nbsp;bindings&nbsp;&raquo; (interfaces) vers d'autres dispositifs (souvent, mais pas n&eacute;cessairement, des biblioth&egrave;ques), le programme interpr&eacute;t&eacute; est effectivement li&eacute; aux dispositifs qu'il utilise &agrave; travers ces interfaces. Donc si ces dispositifs sont diffus&eacute;s sous GPL, le programme interpr&eacute;t&eacute; qui les utilise doit &ecirc;tre diffus&eacute; d'une mani&egrave;recompatible avec la GPL. La JNI ou Java Native Interface est un exemple d'un tel dispositif; les biblioth&egrave;ques auxquelles on acc&egrave;de de cette fa&ccedil;on sont li&eacute;es dynamiquement avec les programmes Java qui les appellent.

source: So if these facilities are released under a GPL-incompatible license, the situation is like linking in any other way with a GPL-incompatible library. Which implies that:
fr: Ainsi si ces dispositifs sont diffus&eacute;s sous une licence incompatible avec la GPL, la situation est similaire dans tout autre aspect &agrave; l'&eacute;dition de liens avec une biblioth&egrave;que non compatible avec la GPL. Ce qui implique que&nbsp;:

source: If you are writing code and releasing it under the GPL, you can state an explicit exception giving permission to link it with those GPL-incompatible facilities.
fr: Si vous &eacute;crivez du code et le diffusez sous GPL, vous pouvez d&eacute;finir une exception explicite donnant l'autorisation d'en faire une &eacute;dition de liens avec ces dispositifs incompatibles avec la GPL.

source: If you wrote and released the program under the GPL, and you designed it specifically to work with those facilities, people can take that as an implicit exception permitting them to link it with those facilities. But if that is what you intend, it is better to say so explicitly.
fr: Si vous avez &eacute;crit et diffus&eacute; le programme sous GPL, et que vous l'avez con&ccedil;u sp&eacute;cifiquement pour fonctionner avec ces dispositifs, on peut consid&eacute;rer qu'il y a une exception implicite autorisant une &eacute;dition de lien avec ces dispositifs. Mais si c'est ce que vous souhaitez, il est r&eacute;f&eacute;rable de le d&eacute;clarer de fa&ccedil;on explicite.

source: You can't take someone else's GPL-covered code and use it that way, or add such exceptions to it. Only the copyright holders of that code can add the exception.
fr: Vous ne pouvez pas prendre le code de quelqu'un d'autre couvert par la GPL et l'utiliser de de cette fa&ccedil;on, ou y ajouter de telles exceptions. Seul le d&eacute;tenteur du copyright pour ce code peut ajouter l'exception.

source: Since the GPL is a copyright license, the copyright holders of the software are the ones who have the power to enforce the GPL. If you see a violation of the GPL, you should inform the developers of the GPL-covered software involved. They either are the copyright holders, or are connected with the copyright holders. <a href="#ReportingViolation">Learn more about reporting GPL violations.</a>
fr: Puisque la GPL est une licence de copyright, les d&eacute;tenteurs du copyright du logiciel sont ceux qui ont la capacit&eacute; de faire respecter la GPL. Si vous constatez une violation de la GPL, vous devriez en informer les d&eacute;veloppeurs du logiciel couvert par la GPL concern&eacute;. Ils sont soit les d&eacute;tenteurs du copyright, ou bien sont li&eacute;s au d&eacute;tenteur du copyright. <a href="#ReportingViolation">En savoir plus sur la fa&ccedil;on de rapporter des violations de la GPL.</a>

source: Subclassing is creating a derivative work. Therefore, the terms of the GPL affect the whole program where you create a subclass of a GPL'ed class.
fr: Une sous-classe cr&eacute;&eacute;e par h&eacute;ritage est un travail d&eacute;riv&eacute;. Ainsi, les termes de la GPL s'appliquent &agrave; l'ensemble du programme dans lequel vous cr&eacute;ez une sous-classe d'une classe sous GPL.

source: In general, the answer is no&mdash;this is not a legal requirement. In specific, the answer depends on which libraries you want to use and what their licenses are. Most system libraries either use the <a href="/licenses/lgpl.html">GNU Lesser GPL</a>, or use the GNU GPL plus an exception permitting linking the library with anything. These libraries can be used in non-free programs; but in the case of the Lesser GPL, it does have some requirements you must follow.
fr: De fa&ccedil;on g&eacute;n&eacute;rale, la r&eacute;ponse est non&mdash;ce n'est pas une exigence l&eacute;gale. De fa&ccedil;on plus sp&eacute;cifique, la r&eacute;ponse d&eacute;pend des biblioth&egrave;ques que vous d&eacute;sirez utiliser et de leurs licences. La plupart des biblioth&egrave;ques syst&egrave;me utilisent soit la <a href="/licenses/lgpl.html">GNU Lesser GPL</a> (GNU GPL Amoindrie), ou utilisent la GNU GPL plus une exception permettant l'&eacute;dition de liens de la biblioth&egrave;que avec quoique ce soit. Ces biblioth&egrave;ques peuvent &ecirc;tre utilis&eacute;es dans des programmes non-libres; mais dans le cas de la GPL Amoindrie, elle comporte des exigences que vous devez suivre.

source: Some libraries are released under the GNU GPL alone; you must use a GPL-compatible license to use those libraries. But these are normally the more specialized libraries, and you would not have had anything much like them on another platform, so you probably won't find yourself wanting to use these libraries for simple porting.
fr: Certaines biblioth&egrave;ques sont diffus&eacute;es sous la GNU GPL seule&nbsp;; vous devez utiliser une licence compatible GPL pour utiliser ces biblioth&egrave;ques. Mais c'est normalement les biblioth&egrave;ques les plus sp&eacute;cialis&eacute;es, et vous n'auriez pas eu quelque chose de similaire sur une autre plateforme, donc vous n'aurez probablement pas besoin de ces biblioth&egrave;ques pour un simple portage.

source: Of course, your software is not a contribution to our community if it is not free, and people who value their freedom will refuse to use it. Only people willing to give up their freedom will use your software, which means that it will effectively function as an inducement for people to lose their freedom.
fr: Bien-s&ucirc;r, votre logiciel n'est pas une contribution &agrave; notre communaut&eacute; s'il n'est pas libre, et ceux qui accordent de la valeur &agrave; leur libert&eacute; refuseront de l'utiliser. Le r&eacute;sultat sera qu'il constituera une incitation &agrave; l'abandon de cette libert&eacute;, et sera seulement utile &agrave; ceux qui auront fait cela.

source: If you hope some day to look back on your career and feel that it has contributed to the growth of a good and free society, you need to make your software free.
fr: Si vous esp&eacute;rez un jour jeter un regard en arri&egrave;re sur votre carri&egrave;re et sentir que votre travail a &eacute;t&eacute; plus qu'une fa&ccedil;on de gagner de l'argent, cela devrait vous inciter &agrave; rendre votre programme libre.

source: No. The GPL does not require anyone to use the Internet for distribution. It also does not require anyone in particular to redistribute the program. And (outside of one special case), even if someone does decide to redistribute the program sometimes, the GPL doesn't say he has to distribute a copy to you in particular, or any other person in particular.
fr: Non. La GPL n'oblige personne &agrave; utiliser Internet pour la distribution. Elle ne requiert pas non plus que quelqu'un en particulier redistribue le programme. Et (en dehors d'un cas particulier), m&ecirc;me si quelqu'un d&eacute;cide parfois de redistribuer le programme, la GPL ne dit pas qu'il doit vous distribuer une copie &agrave; vous en particulier, ou tout autre personne en particulier.

source: What the GPL requires is that he must have the freedom to distribute a copy to you <em>if he wishes to</em>. Once the copyright holder does distribute a copy program to someone, that someone can then redistribute the program to you, or to anyone else, as he sees fit.
fr: Ce que la GPL exige, c'est qu'il ait la libert&eacute; de vous en distribuer une copie <em>s'il le souhaite</em>. Une fois que le d&eacute;tenteur du copyright distribue une copie du programme &agrave; quelqu'un, ce quelqu'un peut alors vous redistribuer le programme, ou &agrave; n'importe qui d'autre, comme &ccedil;a lui convient.

source: No. Such a license would be self-contradictory. Let's look at its implications for me as a user.
fr: Non. Une telle licence serait contradictoire. Regardons ses implications pour moi l'utilisateur.

source: Suppose I start with the original version (call it version A), add some code (let's imagine it is 1000 lines), and release that modified version (call it B) under the GPL. The GPL says anyone can change version B again and release the result under the GPL. So I (or someone else) can delete those 1000 lines, producing version C which has the same code as version A but is under the GPL.
fr: Supposons que je commence avec la version originale (appelons-la version A), que j'ajoute du code (disons 1000 lignes), et que je publie cette version (appelons-la B) sous la GPL. La GPL dit que quiconque peut changer la version B &agrave; nouveau et publier le r&eacute;sultat sous la GPL. Aussi je peux (ou quelqu'un d'autre) supprimer ces 1000 lignes, en produisant la version C qui a le m&ecirc;me code que la version A mais sous la GPL.

source: If you try to block that path, by saying explicitly in the license that I'm not allowed to reproduce something identical to version A under the GPL by deleting those lines from version B, in effect the license now says that I can't fully use version B in all the ways that the GPL permits. In other words, the license does not in fact allow a user to release a modified version such as B under the GPL.
fr: Si vous essayez de bloquer ceci, en disant explicitement dans la licence que je ne suis pas autoris&eacute; &agrave; reproduire quelque chose identique &agrave; la version A sous la GPL en supprimant ces lignes de la version B, en fait la licence dit maintenant que je ne peux pas utiliser enti&egrave;rement la version B des toutes les mani&egrave;res que l'autorise la GPL. En d'autres mots, la licence n'autorise pas en fait un utilisateur &agrave; publier une version telle que la version B sous la GPL.

source: Whether moving a copy to or from this subsidiary constitutes &ldquo;distribution&rdquo; is a matter to be decided in each case under the copyright law of the appropriate jurisdiction. The GPL does not and cannot override local laws. US copyright law is not entirely clear on the point, but appears not to consider this distribution.
fr: Que le d&eacute;placement vers ou &agrave; partir de cette filiale constitue une &laquo;&nbsp;distribution&nbsp;&raquo; ou pas est une question qui doit &ecirc;tre d&eacute;cid&eacute;e en fonction de la loi sur le droit d'auteur et de la juridiction appropri&eacute;s. La GPL ne surpasse pas les lois locales. La loi sur le droit d'auteur am&eacute;ricain n'est pas totalement claire sur ce point, mais ne semble pas traiter de ce cas de distribution.

source: If, in some country, this is considered distribution, and the subsidiary must receive the right to redistribute the program, that will not make a practical difference. The subsidiary is controlled by the parent company; rights or no rights, it won't redistribute the program unless the parent company decides to do so.
fr: Si, dans certains pays, c'est consid&eacute;r&eacute; comme une distribution, et que la filiale doit recevoir le droit de redistribuer le programme, cela ne fera pas de grande diff&eacute;rence. La filiale est contr&ocirc;l&eacute;e par la soci&eacute;t&eacute; m&egrave;re; droits ou pas droits, elle ne redistribuera pas le programme &agrave; moins que la soci&eacute;t&eacute; m&egrave;re ne le d&eacute;cide.

source: Some software packaging systems have a place which requires you to click through or otherwise indicate assent to the terms of the GPL. This is neither required nor forbidden. With or without a click through, the GPL's rules remain the same.
fr: Certains syst&egrave;mes d'empaquetage de logiciel ont une partie qui n&eacute;cessite de cliquer ou d'indiquer votre accord des termes de la GPL. Ce n'est ni requis, ni interdit. Avec ou sans clic, les r&egrave;gles de la GPL demeurent les m&ecirc;mes.

source: Merely agreeing to the GPL doesn't place any obligations on you. You are not required to agree to anything to merely use software which is licensed under the GPL. You only have obligations if you modify or distribute the software. If it really bothers you to click through the GPL, nothing stops you from hacking the GPLed software to bypass this.
fr: Le fait d'accepter les termes de la GPL ne vous obligent &agrave; rien. Vous n'&ecirc;tes pas oblig&eacute; d'accepter quoi que ce soit pour seulement utiliser le logiciel sous licence GPL. Vous avez des obligations seulement si vous modifier ou distribuer le logiciel. Si cela vous ennuie vraiment de cliquer pour accepter l'accord de licence de la GPL,rien ne vous emp&ecirc;che de modifier le logiciel pour passer outre.

source: No. The installer and the files it installs are separate works. As a result, the terms of the GPL do not apply to the installation software.
fr: Non. L'installeur et les fichiers qu'il installe sont des travaux s&eacute;par&eacute;s. Par cons&eacute;quent, les termes de la GPL ne s'appliquent pas au logiciel d'installation.

source: No. In this scenario, the requirement to keep paying a fee limits the user's ability to run the program. This is an additional requirement on top of the GPL, and the license prohibits it.
fr: Non. Dans ce sc&eacute;nario, la n&eacute;cessit&eacute; de continuer &agrave; payer des frais limite la possibilit&eacute; de l'utilisateur d'ex&eacute;cuter le programme. C'est une condition suppl&eacute;mentaire au-dessus de la GPL et la licence interdit cela.

source: First, include the new version of the license in your package. If you're using LGPLv3 in your project, be sure to include copies of both GPLv3 and LGPLv3, since LGPLv3 is now written as a set of additional permissions on top of GPLv3.
fr: Tout d'abord, incorporez la nouvelle version de la licence dans votre paquetage. Si vous utilisez la LGPLv3 pour votre projet, assurez-vous d'incorporer à la fois les copies de la GPLv3 et de la LGPLv3, car la LGPLv3 est maintenant écrite comme un ensemble de permissions supplémentaires en sus de la GPLv3.
