Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-violation.*.po
Languages: fr

source: Violations of the GNU Licenses - GNU Project - Free Software Foundation (FSF)
fr: Violations des licences GNU - GNU Project - Free Software Foundation (FSF)

source: Violations of the GNU Licenses
fr: Violations des licences GNU

source: If you think you see a violation of the GNU <a href="/licenses/gpl.html">GPL</a>, <a href="/licenses/lgpl.html">LGPL</a>, <a href="/licenses/agpl.html">AGPL</a>, or <a href="/licenses/fdl.html">FDL</a>, the first thing you should do is double-check the facts:
fr: Si vous pensez avoir d&eacute;couvert une violation des licences GNU <a href="/licenses/gpl.html">GPL</a>, <a href="/licenses/lgpl.html">LGPL</a>, <a href="/licenses/agpl.html">AGPL</a> ou <a href="/licenses/fdl.html">FDL</a>, la premi&egrave;re chose que vous devriez faire est de v&eacute;rifier deux fois les faits&nbsp;:

source: Does the distribution contain a copy of the License?
fr: La distribution contient-elle une copie de la licence&nbsp;?

source: Does it clearly state which software is covered by the License? Does it say anything misleading, perhaps giving the impression that something is covered by the License when in fact it is not?
fr: &Eacute;tablit-elle clairement quel logiciel est couvert par la licence&nbsp;? Dit-elle quoi que ce soit d'ambigu, donnant peut-&ecirc;tre l'impression que quelque chose est couvert par la licence alors que ce n'est en fait pas le cas&nbsp;?

source: Is source code included in the distribution?
fr: Le code source est-il inclus dans la distribution&nbsp;?

source: Is a written offer for source code included with a distribution of just binaries?
fr: Y a-t-il une offre &eacute;crite pour le code source incluse dans une distribution contenant seulement des binaires&nbsp;?

source: Is the available source code complete, or is it designed for linking in other non-free modules?
fr: Le code source disponible est-il complet ou est-il con&ccedil;u pour &ecirc;tre li&eacute; dans d'autres modules non-libres&nbsp;?

source: If there seems to be a real violation, the next thing you need to do is record the details carefully:
fr: S'il semble y avoir une r&eacute;elle violation, la chose suivante que vous devez faire est d'enregistrer les d&eacute;tails soigneusement&nbsp;:

source: the precise name of the product
fr: le nom pr&eacute;cis du produit

source: the name of the person or organization distributing it
fr: le nom de la personne ou de l'organisation qui le distribue

source: email addresses, postal addresses and phone numbers for how to contact the distributor(s)
fr: les adresses &eacute;lectroniques, postales et les num&eacute;ros de t&eacute;l&eacute;phone pour contacter le(s) distributeur(s)

source: the exact name of the package whose license is violated
fr: le nom exact du paquetage dont la licence est viol&eacute;e

source: how the license was violated:
fr: la fa&ccedil;on dont la licence a &eacute;t&eacute; viol&eacute;e&nbsp;:

source: Is the copyright notice of the copyright holder included?
fr: La notice de copyright du d&eacute;tenteur de copyright est-elle incluse&nbsp;?

source: Is the source code completely missing?
fr: Le code source est-il totalement absent&nbsp;?

source: Is there a written offer for source that's incomplete in some way? This could happen if it provides a contact address or network URL that's somehow incorrect.
fr: Y a-t-il une offre écrite pour le code source qui est incomplète&nbsp;? Ceci pourrait arriver si elle fournit une adresse de contact ou une URL réseau qui est incorrecte.

source: Is there a copy of the license included in the distribution?
fr: Y a-t-il une copie de la licence incluse dans la distribution&nbsp;?

source: Is some of the source available, but not all? If so, what parts are missing?
fr: Le code source n'est-il disponible que partiellement&nbsp;? Dans ce cas, quelles parties manquent&nbsp;?

source: The more of these details that you have, the easier it is for the copyright holder to pursue the matter.
fr: Plus vous avez de d&eacute;tails, plus il est facile pour le d&eacute;tenteur de copyright de poursuivre.

source: Once you have collected the details, you should send a precise report to the copyright holder of the packages that are being misused. The copyright holder is the one who is legally authorized to take action to enforce the license.
fr: Une fois que vous avez rassembl&eacute; les d&eacute;tails, vous devriez envoyer un rapport pr&eacute;cis au d&eacute;tenteur du copyright des paquetages qui sont mal utilis&eacute;s. Le d&eacute;tenteur du copyright est celui qui est l&eacute;galement autoris&eacute; &agrave; agir pour faire appliquer la licence.

source: If the copyright holder <strong>is</strong> the Free Software Foundation, please send the report to <a href="mailto:license-violation@gnu.org">&lt;license-violation@gnu.org&gt;</a>. It's important that we be able to write back to you to get more information about the violation or product. So, if you use an anonymous remailer, please provide a return path of some sort. If you'd like to encrypt your correspondence, just send a brief mail saying so, and we'll make appropriate arrangements.
fr: Si le d&eacute;tenteur du copyright <strong>est</strong> la Free Software Foundation, veuillez envoyer un rapport &agrave; <a href="mailto:license-violation@gnu.org">&lt;license-violation@gnu.org&gt;</a>. Il est important que nous puissions vous r&eacute;pondre pour obtenir plus d'informations sur la violation ou le produit. Donc, si vous utilisez un anonymiseur de courriel, veuillez fournir un quelconque moyen pour vous r&eacute;pondre. Si vous souhaitez chiffrer votre correspondance, envoyez un bref courriel l'expliquant et nous prendrons les arrangements appropri&eacute;s.

source: Note that the GPL, and other copyleft licenses, are copyright licenses. This means that only the copyright holders are empowered to act against violations. The FSF acts on all GPL violations reported on FSF copyrighted code, and we offer assistance to any other copyright holder who wishes to do the same.
fr: Notez que la GPL et d'autres licences de copyleft, sont des licences de copyright. Cela signifie que seuls les d&eacute;tenteurs du copyright sont habilit&eacute;s &agrave; agir contre les violations. La FSF agit sur toutes les violations de la GPL rapport&eacute;es pour le code sous copyright de la FSF, et nous offrons notre assistance &agrave; tout autre d&eacute;tenteur de copyright qui souhaite faire de m&ecirc;me.

source: But, we cannot act on our own if we do not hold copyright. Thus, be sure to find out who the copyright holders of the software are before reporting a violation.
fr: Mais nous ne pouvons agir de notre fait si nous ne d&eacute;tenons pas le copyright. Par cons&eacute;quent, assurez-vous de trouver qui sont les d&eacute;tenteurs du copyright du logiciel avant de rapporter une violation

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page:
fr: Traductions de cette page
