Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-faq.*.po
Languages: fr

source: <a href="#HeardOtherLicense">I heard that someone got a copy of a GPL'ed program under another license. Is this possible?</a>
fr: <a href="#HeardOtherLicense">J'ai entendu parler de quelqu'un qui a obtenu une copie d'un programme en GPL sous une autre licence. Cela est-il possible&nbsp;?</a>

source: <a href="#DeveloperViolate">Is the developer of a GPL-covered program bound by the GPL? Could the developer's actions ever be a violation of the GPL?</a>
fr: <a href="#DeveloperViolate">Est-ce que le d&eacute;veloppeur d'un programme couvert par la GPL est li&eacute; par cette GPL&nbsp;? Est-ce que le d&eacute;veloppeur pourrait se retrouver un jour en violation de la GPL&nbsp;?</a>

source: <a href="#SubscriptionFee">Can I use GPLed software on a device that will stop operating if customers do not continue paying a subscription fee?</a>
fr: <a href="#SubscriptionFee">Puis-je utiliser du logiciel sous GPL dans un appareil qui arr&ecirc;terait de fonctionner si les clients ne continuent pas &agrave; payer un abonnement&nbsp;?</a>

source: <a href="#Cure">What does it mean to &ldquo;cure&rdquo; a violation of GPLv3?</a>
fr: <a href="#Cure">Que signifie &laquo;&nbsp;soigner&nbsp;&raquo; une violation de la GPLv3&nbsp;?</a>

source: <a href="#LaptopLoan">If someone installs GPLed software on a laptop, and then lends that laptop to a friend without providing source code for the software, have they violated the GPL?</a>
fr: <a href="#LaptopLoan">Si quelqu'un installe un logiciel sous GPL sur un portable et qu'il pr&ecirc;te ce portable &agrave; un ami sans fournir le code source du logiciel, a-t-il enfreint la GPL&nbsp;?</a>

source: <a href="#TwoPartyTivoization" >Suppose that two companies try to circumvent the requirement to provide Installation Information by having one company release signed software, and the other release a User Product that only runs signed software from the first company. Is this a violation of GPLv3?</a>
fr: <a href="#TwoPartyTivoization">Supposons que deux soci&eacute;t&eacute;s essaient de contourner l'obligation de fournir des informations d'installation en faisant publier des logiciels sign&eacute;s par l'une et la seconde publierait un produit utilisateur qui n'ex&eacute;cuterait que les logiciels sign&eacute;s de la premi&egrave;re. Est-ce une violation de la GPLv3&nbsp;?</a>

source: &ldquo;GPL&rdquo; stands for &ldquo;General Public License&rdquo;. The most widespread such license is the GNU General Public License, or GNU GPL for short. This can be further shortened to &ldquo;GPL&rdquo;, when it is understood that the GNU GPL is the one intended.
fr: &laquo;&nbsp;GPL&nbsp;&raquo; est l'acronyme de <i>&laquo;&nbsp;General Public License&nbsp;&raquo;</i> (Licence Publique G&eacute;n&eacute;rale). La plus r&eacute;pandue des licences de ce type est la Licence Publique G&eacute;n&eacute;rale GNU (<i>GNU General Public License</i>), ou GNU GPL pour faire court. On peut r&eacute;duire encore plus en &laquo;&nbsp;GPL&nbsp;&raquo;, s'il est entendu qu'il s'agit de la GNU GPL.

source: Not at all&mdash;there are many other free software licenses. We have an <a href="/licenses/license-list.html">incomplete list</a>. Any license that provides the user <a href="/philosophy/free-sw.html">certain specific freedoms</a> is a free software license.
fr: Absolument pas&mdash;il y a beaucoup d'autres licences de logiciels libres. En voici une <a href="/licenses/license-list.fr.html">liste incompl&egrave;te</a>. Toute licence qui offre &agrave; l'utilisateur <a href="/philosophy/free-sw.fr.html">certaines libert&eacute;s sp&eacute;cifiques</a> est une licence de logiciel libre.

source: Using the GNU GPL will require that all the <a href="/philosophy/pragmatic.html">released improved versions be free software</a>. This means you can avoid the risk of having to compete with a proprietary modified version of your own work. However, in some special situations it can be better to use a <a href="/licenses/why-not-lgpl.html">more permissive license</a>.
fr: En utilisant la GNU GPL vous exigerez que toutes les <a href="/philosophy/pragmatic.fr.html">versions am&eacute;lior&eacute;es diffus&eacute;es soient du logiciel libre</a>. Ceci signifie que vous pouvez &eacute;viter le risque d'avoir &agrave; entrer en comp&eacute;tition avec une version modifi&eacute;e propri&eacute;taire de votre propre travail. Cependant, dans certaines situations il peut &ecirc;tre pr&eacute;f&eacute;rable d'utiliser une <a href="/licenses/why-not-lgpl.fr.html">licence plus permissive</a>.

source: Most GNU software packages use the GNU GPL, but there are a few GNU programs (and parts of programs) that use looser licenses, such as the Lesser GPL. When we do this, it is a matter of <a href="/licenses/why-not-lgpl.html">strategy</a>.
fr: La plupart des paquets logiciels GNU utilisent la GNU GPL, mais il existe un petit nombre de programmes (et portions de programmes) GNU qui utilisent des licences moins restrictives, telles que la GPL amoindrie (Lesser GPL). Quand nous l'utilisons, c'est pour des raisons <a href="/licenses/why-not-lgpl.fr.html">strat&eacute;giques</a>.

source: Anyone can release a program under the GNU GPL but that does not make it a GNU package.
fr: N'importe qui peut publier un programme sous licence GNU GPL mais &ccedil;a n'en fait pas un paquet logiciel GNU.

source: Making the program a GNU software package means explicitly contributing to the GNU Project. This happens when the program's developers and the GNU Project agree to do it. If you are interested in contributing a program to the GNU Project, please write to <a href="mailto:maintainers@gnu.org">&lt;maintainers@gnu.org&gt;</a>.
fr: Faire d'un programme un paquet logiciel GNU signifie contribuer explicitement au projet GNU. Ceci se produit quand les d&eacute;veloppeurs du programme et le projet GNU se mettent d'accord pour le faire. Si vous souhaitez contribuer au projet GNU par un programme, veuillez &eacute;crire &agrave; <a href="mailto:maintainers&#64;gnu.org">&lt;maintainers&#64;gnu.org&gt;</a>.

source: You should <a href="/licenses/gpl-violation.html">report it</a>. First, check the facts as best you can. Then tell the publisher or copyright holder of the specific GPL-covered program. If that is the Free Software Foundation, write to <a href="mailto:license-violation@gnu.org">&lt;license-violation@gnu.org&gt;</a>. Otherwise, the program's maintainer may be the copyright holder, or else could tell you how to contact the copyright holder, so report it to the maintainer.
fr: Vous devriez <a href="/licences/gpl-violation.fr.html">la signaler</a>. Tout d'abord, v&eacute;rifiez les faits du mieux que vous pouvez. Puis signalez-le &agrave; l'&eacute;diteur ou au d&eacute;tenteur du copyright du programme en question couvert par la GPL. Si c'est la Free Software Foundation, &eacute;crivez &agrave; <a href="mailto:license-violation&#64;gnu.org">&lt;license-violation&#64;gnu.org&gt;</a>. Sinon, le mainteneur du programme pourrait &ecirc;tre le d&eacute;tenteur du copyright, ou pourrait sinon vous dire comment contacter le d&eacute;tenteur du copyright, donc signalez- le au mainteneur.

source: A crucial aspect of free software is that users are free to cooperate. It is absolutely essential to permit users who wish to help each other to share their bug fixes and improvements with other users.
fr: Un aspect crucial du logiciel libre est que les utilisateurs sont libres de coop&eacute;rer. Il est absolument essentiel de permettre aux utilisateurs qui d&eacute;sirent s'entraider de partager leurs patches et am&eacute;liorations avec d'autres.

source: Some have proposed alternatives to the GPL that require modified versions to go through the original author. As long as the original author keeps up with the need for maintenance, this may work well in practice, but if the author stops (more or less) to do something else or does not attend to all the users' needs, this scheme falls down. Aside from the practical problems, this scheme does not allow users to help each other.
fr: Certains ont propos&eacute; des alternatives &agrave; la GPL qui requi&egrave;rent que la version modifi&eacute;e passe par l'auteur original. Tant que l'auteur original assure la maintenance n&eacute;cessaire, ceci peut fonctionner en pratique, mais si l'auteur cesse (plus ou moins) et passe &agrave; autre chose, ou ne r&eacute;pond pas aux besoins de tous les utilisateurs, cette mani&egrave;re de proc&eacute;der s'effondre. En plus des probl&egrave;mes pratiques, cette fa&ccedil;on de faire ne permet pas aux utilisateurs de s'entraider.

source: Sometimes control over modified versions is proposed as a means of preventing confusion between various versions made by users. In our experience, this confusion is not a major problem. Many versions of Emacs have been made outside the GNU Project, but users can tell them apart. The GPL requires the maker of a version to place his or her name on it, to distinguish it from other versions and to protect the reputations of other maintainers.
fr: Quelquefois, le contr&ocirc;le sur les versions modifi&eacute;es est propos&eacute; comme un moyen d'&eacute;viter des confusions entre les diff&eacute;rentes versions faites par les utilisateurs. Notre exp&eacute;rience nous a montr&eacute; qu'il ne s'agit pas d'un probl&egrave;me majeur. De nombreuses versions d'Emacs ont &eacute;t&eacute; faites en dehors du cadre du Projet GNU, mais les utilisateurs peuvent les diff&eacute;rencier. La GPL requiert que l'auteur d'une version mette son nom dessus, pour la distinguer des autres versions et prot&eacute;ger la r&eacute;putation des autres mainteneurs.

source: The GPL does not require you to release your modified version, or any part of it. You are free to make modifications and use them privately, without ever releasing them. This applies to organizations (including companies), too; an organization can make a modified version and use it internally without ever releasing it outside the organization.
fr: La GPL n'exige pas que vous publiiez votre version modifi&eacute;e. Vous &ecirc;tes libre de faire des modifications et de les utiliser &agrave; titre priv&eacute;, sans jamais les publier. Ceci s'applique aussi aux organisations (y compris les soci&eacute;t&eacute;s); une organisation peut r&eacute;aliser une version modifi&eacute;e et l'utiliser en interne sans jamais la diffuser en dehors de l'organisation.

source: But <em>if</em> you release the modified version to the public in some way, the GPL requires you to make the modified source code available to the program's users, under the GPL.
fr: Mais <em>si</em> vous distribuez la version modifi&eacute;e au public de quelque mani&egrave;re que soit, la GPL vous oblige &agrave; rendre la version du code source modifi&eacute;e disponible pour les utilisateurs, sous GPL.

source: Thus, the GPL gives permission to release the modified program in certain ways, and not in other ways; but the decision of whether to release it is up to you.
fr: Ainsi, la GPL autorise &agrave; distribuer des programmes modifi&eacute;s sous certaines conditions, et pas sous d'autres; mais la d&eacute;cision de le distribuer vous regarde.

source: Yes.
fr: Oui.

source: No. The GPL gives him permission to make and redistribute copies of the program <em>if he chooses to do so</em>. He also has the right not to redistribute the program, if that is what he chooses.
fr: Non. La GPL lui donne la permission de faire de redistribuer des copies du programme <em>S'il choisit de la faire</em>. Il a &eacute;galement le droit de ne pas redistribuer le programme, si c'est son choix.

source: If you choose to provide source through a written offer, then anybody who requests the source from you is entitled to receive it.
fr: Si vous choisissez de fournir les sources via une offre écrite, alors, quiconque vous demande les sources doit les recevoir.

source: If you commercially distribute binaries not accompanied with source code, the GPL says you must provide a written offer to distribute the source code later. When users non-commercially redistribute the binaries they received from you, they must pass along a copy of this written offer. This means that people who did not get the binaries directly from you can still receive copies of the source code, along with the written offer.
fr: Si vous distribuez commercialement des fichiers binaires non accompagn&eacute;s du code source, la GPL dit que vous devez fournir une offre &eacute;crite de distribuer le code source ult&eacute;rieurement. Quand les utilisateurs redistribuent non commercialement les fichiers binaires qu'ils ont obtenu aupr&egrave;s de vous, ils doivent transmettre en m&ecirc;me temps une copie de cette offre &eacute;crite. Ce qui veut dire que les personnes n'ayant pas r&eacute;cup&eacute;r&eacute; les fichiers binaires directement aupr&egrave;s de vous peuvent quand m&ecirc;me recevoir une copie du code source, selon l'offre &eacute;crite.

source: The reason we require the offer to be valid for any third party is so that people who receive the binaries indirectly in that way can order the source code from you.
fr: La raison pour laquelle nous exigeons que l'offre soit valide pour n'importe quel tiers est qu'ainsi les personnes qui re&ccedil;oivent les fichiers binaires indirectement de cette fa&ccedil;on peuvent ainsi commander le code source aupr&egrave;s de vous.

source: Section 2 says that modified versions you distribute must be licensed to all third parties under the GPL. &ldquo;All third parties&rdquo; means absolutely everyone&mdash;but this does not require you to *do* anything physically for them. It only means they have a license from you, under the GPL, for your version.
fr: La section 2 dit que vous devez donner &agrave; tous les tiers une licence sous GPL sur les versions modifi&eacute;es que vous distribuez. &laquo;&nbsp;&Agrave; tous les tiers&nbsp;&raquo; (<i>&laquo;&nbsp;all third parties&nbsp;&raquo;</i>) signifie absolument tout le monde&mdash;mais &ccedil;a ne vous oblige pas &agrave; *faire* quelque chose physiquement pour eux. Cela veut seulement dire qu'ils ont une obtenu une licence de votre part, sous la GPL, pour votre version.

source: You are not required to claim a copyright on your changes. In most countries, however, that happens automatically by default, so you need to place your changes explicitly in the public domain if you do not want them to be copyrighted.
fr: Vous n'&ecirc;tes oblig&eacute; de revendiquer un copyright sur vos modifications. Dans la plupart des pays, cependant, ceci arrive automatiquement par d&eacute;faut, aussi vous devrez mettre de fa&ccedil;on explicite les modifications dans le domaine public si vous ne voulez pas qu'elles soient sous copyright.

source: Whether you claim a copyright on your changes or not, either way you must release the modified version, as a whole, under the GPL. (<a href="#GPLRequireSourcePostedPublic">if you release your modified version at all</a>)
fr: Que vous revendiquiez ou non un copyright sur vos modifications, vous devrez publier la version modifi&eacute;e, dans son entier, sous la GPL (<a href="#GPLRequireSourcePostedPublic">si vous la publiez</a>).

source: You can do that, if you can figure out which part is the public domain part and separate it from the rest. If code was put in the public domain by its developer, it is in the public domain no matter where it has been.
fr: Vous pouvez le faire, si vous pouvez d&eacute;terminer quelle part fait partie du domaine public et la s&eacute;parer du reste. Si du code a &eacute;t&eacute; mis dans le domaine public par son d&eacute;veloppeur, il est dans le domaine public peu importe ou il &eacute;tait auparavant.

source: Yes, the GPL allows everyone to do this. The <a href="/philosophy/selling.html">right to sell copies</a> is part of the definition of free software. Except in one special situation, there is no limit on what price you can charge. (The one exception is the required written offer to provide source code that must accompany binary-only release.)
fr: Oui, la GPL autorise cela pour tout le monde. Le <a href="/philosophy/selling.fr.html">droit de vendre des copies</a> est une partie de la d&eacute;finition du logiciel libre.

source: Yes. You can charge any fee you wish for distributing a copy of the program. If you distribute binaries by download, you must provide &ldquo;equivalent access&rdquo; to download the source&mdash;therefore, the fee to download source may not be greater than the fee to download the binary.
fr: Oui. Vous pouvez demander le montant que vous souhaitez pour distribuer une copie du programme. Si vous distribuez des ex&eacute;cutables en t&eacute;l&eacute;chargement, vous devez fournir un &laquo;&nbsp;acc&egrave;s &eacute;quivalent&nbsp;&raquo; pour le t&eacute;l&eacute;chargement de sources &mdash; cependant, le montant du t&eacute;l&eacute;chargement des sources ne doit pas &ecirc;tre plus important que celui du t&eacute;l&eacute;chargement des ex&eacute;cutables.

source: No. In fact, a requirement like that would make the program non-free. If people have to pay when they get a copy of a program, or if they have to notify anyone in particular, then the program is not free. See the <a href="/philosophy/free-sw.html"> definition of free software</a>.
fr: Non. D'ailleurs, une telle exigence rendrait le programme non-libre. Si l'on doit payer pour recevoir une copie d'un programme, ou si l'on doit le signaler &agrave; quelqu'un en particulier, alors le programme n'est pas libre. Voir la <a href="/philosophy/free-sw.fr.html">d&eacute;finition du logiciel libre</a>.

source: The GPL is a free software license, and therefore it permits people to use and even redistribute the software without being required to pay anyone a fee for doing so.
fr: La GPL est une licence de logiciel libre, et par cons&eacute;quent elle permet l'utilisation et m&ecirc;me la redistribution du logiciel sans que l'on ait &agrave; payer de droit &agrave; quiconque pour cela.

source: No. However, if someone pays your fee and gets a copy, the GPL gives them the freedom to release it to the public, with or without a fee. For example, someone could pay your fee, and then put her copy on a web site for the general public.
fr: Non. Cependant, si quelqu'un paie pour obtenir une copie, la GPL lui donne la libert&eacute; de la rendre disponible au public, avec ou sans r&eacute;tribution. Par exemple, quelqu'un pourrait payer un montant, puis mettre sa copie sur un site Web &agrave; disposition du public.

source: No. The GPL says that anyone who receives a copy from you has the right to redistribute copies, modified or not. You are not allowed to distribute the work on any more restrictive basis.
fr: Non. La GPL dit que quiconque re&ccedil;oit une copie de votre version de votre part a le droit de redistribuer des copies (modifi&eacute;es ou non) de cette version. Elle ne vous donne pas le droit de distribuer votre travail avec plus de restrictions.

source: If someone asks you to sign an NDA for receiving GPL-covered software copyrighted by the FSF, please inform us immediately by writing to <a href="mailto:license-violation@fsf.org">license-violation@fsf.org</a>.
fr: Si quelqu'un vous demande de signer un accord de non divulgation pour recevoir un logiciel sous copyright de la FSF, veuillez nous en informer immédiatement en écrivant à <a href="mailto:license-violation@fsf.org">license-violation@fsf.org</a>.

source: If the violation involves GPL-covered code that has some other copyright holder, please inform that copyright holder, just as you would for any other kind of violation of the GPL.
fr: Si la violation concerne du code couvert par la GPL ayant un autre détenteur de copyright, veuillez en informer le détenteur, tout comme vous le feriez pour toute autre violation de la GPL.

source: No. The GPL says that your modified versions must carry all the freedoms stated in the GPL. Thus, anyone who receives a copy of your version from you has the right to redistribute copies (modified or not) of that version. You may not distribute any version of the work on a more restrictive basis.
fr: Non. La GPL dit que vos versions modifiées doivent porter toutes les libertés déclarées dans la GPL. Par conséquent, quiconque reçoit une copie de votre version de votre part a le droit de redistribuer des copies (modifiées ou pas) de cette version. Vous ne pouvez pas distribuer toute version de l'œuvre sur une base plus restrictive.

source: Yes. For instance, you can accept a contract to develop changes and agree not to release <em>your changes</em> until the client says ok. This is permitted because in this case no GPL-covered code is being distributed under an NDA.
fr: Oui. Par exemple, vous pouvez accepter un contrat pour d&eacute;velopper des modifications et accepter de ne pas publier <em>vos modifications</em> jusqu'&agrave; ce que le client soit d'accord. Ceci est permis car dans ce cas aucun code couvert par la GPL n'est distribu&eacute; sous accord de non divulgation

source: You can also release your changes to the client under the GPL, but agree not to release them to anyone else unless the client says ok. In this case, too, no GPL-covered code is being distributed under an NDA, or under any additional restrictions.
fr: Vous pouvez &eacute;galement publier vos modifications pour le client sous GPL, mais accepter de ne pas les diffuser &agrave; d'autres personnes &agrave; moins que le client ne soit d'accord. Dans ce cas aussi, aucun code couvert par la GPL n'est distribu&eacute; sous accord de non divulgation, ou toute autre restriction suppl&eacute;mentaire.

source: The GPL would give the client the right to redistribute your version. In this scenario, the client will probably choose not to exercise that right, but does <em>have</em> the right.
fr: La GPL donne le droit au client de redistributer votre version. Dans ce sc&eacute;nario, le client choisira probablement de ne pas exercer ce droit, mais il <em>a</em> le droit de le faire

source: You can certainly get credit for the work. Part of releasing a program under the GPL is writing a copyright notice in your own name (assuming you are the copyright holder). The GPL requires all copies to carry an appropriate copyright notice.
fr: Votre travail doit certainement &ecirc;tre reconnu. La distribution d'un programme sous licence GPL doit aussi se traduire par la mention d'un copyright &agrave; votre propre nom (&agrave; supposer que vous d&eacute;teniez ce copyright). La GPL requiert que chaque copie porte une mention de copyright appropri&eacute;e.

source: Including a copy of the license with the work is vital so that everyone who gets a copy of the program can know what his rights are.
fr: Le fait d'inclure une copie de la licence avec le programme est vital, ainsi tous ceux qui re&ccedil;oivent une copie du programme peuvent conna&icirc;tre leurs droits

source: It might be tempting to include a URL that refers to the license, instead of the license itself. But you cannot be sure that the URL will still be valid, five years or ten years from now. Twenty years from now, URLs as we know them today may no longer exist.
fr: Il peut para&icirc;tre tentant d'inclure une URL qui r&eacute;f&egrave;re &agrave; cette licence, au lieu de la licence elle-m&ecirc;me. Mais vous ne pouvez pas &ecirc;tre s&ucirc;r que cette URL sera toujours valable dans cinq ou dix ans. Dans vingt ans, les URL que nous connaissons aujourd'hui n'existeront peut-&ecirc;tre plus.
