Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-faq.*.po
Languages: fr

source: No, in that case the organization is just making the copies for itself. As a consequence, a company or other organization can develop a modified version and install that version through its own facilities, without giving the staff permission to release that modified version to outsiders.
fr: Non, dans ce cas la soci&eacute;t&eacute; fait juste des copies pour elle-m&ecirc;me. Par cons&eacute;quent, une soci&eacute;t&eacute; ou une organisation peut d&eacute;velopper une version modifi&eacute;e et l'installer dans ces locaux, sans donner la permission au personnel de publier la version modifi&eacute;e &agrave; l'ext&eacute;rieur.

source: However, when the organization transfers copies to other organizations or individuals, that is distribution. In particular, providing copies to contractors for use off-site is distribution.
fr: Cependant, quand une organisation transf&egrave;re des copies &agrave; d'autres organisations ou &agrave; des particuliers, c'est une distribution. En particulier, fournir des copies &agrave; des sous-traitants pour une utilisation hors site est une distribution.

source: If the version has been released elsewhere, then the thief probably does have the right to make copies and redistribute them under the GPL, but if he is imprisoned for stealing the CD he may have to wait until his release before doing so.
fr: Si la version a &eacute;t&eacute; publi&eacute;e ailleurs, alors le voleur a probablement le droit de faire des copies et de les redistribuer sous la GPL, mais s'il est emprisonn&eacute; pour avoir vol&eacute; le CD, il se peut qu'il doivent attendre sa lib&eacute;ration avant de le faire.

source: If the version in question is unpublished and considered by a company to be its trade secret, then publishing it may be a violation of trade secret law, depending on other circumstances. The GPL does not change that. If the company tried to release its version and still treat it as a trade secret, that would violate the GPL, but if the company hasn't released this version, no such violation has occurred.
fr: Si la version en question n'est pas publi&eacute;e ou consid&eacute;r&eacute;e par une soci&eacute;t&eacute; comme un secret commercial, alors la publier peut &ecirc;tre une violation du secret commercial, selon d'autres circonstances. La GPL ne change pas cela. Si la soci&eacute;t&eacute; a essay&eacute; de publier sa version en la consid&eacute;rant encore comme un secret commercial, cela violerait la GPL, mais si la soci&eacute;t&eacute; n'a pas publi&eacute; cette version, ce n'est pas une violation.

source: If a company distributes a copy to you and claims it is a trade secret, the company has violated the GPL and will have to cease distribution. Note how this differs from the theft case above; the company does not intentionally distribute a copy when a copy is stolen, so in that case the company has not violated the GPL.
fr: Si la soci&eacute;t&eacute; vous a distribu&eacute; une copie et revendique le secret commercial, la soci&eacute;t&eacute; a viol&eacute; la GPL et doit cesser la distribution. Notez comme cela diff&egrave;re du cas du vol ci-dessus; la soci&eacute;t&eacute; ne distribue pas intentionnellement une copie quand une copie est vol&eacute;e, aussi dans ce cas, la soci&eacute;t&eacute; n'a pas viol&eacute; la GPL.

source: Using the Lesser GPL for any particular library constitutes a retreat for free software. It means we partially abandon the attempt to defend the users' freedom, and some of the requirements to share what is built on top of GPL-covered software. In themselves, those are changes for the worse.
fr: L'utilisation de la <i>Lesser GPL</i> (GPL Amoindrie) pour toute biblioth&egrave;que particuli&egrave;re repr&eacute;sente une d&eacute;faite pour le logiciel libre. Cela signifie que nous abandonnons partiellement nos tentatives de d&eacute;fendre la libert&eacute; de l'utilisateur, et certaines des exigences sur le partage de ce qui est construit sur un logiciel sous GPL. Il s'agit en l'&eacute;tat d'&eacute;volutions n&eacute;gatives.

source: Sometimes a localized retreat is a good strategy. Sometimes, using the LGPL for a library might lead to wider use of that library, and thus to more improvement for it, wider support for free software, and so on. This could be good for free software if it happens to a large extent. But how much will this happen? We can only speculate.
fr: Une d&eacute;faite partielle peut parfois se r&eacute;v&eacute;ler &ecirc;tre une bonne strat&eacute;gie. Quelquefois, l'utilisation de la LGPL pour une biblioth&egrave;que peut amener &agrave; une utilisation plus large de cette biblioth&egrave;que, et par voie de cons&eacute;quence &agrave; son am&eacute;lioration, un plus grand soutien au logiciel libre, ainsi de suite. Cela pourrait &ecirc;tre bon pour le logiciel libre, si cela se passe &agrave; grande &eacute;chelle. Mais nous pouvons seulement sp&eacute;culer sur l'&eacute;tendue d'un tel succ&egrave;s.

source: It would be nice to try out the LGPL on each library for a while, see whether it helps, and change back to the GPL if the LGPL didn't help. But this is not feasible. Once we use the LGPL for a particular library, changing back would be difficult.
fr: Il serait sympathique d'essayer pendant un temps la LGPL pour chaque biblioth&egrave;que, pour voir si cela am&eacute;liore les choses, puis de se remettre sous GPL si la LGPL n'apporte rien de plus. Mais cela n'est pas envisageable. Une fois qu'une biblioth&egrave;que particuli&egrave;re est plac&eacute;e sous LGPL, il est difficile de changer &agrave; nouveau.

source: So we decide which license to use for each library on a case-by-case basis. There is a <a href="/licenses/why-not-lgpl.html">long explanation</a> of how we judge the question.
fr: Nous d&eacute;cidons donc de quelle licence utiliser pour chaque bibliothèque au cas par cas. Il existe une <a href="/licenses/why-not-lgpl.fr.html">longue explication</a> sur la fa&ccedil;on dont nous proc&eacute;dons pour nous d&eacute;cider.

source: Sorry, we don't make such exceptions. It would not be right.
fr: D&eacute;sol&eacute;, nous ne faisons pas d'exception de ce genre, cela ne serait pas bien.

source: Maximizing the number of users is not our aim. Rather, we are trying to give the crucial freedoms to as many users as possible. In general, proprietary software projects hinder rather than help the cause of freedom.
fr: Notre objectif n'est pas de maximiser le nombre d'utilisateurs. Nous essayons plut&ocirc;t de donner les libert&eacute;s fondamentales au plus grand nombre possible d'utilisateurs. D'une mani&egrave;re g&eacute;n&eacute;rale, les logiciels propri&eacute;taires freinent les libert&eacute;s plus qu'ils ne les favorisent.

source: We do occasionally make license exceptions to assist a project which is producing free software under a license other than the GPL. However, we have to see a good reason why this will advance the cause of free software.
fr: Il nous arrive de cr&eacute;er des exceptions de licence pour aider un projet de logiciel libre sous une autre licence que la GPL. Toutefois, il nous faut pour cela une bonne justification du fait que cela fera avancer la cause du logiciel libre.

source: We also do sometimes change the distribution terms of a package, when that seems clearly the right way to serve the cause of free software; but we are very cautious about this, so you will have to show us very convincing reasons.
fr: Il nous arrive aussi quelquefois de modifier les clauses de distribution d'un paquetage, quand cela nous appara&icirc;t clairement comme un moyen de promouvoir la cause du logiciel libre, mais nous sommes tr&egrave;s prudent &agrave; ce sujet et il vous faudra nous donner des raisons tr&egrave;s convaincantes.

source: From time to time, at intervals of years, we change the GPL&mdash;sometimes to clarify it, sometimes to permit certain kinds of use not previously permitted, and sometimes to tighten up a requirement. (The last two changes were in 2007 and 1991.) Using this &ldquo;indirect pointer&rdquo; in each program makes it possible for us to change the distribution terms on the entire collection of GNU software, when we update the GPL.
fr: De temps en temps, apr&egrave;s quelques ann&eacute;es, il nous arrive de modifier la GPL&mdash;quelquefois simplement pour &eacute;claircir un point, quelquefois pour autoriser certaines utilisations alors qu'elles ne l'&eacute;taient pas auparavant, et quelquefois pour renforcer une exigence. (Les deux derniers changements datent de 2007 et 1991). L'utilisation de ce &laquo;&nbsp;pointeur indirect&nbsp;&raquo; dans chaque programme nous permet de changer les conditions de distribution de l'ensemble des logiciels GNU, lorsque nous modifions la GPL.

source: If each program lacked the indirect pointer, we would be forced to discuss the change at length with numerous copyright holders, which would be a virtual impossibility. In practice, the chance of having uniform distribution terms for GNU software would be nil.
fr: Si aucun programme ne contenait ce pointeur indirect, nous serions forc&eacute;s de longuement discuter du changement avec de tr&egrave;s nombreux d&eacute;tenteurs de copyright, ce qui serait virtuellement impossible. En pratique, la probabilit&eacute; d'aboutir &agrave; un mode de distribution unifi&eacute; pour les logiciels GNU serait nulle.

source: Suppose a program says &ldquo;Version 3 of the GPL or any later version&rdquo; and a new version of the GPL is released. If the new GPL version gives additional permission, that permission will be available immediately to all the users of the program. But if the new GPL version has a tighter requirement, it will not restrict use of the current version of the program, because it can still be used under GPL version 3. When a program says &ldquo;Version 3 of the GPL or any later version&rdquo;, users will always be permitted to use it, and even change it, according to the terms of GPL version 3&mdash;even after later versions of the GPL are available.
fr: Supposez qu'un programme dise &laquo;&nbsp;Version 3 de la GPL ou toute version ult&eacute;rieure&nbsp;&raquo; et qu'une nouvelle version de la GPL soit publi&eacute;e. Si la nouvelle version de la GPL donne une permission suppl&eacute;mentaire, cette permission est imm&eacute;diatement disponible pour tous les utilisateurs du programme. Mais, si la nouvelle version de la GPL comporte une exigence plus restrictive, cela ne limitera pas l'utilisation de la version courante du programme, car ce dernier peut toujours &ecirc;tre utilis&eacute; sous GPL Version 3. Lorsqu'un programme dit &laquo;&nbsp;Version 3 de la GPL ou toute version ult&eacute;rieure&nbsp;&raquo;, les utilisateurs seront toujours autoris&eacute;s &agrave; l'utiliser, et m&ecirc;me &agrave; le modifier, selon les termes de la GPL Version 3&mdash;m&ecirc;me apr&egrave;s que d'autres versions de la GPL auront &eacute;t&eacute; rendues disponibles.

source: If a tighter requirement in a new version of the GPL need not be obeyed for existing software, how is it useful? Once GPL version 4 is available, the developers of most GPL-covered programs will release subsequent versions of their programs specifying &ldquo;Version 4 of the GPL or any later version&rdquo;. Then users will have to follow the tighter requirements in GPL version 4, for subsequent versions of the program.
fr: Si une exigence plus forte dans une nouvelle version de la GPL n'est pas obligatoire pour les logiciels existants, &agrave; quoi sert-elle&nbsp;? Lorsque la version 4 de la GPL est disponible, les d&eacute;veloppeurs de la plupart des programmes sous GPL distribueront les versions suivantes de leur programme en sp&eacute;cifiant &laquo;&nbsp;Version 4 de la GPL ou toute version ult&eacute;rieure&nbsp;&raquo;. Les utilisateurs devront se conformer aux clauses plus restrictives de la GPL Version 4, pour les versions suivantes de ce programme.

source: However, developers are not obligated to do this; developers can continue allowing use of the previous version of the GPL, if that is their preference.
fr: Les d&eacute;veloppeurs ne sont toutefois pas dans l'obligation d'agir ainsi&nbsp;; ils peuvent continuer &agrave; autoriser l'utilisation de la version pr&eacute;c&eacute;dente de la GPL, si c'est leur souhait.

source: It is possible to use the GPL for a manual, but the GNU Free Documentation License (GFDL) is much better for manuals.
fr: Il est possible d'utiliser la GPL pour les manuels, mais pour ceux-ci il vaut beaucoup mieux utiliser la GNU Free Documentation Licence (GFDL, Licence de Documentation Libre GNU).

source: The GPL was designed for programs; it contains lots of complex clauses that are crucial for programs, but that would be cumbersome and unnecessary for a book or manual. For instance, anyone publishing the book on paper would have to either include machine-readable &ldquo;source code&rdquo; of the book along with each printed copy, or provide a written offer to send the &ldquo;source code&rdquo; later.
fr: La GPL a &eacute;t&eacute; con&ccedil;ue pour les programmes; elle contient de nombreuses clauses complexes qui sont tr&egrave;s importantes pour les programmes, mais constituent un poids mort pour un livre ou un manuel. En revanche, la GFDL contient des clauses qui permettent aux &eacute;diteurs de manuels libres d'en tirer des revenus.

source: Meanwhile, the GFDL has clauses that help publishers of free manuals make a profit from selling copies&mdash;cover texts, for instance. The special rules for Endorsements sections make it possible to use the GFDL for an official standard. This would permit modified versions, but they could not be labeled as &ldquo;the standard&rdquo;.
fr: Nous autorisons les modifications du texte qui concerne les sujets techniques, mais nous n'autorisons pas de modifications dans les sections qui exposent notre position l&eacute;gale, politique, ou &eacute;thique. Nous faisons cela en signalant explicitement les sections qui ne peuvent &ecirc;tre modifi&eacute;es. La GFDL pr&eacute;voit ces &laquo;&nbsp;sections invariantes&nbsp;&raquo;&mdash;alors que la GPL ne les autoriserait pas.

source: Using the GFDL, we permit changes in the text of a manual that covers its technical topic. It is important to be able to change the technical parts, because people who change a program ought to change the documentation to correspond. The freedom to do this is an ethical imperative.
fr: En utilisant la GFDL, nous permettons des changements dans le texte d'un manuel qui couvre un sujet technique. Il est important d'autoriser les modifications des parties techniques, car les gens qui modifient un programme doivent pouvoir modifier la documentation correspondante. La liberté de faire ceci est un impératif éthique.

source: Our manuals also include sections that state our political position about free software. We mark these as &ldquo;invariant&rdquo;, so that they cannot be changed or removed. The GFDL makes provisions for these &ldquo;invariant sections&rdquo;.
fr: Nos manuels contiennent aussi des sections qui font état de notre position politique sur les logiciels libres. Nous marquons ces sections comme «&nbsp;inaltérables&nbsp;», de sorte qu'elles ne puissent être modifiées ou retirées. La GFDL établit des clauses pour ces «&nbsp;sections inaltérables&nbsp;».

source: Font licensing is a complex issue which needs serious consideration. The following license exception is experimental but approved for general use. We welcome suggestions on this subject&mdash;please see this this <a href="http://www.fsf.org/blogs/licensing/20050425novalis">explanatory essay</a> and write to <a href="mailto:licensing@gnu.org">licensing@gnu.org</a>.
fr: La licence de police est un probl&egrave;me complexe qui a besoin de s&eacute;rieuses consid&eacute;rations. L'exception de licence suivante est exp&eacute;rimentale maisapprouv&eacute;e pour une utilisation g&eacute;n&eacute;rale. Les suggestions sont les bienvenues sur ce sujet &mdash; veuillez consulter ce <a href="http://www.fsf.org/blogs/licensing/20050425novalis">billet explicatif</a> et &eacute;crire &agrave; <a href="mailto:licensing&#64;gnu.org">licensing&#64;gnu.org</a>.

source: To use this exception, add this text to the license notice of each file in the package (to the extent possible), at the end of the text that says the file is distributed under the GNU GPL:
fr: Pour utiliser cette exception, ajouter ce texte &agrave; votre notice de licence pour chaque fichier du paquetage (dans la mesure du possible), apr&egrave;s le texte qui dit que le fichier est distribu&eacute; sous la GPL GNU&nbsp;:

source: As a special exception, if you create a document which uses this font, and embed this font or unaltered portions of this font into the document, this font does not by itself cause the resulting document to be covered by the GNU General Public License. This exception does not however invalidate any other reasons why the document might be covered by the GNU General Public License. If you modify this font, you may extend this exception to your version of the font, but you are not obligated to do so. If you do not wish to do so, delete this exception statement from your version.
fr: As a special exception, if you create a document which uses this font, and embed this font or unaltered portions of this font into the document, this font does not by itself cause the resulting document to be covered by the GNU General Public License. This exception does not however invalidate any other reasons why the document might be covered by the GNU General Public License. If you modify this font, you may extend this exception to your version of the font, but you are not obligated to do so. If you do not wish to do so, delete this exception statement from your version. Traduction&nbsp;: Comme exception sp&eacute;ciale, si vous cr&eacute;ez un document qui utilise cette police, ou int&eacute;grez cette police ou des parties inalt&eacute;r&eacute;es de cette police dans le document, cette police n'implique pas en soi que le document r&eacute;sultant soit couvert par la Licence publique g&eacute;n&eacute;rale GNU. Cette exception n'emp&ecirc;che pas cependant que le document soit, pour d'autres raisons, couvert par la Licence publique g&eacute;n&eacute;rale GNU. Si vous modifiez cette police, vous pouvez &eacute;tendre ce droit &agrave; votre version de la police, mais vous n'y &ecirc;tes pas oblig&eacute;. Si vous ne le souhaitez pas, supprimez cette clause de votre version.

source: Templates are minor enough that it is not worth using copyleft to protect them. It is normally harmless to use copyleft on minor works, but templates are a special case, because they are combined with data provided by users of the application and the combination is distributed. So, we recommend that you license your templates under simple permissive terms.
fr: Les mod&egrave;les sont assez mineurs et &ccedil;a ne vaut pas la peine d'utiliser le copyleft (la gauche d'auteur) pour les prot&eacute;ger. Il n'est normalement pas dangereux d'utiliser le copyleft pour des &oelig;uvres mineures, mais les mod&egrave;les sont un cas particulier car ils combinent des donn&eacute;es fournies par les utilisateurs de l'application et cette combinaison est distribu&eacute;e. C'est pourquoi nous recommandons d'utiliser une licence permissive simple pour vos mod&egrave;les.

source: Some templates make calls into Javascript functions. Since Javascript is often non-trivial, it is worth copylefting. Because the templates will be combined with user data, it's possible that template+user data+Javascript would be considered one work under copyright law. A line needs to be drawn between the Javascript (copylefted), and the user code (usually under incompatible terms).
fr: Certains mod&egrave;les font des appels &agrave; des fonctions Javascript. Puisque le Javascript n'est pas souvent trivial, cela vaut la peine de mettre les scripts sous copyleft. Parce que les mod&egrave;les sont combin&eacute;s avec des donn&eacute;es utilisateur, il est possible que l'ensemble mod&egrave;le+donn&eacute;es utilisateur+Javascript soit consid&eacute;r&eacute; comme une seule &oelig;uvre selon la loi sur les droits d'auteur. Il est n&eacute;cessaire de tracer une ligne antre le code Javascript (sous copyleft) et le code utilisateur (habituellement en des termes incompatibles).

source: A diagram of the above content
fr: Un diagramme du contenu ci-dessus

source: Here's an exception for Javascript code that does this:
fr: Il y a une exception pour le code Javascript qui dit ceci&nbsp;:

source: As a special exception to the GPL, any HTML file which merely makes function calls to this code, and for that purpose includes it by reference shall be deemed a separate work for copyright law purposes. In addition, the copyright holders of this code give you permission to combine this code with free software libraries that are released under the GNU LGPL. You may copy and distribute such a system following the terms of the GNU GPL for this code and the LGPL for the libraries. If you modify this code, you may extend this exception to your version of the code, but you are not obligated to do so. If you do not wish to do so, delete this exception statement from your version.
fr: As a special exception to the GPL, any HTML file which merely makes function calls to this code, and for that purpose includes it by reference shall be deemed a separate work for copyright law purposes. In addition, the copyright holders of this code give you permission to combine this code with free software libraries that are released under the GNU LGPL. You may copy and distribute such a system following the terms of the GNU GPL for this code and the LGPL for the libraries. If you modify this code, you may extend this exception to your version of the code, but you are not obligated to do so. If you do not wish to do so, delete this exception statement from your version. Traduction&nbsp;: En tant qu'exception sp&eacute;ciale &agrave; la GPL, tout fichier HTML faisant essentiellement des appels de fonction &agrave; ce code et qui pour ce faire l'inclut par r&eacute;f&eacute;rence, devra &ecirc;tre consid&eacute;r&eacute; comme une &oelig;uvre s&eacute;par&eacute;e pour la loi sur le droit d'auteur. De plus, les d&eacute;tenteurs du droit d'auteur de ce code vous donne l'autorisation de combiner ce code avec des biblioth&egrave;ques de logiciels libres publi&eacute;es sous la GNU LGPL. Vous pouvez copier et distribuer un tel syst&egrave;me suivant les termes de la GNU GPL pour ce code et ceux de la LGPL pour les biblioth&egrave;ques. Si vous modifiez ce code, vous pouvez &eacute;tendre cette exception &agrave; votre version du code, mais vous n'y &ecirc;tes pas oblig&eacute;. Si vous ne souhaitez pas le faire, supprimez cette d&eacute;claration d'exception de votre version.

source: Which programs you used to edit the source code, or to compile it, or study it, or record it, usually makes no difference for issues concerning the licensing of that source code.
fr: Les programmes que vous utilisez pour &eacute;diter le code source, le compiler, l'&eacute;tudier ou l'enregistrer ne font g&eacute;n&eacute;ralement pas de diff&eacute;rencepour les probl&egrave;mes relatifs &agrave; la licence de ce code source.
