Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-faq.*.po
Languages: fr

source: <a href="#UnchangedJustBinary">I downloaded just the binary from the net. If I distribute copies, do I have to get the source and distribute that too?</a>
fr: <a href="#UnchangedJustBinary">J'ai t&eacute;l&eacute;charg&eacute; seulement le programme binaire &agrave; partir d'Internet. Si je distribue des copies, dois-je obtenir le code source et le redistribuer aussi&nbsp;?</a>

source: <a href="#DistributeWithSourceOnInternet">I want to distribute binaries via physical media without accompanying sources. Can I provide source code by FTP instead of by mail order?</a>
fr: <a href="#DistributeWithSourceOnInternet">Je veux distribuer les fichiers binaires d'un programme sous GPL sur support physique sans les sources associ&eacute;es. Au lieu d'envoyer ult&eacute;rieurement le code source aux utilisateurs qui en font la demande, puis-je me contenter de mettre les sources sur un serveur Internet&nbsp;?</a>

source: <a href="#RedistributedBinariesGetSource">My friend got a GPL-covered binary with an offer to supply source, and made a copy for me. Can I use the offer to obtain the source?</a>
fr: <a href="#RedistributedBinariesGetSource">Mon ami a un ex&eacute;cutable d'un programme sous GPL avec une offre de fourniture des sources, et a fait une copie pour moi. Puis-je utiliser l'offre pour obtenir les sources&nbsp;?</a>

source: <a href="#SourceAndBinaryOnDifferentSites">Can I put the binaries on my Internet server and put the source on a different Internet site?</a>
fr: <a href="#SourceAndBinaryOnDifferentSites">Puis-je mettre les fichiers binaires sur mon serveur Internet et les sources sur un site Internet diff&eacute;rent&nbsp;?</a>

source: <a href="#DistributeExtendedBinary">I want to distribute an extended version of a GPL-covered program in binary form. Is it enough to distribute the source for the original version?</a>
fr: <a href="#DistributeExtendedBinary">Je veux distribuer une version &eacute;tendue d'un programme sous GPL sous forme de fichiers binaires. Me suffit-il de distribuer le code source de la version originale&nbsp;?</a>

source: <a href="#DistributingSourceIsInconvenient">I want to distribute binaries, but distributing complete source is inconvenient. Is it ok if I give users the diffs from the &ldquo;standard&rdquo; version along with the binaries?</a>
fr: <a href="#DistributingSourceIsInconvenient">Je souhaite distribuer des fichiers binaires, mais il est difficile de distribuer l'ensemble du code source. Et si je donnais aux utilisateurs les diff&eacute;rences par rapport &agrave; la version &laquo;&nbsp;standard&nbsp;&raquo; en m&ecirc;me temps que les binaires&nbsp;?</a>

source: <a href="#AnonFTPAndSendSources">Can I make binaries available on a network server, but send sources only to people who order them?</a>
fr: <a href="#AnonFTPAndSendSources">Puis-je rendre disponible sur un serveur r&eacute;seau les fichiers binaires, mais envoyer les sources seulement &agrave; ceux qui en font la demande&nbsp;?</a>

source: <a href="#HowCanIMakeSureEachDownloadGetsSource">How can I make sure each user who downloads the binaries also gets the source?</a>
fr: <a href="#HowCanIMakeSureEachDownloadGetsSource">Comment puis-je m'assurer que tout utilisateur qui t&eacute;l&eacute;charge les fichiers binaires obtient &eacute;galement le code source&nbsp;?</a>

source: <a href="#ReleaseNotOriginal">Can I release a program with a license which says that you can distribute modified versions of it under the GPL but you can't distribute the original itself under the GPL?</a>
fr: <a href="#ReleaseNotOriginal">Puis-je publier un programme avec une licence stipulant que vous pouvez redistribuer des versions modifi&eacute;es de celui-ci sous la GPL mais pas l'original lui-m&ecirc;me sous GPL&nbsp;?</a>

source: <a href="#CompanyGPLCostsMoney">I just found out that a company has a copy of a GPL'ed program, and it costs money to get it. Aren't they violating the GPL by not making it available on the Internet?</a>
fr: <a href="#CompanyGPLCostsMoney">Je viens de d&eacute;couvrir qu'une compagnie a une copie d'un programme sous GPL, et qu'il faut payer pour l'obtenir. Ne violent-ils pas la GPL en ne la rendant pas disponible sur Internet&nbsp;?</a>

source: <a href="#UnreleasedMods">A company is running a modified version of a GPL'ed program on a web site. Does the GPL say they must release their modified sources?</a>
fr: <a href="#UnreleasedMods">Une soci&eacute;t&eacute; utilise une version modifi&eacute;e d'un programme sous GPL sur son site Web. La GPL dit-elle qu'elle doit publier les sources modifi&eacute;es&nbsp;?</a>

source: <a href="#InternalDistribution">Is use within one organization or company &ldquo;distribution&rdquo;?</a>
fr: <a href="#InternalDistribution">Est-ce que l'utilisation &agrave; l'int&eacute;rieur d'une organisation ou d'une soci&eacute;t&eacute; est une &laquo;&nbsp;distribution&nbsp;&raquo;?</a>

source: <a href="#StolenCopy">If someone steals a CD containing a version of a GPL-covered program, does the GPL give him the right to redistribute that version?</a>
fr: <a href="#StolenCopy">Si quelqu'un vole un CD contenant une version d'un programme sous GPL, La GPL lui donne t-elle le droit de redistribuer cette version&nbsp;?</a>

source: <a href="#TradeSecretRelease">What if a company distributes a copy as a trade secret?</a>
fr: <a href="#TradeSecretRelease">Et si une soci&eacute;t&eacute; distribuait une copie sous couvert du secret commercial&nbsp;?</a>

source: <a href="#GPLFairUse">Do I have &ldquo;fair use&rdquo; rights in using the source code of a GPL-covered program?</a>
fr: <a href="#GPLFairUse">Ai-je des droits de <i>&laquo;&nbsp;fair use&nbsp;&raquo;</i> pour l'utilisation du code source d'un programme couvert par la GPL&nbsp;?</a>

source: <a href="#DistributeSubsidiary">Does moving a copy to a majority-owned, and controlled, subsidiary constitute distribution?</a>
fr: <a href="#DistributeSubsidiary">Est-ce que d&eacute;placer une copie vers une filiale contr&ocirc;l&eacute;e majoritairement constitue une distribution&nbsp;?</a>

source: <a href="#ClickThrough">Can software installers ask people to click to agree to the GPL? If I get some software under the GPL, do I have to agree to anything?</a>
fr: <a href="#ClickThrough">Est-ce que des installeurs de logiciels peuvent demander aux gens de cliquer pour accepter la GPL&nbsp;? Si j'obtiens un logiciel sous GPL, dois-je tout accepter quoi&nbsp;?</a>

source: <a href="#GPLCompatInstaller">I would like to bundle GPLed software with some sort of installation software. Does that installer need to have a GPL-compatible license?</a>
fr: <a href="#GPLCompatInstaller">Je voudrais fournir un logiciel sous GPL avec un installeur. Cet installeur doit-il &ecirc;tre compatible avec la licence GPL&nbsp;?</a>

source: <a href="#v3Under4and5">The beginning of GPLv3 section 6 says that I can convey a covered work in object code form &ldquo;under the terms of sections 4 and 5&rdquo; provided I also meet the conditions of section 6. What does that mean?</a>
fr: <a href="#v3Under4and5">Le d&eacute;but de la section 6 de la GPLv3 dit que je peux transmettre un travail couvert sous forme d'objet de code &laquo;&nbsp;selon les termes des sections 4 et 5&nbsp;&raquo; pourvu que je respecte aussi les conditions de la section 6. Que cela signifie-t-il&nbsp;?</a>

source: <a href="#v2OrLaterPatentLicense">My company owns a lot of patents. Over the years we've contributed code to projects under &ldquo;GPL version 2 or any later version&rdquo;, and the project itself has been distributed under the same terms. If a user decides to take the project's code (incorporating my contributions) under GPLv3, does that mean I've automatically granted GPLv3's explicit patent license to that user?</a>
fr: <a href="#v2OrLaterPatentLicense">Ma soci&eacute;t&eacute; d&eacute;tient beaucoup de brevets. Au fil des ann&eacute;es, nous avons contribu&eacute; au code de projets sous &laquo;&nbsp;GPL version 2 ou versions ult&eacute;rieures&nbsp;&raquo;, et le projet lui-m&ecirc;me a &eacute;t&eacute; distribu&eacute; sous les m&ecirc;mes termes. Si un utilisateur d&eacute;cide de mettre le code du projet (incorporant mes contributions) sous GPLv3, cela signifie-t-il que j'ai automatiquement autoris&eacute; une licence de brevet GPLv3 explicite &agrave; cet utilisateur&nbsp;?</a>

source: <a href="#v3ConditionalWarranty">If I distribute a GPLv3-covered program, can I provide a warranty that is voided if the user modifies the program?</a>
fr: <a href="#v3ConditionalWarranty">Si je distribue une programme couvert par la GPLv3, puis-je fournir une garantie nulle si l'utilisateur modifie le programme&nbsp;?</a>

source: <a href="#v3CoworkerConveying">If I give a copy of a GPLv3-covered program to a coworker at my company, have I &ldquo;conveyed&rdquo; the copy to him?</a>
fr: <a href="#v3CoworkerConveying">Si je donne une copie d'un programme couvert par la GPLv3 &agrave; un coll&egrave;gue dans ma soci&eacute;t&eacute;, lui ai-je &laquo;&nbsp;transmis&nbsp;&raquo; la copie&nbsp;?</a>

source: <a href="#SourceInCVS">Am I complying with GPLv3 if I offer binaries on an FTP server and sources by way of a link to a source code repository in a version control system, like CVS or Subversion?</a>
fr: <a href="#SourceInCVS">Suis-je en accord avec la GPLv3 si je propose des binaires sur un serveur FTP et les sources par le biais d'un lien vers un r&eacute;f&eacute;rentiel de code source dans un syst&egrave;me de contr&ocirc;le de versions, tels que CVS ou Subversion&nbsp;?</a>

source: <a href="#RemoteAttestation">Can someone who conveys GPLv3-covered software in a User Product use remote attestation to prevent a user from modifying that software?</a>
fr: <a href="#RemoteAttestation">Quelqu'un qui transmet un logiciel couvert par la GPLv3 dans un produit utilisateur peut-il utiliser une attestation &agrave; distance pour emp&ecirc;cher un utilisateur de modifier ce logiciel&nbsp;?</a>

source: <a href="#RulesProtocols">What does &ldquo;rules and protocols for communication across the network&rdquo; mean in GPLv3?</a>
fr: <a href="#RulesProtocols">Que signifie &laquo;&nbsp;rules and protocols for communication across the network&nbsp;&raquo; (r&egrave;gles et protocoles pour la communication sur le r&eacute;seau) dans la GPLv3&nbsp;?</a>

source: <a href="#SupportService">Distributors that provide Installation Information under GPLv3 are not required to provide &ldquo;support service&rdquo; for the product. What kind of &ldquo;support service&rdquo; do you mean?</a>
fr: <a href="#SupportService">Les distributeurs qui fournissent une information d'installation sous GPLv3 ne sont pas tenus de fournir un &laquo;&nbsp;service de support&nbsp;&raquo; pour le produit. Quelle sorte de &laquo;&nbsp;service de support&nbsp;&raquo; entendez-vous&nbsp;?</a>

source: Using programs released under the GNU licenses when writing other programs
fr: Utiliser des programmes sous licences GNU pour &eacute;crire d'autres programmes

source: <a href="#CanIUseGPLToolsForNF">Can I use GPL-covered editors such as GNU Emacs to develop non-free programs? Can I use GPL-covered tools such as GCC to compile them?</a>
fr: <a href="#CanIUseGPLToolsForNF">Puis-je utiliser des &eacute;diteurs sous GPL pour d&eacute;velopper des programmes non-libres&nbsp;? Puis-je utiliser des outils sous GPL pour les compiler&nbsp;?</a>

source: <a href="#WhatCaseIsOutputGPL">In what cases is the output of a GPL program covered by the GPL too?</a>
fr: <a href="#WhatCaseIsOutputGPL">Dans quels cas le r&eacute;sultat produit par un programme sous GPL est-il &eacute;galement couvert par la GPL&nbsp;?</a>

source: <a href="#PortProgramToGL">If I port my program to GNU/Linux, does that mean I have to release it as free software under the GPL or some other free software license?</a>
fr: <a href="#PortProgramToGL">Si je fais un portage de mon programme vers GNU/Linux, est-ce que cela signifie que je doive le diffuser en tant que Logiciel Libre plac&eacute; sous la GPL ou une autre licence de Logiciel Libre&nbsp;?</a>

source: <a href="#GPLInProprietarySystem">I'd like to incorporate GPL-covered software in my proprietary system. Can I do this?</a>
fr: <a href="#GPLInProprietarySystem">J'aimerais incorporer un logiciel sous GPL dans mon syst&egrave;me propri&eacute;taire. Est-ce possible&nbsp;?</a>

source: <a href="#LGPLv3ContributorVersion">If I distribute a proprietary program that links against an LGPLv3-covered library that I've modified, what is the &ldquo;contributor version&rdquo; for purposes of determining the scope of the explicit patent license grant I'm making&mdash;is it just the library, or is it the whole combination?</a>
fr: <a href="#LGPLv3ContributorVersion">Si je distribue un programme propri&eacute;taire qui est li&eacute; &agrave; une biblioth&egrave;que couverte par la LGPLv3 que j'ai modifi&eacute;e, quelle est la &laquo;&nbsp;version du contributeur&nbsp;&raquo; pour d&eacute;terminer l'&eacute;tendue de l'autorisation de licence de brevet explicite que je donne&nbsp;; s'agit-il seulement de la biblioth&egrave;que ou de la combinaison compl&egrave;te&nbsp;?</a>

source: <a href="#AGPLv3CorrespondingSource">Under AGPLv3, when I modify the Program under section 13, what Corresponding Source does it have to offer?</a>
fr: <a href="#AGPLv3CorrespondingSource">Sous l'AGPLv3, quand je modifie le programme sous la section 13, quelle source correspondante doit-il offrir&nbsp;?</a>

source: Combining work with code released under the GNU licenses
fr: Combiner une &oelig;uvre avec du code sous licences GNU

source: <a href="#v2v3Compatibility">Is GPLv3 compatible with GPLv2?</a>
fr: <a name="v2v3Compatibility">La GPLv3 est-elle compatible avec la GPLv2&nbsp;?</a>

source: <a href="#AllCompatibility">How are the various GNU licenses compatible with each other?</a>
fr: <a href="#AllCompatibility">Quelles sont les compatibilités des différentes licences GNU entre elles&nbsp;?</a>

source: <a href="#IfLibraryIsGPL">If a library is released under the GPL (not the LGPL), does that mean that any program which uses it has to be under the GPL or a GPL-compatible license?</a>
fr: <a href="#IfLibraryIsGPL">Si une biblioth&egrave;que est distribu&eacute;e sous GPL (et non sous LGPL), cela signifie-t-il que n'importe quel programme qui l'utilise doit &ecirc;tre sous GPL ou sous une licence compatible avec la GPL&nbsp;?</a>

source: <a href="#LinkingWithGPL">You have a GPL'ed program that I'd like to link with my code to build a proprietary program. Does the fact that I link with your program mean I have to GPL my program?</a>
fr: <a href="#LinkingWithGPL">Vous avez mis sous GPL un programme que j'aimerais lier &agrave; mon code pour fabriquer un programme propri&eacute;taire. Le fait que je fasse une &eacute;dition de liens avec votre programme implique-t-il que je doive mettre mon programme sous GPL&nbsp;?</a>

source: <a href="#SwitchToLGPL">If so, is there any chance I could get a license of your program under the Lesser GPL?</a>
fr: <a href="#SwitchToLGPL">Si oui, ai-je une chance d'obtenir une licence de votre programme sous la GPL amoindrie (<i>Lesser GPL</i>)&nbsp;?</a>

source: <a href="#WillYouMakeAnException">Using a certain GNU program under the GPL does not fit our project to make proprietary software. Will you make an exception for us? It would mean more users of that program.</a>
fr: <a href="#WillYouMakeAnException">L'utilisation d'un certain programme GNU plac&eacute; sous GPL ne cadre pas avec notre projet de r&eacute;alisation d'un logiciel propri&eacute;taire. Pourriez-vous faire une exception pour nous? Cela augmenterait le nombre d'utilisateurs de ce programme.</a>

source: <a href="#IfInterpreterIsGPL">If a programming language interpreter is released under the GPL, does that mean programs written to be interpreted by it must be under GPL-compatible licenses?</a>
fr: <a href="#IfInterpreterIsGPL">Si un interpr&eacute;teur d'un langage de programmation est diffus&eacute; sous GPL, est-ce que cela signifie que les programmes &eacute;crits pour &ecirc;tre interpr&eacute;t&eacute;s par celui-ci doivent &ecirc;tre plac&eacute;s sous des licences compatibles avec la GPL&nbsp;?</a>

source: <a href="#InterpreterIncompat">If a programming language interpreter has a license that is incompatible with the GPL, can I run GPL-covered programs on it?</a>
fr: <a href="#InterpreterIncompat">Si un interpr&eacute;teur de langage de programmation a une licence qui est incompatible avec la GPL, puis-je l'utiliser pour faire tourner des programmes plac&eacute;s sous GPL&nbsp;?</a>

source: <a href="#GPLModuleLicense">If I add a module to a GPL-covered program, do I have to use the GPL as the license for my module?</a>
fr: <a href="#GPLModuleLicense">Si j'ajoute un module &agrave; un module couvert par la GPL, dois-je utiliser la GPL comme licence pour mon module&nbsp;?</a>

source: <a href="#GPLAndPlugins">If a program released under the GPL uses plug-ins, what are the requirements for the licenses of a plug-in?</a>
fr: <a href="#GPLAndPlugins">Si un programme distribu&eacute; sous GPL utilise des plug-ins, quelles sont les contraintes portant sur les licences d'un plug-in&nbsp;?</a>

source: <a href="#GPLPluginsInNF">Can I apply the GPL when writing a plug-in for a non-free program?</a>
fr: <a href="#GPLPluginsInNF">Puis-je utiliser la GPL pour un plug-in dans un programme non-libre&nbsp;?</a>

source: <a href="#NFUseGPLPlugins">Can I release a non-free program that's designed to load a GPL-covered plug-in?</a>
fr: <a href="#NFUseGPLPlugins">Puis-je faire un programme non-libre con&ccedil;u pour charger un plugin couvert par la GPL&nbsp;?</a>

source: <a href="#GPLWrapper">I'd like to incorporate GPL-covered software in my proprietary system. Can I do this by putting a &ldquo;wrapper&rdquo; module, under a GPL-compatible lax permissive license (such as the X11 license) in between the GPL-covered part and the proprietary part?</a>
fr: <a href="#GPLWrapper">J'aimerais incorporer un logiciel couvert par la GPL dans mon syst&egrave;me propri&eacute;taire. Puis-je le faire en ajoutant un module &laquo;&nbsp;enveloppant&nbsp;&raquo;, sous une licence permissive compatible avec la GPL (de type licence X 11) entre la partie couverte par la GPL et la partie propri&eacute;taire&nbsp;?</a>

source: <a href="#FSWithNFLibs">Can I write free software that uses non-free libraries?</a>
fr: <a href="#FSWithNFLibs">Puis-je &eacute;crire un logiciel libre qui utilise des biblioth&egrave;ques non-libres&nbsp;?</a>

source: <a href="#GPLIncompatibleLibs">What legal issues come up if I use GPL-incompatible libraries with GPL software?</a>
fr: <a href="#GPLIncompatibleLibs">J'&eacute;cris du logiciel libre qui utilise des biblioth&egrave;ques non-libres. Quels probl&egrave;mes l&eacute;gaux surviennent si j'utilise la GPL&nbsp;?</a>

source: <a href="#WindowsRuntimeAndGPL">I'm writing a Windows application with Microsoft Visual C++ and I will be releasing it under the GPL. Is dynamically linking my program with the Visual C++ run-time library permitted under the GPL?</a>
fr: <a href="#WindowsRuntimeAndGPL">J'&eacute;cris une application Windows avec Microsoft Visual C++ et je pr&eacute;vois de la diffuser sous GPL. Est-il permis par ma GPL de lier mon programme dynamiquement avec la biblioth&egrave;que de run-time de Visual C++&nbsp;?</a>

source: <a href="#MoneyGuzzlerInc">I'd like to modify GPL-covered programs and link them with the portability libraries from Money Guzzler Inc. I cannot distribute the source code for these libraries, so any user who wanted to change these versions would have to obtain those libraries separately. Why doesn't the GPL permit this?</a>
fr: <a href="#MoneyGuzzlerInc">J'aimerais modifier des programmes plac&eacute;s sous GPL et les lier avec les biblioth&egrave;ques de portage de Pompe A Fric, S.A. Je ne peux pas distribuer le code source de ces biblioth&egrave;ques, aussi tout utilisateur voulant modifier ces versions devrait acheter ces biblioth&egrave;ques. Pourquoi la GPL ne le permet-elle pas&nbsp;?</a>

source: <a href="#GPLIncompatibleAlone">If license for a module Q has a requirement that's incompatible with the GPL, but the requirement applies only when Q is distributed by itself, not when Q is included in a larger program, does that make the license GPL-compatible? Can I combine or link Q with a GPL-covered program?</a>
fr: <a href="#GPLIncompatibleAlone">Si la licence pour un module Q requiert une condition incompatible avec la GPL, mais que cette condition ne s'applique seulement lorsque Q est distribu&eacute; seul, et non lorsqu'il est distribu&eacute; dans un plus grand programme, est-ce compatible avec la licence GPL&nbsp;? Puis-je combiner ou lier Q avec un programme couvert par la GPL&nbsp;?</a>

source: <a href="#OOPLang">In an object-oriented language such as Java, if I use a class that is GPL'ed without modifying, and subclass it, in what way does the GPL affect the larger program?</a>
fr: <a href="#OOPLang">Dans un langage orient&eacute;-objet comme Java, si j'utilise une classe qui est sous GPL sans la modifier et que j'en h&eacute;rite, dans quelle mesure la GPL affecte-t-elle le programme r&eacute;sultant&nbsp;?</a>

source: <a href="#LinkingOverControlledInterface">How can I allow linking of proprietary modules with my GPL-covered library under a controlled interface only?</a>
fr: <a href="#LinkingOverControlledInterface">Comment puis-je autoriser de lier des modules propri&eacute;taires avec ma biblioth&egrave;que sous GPL uniquement dans une interface contr&ocirc;l&eacute;e&nbsp;?</a>

source: <a href="#Consider">Consider this situation: 1) X releases V1 of a project under the GPL. 2) Y contributes to the development of V2 with changes and new code based on V1. 3) X wants to convert V2 to a non-GPL license. Does X need Y's permission?</a>
fr: <a href="#Consider">Consid&eacute;rez la situation suivante&nbsp;: 1) X distribue la version V1 d'un projet sous GPL. 2) Y contribue au d&eacute;veloppement de la version V2 avec des modifications et des ajouts au code bas&eacute;s sur V1. 3) X veut convertir la version V2 vers une licence autre que GPL. X a-t-il besoin de la permission de Y&nbsp;?</a>

source: <a href="#ManyDifferentLicenses">I have written an application that links with many different components, that have different licenses. I am very confused as to what licensing requirements are placed on my program. Can you please tell me what licenses I may use?</a>
fr: <a href="#ManyDifferentLicenses">J'ai &eacute;crit une application qui se lie avec de nombreux composants diff&eacute;rents, qui sont couverts par diff&eacute;rentes licences. Je ne comprends vraiment pas bien quelles clauses des licences s'appliquent &agrave; mon programme. Pourriez-vous m'expliquer quelle licences je peux utiliser&nbsp;?</a>

source: <a href="#SourceCodeInDocumentation">Can I use snippets of GPL-covered source code within documentation that is licensed under some license that is incompatible with the GPL?</a>
fr: <a href="#SourceCodeInDocumentation">Puis-je utiliser des snippets de code source couvert par la GPL dans de la documentation qui est sous une licence incompatible avec la GPL&nbsp;?</a>

source: Questions about violations of the GNU licenses
fr: Questions sur les violations des licences GNU

source: <a href="#ReportingViolation">What should I do if I discover a possible violation of the GPL?</a>
fr: <a href="#ReportingViolation">Que devrais-je faire si je d&eacute;couvre une violation potentielle de la GPL ?</a>
