Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-howto.*.po
Languages: fr

source: How to use GNU licenses for your own software - GNU Project - Free Software Foundation (FSF)
fr: Comment utiliser les licences GNU pour vos logiciels&nbsp;? - GNU Project - Free Software Foundation (FSF)

source: How to use GNU licenses for your own software
fr: Comment utiliser les licences GNU pour vos logiciels&nbsp;?

source: This is a brief explanation of how to place a program under the <a href="/licenses/gpl.html">GNU General Public License</a>, <a href="/licenses/lgpl.html">Lesser General Public License</a>, or <a href="/licenses/agpl.html">Affero General Public License</a>. For the <a href="/licenses/fdl.html">GNU Free Documentation License</a>, we have a <a href="/licenses/fdl-howto.html">separate page</a>.
fr: Voici une br&egrave;ve explication sur la mani&egrave;re de placer un programme sous la <a href="/licenses/gpl.html">Licence Publique G&eacute;n&eacute;rale GNU</a> (GNU General Publique License), la <a href="/licenses/lgpl.html">Licence Publique G&eacute;n&eacute;rale Amoindrie (Lesser General Publique License)</a> ou la <a href="/licenses/agpl.html">Licence Publique G&eacute;n&eacute;rale Affero (Affero General Publique License)</a>. Pour la <a href="/licenses/fdl.html">Licence de documentation libre GNU (GNU Free Documentation License)</a>, nous avons une <a href="/licenses/fdl-howto.fr.html">page séparée</a>.

source: If you are looking for more detailed information, consider perusing our list of <a href="/licenses/gpl-faq.html">frequently asked questions about our licenses</a>.
fr: Si vous recherchez une information d&eacute;taill&eacute;e, lisez attentivement notre liste <a href="/licenses/gpl-faq.fr.html">questions fr&eacute;quentes concernant la Licence Publique G&eacute;n&eacute;rale de GNU</a>.

source: If you are considering using the GNU Lesser General Public License, please read the article &ldquo;<a href="/licenses/why-not-lgpl.html">Why you shouldn't use the LGPL for your next library</a>&rdquo; first. The article explains why it may be better to use the ordinary GPL instead, and how we would make the decision.
fr: Si vous &ecirc;tes sur le point d'utiliser la Licence Publique G&eacute;n&eacute;rale Amoindrie, veuillez auparavant lire l'article <a href="/licenses/why-not-lgpl.fr.html">&laquo;Pourquoi vous ne devriez pas utiliser la LGPL pour votre prochaine biblioth&egrave;que&raquo;</a>. Cet article explique pourquoi il serait peut-&ecirc;tre mieux d'utiliser plut&ocirc;t la GPL ordinaire et sur quoi repose cette d&eacute;cision.

source: Whichever license you plan to use, the process involves adding two elements to each source file of your program: a copyright notice (such as &ldquo;Copyright 1999 Terry Jones&rdquo;), and a statement of copying permission, saying that the program is distributed under the terms of the GNU General Public License (or the Lesser GPL).
fr: Qu'importe la licence que vous aurez choisie, la proc&eacute;dure comprend l'addition de deux &eacute;l&eacute;ments dans chaque fichier source&nbsp;: une notice de copyright (telle que &laquo;Copyright 1999 Marie Dupont&raquo;) et une d&eacute;claration sur les droits de copie pr&eacute;cisant que le programme est distribu&eacute; sous les termes de la Licence Publique G&eacute;n&eacute;rale GNU (ou la GPL amoindrie).

source: The copyright notice should include the year in which you finished preparing the release (so if you finished it in 1998 but didn't post it until 1999, use 1998). You should add the proper year for each release; for example, &ldquo;Copyright 1998, 1999 Terry Jones&rdquo; if some versions were finished in 1998 and some were finished in 1999. If several people helped write the code, use all their names.
fr: La notice de copyright doit inclure l'ann&eacute;e pendant laquelle vous avez termin&eacute; de pr&eacute;parer la version (donc, si vous l'avez termin&eacute; en 1998 mais que vous ne l'avez pas publi&eacute; avant 1999, utilisez 1998). Vous devez ajouter la bonne ann&eacute;e pour chaque version&nbsp;: par exemple, &laquo;Copyright 1998, 1999 Marie Dupont&raquo; si certaines versions ont &eacute;t&eacute; termin&eacute;es en 1998 et d'autres en 1999. Si plusieurs personnes ont aid&eacute; &agrave; &eacute;crire le code, utilisez le nom de chacune d'elle.

source: Always use the English word &ldquo;Copyright&rdquo;; by international convention, this is used worldwide, even for material in other languages. The copyright symbol &ldquo;&copy;&rdquo; can be included if you wish (and your character set supports it), but it's not necessary. There is no legal significance to using the three-character sequence &ldquo;(C)&rdquo;, although it does no harm.
fr: Utilisez toujours le mot anglais &laquo;Copyright&raquo;; par convention internationale. Ce terme est utilis&eacute; partout dans le monde, m&ecirc;me pour des travaux dans d'autres langues. Le symbole du copyright &laquo;&copy;&raquo; peut &ecirc;tre ajout&eacute; si vous le souhaitez (et que votre jeu de caract&egrave;res le g&egrave;re), mais il n'est pas n&eacute;cessaire. Il n'y a aucune signification l&eacute;gale dans l'utilisation de la s&eacute;quence de trois caract&egrave;res &laquo;(C)&raquo;, bien que cela ne g&ecirc;ne pas.

source: You should also include a copy of the license itself somewhere in the distribution of your program. All programs, whether they are released under the GPL or LGPL, should include <a href="/licenses/gpl.txt">the text version of the GPL</a>. In GNU programs the license is usually in a file called COPYING.
fr: Vous devriez aussi inclure une copie de la licence en question quelque part dans la distribution de votre programme. Tous les programmes, qu'ils soient publi&eacute;s sous GPL ou LGPL, doivent inclure <a href="/licenses/gpl.txt">la version texte de la GPL</a>. Dans les programmes GNU, la licence se trouve habituellement dans un fichier intitul&eacute; COPYING.

source: If you are releasing your program under the LGPL, you should also include <a href="/licenses/lgpl.txt">the text version of the LGPL</a>, usually in a file called COPYING.LESSER. Please note that, since the LGPL is a set of additional permissions on top of the GPL, it's important to include both licenses so users have all the materials they need to understand their rights.
fr: Si vous publiez un programme sous la LGPL, vous devez aussi inclure <a href="/licenses/lgpl.txt">la version texte de la LGPL</a>, habituellement dans un fichier intitul&eacute; COPYING.LESSER. Veuillez noter que, puisque la LGPL est un ensemble de permissions additionnelles &agrave; la GPL, il est important d'inclure les deux licences de sorte que les utilisateurs aient toutes les informations n&eacute;cessaires pour comprendre leurs droits.

source: If you are releasing your program under the GNU AGPL, you only need to include <a href="/licenses/agpl.txt">the text version of the GNU AGPL</a>.
fr: Si vous avez publi&eacute; votre programme sous la GNU AGPL, vous devez seulement inclure <a href="/licenses/agpl.txt">la version texte de la GNU AGPL</a>.<br />NdT&nbsp;: &Agrave; l'heure actuelle, les avocats de la Fondation pour le Logiciel Libre n'ont pas encore d&eacute;clar&eacute; de version fran&ccedil;aise officielle de cette licence. Les programmeurs francophones devraient donc toujours utiliser la version anglaise. Cela ne devrait pas poser de probl&egrave;me quant &agrave; sa validit&eacute;. Dans le doute, consulter un avocat.

source: If you have copied code from other programs covered by the same license, copy their copyright notices too. Put all the copyright notices together, right near the top of each file.
fr: Si vous avez copi&eacute; du code d'autres programmes couverts par la m&ecirc;me licence, copiez aussi leur notice de copyright. Rassemblez toutes les notices de copyright au d&eacute;but de chaque fichier.

source: It is very important for practical reasons to include contact information for how to reach you, perhaps in the README file, but this has nothing to do with the legal issues of applying the license.
fr: Il est tr&egrave;s important pour des raisons pratiques d'inclure des informations de contact pour indiquer le moyen de vous joindre. Le mieux &eacute;tant probablement de les &eacute;crire dans le fichier README. Mais cela n'a rien &agrave; voir avec les questions l&eacute;gales entourant la mise sous licence.

source: The copying permission statement should come right after the copyright notices. For a one-file program, the statement (for the GPL) should look like this:
fr: La d&eacute;claration de permission de copie devrait &ecirc;tre indiqu&eacute;e juste apr&egrave;s les notices de copyright. Pour un programme ne comprenant qu'un seul fichier la d&eacute;claration devrait ressembler (pour la GPL) &agrave;&nbsp;:

source: For programs that are more than one file, it is better to replace &ldquo;this program&rdquo; with the name of the program, and begin the statement with a line saying &ldquo;This file is part of NAME&rdquo;. For instance,
fr: Pour les programmes incluant plusieurs fichiers, il est mieux de remplacer &laquo;&nbsp;ce programme&nbsp;&raquo; par le nom r&eacute;el du programme et de d&eacute;buter la d&eacute;claration par une ligne indiquant &laquo;&nbsp;This file is part of NAME&nbsp;&raquo;. Par exemple&nbsp;:

source: This statement should go near the beginning of every source file, close to the copyright notices. When using the Lesser GPL, insert the word &ldquo;Lesser&rdquo; before &ldquo;General&rdquo; in <em>all three</em> places. When using the GNU AGPL, insert the word &ldquo;Affero&rdquo; before &ldquo;General&rdquo; in <em>all three</em> places.
fr: Cette d&eacute;claration devrait &ecirc;tre plac&eacute;e au d&eacute;but de chaque fichier source, proche des notices de copyright. Pour utiliser la GPL amoindrie, ins&eacute;rez le mot &laquo;&nbsp;Lesser&nbsp;&raquo; avant &laquo;&nbsp;General&nbsp;&raquo; <em>aux trois</em> endroits. Pour utiliser la GNU AGPL, ins&eacute;rez le mot &laquo;&nbsp;Affero&nbsp;&raquo; avant &laquo;&nbsp;General&nbsp;&raquo; aux <em>trois</em> endroits.

source: For interactive programs, it is usually a good idea to make the program print out a brief notice about copyright and copying permission when it starts up. See <a href="/licenses/gpl-3.0.html#howto">the end of the GNU GPL</a> for more information about this.
fr: Pour les programmes interactifs, il est de bon aloi que le programme affiche une br&egrave;ve notice &agrave; propos du copyright et des permissions de copie lorsqu'il d&eacute;marre. Consulter <a href="/licenses/gpl-3.0.html#howto">la fin de la GPL</a> pour plus d'informations &agrave; ce sujet.

source: If you are releasing your program under the GNU AGPL, and it can interact with users over a network, the program should offer its source to those users in some way. For example, if your program is a web application, its interface could display a &ldquo;Source&rdquo; link that leads users to an archive of the code. The GNU AGPL is flexible enough that you can choose a method that's suitable for your specific program&mdash;see section 13 for details.
fr: Si vous publiez votre programme sous la GNU AGPL, et qu'il peut interagir avec les utilisateurs sur un r&eacute;seau, le programme doit leur offrir son code source d'une fa&ccedil;on ou d'une autre. Par exemple, si votre programme est une application Web, son interface pourrait afficher un lien &laquo;&nbsp;Source&nbsp;&raquo; qui m&eacute;nerait les utilisateurs vers une archive du code. La GNU AGPL est suffisamment flexible pour que vous choisissiez une m&eacute;thode qui convienne &agrave; votre programme sp&eacute;cifique (consulter la section 13 pour des d&eacute;tails).

source: There is no legal requirement to register your copyright with anyone; simply distributing the program makes it copyrighted. However, it is a very good idea to register the copyright with the US Registry of Copyrights, because that puts you in a stronger position against anyone who violates the license in the US. Most other countries have no system of copyright registration.
fr: Il n'est pas n&eacute;cessaire au niveau l&eacute;gal d'enregistrer votre copyright o&ugrave; que ce soit; le fait-m&ecirc;me de distribuer votre programme constitue une mise sous copyright. Toutefois, c'est une excellente id&eacute;e que d'enregistrer le copyright avec le Registre des Copyrights des &Eacute;tats-Unis car cela vous met en meilleure position pour vous d&eacute;fendre contre quiconque violerait la licence aux &Eacute;tats-Unis. La plupart des autres pays n'ont pas de syst&egrave;me d'enregistrement de copyright.

source: It's wise to ask your employer or school, if any, to sign a copyright disclaimer for the work, so they cannot claim to hold it later. Below is a sample copyright disclaimer; just alter the names and program description as appropriate:
fr: Il est sage de demander à votre employeur ou à votre école, le cas échéant, de signer un renoncement de droit d'auteur, de sorte qu'il ne puisse pas le revendiquer plus tard. Ci-dessous, un exemple de renoncement de droit d'auteur&nbsp;; remplacez seulement les noms et la description du programme&nbsp;:

source: Yoyodyne, Inc., hereby disclaims all copyright interest in the program &ldquo;Gnomovision&rdquo; (which makes passes at compilers) written by James Hacker.
fr: Yoyodyne, Inc., hereby disclaims all copyright interest in the program &ldquo;Gnomovision&rdquo; (which makes passes at compilers) written by James Hacker.<br />Traduction&nbsp;:<br />Yoyodyne, Inc., déclare par la présente renoncer à tout droit d'auteur sur le programme «&nbsp;Gnomovision&nbsp;» (qui fait des passages aux compilateurs) écrit par James Hacker.

source: We would like to list all free software programs in the Free Software Directory, including all programs licensed under the GPL (any version). Please see the <a href="http://directory.fsf.org/">Directory web page</a> for information and an online submission form.
fr: Nous aimerions lister tous les programmes logiciels libres dans le R&eacute;pertoire des logiciels libres (Free Software Directory), y compris tous les programmes sous licence GPL (toute version). Veuillez consulter la <a href="http://directory.fsf.org/">page Web du r&eacute;pertoire</a> pour des informations et un formulaire de soumission en ligne.

source: It is also possible to make your program a GNU package, a part of the GNU Project. (That's if we like the program&mdash;we have to look at it first, and decide.) If you might be interested in joining up with the GNU Project in this way, please see our <a href="/help/evaluation.html">GNU software evaluation page</a> for more information and a short questionnaire.
fr: Il est aussi possible de faire de votre programme un paquetage GNU, c'est-&agrave;-dire lui faire une place au sein du projet GNU. (Nous devons jeter un &oelig;il &agrave; votre programme auparavant et d&eacute;cider par la suite.) Si vous &eacute;tiez int&eacute;ress&eacute; &agrave; vous impliquer dans le projet GNU de cette mani&egrave;re, veuillez consulter notre <a href="/help/evaluation.html">page d'&eacute;valuation des logiciels GNU</a> pour plus d'informations et un court questionnaire.

source: But you are welcome to use any of our licenses even if your program is not a GNU package; indeed, we hope you will. They're available to everyone. If you'd like to advertise your use of a particular license, feel free to use <a href="/graphics/license-logos.html" title="GNU License Logos">one of our logos</a>.
fr: Notez que vous pouvez utiliser n'importe laquelle de nos licences m&ecirc;me si votre programme n'est pas un paquetage GNU&nbsp; elles sont disponibles pour tout le monde. Si vous voulez signaler l'utilisation d'une licence particuli&egrave;re, vous pouvez utiliser <a href="/graphics/license-logos.fr.html" title="Logos des licences">un de nos logos</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Wolfgang Sourdeau.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traduction de cette page
