Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-faq.*.po
Languages: fr

source: The only way to make sure that people who have copies of the program will continue to be able to see the license, despite all the changes that will happen in the network, is to include a copy of the license in the program.
fr: La seule fa&ccedil;on de s'assurer que les d&eacute;tenteurs de copies du programme pourront continuer &agrave; voir les licences, malgr&eacute; les changements qui appara&icirc;tront dans le r&eacute;seau, est d'inclure une copie de la licence dans le programme.

source: If a single program is that short, you may as well use a simple all-permissive license for it, rather than the GNU GPL.
fr: Si un programme est aussi court, vous pouvez aussi bien utiliser une licence sans restriction, plut&ocirc;t que la GNU GPL.

source: The preamble and instructions are integral parts of the GNU GPL and may not be omitted. In fact, the GPL is copyrighted, and its license permits only verbatim copying of the entire GPL. (You can use the legal terms to make <a href="#ModifyGPL">another license</a> but it won't be the GNU GPL.)
fr: Le pr&eacute;ambule et les instructions sont des portions int&eacute;grales de la GNU GPL et ne peuvent &ecirc;tre supprim&eacute;es. Lisez s'il vous pla&icirc;t l'ensemble de la GPL. En fait, la GPL est sous copyright, et sa licence permet seulement de la recopier telle-quelle dans son int&eacute;gralit&eacute;.

source: The preamble and instructions add up to some 1000 words, less than 1/5 of the GPL's total size. They will not make a substantial fractional change in the size of a software package unless the package itself is quite small. In that case, you may as well use a simple all-permissive license rather than the GNU GPL.
fr: Le pr&eacute;ambule et les instructions ajoutent environ 5000 caract&egrave;res, moins d'1/3 de la taille totale de la GPL. Ils ne constitueraient pas un changement substantiel de la taille d'un paquetage logiciel &agrave; moins que ce paquetage lui-m&ecirc;me soit vraiment petit. Dans ce cas, vous pourriez aussi bien utiliser une licence totalement permissive au lieu de la GNU GPL.

source: In order to combine two programs (or substantial parts of them) into a larger work, you need to have permission to use both programs in this way. If the two programs' licenses permit this, they are compatible. If there is no way to satisfy both licenses at once, they are incompatible.
fr: Pour combiner deux programmes (ou des parties substantielles de ceux-ci) dans un programme plus gros, vous devez avoir la permission d'utiliser les deux programmes de cette manière. Si les licences des deux programmes le permettent, elles sont compatibles. S'il n'y a pas de façon de satisfaire les deux licences en même temps, elles sont incompatibles.

source: For some licenses, the way in which the combination is made may affect whether they are compatible&mdash;for instance, they may allow linking two modules together, but not allow merging their code into one module.
fr: Pour certaines licences, la façon dont la combinaison est faite peut affecter leur compatibilité. Par exemple, elles peuvent autoriser de lier deux modules ensemble, mais ne pas autoriser de fusionner leurs codes dans un seul module.

source: If you just want to install two separate programs in the same system, it is not necessary that their licenses be compatible, because this does not combine them into a larger work.
fr: Si vous voulez seulement installer deux programmes distincts sur le même système, il n'est pas nécessaire que leurs licences soient compatibles, car cela ne les combine pas dans une œuvre plus grande.

source: It means that the other license and the GNU GPL are compatible; you can combine code released under the other license with code released under the GNU GPL in one larger program.
fr: Cela signifie que l'autre licence et la GNU GPL sont compatibles; vous pouvez combiner du code publi&eacute; sous l'autre licence avec du code publi&eacute; sous la GNU GPL dans un programme plus large.

source: All GNU GPL versions permit such combinations privately; they also permit distribution of such combinations provided the combination is released under the same GNU GPL version. The other license is compatible with the GPL if it permits this too.
fr: Toutes les versions de la licence GNU GPL autorise de telles combinaisons &agrave; tire personnel&nbsp;; elles autorisent la distribution de telles combinaisons &agrave; condition que la combinaison soit publi&eacute;e sous la m&ecirc;me version de GNU GPL. L'autre licence est compatible avec la GPL si elle permet cela aussi.

source: GPLv3 is compatible with more licenses than GPLv2: it allows you to make combinations with code that has specific kinds of additional requirements that are not in GPLv3 itself. Section 7 has more information about this, including the list of additional requirements that are permitted.
fr: La GPLv3 est compatible avec plus de licences que la GPLv2&nbsp;: elle permet de faire des combinaisons avec du code ayant des conditions supplémentaires qui ne sont pas dans la GPLv3 elle-même. La section 7 contient plus d'informations à ce sujet, incluant la liste des conditions supplémentaires qu'elle permet.

source: If you do this, your program won't be fully usable in a free environment. If your program depends on a non-free library to do a certain job, it cannot do that job in the Free World. If it depends on a non-free library to run at all, it cannot be part of a free operating system such as GNU; it is entirely off limits to the Free World.
fr: Si vous faites cela, votre programme ne sera pas totalement utilisable dans un environnement libre. Si votre programme d&eacute;pend d'une biblioth&egrave;que non-libre pour faire certaines actions, il ne pourra pas le faire dans le Monde libre. S'il d&eacute;pend d'une biblioth&egrave;que non-libre pour fonctionner, il ne pourra pas faire partie d'un syst&egrave;me d'exploitation libre tel que GNU; c'est totalement hors des limites du Monde libre.

source: So please consider: can you find a way to get the job done without using this library? Can you write a free replacement for that library?
fr: Aussi, veuillez consid&eacute;rer ceci&nbsp;: pouvez-vous trouver un moyen de r&eacute;aliser cette action sans utiliser cette biblioth&egrave;que&nbsp;? Pouvez-vous &eacute;crire une biblioth&egrave;que libre pour la remplacer&nbsp;?

source: If the program is already written using the non-free library, perhaps it is too late to change the decision. You may as well release the program as it stands, rather than not release it. But please mention in the README that the need for the non-free library is a drawback, and suggest the task of changing the program so that it does the same job without the non-free library. Please suggest that anyone who thinks of doing substantial further work on the program first free it from dependence on the non-free library.
fr: Si le programme est d&eacute;j&agrave; &eacute;crit en utilisant la biblioth&egrave;que non-libre, il est peut-&ecirc;tre d&eacute;j&agrave; trop tard pour changer de d&eacute;cision. Vous pouvez aussi publier le programme tel qu'il est plut&ocirc;t que de ne pas le publier. Mais veuillez mentionner dans le fichier README que la n&eacute;cessit&eacute; de la biblioth&egrave;qe non-libre est un inconv&eacute;nient, et sugg&eacute;rez de changer de programme pour qu'il puisse faire la m&ecirc;me chose sans la biblioth&egrave;que non-libre. Veuillez sugg&eacute;rez que quiconque pense faire un gros travail sur le programme, le lib&egrave;re d'abord de sa d&eacute;pendance &agrave; la biblioth&egrave;que non-libre.

source: Note that there may also be legal issues with combining certain non-free libraries with GPL-covered Free Software. Please see <a href="#GPLIncompatibleLibs">the question on GPL software with GPL-incompatible libraries</a> for more information.
fr: Notez &eacute;galement qu'il peut y avoir des probl&egrave;mes juridiques en combinant certaines biblioth&egrave;ques non-libres avec un logiciel libre couvert par la GPL. Veuillez consulter <a href="#GPLIncompatibleLibs">la question sur les logiciels sous GPL avec les biblioth&egrave;ques incompatibles avec la GPL</a> pour plus de renseignements.

source: Both versions of the GPL have an exception to their copyleft, commonly called the system library exception. If the GPL-incompatible libraries you want to use meet the criteria for a system library, then you don't have to do anything special to use them; the requirement to distribute source code for the whole program does not include those libraries, even if you distribute a linked executable containing them.
fr: Les versions de la GPL ont une exception à leur copyleft, communément appelée exception des bibliothèques système. Si les bibliothèques incompatibles avec la GPL que vous voulez utiliser répondent aux critères de bibliothèque système, vous n'avez alors rien de spécial à faire pour les utiliser&nbsp;; la condition de distribuer le code source de tout le programme n'inclut pas ces bibliothèques, même si vous distribuez un exécutable lié les contenant.

source: The criteria for what counts as a &quot;system library&quot; vary between different versions of the GPL. GPLv3 explicitly defines &quot;System Libraries&quot; in section 1, to exclude it from the definition of &quot;Corresponding Source.&quot; GPLv2 says the following, near the end of section 3:
fr: Les critères qui qualifient une &laquo;&nbsp;bibliothèque système&nbsp;&raquo; varient selon les différentes version de la GPL. La GPLv3 définit explicitement les &laquo;&nbsp;Bibliothèques système&nbsp;&raquo; dans la section 1, pour les exclure de la définition du &laquo;&nbsp;code source&nbsp;&raquo;. La GPLv2 dit la chose suivante, près de la fin de la section 3&nbsp;:

source: However, as a special exception, the source code distributed need not include anything that is normally distributed (in either source or binary form) with the major components (compiler, kernel, and so on) of the operating system on which the executable runs, unless that component itself accompanies the executable.
fr: However, as a special exception, the source code distributed need not include anything that is normally distributed (in either source or binary form) with the major components (compiler, kernel, and so on) of the operating system on which the executable runs, unless that component itself accompanies the executable. Traduction&nbsp;: Cependant, en tant qu'exception spéciale, le code source distribué n'a pas besoin d'inclure quoi que ce soit qui ne soit normalement distribué (sous forme de source ou de binaire) avec les composants majeurs (compilateur, noyau, etc.) du système d'exploitation sur lequel fonctionne l'exécutable, à moins que ce composant n'accompagne l'exécutable.

source: If you want your program to link against a library not covered by the system library exception, you need to provide permission to do that. Below are two example license notices that you can use to do that; one for GPLv3, and the other for GPLv2. In either case, you should put this text in each file to which you are granting this permission.
fr: Si vous voulez que votre programme soit lié à une bibliothèque non couverte par l'exception des bibliothèques système, vous devez fournir une autorisation pour faire cela. Vous trouverez ci-dessous deux exemples de notices de licence que vous pouvez utiliser pour faire cela&nbsp;; une pour la GPLv3, et l'autre pour la GPLv2. Dans les deux cas, vous devez mettre ce texte dans chaque fichier pour lesquels vous donnez cette autorisation.

source: Only the copyright holders for the program can legally release their software under these terms. If you wrote the whole program yourself, then assuming your employer or school does not claim the copyright, you are the copyright holder&mdash;so you can authorize the exception. But if you want to use parts of other GPL-covered programs by other authors in your code, you cannot authorize the exception for them. You have to get the approval of the copyright holders of those programs.
fr: Seuls les détenteurs du copyright du programme peuvent légalement publier leur logiciel sosu ces termes. Si vous avez écrit tout le programme vous-mêmes, et en supposant que votre employeur ou votre école ne revendique pas le copyright, vous êtes le détenteur du copyright&mdash;vous pouvez donc autoriser cette exception. Mais si vous voulez utiliser des parties de programmes sous GPL d'autres auteurs dans votre code, vous ne pouvez pas autoriser l'exception pour eux. vous devez obtenir l'accord des détenteurs du copyright de ces programmes.

source: When other people modify the program, they do not have to make the same exception for their code&mdash;it is their choice whether to do so.
fr: Quand d'autres personnes modifient le programme, elles n'ont pas besoin de faire la même exception pour leur code&mdash;il leur appartient de le faire ou pas.

source: If the libraries you intend to link with are non-free, please also see <a href="#FSWithNFLibs">the section on writing Free Software which uses non-free libraries</a>.
fr: Si les bibliothèques que vous projetez de lier ne sont pas libres, veuillez également consulter <a href="#FSWithNFLibs">la section sur l'écriture de logiciels libres qui utilisent des bibliothèques non-libres</a>.

source: If you're using GPLv3, you can accomplish this goal by granting an additional permission under section 7. The following license notice will do that. You must replace all the text in brackets with text that is appropriate for your program. If not everybody can distribute source for the libraries you intend to link with, you should remove the text in braces; otherwise, just remove the braces themselves.
fr: Si vous utilisez la GPLv3, vous pouvez accomplir ce but en donnant une permission supplémentaire sous la section 7. La notice de licence suivante fait cela. Vous devez remplacer tout le texte entre crochets avec le texte approprié pour votre programme.

source: Copyright (C) <var>[years]</var> <var>[name of copyright holder]</var>
fr: Copyright (C) <var>[years]</var> <var>[name of copyright holder]</var> Traduction&nbsp;: Copyright (C) <var>[années]</var> <var>[nom du détenteur du copyright]</var>

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version.
fr: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version. Traduction&nbsp;: Ce programme est un logiciel libre; vous pouvez le redistribuer et/ou le modifier selon les termes de la GNU General Public License (Licence Publique G&eacute;n&eacute;rale GNU) telle qu'elle a &eacute;t&eacute; publi&eacute;e par la Free Software Foundation; soit la version 3 de la licence, soit (comme vous le souhaitez) toute version ult&eacute;rieure.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
fr: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. Traduction&nbsp;: Ce programme est distribu&eacute; dans l'espoir qu'il sera utile, mais SANS LA MOINDRE GARANTIE; pas m&ecirc;me la garantie implicite de COMMERCIABILIT&eacute; ou d'AD&eacute;QUATION &agrave; UN BUT PARTICULIER. Voir la GNU General Public License pour plus de d&eacute;tails.

source: You should have received a copy of the GNU General Public License along with this program; if not, see &lt;http://www.gnu.org/licenses&gt;.
fr: You should have received a copy of the GNU General Public License along with this program; if not, see &lt;http://www.gnu.org/licenses&gt;. Traduction&nbsp;: Vous devriez avoir re&ccedil;u une copie de la GNU General Public License en m&ecirc;me temps que ce programme; si ce n'est pas le cas, consultez &lt;http://www.gnu.org/licenses&gt;.

source: Additional permission under GNU GPL version 3 section 7
fr: Permission supplémentaire de la GNU GPL version 3 section 7

source: If you modify this Program, or any covered work, by linking or combining it with <var>[name of library]</var> (or a modified version of that library), containing parts covered by the terms of <var>[name of library's license]</var>, the licensors of this Program grant you additional permission to convey the resulting work. {Corresponding Source for a non-source form of such a combination shall include the source code for the parts of <var>[name of library]</var> used as well as that of the covered work.}
fr: If you modify this Program, or any covered work, by linking or combining it with <var>[name of library]</var> (or a modified version of that library), containing parts covered by the terms of <var>[name of library's license]</var>, the licensors of this Program grant you additional permission to convey the resulting work. {Corresponding Source for a non-source form of such a combination shall include the source code for the parts of <var>[name of library]</var> used as well as that of the covered work.} Traduction&nbsp;: Si vous modifiez ce Programme, ou toute &oelig;uvre couverte, en le liant ou en le combinant avec <var>[nom de la bibliothèque]</var> (ou une version modifiée de cette bibliothèque), contenant des parties couvertes pares termes de <var>[nom de la licence de la bibliothèque]</var>, les licenceurs de ce Programme vous donne une permission supplémentaire de transmettre le travail résultant. {Le Source Correspondant pour une forme non-source d'une telle combinaison devra inclure le code source pour les parties de <var>[nom de la bibliothèque]</var> utilisées ainsi que celui de l'&oelig;uvre couverte}.

source: If you're using GPLv2, you can provide your own exception to the license's terms. The following license notice will do that. Again, you must replace all the text in brackets with text that is appropriate for your program. If not everybody can distribute source for the libraries you intend to link with, you should remove the text in braces; otherwise, just remove the braces themselves.
fr: Si vous utilisez la GPLv2, vous pouvez fournir votre propre exception aux termes de la licence. La notice de licence suivante fera cela. Là encore, vous devez remplacer tout le texte entre crochets avec le texte approprié pour votre programme. Si tout le monde ne peut pas distribuer le source pour les bibliothèques que vous voulez lier, vous devrez supprimer le texte entre accolades&nbsp;; sinon, enlevez juste les accolades.

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
fr: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. Traduction&nbsp;:Ce programme est un logiciel libre; vous pouvez le redistribuer et/ou le modifier selon les termes de la GNU General Public License (Licence Publique G&eacute;n&eacute;rale GNU) telle qu'elle a &eacute;t&eacute; publi&eacute;e par la Free Software Foundation; soit la version 2 de la licence, soit (comme vous le souhaitez) toute version ult&eacute;rieure.

source: Linking <var>[name of your program]</var> statically or dynamically with other modules is making a combined work based on <var>[name of your program]</var>. Thus, the terms and conditions of the GNU General Public License cover the whole combination.
fr: Linking <var>[name of your program]</var> statically or dynamically with other modules is making a combined work based on <var>[name of your program]</var>. Thus, the terms and conditions of the GNU General Public License cover the whole combination. Traduction&nbsp;: Lier <var>[nom de votre programme]</var> statiquement ou dynamiquement avec d'autres modules en fait une &oelig;uvre combin&eacute;e bas&eacute;e sur <var>[nom de votre programme]</var>. Par conséquent, les termes et conditions de la Licence publique g&eacute;n&eacute;rale GNU couvrent la totalit&eacute; de la combinaison.

source: In addition, as a special exception, the copyright holders of <var>[name of your program]</var> give you permission to combine <var>[name of your program]</var> with free software programs or libraries that are released under the GNU LGPL and with code included in the standard release of <var>[name of library]</var> under the <var>[name of library's license]</var> (or modified versions of such code, with unchanged license). You may copy and distribute such a system following the terms of the GNU GPL for <var>[name of your program]</var> and the licenses of the other code concerned{, provided that you include the source code of that other code when and as the GNU GPL requires distribution of source code}.
fr: In addition, as a special exception, the copyright holders of <var>[name of your program]</var> give you permission to combine <var>[name of your program]</var> with free software programs or libraries that are released under the GNU LGPL and with code included in the standard release of <var>[name of library]</var> under the <var>[name of library's license]</var> (or modified versions of such code, with unchanged license). You may copy and distribute such a system following the terms of the GNU GPL for <var>[name of your program]</var> and the licenses of the other code concerned{, provided that you include the source code of that other code when and as the GNU GPL requires distribution of source code}. Traduction&nbsp;: De plus, &agrave; titre exceptionnel, les d&eacute;tenteurs du copyright&gt; de <var>[nom de votre programme]</var> vous donne l'autorisation de combiner <var>[nom de votre programme]</var> avec des logiciels libres ou des biblioth&egrave;ques couvertes par la LGPL GNU et avec du code inclus dans la version standard de <var>[nom de la bibliothèque]</var> sous la licence <var>[nom de la licence de la bibliothèque]</var> (ou des versions modifi&eacute;es de ce code, sans changement de licence). Vous pouvez copier et distribuer un tel syst&egrave;me en suivant les termes de la GPL GNU pour <var>[nom de votre programme]</var> et les licences de l'autre code concern&eacute;{, pourvu d'y inclure le code source de l'autre code car la GPL GNU n&eacute;cessite la distribution du code source}.
