Repository: gitGNU/gnu_www-fr
Catalog: licenses/gpl-faq.*.po
Languages: fr

source: The GPL permits this because that run-time library normally accompanies the compiler or interpreter you are using. The run-time libraries here are &ldquo;System Libraries&rdquo; as GPLv3 defines them, and as such they are not considered part of the Corresponding Source. GPLv2 has a similar exception in section 3.
fr: La GPL permet cela car cette biblioth&egrave;que <i>run-time</i> accompagne normalement le compilateur ou l'interpr&eacute;teur que vous utilisez. Les bibliothèques run-time ici sont des «&nbsp;bibliothèques système&nbsp;» comme le définit la GPLv3, et comme telles sont considérées comme faisant partie des sources correspondant. La GPLv2 a une exception similaire dans la section 3.

source: That doesn't mean it is a good idea to write the program so that it only runs on Windows. Doing so results in a program that is free software but &ldquo;<a href="/philosophy/java-trap.html">trapped</a>&rdquo; by Windows.
fr: Cela ne signifie pas que c'est une bonne id&eacute;e d'&eacute;crire un programme qui ne fonctionne que sur Windows. En faisant ceci, cela donne un logiciellibre mais<a href="/philosophy/java-trap.fr.html"> &laquo;&nbsp;pris au pi&egrave;ge&nbsp;&raquo;</a> par Windows.

source: Because it imposes a specific requirement that is not in the GPL; namely, the requirement on advertisements of the program. Section 6 of GPLv2 states:
fr: Parce qu'elle impose une exigence sp&eacute;cifique qui n'est pas dans la GPL; &agrave; savoir la r&egrave;gle portant sur la publicit&eacute; du programme. La section 6 de la GPLv2 dit&nbsp;:

source: You may not impose any further restrictions on the recipients' exercise of the rights granted herein.
fr: You may not impose any further restrictions on the recipients' exercise of the rights granted herein. Traduction&nbsp;: Vous ne pouvez pas imposer d'autres restrictions aux destinataires aux droits autorisés ici.

source: GPLv3 says something similar in section 10. The advertising clause provides just such a further restriction, and thus is GPL-incompatible.
fr: La GPLv3 dit quelque chose de similaire dans la section 10. La clause concernant la publicit&eacute; est justement l'une de ces restrictions suppl&eacute;mentaires, et ceci la rend incompatible avec la GPL.

source: The revised BSD license does not have the advertising clause, which eliminates the problem.
fr: La licence BSD r&eacute;vis&eacute;e ne contient plus cette clause sur la publicit&eacute;, ce qui &eacute;limine le probl&egrave;me.

source: It depends on how the program invokes its plug-ins. If the program uses fork and exec to invoke plug-ins, then the plug-ins are separate programs, so the license for the main program makes no requirements for them.
fr: Cela d&eacute;pend de la fa&ccedil;on dont le programme invoque ses plug-ins. S'il utilise 'fork' et 'exec' pour les invoquer, alors les plug-ins sont des programmes s&eacute;par&eacute;s, donc la licence du programme principal ne n'impose aucune exigence les concernant.

source: If the program dynamically links plug-ins, and they make function calls to each other and share data structures, we believe they form a single program, which must be treated as an extension of both the main program and the plug-ins. This means the plug-ins must be released under the GPL or a GPL-compatible free software license, and that the terms of the GPL must be followed when those plug-ins are distributed.
fr: Si le programme fait une &eacute;dition de liens dynamique avec les plug-ins, et qu'ils font des appels de fonctions mutuels et partagent de structure de donn&eacute;es, nous pensons qu'ils forment un seul et m&ecirc;me programme, et les plug-ins doivent donc &ecirc;tre trait&eacute;s comme des extensions du programme principal. Cela signifie qu'il doivent &ecirc;tre distribu&eacute;s sous la GPL ou sous une licence de logiciel libre compatible avec la GPL.

source: If the program dynamically links plug-ins, but the communication between them is limited to invoking the &lsquo;main&rsquo; function of the plug-in with some options and waiting for it to return, that is a borderline case.
fr: Si le programme fait une &eacute;dition de liens dynamique avec des plug-ins, mais que la communication entre eux est limit&eacute;e &agrave; l'invocation de la fonction `main' du plug-in avec quelques options et l'attente du r&eacute;sultat de l'ex&eacute;cution du plug-in, nous nous trouvons dans un cas limite

source: If the program uses fork and exec to invoke plug-ins, then the plug-ins are separate programs, so the license for the main program makes no requirements for them. So you can use the GPL for a plug-in, and there are no special requirements.
fr: Si le programme utilise 'fork' et 'exec' pour invoquer les plug-ins, alors les plug-ins sont des programmes s&eacute;par&eacute;s, aussi la licence pour le programme principal n'impose aucune exigence les concernant. Vous pouvez donc utiliser la GPL pour un plug-in, il n'y a pas d'exigence sp&eacute;ciale.

source: If the program dynamically links plug-ins, and they make function calls to each other and share data structures, we believe they form a single program, which must be treated as an extension of both the main program and the plug-ins. This means that combination of the GPL-covered plug-in with the non-free main program would violate the GPL. However, you can resolve that legal problem by adding an exception to your plug-in's license, giving permission to link it with the non-free main program.
fr: Si le programme fait une &eacute;dition de liens dynamique avec les plug-ins, et qu'ils font des appels de fonctions mutuels et partagent de structure de donn&eacute;es, nous pensons qu'ils forment un seul et m&ecirc;me programme qui doit &ecirc;tre trait&eacute; comme une extension du programme principal et des plug-ins. Cela signifie que la combinaison du plug-in sous GPL avec le programme principal constituerait une violation de la GPL. Toutefois, vous pouvez r&eacute;soudre ce probl&egrave;me l&eacute;galen ajoutant une exception &agrave; la licence de votre plug-in, qui autorise &agrave; le lier avec le programme principal non-libre.

source: See also the question <a href="#FSWithNFLibs">I am writing free software that uses a non-free library.</a>
fr: Voir aussi la question <a href="#FSWithNFLibs">&laquo;&nbsp;Puis-je &eacute;crire un logiciel libre qui utilise des biblioth&egrave;ques non-libres&nbsp;?&nbsp;&raquo;</a>

source: It depends on how the program invokes its plug-ins. For instance, if the program uses <em>only</em> simple fork and exec to invoke and communicate with plug-ins, then the plug-ins are separate programs, so the license of the plug-in makes no requirements about the main program.
fr: Cela d&eacute;pend de la fa&ccedil;on dont le programme invoque ses plug-ins. Si le programme utilise fork et exec pour invoquer les plug-ins, alors les plug-ins sont des programmes s&eacute;par&eacute;s, alors, la licence du plug-in ne demande pas de pr&eacute;requis pour le programme principal.

source: If the program dynamically links plug-ins, and they make function calls to each other and share data structures, we believe they form a single program, which must be treated as an extension of both the main program and the plug-ins. In order to use the GPL-covered plug-ins, the main program must be released under the GPL or a GPL-compatible free software license, and that the terms of the GPL must be followed when the main program is distributed for use with these plug-ins.
fr: Si le programme lie dynamiquement les plug-ins, et qu'ils font mutuellement des appels de fonctions et partagent des structures de donn&eacute;es, nous pensons qu'ils forment un seul programme, qui doit &ecirc;tre trait&eacute; comme une extension du programme principal et des plug-ins. Afin d'utiliser les plug-ins couverts par la GPL, le programme principal doit &ecirc;tre publi&eacute; sous la GPL ou une licence de logiciel libre compatible avec la GPL, et que les termes ne la GPL doivent &ecirc;tre respect&eacute;s quand le programme principal est distribu&eacute; pour utiliser ces plug-ins.

source: Using shared memory to communicate with complex data structures is pretty much equivalent to dynamic linking.
fr: L'utilisation de mémoire partagée pour communiquer avec des structures de données complexes est pratiquement équivalent à une liaison dynamique.

source: Not exactly. It means you must release your program under a license compatible with the GPL (more precisely, compatible with one or more GPL versions accepted by all the rest of the code in the combination that you link). The combination itself is then available under those GPL versions.
fr: Pas exactement. Cela signifie que vous devez publier votre programme sous une licence compatible avec la GPL (plus précisément, compatible avec une ou plusieurs des versions de la GPL acceptées par tout le reste du compte avec la combinaison que vous liez). La combinaison elle-même est alors disponible sous ces versions de la GPL.

source: You can ask, but most authors will stand firm and say no. The idea of the GPL is that if you want to include our code in your program, your program must also be free software. It is supposed to put pressure on you to release your program in a way that makes it part of our community.
fr: Vous pouvez toujours demander, mais la plupart des auteurs persisteront et refuseront. L'id&eacute;e m&ecirc;me de la GPL est que, si vous voulez inclure notre code dans votre programme, votre programme doit aussi &ecirc;tre un logiciel libre. Ceci est fait pour vous inciter &agrave; distribuer votre programme de telle sorte qu'il s'int&egrave;gre &agrave; notre communaut&eacute;.

source: You always have the legal alternative of not using our code.
fr: Vous disposez toujours de l'alternative l&eacute;gale de ne pas utiliser notre code.

source: Add this text to the license notice of each file in the package, at the end of the text that says the file is distributed under the GNU GPL:
fr: Ajouter ce texte &agrave; la notice de licence de chaque fichier du paquetage, &agrave; la fin du texte qui dit que le fichier est distribu&eacute; sous la licence GPL GNU&nbsp;:

source: Linking ABC statically or dynamically with other modules is making a combined work based on ABC. Thus, the terms and conditions of the GNU General Public License cover the whole combination.
fr: Linking ABC statically or dynamically with other modules is making a combined work based on ABC. Thus, the terms and conditions of the GNU General Public License cover the whole combination. Traduction&nbsp;: Lier ABC statiquement ou dynamiquement avec d'autres modules en fait un travail combin&eacute; bas&eacute; sur ABC. Par cons&eacute;quent, les termes et conditions de la Licence publique g&eacute;n&eacute;rale GNU couvrent la totalit&eacute; de programme.

source: In addition, as a special exception, the copyright holders of ABC give you permission to combine ABC program with free software programs or libraries that are released under the GNU LGPL and with independent modules that communicate with ABC solely through the ABCDEF interface. You may copy and distribute such a system following the terms of the GNU GPL for ABC and the licenses of the other code concerned, provided that you include the source code of that other code when and as the GNU GPL requires distribution of source code.
fr: In addition, as a special exception, the copyright holders of ABC give you permission to combine ABC program with free software programs or libraries that are released under the GNU LGPL and with independent modules that communicate with ABC solely through the ABCDEF interface. You may copy and distribute such a system following the terms of the GNU GPL for ABC and the licenses of the other code concerned, provided that you include the source code of that other code when and as the GNU GPL requires distribution of source code. Traduction&nbsp;: Exceptionnellement, les d&eacute;tenteurs du copyright de ABC vous donne la permission de combiner ABC avec des logiciels libres ou des biblioth&egrave;ques couvertes par la LGPL GNU et avec des modules ind&eacute;pendants qui communiquent avec ABC seulement &agrave; partir de l'interface ABCDEF. Vous pouvez copier et distribuer un tel syst&egrave;me en suivant les termes de la GPL GNU pour ABC et les licences de l'autre code concern&eacute; pourvu d'y inclure le code source de cet autre code car la GPL GNU n&eacute;cessite de distribuer le code source.

source: Note that people who make modified versions of ABC are not obligated to grant this special exception for their modified versions; it is their choice whether to do so. The GNU General Public License gives permission to release a modified version without this exception; this exception also makes it possible to release a modified version which carries forward this exception.
fr: Note that people who make modified versions of ABC are not obligated to grant this special exception for their modified versions; it is their choice whether to do so. The GNU General Public License gives permission to release a modified version without this exception; this exception also makes it possible to release a modified version which carries forward this exception. Traduction&nbsp;: Notez que les personnes qui font des versions modifi&eacute;es de ABC ne sont pas oblig&eacute;es d'accorder cette exception particuli&egrave;re pour leurs versions modifi&eacute;es; il leur appartient de le faire ou pas. La Licence publique g&eacute;n&eacute;rale GNU donne la permission de publier une version modifi&eacute;e sans cette exception; cette exception rend &eacute;galement possible de publier une version modifi&eacute;e qui perp&eacute;tue cette exception.

source: Only the copyright holders for the program can legally authorize this exception. If you wrote the whole program yourself, then assuming your employer or school does not claim the copyright, you are the copyright holder&mdash;so you can authorize the exception. But if you want to use parts of other GPL-covered programs by other authors in your code, you cannot authorize the exception for them. You have to get the approval of the copyright holders of those programs.
fr: Seuls les d&eacute;tenteurs du droit d'auteur pour le programme peuvent l&eacute;galement autoriser cette exception. Si vous avez &eacute;crit tout le programme vous-m&ecirc;me, en vous assurant que votre employeur ou votre &eacute;cole ne revendique pas le droit d'auteur, vous &ecirc;tes le d&eacute;denteur du droit d'auteur et vous pouvez alors autoriser cette exception. Mais si vous voulez utiliser des parties d'autres programmes couverts par la GPL par d'autres auteurs dans votre code, vous ne pouvez autoriser cette exception pour eux. Vous devez obtenir l'autorisation des d&eacute;tenteurs de droit d'auteur pour ces programmes.

source: To answer this question, we would need to see a list of each component that your program uses, the license of that component, and a brief (a few sentences for each should suffice) describing how your library uses that component. Two examples would be:
fr: Pour r&eacute;pondre &agrave; cette question, nous aurions besoin de voir une liste compl&egrave;te des composants utilis&eacute;s par votre programme, des licences de chacun de ces composants, ainsi qu'une description br&egrave;ve (quelques phrases par composant devraient suffire) de la fa&ccedil;on dont votre biblioth&egrave;que les utilise. Deux exemples potentiels&nbsp;:

source: To make my software work, it must be linked to the FOO library, which is available under the Lesser GPL.
fr: Pour que mon logiciel fonctionne, il doit subir une &eacute;dition de liens avec la librairie FOO, qui est disponible sous Lesser GPL (GPL Amoindrie).

source: My software makes a system call (with a command line that I built) to run the BAR program, which is licensed under &ldquo;the GPL, with a special exception allowing for linking with QUUX&rdquo;.
fr: Mon logiciel fait un appel syst&egrave;me (avec une ligne de commande que j'ai &eacute;crite) pour lancer le programme BAR, qui est &laquo;&nbsp;sous GPL, avec une exception sp&eacute;ciale autorisant une &eacute;dition de liens avec QUUX&nbsp;&raquo;.

source: An &ldquo;aggregate&rdquo; consists of a number of separate programs, distributed together on the same CD-ROM or other media. The GPL permits you to create and distribute an aggregate, even when the licenses of the other software are non-free or GPL-incompatible. The only condition is that you cannot release the aggregate under a license that prohibits users from exercising rights that each program's individual license would grant them.
fr: Une <i>&laquo;&nbsp;aggrégation&nbsp;&raquo;</i> consiste en des programmes séparés distribués ensemble sur le m&ecirc;me CD-ROM ou un autre média. La GPL vous permet de créer et distribuer une aggrégation, même si les licences des autres logiciels ne sont pas libres ou sont incompatibles avec la GPL. La seule condition est que vous ne pouvez pas publier une aggrégation sous une licence qui interdise aux utilisateurs d'exercer les droits que chaque licence individuelle des programmes leur autorise.

source: Where's the line between two separate programs, and one program with two parts? This is a legal question, which ultimately judges will decide. We believe that a proper criterion depends both on the mechanism of communication (exec, pipes, rpc, function calls within a shared address space, etc.) and the semantics of the communication (what kinds of information are interchanged).
fr: Où est la limite entre deux programmes séparés et un programme en deux parties&nbsp;? Il s'agit d'un probl&egrave;me juridique, qui sera tranch&eacute; en dernier recours par un juge. Nous pensons qu'un crit&egrave;re adapt&eacute; tient compte &agrave; la fois des modes de communication (exec, pipes, rpc, appel de fonctions au sein d'un espace de m&eacute;moire commun, etc.) et de la s&eacute;mantique de cette communication (quels genres d'informations sont &eacute;chang&eacute;s).

source: If the modules are included in the same executable file, they are definitely combined in one program. If modules are designed to run linked together in a shared address space, that almost surely means combining them into one program.
fr: Si les modules sont inclus dans un m&ecirc;me fichier ex&eacute;cutable, ils sont ind&eacute;niablement combin&eacute;s dans un seul programme. Si les modules sontcon&ccedil;us pour &ecirc;tre ex&eacute;cut&eacute;s par &eacute;dition de liens dans un m&ecirc;me espace m&eacute;moire partag&eacute;, cela signifie presque &agrave; coup s&ucirc;r une combinaison en un seul programme.

source: By contrast, pipes, sockets and command-line arguments are communication mechanisms normally used between two separate programs. So when they are used for communication, the modules normally are separate programs. But if the semantics of the communication are intimate enough, exchanging complex internal data structures, that too could be a basis to consider the two parts as combined into a larger program.
fr: En revanche, les pipes, sockets et autres arguments de ligne de commande sont des m&eacute;canismes de communication utilis&eacute;s normalement entre deux programmes s&eacute;par&eacute;s. Aussi, tant que ceux-ci servent &agrave; communiquer, les modules sont normalement des programmes s&eacute;par&eacute;s. Mais si la s&eacute;mantique des &eacute;changes est assez 'intime', avec &eacute;change de structures de donn&eacute;es internes complexes, cela pourrait &eacute;galement constituer une base suffisante pour consid&eacute;rer les deux &eacute;l&eacute;ments combin&eacute;s comme un seul et m&ecirc;me programme.

source: Our lawyers have told us that to be in the <a href="/licenses/why-assign.html">best position to enforce the GPL</a> in court against violators, we should keep the copyright status of the program as simple as possible. We do this by asking each contributor to either assign the copyright on his contribution to the FSF, or disclaim copyright on it and thus put it in the public domain.
fr: Nos avocats nous ont avis&eacute;s que pour &ecirc;tre dans la <a href="/licenses/why-assign.fr.html">meilleure position pour faire appliquer la GPL</a> au tribunal contre des contrevenants, il valait mieux conserver un statut de copyright le plus simple possible. C'est ce que nous faisons en demandant &agrave; chaque contributeur, soit de transf&eacute;rer le copyright de sa contribution &agrave; la FSF, soit d'abandonner ce copyright, le pla&ccedil;ant ainsi dans le domaine public.

source: We also ask individual contributors to get copyright disclaimers from their employers (if any) so that we can be sure those employers won't claim to own the contributions.
fr: Nous demandons &eacute;galement aux contributeurs individuels d'obtenir une renonciation au copyright &eacute;crite par leur employeur (s'il existe), de fa&ccedil;on &agrave; s'assurer que ce dernier ne puisse pr&eacute;tendre avoir des droits sur les &eacute;l&eacute;ments de contribution au projet.

source: Of course, if all the contributors put their code in the public domain, there is no copyright with which to enforce the GPL. So we encourage people to assign copyright on large code contributions, and only put small changes in the public domain.
fr: Bien entendu, si tous les participants mettent leur code dans le domaine public, il n'y a plus de copyright permettant de faire appliquer la GPL. Aussi nous encourageons &agrave; d&eacute;finir un copyright sur les des contributions importantes en mati&egrave;re de code, et &agrave; seulement mettre les modifications mineures dans le domaine public.

source: If you want to make an effort to enforce the GPL on your program, it is probably a good idea for you to follow a similar policy. Please contact <a href="mailto:licensing@gnu.org">&lt;licensing@gnu.org&gt;</a> if you want more information.
fr: Si &ecirc;tes pr&ecirc;t &agrave; faire un effort pour d&eacute;fendre la GPL appliqu&eacute;e &agrave; votre programme, c'est probablement une bonne id&eacute;e que d'adopter une politique similaire. Merci de contacter <a href="mailto:licensing&#64;gnu.org">&lt;licensing&#64;gnu.org&gt;</a> si vous d&eacute;sirez plus de renseignements.

source: You can use the GPL terms (possibly modified) in another license provided that you call your license by another name and do not include the GPL preamble, and provided you modify the instructions-for-use at the end enough to make it clearly different in wording and not mention GNU (though the actual procedure you describe may be similar).
fr: Vous pouvez utiliser les termes de la GPL (qui peuvent &ecirc;tre modifi&eacute;s) dans une autre licence pourvu que vous l'appeliez par un autre nom et que vous n'y incluiez pas le pr&eacute;ambule de la GPL, et pourvu que vous modifiez les instructions d'usage &agrave; la fin suffisamment pour la rendre clairement diff&eacute;rente dans la formulation et en ne mentionnant pas GNU (bien que la proc&eacute;dure que vous d&eacute;crivez puisse &ecirc;tre similaire).

source: If you want to use our preamble in a modified license, please write to <a href="mailto:licensing@gnu.org">&lt;licensing@gnu.org&gt;</a> for permission. For this purpose we would want to check the actual license requirements to see if we approve of them.
fr: Si vous voulez utiliser notre pr&eacute;ambule dans une licence modifi&eacute;e, veuillez &eacute;crire &agrave; <a href="mailto:licensing&#64;gnu.org">&lt;licensing&#64;gnu.org&gt;</a> pour une autorisation. &Agrave; cette fin, vous voudrons v&eacute;rifier les conditions r&eacute;elles de la licence pour voir si nous les approuvons.
