Repository: gitGNU/gnu_www-fr
Catalog: licenses/gplv3-the-program.*.po
Languages: fr

source: terms that wholly or partially terminate, or allow termination of, permission for use of the material they cover, for a user who files a software patent lawsuit (that is, a lawsuit alleging that some software infringes a patent) not filed in retaliation or defense against the earlier filing of another software patent lawsuit, or in which the allegedly infringing software includes some of the covered material, possibly in combination with other software &hellip;
fr: [&hellip;] des conditions qui r&eacute;silient totalement ou partiellement [la licence]&nbsp;; ou qui permettent la r&eacute;siliation de l'octroi de droits sur les &eacute;l&eacute;ments couverts, et ce &agrave; l'encontre d'un utilisateur qui intente une action juridique pour contrefa&ccedil;on (c'est-&agrave;-dire un proc&egrave;s au motif que tel logiciel viole un brevet) lorsque cette action n'est pas en repr&eacute;saille ou ne sert pas de d&eacute;fense contre une pr&eacute;c&eacute;dente action en contrefa&ccedil;on, ou une action juridique dans laquelle le logiciel incrimin&eacute; contient une partie des &eacute;l&eacute;ments couverts, &eacute;ventuellement combin&eacute;e &agrave; d'autres logiciels&hellip;

source: Section 7 does not state the GPL's own policy; instead it says how far other compatible licenses can go. Thus, that text in section 7 would not have established broad patent relatiation; it only would have permitted combining GPL-covered code with other licenses that do such broad patent relatiation.
fr: Cette section 7 ne fait pas &eacute;tat de la politique de la GPL &agrave; ce sujet. &Agrave; la place, elle indique jusqu'&agrave; quel point d'autres licences compatibles peuvent aller. De ce fait, ce texte dans la section 7 n'aurait pas &eacute;tabli la possibilit&eacute; de larges repr&eacute;sailles&nbsp;; il aurait seulement permis &agrave; des portions de code soumis &agrave; la GPL d'&ecirc;tre combin&eacute;es &agrave; d'autres licences, qui permettent, elles, de larges repr&eacute;sailles.

source: Nonetheless, as explained in the Rationale for Draft 3, such broad retaliation was criticized because it could apply to software patent lawsuits in which the accused software was unrelated to the software that was the subject of the license. Seeing that there were no widely used licenses with which this would provide compatibility, in draft 3 we dropped broad patent retaliation from the range of GPL compatibility.
fr: Quoi qu'il en soit, comme c'est expliqu&eacute; dans la justification du raisonnement [NDT&nbsp;: Rationale] du troisi&egrave;me brouillon, de telles larges repr&eacute;sailles sont critiquables dans la mesure o&ugrave; elles pourraient s'appliquer &agrave; des proc&egrave;s en contrefa&ccedil;on o&ugrave; le logiciel incrimin&eacute; n'a pas de relation avec le logiciel soumis &agrave; la licence. Consid&eacute;rant qu'il n'y avait pas de licence couramment utilis&eacute;e avec laquelle la compatibilit&eacute; de la GPLv3 serait assur&eacute;e [NDT&nbsp;: gr&acirc;ce &agrave; la possibilit&eacute; de larges repr&eacute;sailles], nous avons laiss&eacute; tomber les larges repr&eacute;sailles du p&eacute;rim&egrave;tre de la compatibilit&eacute; de la GPL dans le cadre du troisi&egrave;me brouillon.

source: We did so by replacing 7(b)(5) with text in section 10, in which we kept only what corresponded to the second category. The first category therefore reverted to being a GPL-incompatible &quot;further restriction&quot; in Draft 3, and likewise in GPL version 3 as actually published.
fr: Nous avons fait cela en rempla&ccedil;ant la clause 7(b)(5) par une portion de texte dans la section 10, portion dans laquelle nous n'avons gard&eacute; que ce qui correspondait &agrave; la seconde cat&eacute;gorie. La premi&egrave;re cat&eacute;gorie est donc redevenue une &laquo;&nbsp;restriction suppl&eacute;mentaire&nbsp;&raquo; incompatible avec le troisi&egrave;me brouillon de la GPL et, de mani&egrave;re analogue, incompatible avec la GPLv3 telle qu'elle est publi&eacute;e actuellement.

source: <a href="/licenses/gpl-faq.html">Return to the FAQ</a>
fr: <a href="/licenses/gpl-faq.fr.html">Revenir &agrave; la FAQ</a>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:licensing@fsf.org"><em>licensing@fsf.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Marc Chauvet.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
