Repository: gitGNU/gnu_www-fr
Catalog: licenses/gplv3-the-program.*.po
Languages: fr

source: What does &quot;the Program&quot; mean in GPLv3?
fr: Que signifie &laquo;&nbsp;le Programme&nbsp;&raquo; dans la GPLv3&nbsp;?

source: Summary
fr: R&eacute;sum&eacute;

source: In version 3 of the GNU General Public License (GPLv3), the term &quot;the Program&quot; means one particular work that is licensed under GPLv3 and is received by a particular licensee from an upstream licensor or distributor. The Program is the particular work of software that you received in a given instance of GPLv3 licensing, as you received it.
fr: Dans la 3&egrave;me version de la GNU General Public License (GPLv3), le terme &laquo;&nbsp;le Programme&nbsp;&raquo; signifie une &oelig;uvre sp&eacute;cifique qui est publi&eacute;e sous la licence GPLv3 et provient d'un distributeur ou d'un d&eacute;tenteur de droits situ&eacute;s en amont. &laquo;&nbsp;Le Programme&nbsp;&raquo; est le logiciel sp&eacute;cifique que vous avez re&ccedil;u dans une version donn&eacute;e de la GPLv3, tel que vous l'avez re&ccedil;u.

source: &quot;The Program&quot; cannot mean &quot;all the works ever licensed under GPLv3&quot;; that interpretation makes no sense, because &quot;the Program&quot; is singular: those many different programs do not constitute one program.
fr: &laquo;&nbsp;Le Programme&nbsp;&raquo; ne peut signifier &laquo;&nbsp;toutes les &oelig;uvres qui ont &eacute;t&eacute; un jour licenci&eacute;es sous GPLv3&nbsp;&raquo;&nbsp;; cette interpr&eacute;tation n'a pas de sens dans la mesure o&ugrave; le terme &laquo;&nbsp;le Programme&nbsp;&raquo; est au singulier&nbsp;: tous ces programmes sous GPLv3 ne forment pas un programme.

source: In particular, this applies to the clause in section 10, paragraph 3 of GPLv3 which states
fr: Notamment, ceci s'applique &agrave; l'article du paragraphe 3 de la section 10 de la GPLv3 qui indique&nbsp;:

source: [Y]ou may not initiate litigation (including a cross-claim or counterclaim in a lawsuit) alleging that any patent claim is infringed by making, using, selling, offering for sale, or importing the Program or any portion of it.
fr: Vous n'avez pas le droit d'initier un contentieux (y compris des actions judiciaires sous forme crois&eacute;e ou en repr&eacute;saille &agrave; une autre action en justice) sous pr&eacute;texte qu'une quelconque demande de brevet est viol&eacute;e lors de la cr&eacute;ation, de l'utilisation, de la vente, de l'offre &agrave; la vente ou de l'importation du &laquo;&nbsp;Programme&nbsp;&raquo; ou d'une partie de celui-ci.

source: This is a condition that limits the ability of a GPLv3 licensee to bring a lawsuit accusing the particular GPLv3-covered software received by the licensee of patent infringement. It does not speak to the situation in which a party who is a licensee of GPLv3-covered program A, but not of unrelated GPLv3-covered program B, initiates litigation accusing program B of patent infringement. If the party is a licensee of both A and B, that party would potentially lose rights to B, but not to A.
fr: Il s'agit d'un article qui limite la possibilit&eacute; d'un d&eacute;tenteur d'une licence GPLv3 d'intenter une action en justice pour contrefa&ccedil;on contre le logiciel sous GPLv3.</span> Cet article ne s'applique pas au cas o&ugrave; une partie initie un litige en contrefa&ccedil;on contre un programme B, lorsque cette partie est d&eacute;tentrice de droits sur un programme A sous licence GPLv3 et n'en est pas d&eacute;tentrice pour le programme B, lui aussi sous GPLv3 mais sans rapport avec A. Au cas o&ugrave; la partie serait d&eacute;tentrice des droits &agrave; la fois des programmes A et B, cette partie pourrait perdre certains de ses droits sur B, mais pas sur A.

source: Since software patents pose an unjust threat to all software developers, all software distributors, and all software users, we would abolish them if we could. Indeed, we campaign to do so. But we think it would have been self-defeating to make the license conditions for any one GPL-covered program go so far as to require a promise to never attack any GPL-covered program.
fr: Puisque les brevets logiciels font peser une injuste menace sur tous les d&eacute;veloppeurs, distributeurs et utilisateurs de logiciels, nous les abolirions si nous pouvions. Etd'ailleurs, nous faisons campagne en ce sens. Mais nous pensons qu'il serait contre-productif de faire aller les conditions de la licence au point de requ&eacute;rir l'interdiction d'attaquer n'importe lequel des programmes sous GPL.

source: Further analysis
fr: Analyse plus pouss&eacute;e

source: GPLv3 defines &quot;the Program&quot; as follows:
fr: La licence GPLv3 d&eacute;finit &laquo;&nbsp;le Programme&nbsp;&raquo; comme suit&nbsp;:

source: &quot;The Program&quot; refers to any copyrightable work licensed under this License.
fr: &laquo;&nbsp;Le Programme&nbsp;&raquo; fait r&eacute;f&eacute;rence &agrave; n'importe quelle &oelig;uvre sous cette licence.

source: Some have contended that this definition can be read to mean all GPLv3-licensed works, rather than the one particular GPLv3-licensed work received by a licensee in a given licensing context. These readers have expressed particular concern about the consequences of such an interpretation for the new patent provisions of GPLv3, especially the patent termination condition found in the third paragraph 10 and the express patent license grant made by upstream contributors under the third paragraph of section 11. This overbroad reading of &quot;the Program&quot; is incorrect, and contrary to our intent as the drafters of GPLv3.
fr: Certains ont soutenu que cette d&eacute;finition pouvait &ecirc;tre interpr&eacute;t&eacute;e comme recouvrant toutes les &oelig;uvres sous GPLv3, plut&ocirc;t que la seule &oelig;uvre obtenue par un [licenci&eacute;] dans un contexte donn&eacute; de licence. Ces lecteurs ont exprim&eacute; leurs inqui&eacute;tudes quant aux cons&eacute;quences d'une telle interpr&eacute;tation des dispositions de la nouvelle licence GPLv3, et notamment les conditions de r&eacute;siliation de licence &eacute;nonc&eacute;es dans le troisi&egrave;me paragraphe de la section 10 et celles d'octroi de licence faites par des contributeurs en amont dans le cadre du troisi&egrave;me paragraphe de la section 11. Cette lecture trop large du terme &laquo;&nbsp;Programme&nbsp;&raquo; est erron&eacute;e, et contraire &agrave; nos intentions en tant que r&eacute;dacteurs du brouillon de la GPLv3.

source: The word &quot;any&quot; is susceptible to multiple, subtly different shades of meaning in English. In some contexts, &quot;any&quot; means &quot;every&quot; or &quot;all&quot;; in others, including the definition of &quot;the Program&quot; in GPLv3, it suggests &quot;one particular instance of, selected from many possibilities&quot;. This variability has to be resolved by the context. This context resolves it, but it requires some thought.
fr: Les termes &laquo;&nbsp;n'importe quelle&nbsp;&raquo; [NDT&nbsp;: &laquo;&nbsp;any&nbsp;&raquo;] ont de multiples sens, s&eacute;par&eacute;s par de subtiles nuances. Dans certains cas, ces mots signifient &laquo;&nbsp;tous&nbsp;&raquo; ou &laquo;&nbsp;chaque&nbsp;&raquo;&nbsp;; dans d'autres cas, dont celui de la d&eacute;finition du &laquo;&nbsp;Programme&nbsp;&raquo; dans la GPLv3, ils recouvrent seulement une instance particuli&egrave;re, parmi de pleins d'instances. Cette ambigu&iuml;t&eacute; doit &ecirc;tre r&eacute;solue d'apr&egrave;s le contexte. En l'occurrence, le contexte la r&eacute;sout, mais cela requiert d'y r&eacute;fl&eacute;chir.

source: We could have worded the definition of &quot;the Program&quot; differently, such as by using &quot;a particular&quot; instead of &quot;any&quot;, but that would not have eliminated the need for thought. The phrase &quot;a particular work licensed under this License&quot;, regarded in isolation, would not necessarily signify *the* particular work received by a particular &quot;you&quot; in a particular act of licensing or distribution. Our review of other free software licenses shows that they raise similar issues of interpretation, with words of general reference used in order to facilitate license reuse.
fr: Nous aurions pu formuler la d&eacute;finition du &laquo;&nbsp;Programme&nbsp;&raquo; diff&eacute;remment, comme en utilisant &laquo;&nbsp;une &oelig;uvre sp&eacute;cifique&nbsp;&raquo; plut&ocirc;t que &laquo;&nbsp;n'importe quelle &oelig;uvre&nbsp;&raquo;, mais cela n'aurait pas retir&eacute; la n&eacute;cessit&eacute;d'y r&eacute;fl&eacute;chir. L'expression &laquo;&nbsp;une &oelig;uvre sp&eacute;cifique sous cette licence&nbsp;&raquo;, &eacute;tudi&eacute;e isol&eacute;ment, ne signifierait pas forc&eacute;ment *l'*&oelig;uvre sp&eacute;cifique re&ccedil;ue par un &laquo;&nbsp;vous&nbsp;&raquo; sp&eacute;cifique dans un mode de distribution ou de licence sp&eacute;cifique. Notre examen d'autres licences de logiciels libres montre qu'elles soul&egrave;vent les m&ecirc;mes probl&egrave;mes d'interpr&eacute;tation,avec l'utilisation de mots g&eacute;n&eacute;raux afin de faciliter la r&eacute;utilisation des licences.

source: Given that no choice is so clear that all other candidate meanings must be rejected, &quot;any&quot; has certain advantages. It is a somewhat more informal and less legalistic usage than the possible alternatives, an appropriate register for the developers reading and applying the license. Moreover, the usage of &quot;any&quot;, through its suggestion of selection out of many qualifying possibilities, has the effect of emphasizing the reusability of GPLv3 for multiple works of software and in multiple licensing situations. The GNU GPL is intended to be used by many developers on their programs and that too needs to be clear.
fr: &Eacute;tant donn&eacute; qu'aucun choix de termes n'est clair au point que les autres sens possibles soient exclus, &laquo;&nbsp;n'importe quelle&nbsp;&raquo; avaitcertains avantages. Il s'agit d'un usage un peu plus informel et moins juridique que les alternatives, d'un usage appropri&eacute; pour les d&eacute;veloppeurs lisant et appliquant la licence. De plus, gr&acirc;ce &agrave; la connotation de s&eacute;lection parmi une multitude d'&oelig;uvres, l'utilisation de &laquo;&nbsp;n'importe quelle&nbsp;&raquo; permet de mettre l'accent sur la r&eacute;utilisation de la GPLv3 pour plusieurs &oelig;uvres et dans plusieurs situations de licence. La licence GNU GPL est pr&eacute;vue pour &ecirc;tre utilis&eacute;e par de nombreux d&eacute;veloppeurs pour leurs programmes et cela aussi m&eacute;rite d'&ecirc;tre clair.

source: The same use of &quot;any&quot; that has given rise to interpretive concerns under GPLv3 exists in GPLv2, in its corresponding definition. Section 0 of GPLv2 states:
fr: La m&ecirc;me utilisation de &laquo;&nbsp;n'importe quelle&nbsp;&raquo; qui g&eacute;n&egrave;re ces inqui&egrave;tudes quant &agrave; l'interpr&eacute;tation dans la GPLv3 existe dans la GPLv2, dans sa d&eacute;finition correspondante. La section 0 de la GPLv2 stipule&nbsp;:

source: This License applies to any program or other work which contains a notice placed by the copyright holder saying it may be distributed under the terms of this General Public License. The &quot;Program&quot;, below, refers to any such program or work, and a &quot;work based on the Program&quot; means either the Program or any derivative work under copyright law &hellip;
fr: Cette Licence s'applique &agrave; n'importe quel programme ou n'importe quelle &oelig;uvre qui contient une mention plac&eacute;e par le d&eacute;tenteur des droits d'auteur indiquant que l'&oelig;uvre peut &ecirc;tre distribu&eacute;e sous les termes de cette GPL. Le terme &laquo;&nbsp;Programme&nbsp;&raquo;, ci-dessous, fait r&eacute;f&eacute;rence &agrave; n'importe quel programme ou &oelig;uvre, et une &laquo;&nbsp;&oelig;uvre fond&eacute;e sur le Programme&nbsp;&raquo; se r&eacute;f&egrave;re soit au &laquo;&nbsp;Programme&nbsp;&raquo;, soit &agrave; toute &oelig;uvre d&eacute;riv&eacute;e soumise au droit d'auteur&hellip;

source: However, it has always been the understanding of the FSF and others in the GPL-using community that &quot;the Program&quot; in GPLv2 means the particular GPL-covered work that you receive, before you make any possible modifications to it. The definition of &quot;the Program&quot; in GPLv3 is intended to preserve this meaning.
fr: Toutefois, il a toujours &eacute;t&eacute; entendu par la FSF et d'autres dans la communaut&eacute; des utilisateurs de la GPL que &laquo;&nbsp;le Programme&nbsp;&raquo; dans la GPLv2 fait mention &agrave; l'&oelig;uvre sp&eacute;cifique, couverte par la GPL, que vous recevez, avant que vous ne fassiez n'importe quelle modification dessus. La d&eacute;finition du &laquo;&nbsp;Programme&nbsp;&raquo; dans la GPLv3 est destin&eacute;e &agrave; avoir le m&ecirc;me sens.

source: We can find no clause in GPLv3 in which applying the suggested broad interpretation of &quot;the Program&quot; (and the superset term &quot;covered work&quot;) would make sense or have any practical significance, consistent with the wording of the clause and its drafting history. The patent provisions of GPLv3 are a case in point.
fr: Nous ne pouvons trouver aucun article dans la GPLv3 dans lequel le sens plus global sugg&eacute;r&eacute; pour le terme &laquo;&nbsp;le Programme&nbsp;&raquo; ou son sur-ensemble &laquo;&nbsp;&oelig;uvre fond&eacute;e sur le Programme&nbsp;&raquo; aurait un sens ou une quelconque signification pratique, coh&eacute;rente avec la terminologie de l'article et l'historique de ses brouillons. Les clauses de la licence GPLv3 en sont une illustration.

source: The third paragraph of section 11 states:
fr: Le troisi&egrave;me paragraphe de la section 11 indique&nbsp;:

source: Each contributor grants you a non-exclusive, worldwide, royalty-free patent license under the contributor's essential patent claims, to make, use, sell, offer for sale, import and otherwise run, modify and propagate the contents of its contributor version.
fr: Chaque contributeur vous accorde une licence non-exclusive, mondiale, exempte de royalties dans le cadre des principaux droits d'auteur des contributeurs, pour faire, utiliser, vendre, proposer &agrave; la vente, importer et autrement faire fonctionner, modifier et propager les contenus des versions des contributeurs.

source: A &quot;contributor&quot; is defined as &quot;a copyright holder who authorizes use under this License of the Program or a work on which the Program is based.&quot;
fr: Un &laquo;&nbsp;contributeur&nbsp;&raquo; est d&eacute;fini comme &laquo;&nbsp;un d&eacute;tenteur des droits d'auteur qui autorise l'utilisation sous les termes de cette licence du Programme ou d'une &oelig;uvre fond&eacute;e sur le programme&nbsp;&raquo;.

source: The broad reading of &quot;the Program&quot;, it has been suggested, gives rise to an unreasonably broad patent license grant. The reasoning is that, for a given GPLv3 licensee, the set of contributors granting patent licenses becomes all GPLv3 licensors of all GPLv3-covered works in the world, and not merely licensors of the specific work received by that licensee in a particular act of licensing.
fr: Il a &eacute;t&eacute; sugg&eacute;r&eacute; que la lecture plus g&eacute;n&eacute;rale du terme &laquo;&nbsp;le Programme&nbsp;&raquo; ouvre la voie &agrave; l'attribution d'une licence d&eacute;raisonnablement large. Pour une &oelig;uvre donn&eacute;e sous licence GPLv3, la raison en est que la liste des contributeurs accordant la licence d'utilisation devient la liste de tous les contributeurs de toutes les &oelig;uvres couvertes par la GPLv3 de par le monde, et pas seulement les contributeurs de l'&oelig;uvre sp&eacute;cifique re&ccedil;u par le b&eacute;n&eacute;ficiaire de la licence dans un cas particulier de licence.

source: Close attention to the wording of the patent license grant, however, shows that these concerns are unfounded. In order to exercise the permissions of the patent license grant, a GPLv3 licensee must have &quot;the contents of [the contributor's] contributor version&quot; in his possession. If he does, then he is necessarily a recipient of that material, licensed to him under GPLv3.
fr: Toutefois, une &eacute;tude attentive du libell&eacute; de la notice de la licence montre que ces inqui&eacute;tudes sont sans fondement. Afin d'exercer les pr&eacute;rogatives de l'attribution de la licence, un b&eacute;n&eacute;ficiaire d'une licence GPLv3 doit avoir en sa possession &laquo;&nbsp;les contenus de la version du contributeur&nbsp;&raquo;. Si c'est le cas, alors il est de fait r&eacute;cipiendaire de cette &oelig;uvre, licenci&eacute;e pour lui sous la GPLv3.

source: Therefore, contributors are always the actual copyright licensors of the material that is the subject of the patent license grant. The user benefiting from the patent license grant has ultimately received the material covered by the grant from those contributors. If it were otherwise, the patent license grant would be meaningless, because the exercise of its permissions is tied to the contributor's &quot;contributor version&quot;. The contributors and the section 11 patent licensee stand in a direct or indirect distribution relationship. Therefore, section 11, paragraph 3 does not require you to grant a patent license to anyone who is not also your copyright licensee. (Non-contributor redistributors remain subject to applicable implied patent license doctrine and to the special &quot;automatic extension&quot; provision of section 11, paragraph 6.)
fr: Ainsi, les contributeurs sont toujours les d&eacute;tenteurs des droits d'attribution pour l'&oelig;uvre qui est sujette &agrave; l'attribution de la licence. L'utilisateur b&eacute;n&eacute;ficiant de la licence a en fin de compte re&ccedil;u l'&oelig;uvre sujette &agrave; cette licence des contributeurs. S'il en &eacute;tait autrement, l'attributionde la licence serait caduque, puisque l'exercice de ses pr&eacute;rogatives est li&eacute; &agrave; la &laquo;&nbsp;version contributeur&nbsp;&raquo; du contributeur. Les contributeurs et la section 11 de la licence sont dans une relation de distribution directe ou indirecte. De ce fait, le paragraphe 3 de la section 11 ne requiert pas de vous que vous accordiez une licence &agrave; quiconque n'est pas aussi votre licenci&eacute;. (Les ditributeurs non-contributeurs restent soumis &agrave; la doctrine de la licence implicite applicable et &agrave; la sp&eacute;cificit&eacute; de &laquo;&nbsp;l'extension automatique&nbsp;&raquo; telle que sp&eacute;cifi&eacute;e dans la section 11,paragraphe 6).

source: There is similarly no basis for the broad reading of &quot;the Program&quot; when one considers the patent-related clause in the third paragraph of section 10. This clause provides:
fr: De mani&egrave;re analogue, il n'y a pas de fondement &agrave; une lecture &laquo;&nbsp;g&eacute;n&eacute;rale&nbsp;&raquo; du terme &laquo;&nbsp;le Programme&nbsp;&raquo; quand on consid&egrave;re la clause du troisi&egrave;me paragraphe de la section 10. Cette clause stipule que&nbsp;:

source: Coupled with the patent license grant of section 11, paragraph 3, and the termination clause of section 8, this section 10 clause gives rise to a patent termination condition similar in scope to that contained in the Apache License version 2.0.
fr: Coupl&eacute;e avec l'octroi de licence du paragraphe 3 de la section 11 et la clause de r&eacute;siliation de la section 8, la clause de la section 10 donne lieu a une condition de r&eacute;siliation de licence similaire en terme de port&eacute;e &agrave; celle contenue dans la version 2.0 de la licence Apache.

source: The FSF sympathizes with the intent of broad patent retaliation clauses in some free software licenses, since the abolition of software patents is greatly to be desired. However, we think that broad patent retaliation provisions in software licenses are unlikely to benefit the community, especially those clauses which can be triggered by patent litigation concerning other programs unrelated to the software whose license permissions are being terminated. We were very cautious in taking steps to incorporate patent retaliation into GPLv3, and the section 10, paragraph 3 clause is intended to be narrower than patent retaliation clauses in several other well-known licenses, notably the Mozilla Public License version 1.1, with respect to termination of patent licenses.
fr: La FSF comprend l'intention d'avoir des clauses &laquo;&nbsp;larges&nbsp;&raquo; dans les licences de certains logiciels libres, dans la mesure o&ugrave; l'abolition des brevets logiciels est ardemment d&eacute;sir&eacute;e. Toutefois, nous pensons que cela a peu de chance d'&ecirc;tre b&eacute;n&eacute;fique pour la communaut&eacute;, en particulier dans le cas de ces clauses qui peuvent &ecirc;tre activ&eacute;es en cas de litiges concernant d'autres programmes sans rapports avec le logiciel dont les pr&eacute;rogatives sont r&eacute;sili&eacute;es. Nous sommes particuli&egrave;rement prudents lorsqu'il s'agit d'int&eacute;grer des notions de repr&eacute;sailles dans la GPLv3, et la clause du paragraphe 3 de la section 10 est pr&eacute;vue pour &ecirc;tre plus restrictive que les repr&eacute;sailles dans plusieurs autres licences c&eacute;l&egrave;bres, notamment la Mozilla Public License version 1.1, pour ce qui est de la r&eacute;siliation des licences.

source: If the suggested interpretation of &quot;the Program&quot; applied to the section 10, paragraph 3 clause, the result would be a radical departure from our consistent past statements and policies concerning patent retaliation, which we clearly did not intend.
fr: Si l'interpr&eacute;tation en question du &laquo;&nbsp;Programme&nbsp;&raquo; &eacute;tait appliqu&eacute;e &agrave; la clause du paragraphe 3 de la section 10, le r&eacute;sultat serait une rupture radicale avec toute la coh&eacute;rence de nos d&eacute;clarations pass&eacute;es et de notre politique &agrave; ce sujet, ce qui n'est clairement pas notre intention.

source: Other text in GPL version 3 shows the same policy. The patent litigation clause in section 10 was added to Draft 3 of GPLv3 as a replacement for part of the previous clause 7(b)(5) (in Draft 2). Clause 7(b)(5) permitted the placement of two categories of patent termination provisions on GPLv3-licensed works:
fr: D'autres textes dans la GPLv3 soulignent la m&ecirc;me politique. La clause sur les litiges de la section 10 a &eacute;t&eacute; ajout&eacute;e au troisi&egrave;me brouillon [NDT&nbsp;: Draft 3] de la GPLv3 en remplacement de certaines parties de la clause 7(b)(5) du brouillon pr&eacute;c&eacute;dent. Cette derni&egrave;re clause permettait d'&eacute;tablir deux cat&eacute;gories de causes de r&eacute;siliation de licence sur des &oelig;uvres sous GPLv3&nbsp;:
