Repository: gitGNU/gnu_www-fr
Catalog: licenses/lgpl-java.*.po
Languages: fr

source: The LGPL and Java
fr: La LGPL et Java

source: by <a href="mailto:licensing@fsf.org">David Turner</a>
fr: par <a href="mailto:licensing@fsf.org">David Turner</a>

source: This article was written in November 2004, when <a href="/licenses/old-licenses/lgpl-2.1.html">LGPLv2.1</a> was the most current version of the license. Since then, <a href="/licenses/lgpl-3.0.html">LGPLv3</a> has been published. The main points of this article remain true about LGPLv3, but some of the details, such as section numbers, have changed.
fr: Cet article a &eacute;t&eacute; &eacute;crit en novembre 2004, quand la <a href="/licenses/old-licenses/lgpl-2.1.html">LGPLv2.1</a> &eacute;tait la version la plus &agrave; jour de la licence. Depuis, la <a href="/licenses/lgpl-3.0.html">LGPLv3</a> a &eacute;t&eacute; publi&eacute;e. Les points principaux de cet article demeurent vrais avec la LGPLv3, mais certains d&eacute;tails, comme les num&eacute;ros de section, ont chang&eacute;.

source: It has always been the FSF's position that dynamically linking applications to libraries creates a single work derived from both the library code and the application code. The GPL requires that all derivative works be licensed under the GPL, an effect which can be described as &ldquo;hereditary.&rdquo; So, if an application links to a library licensed under the GPL, the application too must be licensed under the GPL. By contrast, libraries licensed under the GNU Lesser General Public License (LGPL) may be linked to proprietary applications.
fr: La position de la FSF a toujours &eacute;t&eacute; que la liaison dynamique d'applications &agrave; des biblioth&egrave;ques cr&eacute;e une &oelig;uvre unique d&eacute;riv&eacute;e &agrave; la fois du code de la biblioth&egrave;que et de celui de l'application. La GPL n&eacute;cessite que toutes les &oelig;uvres d&eacute;riv&eacute;es soient sous licence GPL, un effet qui peut &ecirc;tre d&eacute;crit comme &laquo;&nbsp;h&eacute;r&eacute;ditaire&nbsp;&raquo;. Donc, si une application est li&eacute;e &agrave; une biblioth&egrave;que sous licence GPL, l'application doit &ecirc;tre aussi sous licence GPL. En revanche, des biblioth&egrave;ques sous licence GNU Lesser General Public License (LGPL) peuvent &ecirc;tre li&eacute;es &agrave; des applications propri&eacute;taires.

source: In July of 2003, Slashdot published a story claiming that I had claimed that the LGPL did not function as intended in the case of Java. This story was based on a misunderstanding of a response to a question sent to licensing@gnu.org, and many attempts to clarify the issue in the Slashdot story did not get across. I have recieved numerous questions about the story since, via both licensing@gnu.org and personal email.
fr: En juillet 2003, Slashdot a publi&eacute; une histoire d&eacute;clarant que j'avais affirm&eacute; que la LGPL ne fonctionnait pas comme pr&eacute;vu dans le cas de Java. Cette histoire &eacute;tait bas&eacute;e sur une mauvaise compr&eacute;hension d'une r&eacute;ponse &agrave; une question envoy&eacute;e &agrave; licensing@gnu.org, et plusieurs tentatives pour clarifier le probl&egrave;me dans l'histoire de Slashdot n'ont pas abouti. J'ai re&ccedil;u de nombreuses questions sur cette histoire depuis, &agrave; la fois sur licensing@gnu.org et sur mon adresse personnelle.

source: FSF's position has remained constant throughout: the LGPL works as intended with all known programming languages, including Java. Applications which link to LGPL libraries need not be released under the LGPL. Applications need only follow the requirements in section 6 of the LGPL: allow new versions of the library to be linked with the application; and allow reverse engineering to debug this.
fr: La position de la FSF est demeur&eacute;e la m&ecirc;me depuis&nbsp;: la LGPL fonctionne comme pr&eacute;vu avec tous les langages de programmation connus, y compris Java. Les applications qui sont li&eacute;es &agrave; des biblioth&egrave;ques LGPL n'ont pas besoin d'&ecirc;tre publi&eacute;es sous licence LGPL. Les applications ne doivent suivre que les conditions de la section 6 de la LGPL&nbsp;: autoriser de nouvelles versions de la biblioth&egrave;que &agrave; &ecirc;tre li&eacute;es avec l'application&nbsp; et de permettre la r&eacute;tro-ing&eacute;nierie pour d&eacute;boguer cela.

source: The typical arrangement for Java is that each library an application uses is distributed as a separate JAR (Java Archive) file. Applications use Java's &ldquo;import&rdquo; functionality to access classes from these libraries. When the application is compiled, function signatures are checked against the library, creating a link. The application is then generally a derivative work of the library. So, the copyright holder for the library must authorize distribution of the work. The LGPL permits this distribution.
fr: L'arrangement typique pour Java est que chaque biblioth&egrave;que qu'une application utilise est distribu&eacute;e sous forme de fichier JAR s&eacute;par&eacute; (archive Java). Les applications utilisent la fonctionnalit&eacute; &laquo;&nbsp;import&nbsp;&raquo; de Java pour acc&eacute;der aux classes de ces biblioth&egrave;ques. quand l'application est compil&eacute;e, les signatures de fonction sont v&eacute;rifi&eacute;es par rapport &agrave; la biblioth&egrave;que, cr&eacute;ant un lien. L'applicationest alors g&eacute;n&eacute;ralement une &oelig;uvre d&eacute;riv&eacute;e de la biblioth&egrave;que. Donc, le d&eacute;tenteur du copyright de la biblioth&egrave;que doit autoriser la distribution de l'&oelig;uvre. La LGPL permet cette distribution.

source: If you distribute a Java application that imports LGPL libraries, it's easy to comply with the LGPL. Your application's license needs to allow users to modify the library, and reverse engineer your code to debug these modifications. This doesn't mean you need to provide source code or any details about the internals of your application. Of course, some changes the users may make to the library may break the interface, rendering the library unable to work with your application. You don't need to worry about that&mdash;people who modify the library are responsible for making it work.
fr: Si vous distribuez une application Java qui importe des biblioth&egrave;ques sous LGPL, il est facile de se conformer &agrave; la LGPL. La licence de votre application doit autoriser les utilisateurs &agrave; modifier la biblioth&egrave;que et &agrave; faire de la r&eacute;tro-ing&eacute;nierie de votre code pour d&eacute;boguer ces modifications. Cela ne signifie pas que vous devez fournir le code source ou des d&eacute;tails sur le fonctionnement interne de votre appplication. Bien s&ucirc;r, certains changements que peuvent faire les utilisateurs peuvent casser l'interface, rendant la biblioth&egrave;que inutilisable pour fonctionner avec votre application. Vous n'avez pas &agrave; vous inqui&eacute;ter de cela (les personnes qui modifient la biblioth&egrave;que sont responsables de son fonctionnement).

source: When you distribute the library with your application (or on its own), you need to include source code for the library. But if your application instead requires users to obtain the library on their own, you don't need to provide source code for the library.
fr: Quand vous distribuez la biblioth&egrave;que avec votre application (ou s&eacute;par&eacute;ment), vous devez inclure le code source de la biblioth&egrave;que. Mais si votre application n&eacute;cessite que les utilisateurs doivent obtenir la biblioth&egrave;que par leurs propres moyens, vous n'avez pas besoin de fournir le code source de la biblioth&egrave;que.

source: The only difference between Java and C from the LGPL's perspective is that Java is an object-oriented language, supporting inheritance. The LGPL contains no special provisions for inheritance, because none are needed. Inheritance creates derivative works in the same way as traditional linking, and the LGPL permits this type of derivative work in the same way as it permits ordinary function calls.
fr: La seule diff&eacute;rence entre Java et C du point de vue de la LGPL est que Java est un langage orient&eacute; objet et g&eacute;rant l'h&eacute;ritage. La LGPL ne contient pas de clauses sp&eacute;ciales pour l'h&eacute;ritage, car aucune n'est n&eacute;cessaire. L'h&eacute;ritage cr&eacute;e une &oelig;uvre d&eacute;riv&eacute;e de la m&ecirc;me mani&egrave;re que la liaison traditionnelle, et la LGPL permet ce type d'&oelig;uvre d&eacute;riv&eacute;e de la m&ecirc;me mani&egrave;re qu'elle permet les appels de fonction ordinaires.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
