Repository: gitGNU/gnu_www-fr
Catalog: licenses/licenses.*.po
Languages: fr

source: Copyleft also helps programmers who want to contribute <a href="/software/software.html#HelpWriteSoftware">improvements</a> to <a href="/philosophy/free-sw.html">free software</a> get permission to do that. These programmers often work for companies or universities that would do almost anything to get more money. A programmer may want to contribute her changes to the community, but her employer may want to turn the changes into a proprietary software product.
fr: Le copyleft aide les programmeurs qui souhaitent contribuer &agrave; <a href="/software/software.fr.html#HelpWriteSoftware">am&eacute;liorer</a> les <a href="/philosophy/free-sw.fr.html">logiciels libres</a> &agrave; obtenir la permission de le faire. En effet, ces programmeurs travaillent souvent pour les entreprises ou pour les universit&eacute;s et celles-ci feraient presque n'importe quoi pour obtenir de l'argent. Si un programmeur ou une programmeuse d&eacute;sire contribuer &agrave; l'&oelig;uvre commune, il se peut que son employeur veuille au contraire tirer parti de ce travail par la vente d'une licence de logiciel propri&eacute;taire.

source: When we explain to the employer that it is illegal to distribute the improved version except as free software, the employer usually decides to release it as free software rather than throw it away.
fr: Quand nous expliquons &agrave; l'employeur qu'il est ill&eacute;gal de redistribuer la version am&eacute;lior&eacute;e autrement que sous la forme d'un logiciel libre, ce qui se passe habituellement c'est que l'employeur pr&eacute;f&egrave;re tout de m&ecirc;me le publier comme logiciel libre plut&ocirc;t que de tout jeter.

source: To copyleft a program, we first state that it is copyrighted; then we add distribution terms, which are a legal instrument that gives everyone the rights to use, modify, and redistribute the program's code <em>or any program derived from it</em> but only if the distribution terms are unchanged. Thus, the code and the freedoms become legally inseparable.
fr: Pour placer un programme sous gauche d'auteur, nous commen&ccedil;ons par &eacute;noncer le droit de copie, puis nous y ajoutons les conditions de distribution. Celles-ci constituent un instrument juridique donnant &agrave; toute personne le droit d'utiliser, de modifier et de redistribuer le code du programme <em>ou de tout programme d&eacute;riv&eacute;</em>, sous r&eacute;serve que les conditions distribution demeurent inchang&eacute;es. Ainsi, le code et les libert&eacute;s attenantes deviennent juridiquement ins&eacute;cables.

source: Proprietary software developers use copyright to take away the users' freedom; we use copyright to guarantee their freedom. That's why we reverse the name, changing &ldquo;copyright&rdquo; into &ldquo;copyleft.&rdquo;
fr: Les d&eacute;veloppeurs de logiciels propri&eacute;taires utilisent le droit de copie pour priver les utilisateurs de leurs libert&eacute;s. De notre c&ocirc;t&eacute;, nous l'utilisons pour garantir ces libert&eacute;s. Voil&agrave; pourquoi nous avons invers&eacute; le mot &laquo;&nbsp;copyright&nbsp;&raquo; (&laquo;&nbsp;droit d'auteur&nbsp;&raquo;) en &laquo;&nbsp;copyleft&nbsp;&raquo; (&laquo;&nbsp;gauche d'auteur&nbsp;&raquo;).

source: Copyleft is a general concept; there are many ways to fill in the details. In the GNU Project, the specific distribution terms that we use are contained in the GNU General Public License, the GNU Lesser General Public License and the GNU Free Documentation License.
fr: Le copyleft est un concept d'une port&eacute;e g&eacute;n&eacute;rale et peut &ecirc;tre d&eacute;clin&eacute; de diverses mani&egrave;res. En ce qui concerne le projet GNU, les conditions sp&eacute;cifiques de distribution que nous utilisons sont &eacute;nonc&eacute;es par la Licence publique g&eacute;n&eacute;rale (GPL), la Licence publique g&eacute;n&eacute;rale amoindrie (LGPL) et la Licence de documentation libre (FDL) de GNU.

source: The appropriate license is included in many manuals and in each GNU source code distribution.
fr: Le texte de la licence appropri&eacute;e est pr&eacute;sent dans de nombreux manuels et dans chacune des distributions de code source du projet GNU.

source: The GNU GPL is designed so that you can easily apply it to your own program if you are the copyright holder. You don't have to modify the GNU GPL to do this, just add notices to your program which refer properly to the GNU GPL. Please note that you must use the entire text of the GPL, if you use it. It is an integral whole, and partial copies are not permitted. (Likewise for the LGPL and the FDL.)
fr: La GPL de GNU a &eacute;t&eacute; con&ccedil;ue pour que vous puissiez facilement l'appliquer &agrave; votre programme si vous en &ecirc;tes l'auteur. Il n'est pas n&eacute;cessaire de modifier le texte de la licence, il vous suffit d'ins&eacute;rer des notices faisant r&eacute;f&eacute;rence &agrave; la licence GPL. Attention, pour placer votre programme sous GPL vous devez imp&eacute;rativement utiliser le texte int&eacute;gral de la licence. Elle forme un tout, la copie partielle n'est pas autoris&eacute;e. (De m&ecirc;me pour la LGPL ou la FDL).

source: Using the same distribution terms for many different programs makes it easy to copy code between various different programs. Since they all have the same distribution terms, there is no need to think about whether the terms are compatible. The Lesser GPL includes a provision that lets you alter the distribution terms to the ordinary GPL, so that you can copy code into another program covered by the GPL.
fr: Le fait d'utiliser les m&ecirc;mes conditions de distribution pour de nombreux programmes diff&eacute;rents facilite la recopie de code entre divers programmes. En effet, si les termes de distribution sont identiques, on n'a plus besoin de se poser de questions sur la compatibilit&eacute; des conditions de distribution. La GPL amoindrie comprend une clause permettant de modifier les termes de distribution en faveur de la GPL normale, ce qui permet aussi de recopier du code dans un programme sous GPL.

source: Licenses for Other Types of Works
fr: Licences pour d'autres types d'&oelig;uvres

source: We believe that published software and documentation should be <a href="/philosophy/free-doc.html">free software and free documentation</a>. We recommend making all sorts of educational and reference works free also, using free documentation licenses such as the <a href="#FDL">GNU Free Documentation License</a> (GNU FDL).
fr: Nous pensons que le logiciel et la documentation publi&eacute;s devraient &ecirc;tre du <a href="#Intro">logiciel libre et de la documentation libre</a>. Nous recommandons que les &oelig;uvres de r&eacute;f&eacute;rence et les &oelig;uvres &eacute;ducatives soient libres &eacute;galement, en utilisant les licences de documentation libre telle que la <a href="#FDL">GNU Free Documentation License</a> (GNU FDL).

source: For essays of opinion and scientific papers, we recommend the simple &ldquo;verbatim copying only&rdquo; license that is used for this web page.
fr: Pour des essais d'opinion et des articles scientifiques, nous recommandons la simple licence &laquo;&nbsp;verbatim copying only&nbsp;&raquo; (&laquo;&nbsp;copie int&eacute;grale uniquement&nbsp;&raquo;) qui est utilis&eacute;e pour cette page Web.

source: We don't take the position that artistic or entertainment works must be free, but if you want to make one free, we recommend the <a href="http://artlibre.org/licence/lalgb.html">Free Art License</a>.
fr: Nous ne sommes pas convaincus que les &oelig;uvres artistiques ou de divertissement doivent &ecirc;tre libres, mais si vous voulez en rendre une libre, nous recommandonsla <a href="http://artlibre.org/licence/lalgb.html">Free Art License</a> (Licence Art libre).

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Odile Bénassy.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
