Repository: gitGNU/gnu_www-fr
Catalog: licenses/licenses.*.po
Languages: fr

source: Licenses - GNU GPL, GNU LGPL, GNU FDL, General Public License, Lesser General Public License, Free Documentation License, List of Free Software Licenses
fr: Licences - GNU GPL, GNU LGPL, GNU FDL, General Public License, Lesser General Public License, Free Documentation License, Liste des licences de logiciels libres

source: Licenses
fr: Licences

source: Published software should be <a href="/philosophy/free-sw.html">free software</a>. To make it free software, you need to release it under a free software license. We normally use the <a href="#GPL">GNU General Public License</a> (GNU GPL), but occasionally we use <a href="/licenses/license-list.html#SoftwareLicenses">other free software licenses</a>. We use only licenses that are compatible with the GNU GPL for GNU software.
fr: Les logiciels publi&eacute; devraient &ecirc;tre des <a href="/philosophy/free-sw.fr.html">logiciels libres</a>. Pour rendre un logiciel libre, vous devez le diffuser sous les termes d'une licence de logiciel libre. Nous utilisons normalement la <a href="#GPL">GNU General Public License</a> (GNU GPL), mais occasionnellement nous utilisons d'<a href="/licenses/license-list.fr.html#SoftwareLicenses">autres licences de logiciel libre</a>. Pour les logiciels du projet GNU, nous utilisons uniquement des licences compatibles avec la GNU GPL.

source: Documentation for free software should be <a href="/philosophy/free-doc.html">free documentation</a>, so that people can redistribute it and improve it along with the software it describes. To make it free documentation, you need to release it under a free documentation license. We normally use the <a href="#FDL">GNU Free Documentation License</a> (GNU FDL), but occasionally we use <a href="/licenses/license-list.html#DocumentationLicenses">other free documentation licenses</a>.
fr: La documentation pour les logiciels libres devraient &ecirc;tre de la <a href="/philosophy/free-doc.fr.html">documentation libre</a>, de fa&ccedil;on &agrave; que les gens puissent la redistribuer et l'am&eacute;liorer avec le logiciel qu'elle d&eacute;crit. Pour rendre une documentation libre, vous devez la diffuser sous les termes d'une licence de documentation libre. Nous utilisons normalement la <a href="#FDL">GNU Free Documentation License</a> (GNU FDL), mais occasionnellement nous utilisons d'<a href="/licenses/license-list.fr.html#DocumentationLicenses">autres licences de documentation libre</a>.

source: Our documentation licenses are currently being revised, and we welcome your comments on the proposed texts. Please visit <a href="http://gplv3.fsf.org">our license update site</a> to read the current drafts and participate in the process.
fr: La documentation de nos licences est en cours de r&eacute;vision et vos commentaires sur les textes propos&eacute;s sont les bienvenus. Veuillez visiter <a href="http://gplv3.fsf.org">notre site de mise &agrave; jour des licences</a> pour lire les projets en cours et participer au processus.

source: Common Resources for our Software Licenses
fr: Ressources communes pour nos licences logicielles

source: We have a number of resources to help people understand and use our various licenses:
fr: Nous avons beaucoup de documentations pour aider les gens à comprendre et utiliser nos diverses licences&nbsp;:

source: <a href="/licenses/gpl-faq.html">Frequently Asked Questions about the GNU licenses</a>
fr: <a href="/licenses/gpl-faq.fr.html">Questions fréquentes sur les licences GNU</a>

source: <a href="/licenses/gpl-howto.html">How to use GNU licenses for your own software</a>
fr: <a href="/licenses/gpl-howto.fr.html">Comment utiliser les licences GNU pour vos propres logiciels</a>

source: <a href="/licenses/gpl-violation.html">What to do if you see a violation of a GNU license</a>
fr: <a href="/licenses/gpl-violation.fr.html">Que faire si vous constatez une violation d'une licence GNU</a>

source: <a href="/philosophy/university.html">Releasing Free Software if you work at a university</a>
fr: <a href="/philosophy/university.fr.html">Publication de logiciels libres si vous travaillez dans une université</a>

source: <a href="/licenses/why-assign.html">Why the FSF gets copyright assignments from contributors</a>
fr: <a href="/licenses/why-assign.fr.html">Pourquoi la FSF obtient la cession des copyright de ses contributeurs</a>

source: <a href="/graphics/license-logos.html">GNU license logos</a> to use with your project
fr: <a href="/graphics/license-logos.fr.html">Logos des licences GNU</a> &agrave; utiliseravec votre projet

source: <a href="/licenses/license-list.html#LicensingMailingList">&lt;licensing@fsf.org&gt; mailing list</a> for general licensing help
fr: La <a href="/licenses/license-list.fr.html#LicensingMailingList">liste de diffusion &lt;licensing@fsf.org&gt; mailing list</a> pour de l'aide générale sur les licences

source: The GNU General Public License
fr: La Licence publique g&eacute;n&eacute;rale (GPL) de GNU

source: The GNU General Public License is often called the GNU GPL for short; it is used by most GNU programs, and by more than half of all free software packages. The latest version is version 3.
fr: La Licence publique g&eacute;n&eacute;rale de GNU (en anglais General Public License) est souvent appel&eacute;e de l'acronyme &laquo;&nbsp;GNU GPL&nbsp;&raquo; ou &laquo;&nbsp;GPL de GNU&nbsp;&raquo;. C'est la licence de la plupart des programmes GNU et de plus de la moiti&eacute; de l'ensemble des logiciels libres actuellement distribu&eacute;s. La dernière version est la version 3.

source: The GNU General Public License is available in these formats: <a href="/licenses/gpl.html">HTML</a>, <a href="/licenses/gpl.txt">plain text</a>, <a href="/licenses/gpl.odt">ODF</a>, <a href="/licenses/gpl.dbk">Docbook</a>, <a href="/licenses/gpl.texi">Texinfo</a>, and <a href="/licenses/gpl.tex">LaTeX</a>. These documents are not formatted for standalone publishing, and are intended to be included in another document.
fr: Le texte de la Licence Publique G&eacute;n&eacute;rale de GNU est disponible aux formats <a href="/licenses/gpl.html">HTML</a>, <a href="/licenses/gpl.txt">texte</a>, <a href="/licenses/gpl.odt">ODF</a>, <a href="/licenses/gpl.texi">Texinfo</a> et <a href="/licenses/gpl.tex">LaTeX</a>. Ces documents ne sont pas format&eacute;s pour &ecirc;tre publi&eacute;s isol&eacute;ment, et sont destin&eacute;s &agrave; &ecirc;tre inclus dans un autre document.

source: <a href="/licenses/quick-guide-gplv3.html">A Quick Guide to GPLv3</a>
fr: <a href="/licenses/quick-guide-gplv3.fr.html">Un guide rapide pour la GPLv3</a>

source: <a href="/licenses/old-licenses/old-licenses.html#GPL">Older versions of the GNU GPL</a>
fr: <a href="/licenses/old-licenses/old-licenses.fr.html#GPL">Anciennes versions de la GPL de GNU</a>

source: The GNU Lesser General Public License
fr: La Licence publique g&eacute;n&eacute;rale amoindrie (LGPL) de GNU

source: The GNU Lesser General Public License is used by a few (not by any means all) GNU libraries. The latest version is version 3.
fr: La Licence publique g&eacute;n&eacute;rale amoindrie de GNU est adopt&eacute;e par certaines biblioth&egrave;ques de composants (mais en aucun cas toutes). La dernière version est la version 3.

source: The GNU Lesser General Public License text is available in these formats: <a href="/licenses/lgpl.html">HTML</a>, <a href="/licenses/lgpl.txt">plain text</a>, <a href="/licenses/lgpl.dbk">Docbook</a>, and <a href="/licenses/lgpl.texi">Texinfo</a>. These documents are not formatted for standalone publishing, and are intended to be included in another document.
fr: Le texte de la Licence publique g&eacute;n&eacute;rale amoindrie de GNU est disponible aux formats <a href="/licenses/lgpl.html">HTML</a>, <a href="/licenses/lgpl.txt">texte</a>, <a href="/licenses/lgpl.dbk">Docbook</a> et <a href="/licenses/lgpl.texi">Texinfo</a>. Ces documents ne sont pas format&eacute;s pour &ecirc;tre publi&eacute;s isol&eacute;ment, et sont destin&eacute;s &agrave; &ecirc;tre inclus dans un autre document.

source: <a href="/licenses/why-not-lgpl.html">Why you shouldn't use the Lesser GPL for your next library</a>
fr: <a href="/licenses/why-not-lgpl.fr.html">Pourquoi il vaut mieux ne pas utiliser la LGPL pour votre prochaine biblioth&egrave;que de composants.</a>

source: <a href="/licenses/old-licenses/old-licenses.html#GPL">Older versions of the GNU LGPL</a>
fr: <a href="/licenses/old-licenses/old-licenses.fr.html#GPL">Anciennes versions de la GNU LGPL</a>

source: The GNU Affero General Public License
fr: La licence GNU Affero General Public

source: The GNU Affero General Public License is based on the GNU GPL, but has an additional term to allow users who interact with the licensed software over a network to receive the source for that program. We recommend that people consider using the GNU AGPL for any software which will commonly be run over a network. The latest version is version 3.
fr: La licence publique générale GNU Affero est basée sur la GNU GPL, mais a une clause additionnelle pour autoriser les utilisateurs qui inter-agissent avec le logiciel sous licence via un réseau de recevoir les sources de ce programme. Nous recommandons que les personnes envisagent d'utiliser la GNU AGPL pour tout logiciel exécuté sur un réseau. La dernière version est la version 3.

source: The GNU Affero General Public License text is available in these formats: <a href="/licenses/agpl.html">HTML</a>, <a href="/licenses/agpl.txt">plain text</a>, <a href="/licenses/agpl.dbk">Docbook</a>, <a href="/licenses/agpl.texi">Texinfo</a>, and <a href="/licenses/agpl.tex">LaTeX</a>. These documents are not formatted for standalone publishing, and are intended to be included in another document.
fr: Le texte de la licence publique générale GNU Affero est disponible au formats&nbsp;: <a href="/licenses/agpl.html">HTML</a>, <a href="/licenses/agpl.txt">texte brut</a>,<a href="/licenses/agpl.dbk">Docbook</a>, <a href="/licenses/agpl.texi">Texinfo</a> et <a href="/licenses/agpl.tex">LaTeX</a>. Ces documents ne sont pas formatés pour être publiés séparément et sont destinés à être inclus dans un autre document.

source: The GNU Free Documentation License
fr: La Licence de documentation libre (FDL) de GNU

source: The GNU Free Documentation License is a form of copyleft intended for use on a manual, textbook or other document to assure everyone the effective freedom to copy and redistribute it, with or without modifications, either commercially or non-commercially. The latest version is 1.2.
fr: La Licence de documentation libre de GNU est une forme de copyleft destin&eacute;e aux manuels, aux recueils de textes et autres documents. Son objectif est de garantir &agrave; tous la possibilit&eacute; effective de copier et de redistribuer librement le document avec ou sans modifications, et que ce soit ou non dans un but commercial. La dernière version est la version 1.2.

source: The GNU Free Documentation License text is available in these formats: <a href="/licenses/fdl.html">HTML</a>, <a href="/licenses/fdl.txt">plain text</a>, <a href="/licenses/fdl.xml">Docbook</a>, <a href="/licenses/fdl.texi">Texinfo</a>, and <a href="/licenses/fdl.tex">LaTeX</a> These documents are not formatted for standalone publishing, and are intended to be included in another document.
fr: Le texte de la Licence de documentation libre de GNU est disponible aux formats <a href="/licenses/fdl.html">HTML</a>, <a href="/licenses/fdl.txt">texte</a>, <a href="/licenses/fdl.xml">Docbook</a>, <a href="/licenses/fdl.texi">Texinfo</a> et <a href="/licenses/fdl.tex">LaTeX</a>. Ces documents ne sont pas format&eacute;s pour &ecirc;tre publi&eacute;s isol&eacute;ment, et sont destin&eacute;s &agrave; &ecirc;tre inclus dans un autre document.

source: <a href="/licenses/why-gfdl.html">Why publishers should use the GNU FDL</a>
fr: <a href="/licenses/why-gfdl.fr.html">Pourquoi les &eacute;diteurs devraient utiliser la FDL de GNU</a>

source: <a href="/licenses/fdl.html#SEC4">How to use the GNU FDL for your documentation</a>
fr: <a href="/licenses/fdl.html#SEC4">Comment utiliser la FDL de GNU pour vos documents</a>

source: <a href="/licenses/fdl-howto.html">Tips on using the GNU FDL</a>
fr: <a href="/licenses/fdl-howto.fr.html">Astuces pour l'utilisation de la FDL de GNU</a>

source: <a href="/licenses/fdl-howto-opt.html">How to use the optional features of the GNU FDL</a>
fr: <a href="/licenses/fdl-howto-opt.html">Comment utiliser les fonctionnalit&eacute;s suppl&eacute;mentaires de la FDL de GNU</a>

source: <a href="/licenses/old-licenses/old-licenses.html#FDL"> Older versions of the GNU FDL</a>
fr: <a href="/licenses/old-licenses/old-licenses.fr.html#FDL">Anciennes versions de la FDL de GNU</a>

source: License URLs
fr: URL des licences

source: When linking to our licenses, it's usually best to link to the latest version; hence the standard URLs such as <tt>http://www.gnu.org/licenses/gpl.html</tt> have no version number. Occasionally, however, you may want to link to a specific version of a given license. In those situations, you can use the following links [<a href="#urlskip">skip links</a>]:
fr: Lorsque vous faites un lien vers nos licences, il est habituellement pr&eacute;f&eacute;rable de le faire vers les derni&egrave;res versions&nbsp;; par cons&eacute;quent, les URL standards comme <tt>http://www.gnu.org/licenses/gpl.html</tt> n'ont pas de num&eacute;ro de version. Occasionnellement cependant, vous pourriez vouloir faire un lien vers une version sp&eacute;cifique d'une licence donn&eacute;e. Dans ces situations, vous pouvez utiliser les [<a href="#urlskip">liens</a>]&nbsp;:

source: <a href="http://www.gnu.org/licenses/gpl-3.0.html">GPLv3</a>, <a href="http://www.gnu.org/licenses/gpl-2.0.html">GPLv2</a>, <a href="http://www.gnu.org/licenses/gpl-1.0.html">GPLv1</a>
fr: <a href="http://www.gnu.org/licenses/gpl-3.0.html">GPLv3</a>, <a href="http://www.gnu.org/licenses/gpl-2.0.html">GPLv2</a>, <a href="http://www.gnu.org/licenses/gpl-1.0.txt">GPLv1</a>

source: <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU AGPLv3</a> (The <a href="http://www.affero.org/oagpl.html">Affero General Public License version 1</a> is not a GNU license, but it was designed to serve a purpose much like the GNU AGPL's.)
fr: <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU AGPLv3</a>

source: <a name="urlskip"></a>Stable links to each license's alternative formats are available on its respective page. Not every version of every license is available in every format. If you need one that is missing, please <a href="mailto:licensing@gnu.org">email us</a>.
fr: <a name="urlskip"></a>Les liens stables pour chaque format alternatif de licence sont disponibles sur leurs pages respectives. Toutes les versions de chaque licence ne sont pas forc&eacute;ment disponibles dans tous les formats. Si vous avez besoin d'un format manquant, veuillez <a href="mailto:licensing@gnu.org">nous &eacute;crire</a>.

source: See also the <a href="old-licenses/">old licenses page</a>.
fr: Consulter &eacute;galement la <a href="old-licenses/old-licenses.fr.html">page des anciennes licences</a>.

source: Unofficial Translations
fr: Traductions non officielles

source: Legally speaking, the original (English) version of the licenses is what specifies the actual distribution terms for GNU programs and others that use them. But to help people better understand the licenses, we give permission to publish translations into other languages provided that they follow our regulations for unofficial translations:
fr: Juridiquement parlant, la version originale - en anglais - des licences est celle qui d&eacute;crit exactement les conditions de distribution des programmes GNU. Cependant, pour aider &agrave; une meilleure compr&eacute;hension des licences, nous autorisons la publication de traductions dans d'autres langues, &agrave; condition que ces traductions respectent notre protocole pour les traductions non officielles.

source: <a href="/licenses/translations.html">List of unofficial translations</a>
fr: <a href="/licenses/translations.fr.html">Liste de traductions non officielles</a>

source: <a href="/licenses/translations.html#rules">How to create an unofficial translation</a>
fr: <a href="/licenses/translations.fr.html#rules">Comment cr&eacute;er une traduction non officielle</a>

source: Verbatim Copying and Distribution
fr: Copie et distribution conforme (verbatim)

source: The standard copyright notice for GNU webpages reads: <em><span class="highlight">Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice is preserved</span>.</em> Please note the following commentary by Eben Moglen:
fr: La notice de copyright standard pour les pages web de GNU est&nbsp;: <em><span class="highlight">Verbatim copying and distribution of this entire article are permitted worldwide without royalty in any medium, provided this notice is preserved</span>.</em> (en fran&ccedil;ais&nbsp;: <em><span class="highlight">La reproduction exacte et la distribution int&eacute;grale de cet article sont autoris&eacute;es dans le monde entier sans redevance et sur tous supports pourvu que la pr&eacute;sente notice soitpr&eacute;serv&eacute;e</span>.</em>). Noter le commentaire suivant d'Eben Moglen&nbsp;:

source: &ldquo;Our intention in using the phrase &lsquo;verbatim copying in any medium&rsquo; is not to require retention of page headings and footers or other formatting features. Retention of weblinks in both hyperlinked and non-hyperlinked media (as notes or some other form of printed URL in non-HTML media) is required.&rdquo;
fr: &laquo;&nbsp;Notre intention dans la phrase &laquo;&nbsp;verbatim copying in any medium&nbsp;&raquo; n'est pas d'obliger la r&eacute;tention des en-t&ecirc;tes et des pieds de page, ou d'autres mises en forme graphique. La r&eacute;tention des liens hypertextes &agrave; la fois sur les supports de type hypertextes ou non (tels que les notes ou les URL imprim&eacute;es dans des medias non-HTML) est requise.&nbsp;&raquo;

source: List of Free Software Licenses
fr: Liste des licences de logiciels libres

source: <a href="/licenses/license-list.html">List of Free Software Licenses</a>
fr: <a href="/licenses/license-list.fr.html">Liste des licences de logiciels libres</a>

source: If you are contemplating writing a new license, please contact the FSF by writing to <a href="mailto:licensing@fsf.org">&lt;licensing@fsf.org&gt;</a>. The proliferation of different free software licenses means increased work for users in understanding the licenses; we may be able to help you find an existing Free Software license that meets your needs.
fr: Si vous envisagez d'&eacute;crire une nouvelle licence, veuillez contacter la FSF en &eacute;crivant &agrave; <a href="mailto:licensing&#64;gnu.org">&lt;licensing&#64;gnu.org&gt;</a>. La prolif&eacute;ration de diff&eacute;rentes licences de logiciels libres implique un travail grandissant pour les utilisateurs dans la compr&eacute;hension des licences; nous pouvons vous aider &agrave; trouver une licence existante de logiciel libre qui r&eacute;ponde &agrave; vos besoins.

source: If that isn't possible, if you really need a new license, with our help you can ensure that the license really is a Free Software license and avoid various practical problems.
fr: Si ce n'est pas possible, si vous avez vraiment besoin d'une nouvelle licence, avec notre aide, vous pouvez vous assurer que la licence est vraiment une licence de logiciel libre et &eacute;viter divers probl&egrave;mes pratiques.

source: What Is Copyleft?
fr: Qu'entend-on par &laquo;&nbsp;Copyleft&nbsp;&raquo;, ou &laquo;&nbsp;gauche d'auteur&nbsp;&raquo;?

source: <a href="/copyleft/copyleft.html"><em>Copyleft</em></a> is a general method for making a program free software and requiring all modified and extended versions of the program to be free software as well.
fr: Le <a href="/copyleft/copyleft.fr.html"><em>Copyleft</em></a> est un cadre permettant de faire d'un programme un logiciel libre et d'exiger que les versions modifi&eacute;es ou &eacute;tendues deviennent elles aussi des logiciels libres.

source: The simplest way to make a program free is to put it in the <a href="/philosophy/categories.html#PublicDomainSoftware">public domain</a>, uncopyrighted. This allows people to share the program and their improvements, if they are so minded. But it also allows uncooperative people to convert the program into <a href="/philosophy/categories.html#ProprietarySoftware">proprietary software</a>. They can make changes, many or few, and distribute the result as a proprietary product. People who receive the program in that modified form do not have the freedom that the original author gave them; the middleman has stripped it away.
fr: Le moyen le plus simple pour faire d'un programme un logiciel libre est de le placer dans le <a href="/philosophy/categories.fr.html#PublicDomainSoftware">domaine public</a>, sans aucune licence de droit de copie. Une telle publication permet effectivement aux personnes bien intentionn&eacute;es de s'&eacute;changer le programme ainsi que d'&eacute;ventuelles am&eacute;liorations. Malheureusement elle permet aussi &agrave; des personnes &agrave; l'esprit peu coop&eacute;ratif de transformer le programme en <a href="/philosophy/categories.fr.html#ProprietarySoftware">logiciel propri&eacute;taire</a>. Ces personnes peuvent &eacute;crire des modifications, beaucoup de modifications, ou bien un petit peu, puis le distribuer en tant que produit propri&eacute;taire. Les gens qui re&ccedil;oivent le logiciel sous sa forme modifi&eacute;e ne disposent plus des libert&eacute;s que l'auteur leur avait donn&eacute;es &agrave; l'origine&nbsp;: un interm&eacute;diaire s'est interpos&eacute; et les a supprim&eacute;es.

source: In the <a href="/gnu/thegnuproject.html">GNU project</a>, our aim is to give <em>all</em> users the freedom to redistribute and change GNU software. If middlemen could strip off the freedom, we might have many users, but those users would not have freedom. So instead of putting GNU software in the public domain, we &ldquo;copyleft&rdquo; it. Copyleft says that anyone who redistributes the software, with or without changes, must pass along the freedom to further copy and change it. Copyleft guarantees that every user has freedom.
fr: En ce qui concerne le <a href="/gnu/thegnuproject.fr.html">projet GNU</a>, nous voulons garantir &agrave; <em>tous</em> les utilisateurs la possibilit&eacute; de redistribuer et de modifier les logiciels. Si des interm&eacute;diaires pouvaient supprimer ces libert&eacute;s, nous aurions peut-&ecirc;tre plus d'utilisateurs mais ces utilisateurs n'auraient pas les libert&eacute;s que nous voulons leur donner. Alors, au lieu de placer les logiciels GNU dans le domaine public, nous les mettons sous &laquo;&nbsp;gauche d'auteur&nbsp;&raquo;. La gauche d'auteur (copyleft) &eacute;nonce que quiconque redistribue le logiciel, avec ou sans modifications, doit transmettre aussi la libert&eacute; de copier et de modifier ce logiciel. Le copyleft est une garantie des libert&eacute;s de tous les utilisateurs.

source: Copyleft also provides an <a href="/philosophy/pragmatic.html">incentive</a> for other programmers to add to free software. Important free programs such as the GNU C++ compiler exist only because of this.
fr: Le copyleft constitue aussi un <a href="/philosophy/pragmatic.fr.html">moyen d'encourager</a> d'autres programmeurs &agrave; contribuer aux logiciels libres. D'importants programmes libres comme le compilateur GNU C++ n'existeraient pas sans cela.
