Repository: gitGNU/gnu_www-fr
Catalog: licenses/NYC_Seminars_Jan2004.*.po
Languages: fr

source: FSF Seminars in 2004
fr: Séminiares de la FSF en 2004

source: <big><span style="font-weight: bold;">FSF Offers Seminars </span></big><b>
fr: <big><span style="font-weight: bold;">La FSF propose des séminaires </span></big><b>

source: on<br /> Study and Analysis of the GPL and Legal Ethics in Free Software Licensing
fr: sur<br />l'&eacute;tude et l'analyse de la GPL et la ligne de conduite l&eacute;gale lors de la publication de logiciels sous licence libre.

source: <span lang="en-US">On January 20 and 21, 2004, the Free Software Foundation (FSF) will offer two day-long seminars on Free Software Licensing and the GNU GPL at Columbia Law School in New York. The two days will provide a detailed </span>
fr: <span lang="fr-FR">Les 20 et 21 janvier 2004, la Free Software Foundation (FSF) proposera deux s&eacute;minaires d'une journ&eacute;e &agrave; propos de la licence GNU CPL et de la diffusion de logiciels sous licence libre &agrave; la Columbia Law School de New York. Ces deux journ&eacute;es seront l'occasion de passer en revue </span>

source: <small>study and analysis of the GPL, review a few case studies and look at legal ethics in Free Software Licensing</small>
fr: <small>une analyse d&eacute;taill&eacute;e de la licence GPL, un passage en revue de quelques cas d'&eacute;tude et l'&eacute;tude d'un point de vue l&eacute;gal de la ligne de conduite &agrave; tenir de la publication de logiciels sous licence libre</small>

source: <span lang="en-US">. </span>
fr: <span lang="fr-FR">. </span>

source: <span lang="en-US">The seminars will be co-led by Daniel Ravicher, Senior Counsel to FSF and Bradley M. Kuhn, Executive Director of FSF. </span>
fr: <span lang="fr-FR"> Ces s&eacute;minaires seront co-anim&eacute;s par Daniel Ravicher, Conseiller S&eacute;nior aupr&egrave;s de la FSF, et par Bradley M. Kuhn, Directeur Ex&eacute;cutif de la FSF.</span>

source: <span lang="en-US"></span>
fr: <span lang="fr-FR"></span>

source: <span style="font-weight: bold;">&ldquo;Detailed Study and Analysis of GPL and LGPL&rdquo;</span>,<span style="font-weight: bold;"> </span>the seminar on January 20, will give a section-by-section explanation of the most popular Free Software copyright license, the GNU General Public License (GNU GPL), and will educate lawyers, software developers, managers and business people on how to use the GPL (and GPL'd software) successfully in a new Free Software business and in existing, successful enterprises.
fr: <span style="font-weight: bold;">&laquo;&nbsp;&Eacute;tude d&eacute;taill&eacute;e et analyse des licences GPL et LGPL&nbsp;&raquo;</span>&nbsp;: ce s&eacute;minaire, qui se tiendra le 20 janvier, fournira une explication de texte de la licence libre la plus populaire, &agrave; savoir la GNU GPL, section par section. Le s&eacute;minaire permettra de pr&eacute;senter aux avocats, aux d&eacute;veloppeurs logiciels, aux managers et aux d&eacute;cideurs la fa&ccedil;on d'utiliser correctement la GPL (et les logiciels sous licence GPL) &agrave; la fois dans des entreprises existantes et dans de nouveaux mod&egrave;les d'activit&eacute; fond&eacute;e sur le logiciel libre.

source: On January 21, FSF will offer <span style="font-weight: bold;">&ldquo;GPL Compliance Case Studies and Legal Ethics in Free Software Licensing&rdquo;</span>. Also a day-long seminar, which will present the details of five different GPL compliance cases handled by FSF's GPL Compliance Laboratory. Each case offers unique insights into problems that can arise when the terms of GPL are not properly followed, and how diplomatic negotiation between the violator and the copyright holder can yield positive results for both parties. This course also includes a unit on the ethical considerations for attorneys who want to represent clients that make use of or sell Free Software products.
fr: Le 21 janvier, la FSF proposera son s&eacute;minaire <span style="font-weight: bold;">&laquo;&nbsp;&Eacute;tude de cas de respect de la GPL et conduite &agrave; tenir d'un point de vue l&eacute;gal lors de la publication de logiciels sous licence libre&nbsp;&raquo;</span>. Il s'agit l&agrave; aussi d'un s&eacute;minaire d'une journ&eacute;e, qui pr&eacute;sentera tous les d&eacute;tails des cinq diff&eacute;rents cas de respect de la GPL trait&eacute;s par le &laquo;&nbsp;Compliance Lab&nbsp;&raquo; de la FSF. Chacun de ces cas est une occasion unique de voir concr&egrave;tement les probl&egrave;mes qui peuvent d&eacute;couler d'un respect inad&eacute;quat de la GPL, et d'illustrer les r&eacute;sultats positifs pour tous qui peuvent r&eacute;sulter de n&eacute;gociations diplomatiques entre les d&eacute;tenteurs des droits d'auteur et ceux qui violent ces droits. Ce cours contient aussi un module sur les consid&eacute;rations &eacute;thiques &agrave; destination des avocats qui souhaitent repr&eacute;senter des clients qui utilisent ou vendent des logiciels libres.

source: To register for the seminar, please download the <a href="/licenses/RegistrationForm.pdf">registration form</a>, fill it in and fax it to FSF.
fr: Pour s'inscrire &agrave; ce s&eacute;minaire, merci de t&eacute;l&eacute;charger le <a href="RegistrationForm.pdf">formulaire d'inscription</a>, le remplir et le faxer &agrave; la FSF.

source: <span style="font-weight: bold;">Lunchtime Speaker: </span><a href="http://emoglen.law.columbia.edu/">Eben Moglen</a> will be the lunchtime speaker. Professor Moglen is Professor of Law and Legal History at Columbia Law School and one of the nation's foremost scholars on copyright, patents and the proposed &ldquo;Broadcast Flag&rdquo;. He is also a member of FSF's Board of Directors and the foundation's General Counsel. Professor Moglen has also written extensively on the SCO vs IBM lawsuit. <br /> <br />
fr: <span style="font-weight: bold;">Intervenant de midi&nbsp;:</span> <a href="http://emoglen.law.columbia.edu/">Eben Moglen</a> interviendra &agrave; l'heure du d&eacute;jeuner. Le professeur Moglen est professeur de droit et d'histoire du droit &agrave; la Columbia Law School et est l'une des sommit&eacute;s des &Eacute;tats-Unis sur les droits d'auteurs, les brevets et la proposition de &laquo;&nbsp;broadcast flag&nbsp;&raquo; [NdT&nbsp;: Proposition d'avoir un signal emp&ecirc;chant d'enregistrer certains contenus diffus&eacute;s &agrave; la t&eacute;l&eacute;vision]. Il est aussi membre du conseil d'administration de la FSF et consultant g&eacute;n&eacute;ral [NdT&nbsp;: General Consultant] de la fondation. Le professeur Moglen a aussi publi&eacute; de nombreux &eacute;crits sur le proc&egrave;s entre SCO et IBM.<br /><br />

source: <span style="font-weight: bold;">&ldquo;Detailed Study and Analysis of GPL and LGPL&rdquo;<br /> </span>
fr: <span style="font-weight: bold;">&laquo;&nbsp;&Eacute;tude d&eacute;taill&eacute;e et analyse des licences GPL et LGPL&nbsp;&raquo;<br /></span>

source: <span lang="en-US">
fr: <span lang="fr-FR">

source: January 20, 9 am to 6 pm<br />
fr: 20 janvier, de 9h &agrave; 18h<br />

source: <span style="font-style: italic;">Prerequisites:</span> Attendees should have a general familiarity with software development processes. A basic understanding of how copyright law typically applies to software is also helpful.
fr: <span style="font-style: italic;">Connaissances requises&nbsp;:</span> Les participants doivent &ecirc;tre familiers des processus de d&eacute;veloppement logiciel. Une connaissance basique des usages typiques des droits d'auteur aux logiciels est aussi recommand&eacute;e.

source: <span style="font-style: italic;">Audience: </span>The course is of most interest to lawyers, software developers and managers who run (or have clients who run) software businesses that modify and/or redistribute software under terms of the GNU GPL or LGPL, or who wish to make use of existing GPL'd and LGPL'd software in their enterprise.
fr: <span style="font-style: italic;">Public cibl&eacute;&nbsp;:</span> Ce cours sera des plus int&eacute;ressants pour les avocats, les d&eacute;veloppeurs logiciels aux d&eacute;veloppeurs logiciels, aux managers qui dirigent des entreprises qui modifient et/ou redistribuent des logiciels sous les licences GNU GPL ou LGPL, aux managers dont les clients dirigent de telles entreprises et enfin aux managers qui souhaitent utiliser des logiciels sous licence GPL ou LGPL au sein de leur entreprise.

source: The course will include the topics listed below, along with ample time for questions and discussions.
fr: Ce cours abordera les sujets suivants, en plus de laisser beaucoup de temps aux questions et aux discussions&nbsp;:

source: * Free Software Principles and the Free Software Definition<br /> * Preamble of the GNU General Public License (GPL)<br /> * GPL, Section 0: Definitions, etc.<br /> * GPL, Section 1: Grant for Verbatim Source Copying<br /> * Derivative Works: Statute and Case Law<br /> * GPL, Section 2: Grants for Source Derivative Works<br /> * GPL, Section 3: Grants for Creating Binary Derivative Works<br /> * The Implied Patent Grant in GPL<br /> * GPL, Section 4: Termination of License<br /> * GPL, Section 5: Acceptance of License<br /> * GPL, Section 6: Prohibition on Further Restrictions<br /> * GPL, Section 7: Conflicts with other Agreements or Orders<br /> * GPL, Section 8: International Licensing Issues<br /> * GPL, Section 9: FSF as GPL's Stewards<br /> * GPL, Section 10: Copyright Holder's Exceptions to GPL<br /> * GPL, Section 11: Disclaimer of Warranties<br /> * GPL, Section 12: Limitation of Liability<br /> * Lesser General Public License (LGPL)<br />
fr: * Principes et d&eacute;finition du logiciel libre<br />* Pr&eacute;ambule de la licence GNU GPL<br />* GPL, Section 0&nbsp;: D&eacute;finitions, etc.<br />* GPL, Section 1&nbsp;: Cession des droits pour la copie conforme de la source<br />* Travaux d&eacute;riv&eacute;s&nbsp;: Loi et &eacute;tude de cas l&eacute;gale<br/>* GPL, Section 2&nbsp;: Cession des droits pour les &oelig;uvres d&eacute;riv&eacute;es sous forme de source<br />* GPL, Section 3&nbsp;: Cession des droits pour les &oelig;uvres d&eacute;riv&eacute;es sous forme de binaires<br />* La cession tacite de brevet incluse dans la GPL<br />* GPL, Section 4&nbsp;: Résiliation de la licence<br />* GPL, Section 5&nbsp;: Acceptation de la licence<br />* GPL, Section 6&nbsp;: Interdiction de restrictions suppl&eacute;mentaires<br />* GPL, Section 7&nbsp;: Conflits avec d'autres accords ou d&eacute;cisions de justice<br />* GPL, Section 8&nbsp;: Licence &agrave; l'international<br />* GPL, Section 9&nbsp;: La FSF en tant qu'assistante de la GPL<br />* GPL, Section 10&nbsp;: Exceptions &agrave; la GPL pour les d&eacute;tenteurs de droits d'auteur<br />* GPL, Section 11&nbsp;: D&eacute;gagement de responsabilit&eacute; concernant les garanties<br />* GPL, Section 12&nbsp;: Limitation de responsabilit&eacute;<br />* La licence LGPL<br />

source: For more details, please visit <a href="/licenses/200104_seminar.html"> http://www.gnu.org/licenses/200104_seminar.html.</a> <br />
fr: Pour plus de d&eacute;tails, veuillez visiter <a href="/licenses/200104_seminar.fr.html"> http://www.gnu.org/licenses/200104_seminar.fr.html.</a> <br />

source: <span style="font-weight: bold;">&ldquo;GPL Compliance Case Studies and Legal Ethics in Free Software Licensing&rdquo;<br /> </span>
fr: <span style="font-weight: bold;">&laquo;&nbsp;&Eacute;tude de cas de respect de la GPL et conduite &agrave; tenir d'un point de vue l&eacute;gal lors de la publication de logiciels sous licence libre&nbsp;&raquo;<br /> </span>

source: January 21, 9 am to 6 pm<br />
fr: 21 janvier, de 9h &agrave; 18h<br />

source: <span style="font-style: italic;">Prerequisites:</span> Attendees should have successfully completed the course, a <span style="font-style: italic;">Detailed</span><span style="font-style: italic;"> Study and Analysis of GPL and LGPL</span>, as the material from that course forms the building blocks for this material, or have attended a previous <span style="font-style: italic;">Free Software Licensing and the GNU GPL Seminar</span>.<span style="font-style: italic;"></span>
fr: <span style="font-style: italic;">Connaissances requises&nbsp;:</span> Les participants doivent avoir suivi le cours &laquo;&nbsp;<span style="font-style: italic;">&Eacute;tude d&eacute;taill&eacute;e et analyse des licences GPL et LGPL</span>&nbsp;&raquo;, dans la mesure o&ugrave; les &eacute;l&eacute;ments de ce cours-ci seront suppos&eacute;s acquis, ou alors les participants doivent avoir particip&eacute; &agrave; une pr&eacute;c&eacute;dente s&eacute;ance de ce cours, lors de pr&eacute;c&eacute;dents s&eacute;minaires.</span>

source: <span style="font-style: italic;">Audience:</span> The course is of most interest to lawyers who have clients or employers that deal with Free Software on a regular basis. However, technical managers and executives whose businesses use or distribute Free Software will also find the course very helpful.
fr: <span style="font-style: italic;">Public cibl&eacute;&nbsp;:</span> Ce cours sera des plus int&eacute;ressants pour les avocats qui ont des clients ou des employeurs qui ont r&eacute;guli&egrave;rement &agrave; faire &agrave; des logiciels libres. Toutefois, des managers f&eacute;rus de techniques et les dirigeants d'entreprises qui utilisent ou distribuent des logiciels libres trouveront aussi un grand int&eacute;r&ecirc;t &agrave; ce cours.

source: GPL Compliance Case Studies:
fr: &Eacute;tude de cas de respect de la licence GPL&nbsp;:

source: * Overview of FSF's GPL Compliance Lab
fr: * Pr&eacute;sentation succincte du &laquo;&nbsp;GPL Compliance Lab&nbsp;&raquo; de la FSF

source: * GPL Violation Case Study A<br />
fr: * &Eacute;tude de cas de violation de la licence GPL, cas A<br />

source: - Explains how FSF deals with sometimes belligerent violators.
fr: - Explication de la d&eacute;marche de la FSF &agrave; l'encontre de certains violateurs de la licence.

source: * GPL Violation Case Study B<br />
fr: * &Eacute;tude de cas de violation de la licence GPL, cas B<br />

source: - Explains how smoothly violations can be resolved and the process that an otherwise friendly violator can expect.<br />
fr: - D&eacute;monstration du fait que les violations peuvent &ecirc;tre r&eacute;gl&eacute;es tr&egrave;s facilement et pr&eacute;sentation de la d&eacute;marche habituelle de la FSF &agrave; l'encontre d'un violateur de bonne volont&eacute;.<br />

source: * GPL Violation Case Study C<br />
fr: * &Eacute;tude de cas de violation de la licence GPL, cas C<br />

source: - Problems faced regarding kernel modules for device drivers for government-regulated hardware, and cases where both an upstream provider and a downstream distributor are in violation on separate matters.<br />
fr: - Illustration des probl&egrave;mes concernant les modules du noyau pour leur utilisation dans des drivers d'un &eacute;quipement soumis &agrave; r&eacute;gulation, et exemples o&ugrave; un fournisseur en amont et un distributeur en aval sont tous deux en violation de la licence, sur des questions distinctes.<br />

source: * GPL Violation Case Study D<br />
fr: * &Eacute;tude de cas de violation de la licence GPL, cas D<br />

source: - Violations from a company committed to doing Free Software but has occasional GPL violations or near-violations.<br />
fr: - Violations par une entreprise impliqu&eacute;e dans le logiciel libre, mais qui viole parfois la licence GPL, et qui est tr&egrave;s proche de la violer d'autres fois.<br />

source: * Good Practices for GPL Compliance<br /><br />
fr: * Bonnes pratiques pour respecter la licence GPL<br /><br />

source: Ethical Considerations for the Attorney Practicing Free Software
fr: Consid&eacute;rations &eacute;thiques pour l'avocat d&eacute;fendant les logiciels libres

source: * Part I: Representing Free Software Clients<br /> * Part II: Practicing Free Software<br /> * Part III: More General Ethical Considerations Relevant to Free Software<br />
fr: * Partie I&nbsp;: Repr&eacute;senter des clients issus du logiciel libre<br />* Partie II&nbsp;: Exercer dans le cadre des logiciels libres<br />* Partie III&nbsp;: Consid&eacute;rations &eacute;thiques plus g&eacute;n&eacute;rales &agrave; propos des logiciels libres<br />

source: For more details, please visit <a href="/licenses/210104_seminar.html"> http://www.gnu.org/licenses/210104_seminar.html</a>.
fr: Pour plus de d&eacute;tails, veuillez visiter <a href="/licenses/210104_seminar.fr.html"> http://www.gnu.org/licenses/210104_seminar.fr.html</a>.

source: <br /> <span style="font-weight: bold;">Pricing (Book by December 24, 2003 for </span><span style="font-weight: bold;">early registration discount):</span><br /> <br />
fr: <br /><span style="font-weight: bold;">Prix (Inscrivez-vous d'ici le 24 d&eacute;cembre 2003 afin d'obtenir la </span><span style="font-weight: bold;">r&eacute;duction des premiers inscrits)&nbsp;:</span><br /><br />

source: Both Courses: $875 for registrations on or before December 24, 2003 and $975 after December 24<br />
fr: Les deux cours&nbsp;: 875$ pour les inscriptions d'ici le 24 d&eacute;cembre 2003 et 975$ apr&egrave;s<br />

source: First Course Only: $495 for registrations on or before December 24, 2003 and $595 after December 24<br /> <br />
fr: Seulement le premier cours&nbsp;: 495$ pour les inscriptions d'ici le 24 d&eacute;cembre 2003 et 595$ apr&egrave;s<br /><br />

source: Financial Aid Policy:
fr: Soutien financier&nbsp;:

source: Applicants with annual incomes of up to $15,000 are entitled to a 75% discount. People with incomes between $15,000 and $30,000 receive a 50% discount. Any member of the judiciary, academics or attorneys from non-profit organizations receive a 10% discount. If you fall within one of these categories, please contact John at <a href="mailto:johns@fsf.org">&lt;johns@fsf.org&gt;</a> or Ravi at <a href="mailto:ravi@fsf.org">&lt;ravi@fsf.org&gt;</a><span style="text-decoration: none;">
fr: Les inscrits dont les revenus annuels sont inf&eacute;rieurs &agrave; 15&nbsp;000$ ont droit &agrave; une r&eacute;duction de 75% des co&ucirc;ts d'inscription. Ceux dont les revenus sont entre 15&nbsp;000$ et 30&nbsp;000$ ont droit &agrave; une r&eacute;duction de 50%. Tout membre des instances judiciaires ou universitaires ainsi que les avocats d'organisations non gouvernementales ont droit &agrave; une r&eacute;duction de 10%. Si vous rentrez dans une de ces cat&eacute;gories, veuillez contacter John &agrave; <a href="mailto:johns@fsf.org">johns@fsf.org</a> ou Ravi &agrave; <a href="mailto:ravi@fsf.org">ravi@fsf.org</a><span style="text-decoration: none;">

source: or by phone at 617.620.9640.
fr: ou par t&eacute;l&eacute;phone au +1&nbsp;617&nbsp;620&nbsp;9640.

source: <br /> <br /> To register for the seminar, please download the <a href="/licenses/RegistrationForm.pdf">registration form</a>, fill it in and fax it to FSF.<br /> <br />
fr: <br /> <br />Pour vous inscrire au s&eacute;minaire, merci de t&eacute;l&eacute;charger le <a href="/licenses/RegistrationForm.pdf">formulaire d'inscription</a>, de le remplir et de le faxer &agrave; la FSF.<br /><br />

source: <span style="font-weight: bold;">CLE Credits: </span>Attorneys who successfully complete
fr: <span style="font-weight: bold;">Cr&eacute;dits CLE&nbsp;: </span>Les avocats qui auront valid&eacute; le cours

source: <span style="font-weight: bold;">&ldquo;Detailed Study and Analysis of GPL and LGPL&rdquo; </span>on
fr: <span style="font-weight: bold;">&laquo;&nbsp;&Eacute;tude d&eacute;taill&eacute;e et analyse des licences GPL et LGPL&nbsp;&raquo;</span> le

source: January 20,
fr: 20 janvier,

source: will be entitled to 7 New York Transitional CLE credits. Those who complete
fr: auront droit &agrave; 7 cr&eacute;dits &laquo;&nbsp;New&nbsp;York Transitional CLE&nbsp;&raquo;. Ceux qui auront valid&eacute; l'

source: <span style="font-weight: bold;">&ldquo;GPL Compliance Case Studies and Legal Ethics in Free Software Licensing&rdquo; </span>on
fr: <span style="font-weight: bold;">&laquo;&nbsp;&Eacute;tude de cas de respect de la GPL et conduite &agrave; tenir d'un point de vue l&eacute;gal lors de la publication de logiciels sous licence libre&nbsp;&raquo;</span> le

source: January 21,
fr: 21 janvier,

source: will be entitled to a total of 7.5 New York Transitional CLE credits, 3 in the area of Professional Practice and 4.5 toward the Ethics and Professionalism requirments.<br />
fr: auront droit &agrave; 7,5 cr&eacute;dits &laquo;&nbsp;New&nbsp;York Transitional CLE&nbsp;&raquo;, r&eacute;partis en 3 cr&eacute;dits dans le domaine de la pratique professionnelle et 4,5 cr&eacute;dits dans le domaine des pr&eacute;-requis en terme d'&eacute;thique et de professionnalisme.<br />

source: Companies that have signed up as Corporate Patrons of FSF receive two complimentary seats at the seminar and reduced rates for additional participants. Please contact patron@fsf.org for more details. You can find out more about the Corporate Patron Program at <a href="http://patron.fsf.org/"> http://patron.fsf.org<span style="text-decoration: none;">.</span></a><br />
fr: Les entreprises qui se seront inscrites en tant que m&eacute;c&egrave;nes de la FSF [NdT&nbsp;: Corporate Patrons of FSF] recevront deux places suppl&eacute;mentaires au s&eacute;minaire ainsi que des r&eacute;ductions sur les frais d'inscription pour tout participant suppl&eacute;mentaire. Veuillez contacter patron@fsf.org pour plus de d&eacute;tails au sujet de ce programme de m&eacute;c&eacute;nat &agrave; <a href="http://patron.fsf.org/">http://patron.fsf.org<span style="text-decoration: none;">.</span></a><br />

source: Both days of the seminar will be held at Columbia Law School in New York. Directions will be sent following registration. For more information, please contact Ravi Khanna, FSF's Director of Communication at <a href="mailto:ravi@fsf.org">&lt;ravi@fsf.org&gt;</a> or by calling 1+617-620-9640.
fr: Les deux journ&eacute;es du s&eacute;minaire se tiendront &agrave; la Columbia Law School &agrave; New&nbsp;York. Les indications pour s'y rendre seront indiqu&eacute;es lors de l'inscription. Pour plus d'information, veuillez contacter le directeur de la communication de la FSF, Ravi Khanna, &agrave; <a href="mailto:ravi@fsf.org">ravi@fsf.org</a> ou par t&eacute;l&eacute;phone au +1&nbsp;617&nbsp;620&nbsp;9640.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.
