Repository: gitGNU/gnu_www-fr
Catalog: licenses/quick-guide-gplv3.*.po
Languages: fr

source: A Quick Guide to GPLv3 - GNU Project - Free Software Foundation (FSF)
fr: Guide rapide de la GPLv3 - GNU Project - Free Software Foundation (FSF)

source: A Quick Guide to GPLv3
fr: Guide rapide de la GPLv3

source: by <strong>Brett Smith</strong>
fr: par <strong>Brett Smith</strong>

source: [This article is also available in <a href="/licenses/quick-guide-gplv3.pdf">PDF</a> and <a href="/licenses/quick-guide-gplv3.tar.gz">reStructuredText</a> formats.]
fr: [Cet article est &eacute;galement disponible aux formats <a href="/licenses/quick-guide-gplv3.pdf">PDF</a> et <a href="/licenses/quick-guide-gplv3.tar.gz">reStructuredText</a>.]

source: The Foundations of the GPL
fr: Les fondements de la GPL

source: Nobody should be restricted by the software they use. There are four freedoms that every user should have:
fr: Personne ne devrait &ecirc;tre limit&eacute; par les logiciels qu'il utilise. Il y a quatre libert&eacute;s que tout utilisateur devrait avoir&nbsp;:

source: the freedom to use the software for any purpose,
fr: La libert&eacute; d'utiliser le logiciel pour n'importe quel usage,

source: the freedom to change the software to suit your needs,
fr: La libert&eacute; d'am&eacute;liorer le programme pour r&eacute;pondre &agrave; vos besoins,

source: the freedom to share the software with your friends and neighbors, and
fr: La libert&eacute; de redistribuer des copies &agrave; vos amis, voisins, &hellip;,

source: the freedom to share the changes you make.
fr: La libert&eacute; de redistribuer ces am&eacute;liorations.

source: When a program offers users all of these freedoms, we call it <a class="reference external" href="/philosophy/free-sw.html">free software</a>.
fr: Quand un programme offre &agrave; ses utilisateurs toutes ces libert&eacute;s, nous le qualifions de <a class="reference external" href="/philosophy/free-sw.fr.html">logiciel libre</a>.

source: Developers who write software can release it under the terms of the GNU GPL. When they do, it will be free software and stay free software, no matter who changes or distributes the program. We call this copyleft: the software is copyrighted, but instead of using those rights to restrict users like proprietary software does, we use them to ensure that every user has freedom.
fr: Les d&eacute;veloppeurs qui &eacute;crivent des logiciels peuvent les publier sous les termes de la licence GNU GPL. Ce faisant, leur logiciel sera libre et le restera, ind&eacute;pendamment de qui modifiera et distribuera ce logiciel. Nous appelons cela la &laquo;&nbsp;gauche d'auteur&nbsp;&raquo; [copyleft]&nbsp;: le logiciel est bien soumis au droit d'auteur, mais plut&ocirc;t que d'utiliser ces droits pour restreindre l'utilisation que peuvent en faire les utilisateurs (comme c'est le cas dans les logicielspropri&eacute;taires), nous utilisons ces droits d'auteur pour nous assurer que tous les utilisateurs ont ces libert&eacute;s.

source: We update the GPL to protect its copyleft from being undermined by legal or technological developments. The most recent version protects users from three recent threats:
fr: Nous mettons &agrave; jour la GPL afin d'emp&ecirc;cher la gauche d'auteur d'&ecirc;tre sap&eacute;e par des &eacute;volutions l&eacute;gales ou technologiques. La derni&egrave;re version prot&egrave;ge les utilisateurs contre trois dangers r&eacute;cents&nbsp;:

source: Tivoization: Some companies have created various different kinds of devices that run GPLed software, and then rigged the hardware so that they can change the software that's running, but you cannot. If a device can run arbitrary software, it's a general-purpose computer, and its owner should control what it does. When a device thwarts you from doing that, we call that tivoization.
fr: La &laquo;&nbsp;Tivoisation&nbsp;&raquo; [prononcer &laquo;&nbsp;Tivo&iuml;sation&nbsp;&raquo;]&nbsp;: Certaines entreprises ont cr&eacute;&eacute; diff&eacute;rents types d'&eacute;quipements qui font tourner des logiciels sous licence GPL, et ont ensuite rendu le mat&eacute;riel tel qu'elles peuvent changer les logiciels mais pas vous. Si un &eacute;quipement peut faire tourner un logiciel arbitrairement, cet &eacute;quipement est un ordinateur multi-usage. D&egrave;s lors, son propri&eacute;taire devrait pouvoir contr&ocirc;ler ce que fait cet &eacute;quipement. Quand un &eacute;quipement vous emp&ecirc;che de faire cela, nous appelons cela la &laquo;&nbsp;Tivoisation&nbsp;&raquo;.

source: Laws prohibiting free software: Legislation like the Digital Millennium Copyright Act and the European Union Copyright Directive make it a crime to write or share software that can break DRM (Digital Restrictions Mismanagement; see <a href="#neutralizing-laws-that-prohibit-free-software-but-not-forbidding-drm">below</a>). These laws should not interfere with the rights the GPL grants you.
fr: Des lois prohibant les logiciels libres&nbsp;: Certaines lois, comme la <acronym title="Digital Millennium Copyright Act">DMCA</acronym> aux &Eacute;tats-Unis ou l'<acronym title="European Union Copyright Directive">EUCD</acronym> [dont la loi <acronym title=" Droit d’auteur et droits voisins dans la société de l’information">DADVSI</acronym> est la transposition fran&ccedil;aise], ont criminalis&eacute; le fait d'&eacute;crire ou de distribuer des logiciels qui peuvent casser des mesures de m&eacute;gestion des droits num&eacute;riques (ou Digital Rights Mismanagement - DRM [jeu de mots avec Digital Rights Management], voir <a href="#neutralizing-laws-that-prohibit-free-software-but-not-forbidding-drm">ci-dessous</a>). Ces lois ne devraient pas interf&eacute;rer avec les droits que vous conf&egrave;re la licence GPL.

source: Discriminatory patent deals: Microsoft has recently started telling people that they will not sue free software users for patent infringement&mdash;as long as you get the software from a vendor that's paying Microsoft for the privilege. Ultimately, Microsoft is trying to collect royalties for the use of free software, which interferes with users' freedom. No company should be able to do this.
fr: Des accords discriminants autour des brevets&nbsp;: l'entreprise Microsoft a r&eacute;cemment commenc&eacute; &agrave; dire qu'elle n'intenterait pas de proc&egrave;s pour violation de copyright contre les utilisateurs de logiciels libres&hellip; &laquo;&nbsp;pour peu&nbsp;&raquo; qu'ils aient obtenu le logiciel d'un fournisseur qui paye Microsoft pour ce privil&egrave;ge. En fin de compte, Microsoft cherche &agrave; obtenir une r&eacute;tribution pour l'utilisation de logiciels libres, ce qui interf&egrave;re avec la libert&eacute; des utilisateurs. Aucune entreprise ne devrait &ecirc;tre en mesure de faire cela.

source: Version 3 also has a number of improvements to make the license easier for everyone to use and understand. But even with all these changes, GPLv3 isn't a radical new license; instead it's an evolution of the previous version. Though a lot of text has changed, much of it simply clarifies what GPLv2 said. With that in mind, let's review the major changes in GPLv3, and talk about how they improve the license for users and developers.
fr: La version 3 de la GNU GPL apporte aussi un certain nombre d'am&eacute;liorations quant &agrave; la lisibilit&eacute; et l'utilisation pour tout un chacun. Mais m&ecirc;me avec tous ces changements, la GPLv3 n'est pas une licence radicalement nouvelle&nbsp;; c'est plut&ocirc;t une &eacute;volution par rapport &agrave; la version pr&eacute;c&eacute;dente. Bien qu'une bonne partie du texte ait chang&eacute;, beaucoup de ces changements visent seulement &agrave; simplifier ce que la GPLv2 disait d&eacute;j&agrave;. En ayant cela &agrave; l'esprit, voyons ensemble les principaux changements dans la GPLv3 et en quoi ces changements am&eacute;liorent la licence pour les utilisateurs et les d&eacute;veloppeurs.

source: Neutralizing Laws That Prohibit Free Software &mdash; But Not Forbidding DRM
fr: Neutraliser les lois prohibant les logiciels libres, sans interdire les DRM

source: You're probably familiar with the Digital Restrictions Mismanagement (DRM) on DVDs and other media. You're probably also familiar with the laws that make it illegal to write your own tools to bypass those restrictions, like the Digital Millennium Copyright Act and the European Union Copyright Directive. Nobody should be able to stop you from writing any code that you want, and GPLv3 protects this right for you.
fr: Vous &ecirc;tes certainement au courant de l'existence de mesures de m&eacute;gestion des droits num&eacute;riques (Digital Rights Mismanagement - DRM) sur les DVD et d'autres m&eacute;dias. Vous &ecirc;tes sans doute aussi au courant des lois qui ont rendu ill&eacute;gale l'&eacute;criture de vos propres outils pour les contourner, comme par exemple les lois Digital Millennium Copyright Act aux &Eacute;tats-Unis ou la European Union Copyright Directive [dont la loi DADVSI est la transposition fran&ccedil;aise].Personne ne devrait pouvoir vous emp&ecirc;cher d'&eacute;crire le code que vous souhaitez &eacute;crire, et la GPLv3 prot&egrave;ge ce droit qui est le v&ocirc;tre.

source: It's always possible to use GPLed code to write software that implements DRM. However, if someone does that with code protected by GPLv3, section 3 says that the system will not count as an effective technological &quot;protection&quot; measure. This means that if you break the DRM, you'll be free to distribute your own software that does that, and you won't be threatened by the DMCA or similar laws.
fr: Il est toujours possible d'utiliser du code sous licence GPL pour &eacute;crire des programmes qui mettent en &oelig;uvre des &laquo;&nbsp;DRM&nbsp;&raquo;. En revanche, si quelqu'un le fait avec du code sous licence GPLv3, la section 3 de la licence stipule que le syst&egrave;me ne pourra &ecirc;tre consid&eacute;r&eacute; comme une mesure de protection effective. Ceci veut dire que si vous cassez le DRM, vous serez libres de distribuer ce logiciel et vous ne serez pas menac&eacute;s de sanctions du fait des lois DMCA, EUCD, DADVSI ou assimil&eacute;es.

source: As usual, the GNU GPL does not restrict what people do in software; it just stops them from restricting others.
fr: Comme toujours, la licence GNU GPL ne bride pas les gens dans les logiciels qu'ils font, elle les emp&ecirc;che juste de brider l'usage que les autres en font.

source: Protecting Your Right to Tinker
fr: Prot&eacute;ger votre droit de bricoler

source: Tivoization is a dangerous attempt to curtail users' freedom: the right to modify your software will become meaningless if none of your computers let you do it. GPLv3 stops tivoization by requiring the distributor to provide you with whatever information or data is necessary to install modified software on the device. This may be as simple as a set of instructions, or it may include special data such as cryptographic keys or information about how to bypass an integrity check in the hardware. It will depend on how the hardware was designed&mdash;but no matter what information you need, you must be able to get it.
fr: La Tivoisation est une dangereuse tentative visant &agrave; restreindre la libert&eacute; des utilisateurs&nbsp;: le droit de modifier votre logiciel devient caduc si aucun de vos ordinateurs ne vous le permet. La GPLv3 emp&ecirc;che la tivoisation en requ&eacute;rant du distributeur qu'il vous fournisse toutes les informations et toutes les donn&eacute;es n&eacute;cessaires pour installer des versions modifi&eacute;es sur l'&eacute;quipement. Cela peut &ecirc;tre aussi simple qu'un ensemble d'instructions, ou cela peut aller jusqu'&agrave; inclure des donn&eacute;es sp&eacute;ciales telles que des cl&eacute;s cryptographiques ou des informations sur la fa&ccedil;on de contourner un test d'int&eacute;grit&eacute; dans le mat&eacute;riel. Tout cela d&eacute;pend de la fa&ccedil;on dont le mat&eacute;riel est fait, mais quelle que soit l'information dont vous avez besoin, vous devez &ecirc;tre en mesure de l'obtenir.

source: This requirement is limited in scope. Distributors are still allowed to use cryptographic keys for any purpose, and they'll only be required to disclose a key if you need it to modify GPLed software on the device they gave you. The GNU Project itself uses GnuPG to prove the integrity of all the software on its FTP site, and measures like that are beneficial to users. GPLv3 does not stop people from using cryptography; we wouldn't want it to. It only stops people from taking away the rights that the license provides you&mdash;whether through patent law, technology, or any other means.
fr: Cette exigence a une port&eacute;e limit&eacute;e. Les distributeurs ont toujours le droit d'utiliser des cl&eacute;s cryptographiques quelle qu'en soit l'utilisation, et ils n'auront l'obligation de fournir une cl&eacute; que si elle vous est indispensable pour modifier les logiciels sous GPL sur l'&eacute;quipement en question. Le projet GNU lui-m&ecirc;me utilise GnuPG pour attester de l'int&eacute;grit&eacute; de tous les logiciels sur son site FTP, et ce type de mesures sont b&eacute;n&eacute;fiques pour l'utilisateur. La GPLv3 n'emp&ecirc;che pas les gens d'utiliser la cryptographie, et nous ne le voudrions pas. Elle se contente d'emp&ecirc;cher des gens de vous priver des droits que la licence vous accorde, que cette privation se fasse par le biais de la technologie, d'une loi sur les brevets ou de toute autre fa&ccedil;on.

source: Stronger Protection Against Patent Threats
fr: Une protection plus forte contre la menace des brevets

source: In the 17 years since GPLv2 was published, the software patent landscape has changed considerably, and free software licenses have developed new strategies to address them. GPLv3 reflects these changes too. Whenever someone conveys software covered by GPLv3 that they've written or modified, they must provide every recipient with any patent licenses necessary to exercise the rights that the GPL gives them. In addition to that, if any licensee tries to use a patent suit to stop another user from exercising those rights, their license will be terminated.
fr: Au cours des 17 ann&eacute;es &eacute;coul&eacute;es depuis la publication de la GPLv2, le paysage des brevets logiciels a consid&eacute;rablement &eacute;volu&eacute; et les licences des logiciels libres ont d&eacute;velopp&eacute;s de nouvelles strat&eacute;gies pour y r&eacute;pondre. La GPLv3 est, elle aussi, &agrave; l'image des ces changements. D&egrave;s que quelqu'un transf&egrave;re un logiciel couvert par la GPLv3 apr&egrave;s qu'il l'a cr&eacute;&eacute; ou modifi&eacute;, cette personne doit fournir &agrave; tous les destinataires les droits n&eacute;cessaires &agrave; l'exercice des droits que conf&egrave;rent la GPLv3. De plus, si jamais le b&eacute;n&eacute;ficiaire d'une licence cherche &agrave; engager un proc&egrave;s pour violation de copyright &agrave; l'encontre d'un autre utilisateur en vue de l'emp&ecirc;cher d'exercer ses droits issus de la GPLv3, la licence de l'attaquant sera r&eacute;voqu&eacute;e.

source: What this means for users and developers is that they'll be able to work with GPLv3-covered software without worrying that a desperate contributor will try to sue them for patent infringement later. With these changes, GPLv3 affords its users more defenses against patent aggression than any other free software license.
fr: Ce que cela signifie pour les utilisateurs et les d&eacute;veloppeurs est qu'ils pourront travailler avec des outils couverts par la GPLv3 sans se soucier d'&eacute;ventuels contributeurs d&eacute;sesp&eacute;r&eacute;s qui essayent plus tard d'intenter un proc&egrave;s pour violation de copyright. Avec ces changements, la GPLv3 accorde &agrave; ses utilisateurs plus de protection que n'importe quelle autre licence de logiciels libres contre les agressions faites par l'entremise de brevets.

source: Clarifying License Compatibility
fr: Clarifications autour des compatibilit&eacute;s entre licences

source: If you found some code and wanted to incorporate it into a GPLed project, GPLv2 said that the license on the other code was not allowed to have any restrictions that were not already in GPLv2. As long as that was the case, we said the license was GPL-compatible.
fr: Si vous avez trouv&eacute; des portions de code et si vous souhaitez les incorporez dans un projet sous licence GPL, la GPLv2 stipule que la licence de l'autre code ne devait pas comporter une quelconque restriction qui n'&eacute;tait pas d&eacute;j&agrave; pr&eacute;sente dans la GPLv2. Tant que c'&eacute;tait le cas, nous avons d&eacute;clar&eacute; la licence &laquo;&nbsp;compatible GPL&nbsp;&raquo;.

source: However, some licenses had requirements that weren't really restrictive, because they were so easy to comply with. For example, some licenses say that they don't give you permission to use certain trademarks. That's not really an additional restriction: if that clause wasn't there, you still wouldn't have permission to use the trademark. We always said those licenses were compatible with GPLv2, too.
fr: Toutefois, certaines licences avaient des limitations qui n'&eacute;taient pas sp&eacute;cialement restrictives, parce qu'elles &eacute;taient tr&egrave;s simples &agrave; respecter. Par exemple, certaines licences disent qu'elles ne vous permettent pas d'utiliser certaines marques. Ce n'est pas tant une clause restrictive&nbsp;: si cette clause n'&eacute;tait pas l&agrave;, vous n'auriez toujours pas le droit d'utiliser cette marque. Nous avons aussi toujours dit que ces licences &eacute;taient compatibles avec la GPLv2.

source: Now, GPLv3 explicitly gives everyone permission to use code that has requirements like this. These new terms should help clear up misunderstandings about which licenses are GPL-compatible, why that is, and what you can do with GPL-compatible code.
fr: Aujourd'hui, la GPLv3 donne explicitement droit &agrave; quiconque d'utiliser du code qui a des limitations comme celle-l&agrave;. Ces nouveaux termes de la licence devraient permettre de clarifier certaines incompr&eacute;hensions quant aux licences qui sont compatibles GPL, quant aux raisons pour cela et quant &agrave; ce que vous pouvez faire avec du code compatible GPL.

source: New Compatible Licenses
fr: Nouvelles licences compatibles

source: In addition to clarifying the rules about licenses that are already GPL-compatible, GPLv3 is also newly compatible with a few other licenses. The Apache License 2.0 is a prime example. Lots of great free software is available under this license, with strong communities surrounding it. We hope that this change in GPLv3 will foster more cooperation and sharing within the free software community. The chart below helps illustrate some common compatibility relationships between different free software licenses:
fr: En plus de ces clarifications concernant les r&egrave;gles autour de licences d&eacute;j&agrave; compatibles GPL, la GPLv3 est aussi compatible avec certaines nouvelles licences. La licence Apache 2.0 en est un parfait exemple. Pleins de logiciels libres de grande qualit&eacute; sont disponibles sous cette licence, avec des fortes communaut&eacute;s attach&eacute;es. Nous esp&eacute;rons que ces changements dans la GPLv3 nourriront plus de coop&eacute;ration et de partage au sein de la communaut&eacute; du logiciel libre. Ce diagramme illustre certaines des relations usuelles de compatibilit&eacute; entre diff&eacute;rentes licences de logiciels libres&nbsp;:

source: A chart illustrating compatibility relationships between different free software licenses. For details, see the FSF's license list page.
fr: Diagramme repr&eacute;sentant les relations de compatibilit&eacute;s entre les diff&eacute;rentes licences de logiciels libres.

source: Arrows pointing from one license to another indicate that the first license is compatible with the second. This is true even if you follow multiple arrows to get from one license to the other; so, for example, the ISC license is compatible with GPLv3. GPLv2 is compatible with GPLv3 if the program allows you to choose &quot;any later version&quot; of the GPL, which is the case for most software released under this license. This diagram is not comprehensive (see <a class="reference external" href="/licenses/license-list.html">our licenses page</a> for a more complete list of licenses compatible with GPLv2 and GPLv3), but plainly illustrates that GPLv3 is compatible with just about everything GPLv2 is, and then some.
fr: Les fl&egrave;ches pointant d'une licence &agrave; une autre indique que la premi&egrave;re licence est compatible avec la seconde. Ceci est vrai m&ecirc;me en suivant plusieurs fl&egrave;ches &agrave; la suite&nbsp;; donc, par exemple, la licence ISC est compatible avec la GPLv3. La GPLv2 est compatible avec la GPLv3 si le programme vous permet de choisir &laquo;&nbsp;n'importe quelle version ult&eacute;rieure&nbsp;&raquo; de la GPL, ce qui est le cas de la plupart des logiciels fournis sous cette licence. Ce diagramme n'est pas complet (se reporter &agrave; <a class="reference external" href="/licenses/license-list.html">notre page de licences</a> pour une liste plus compl&egrave;tes des licences compatibles avec la GPLv2 et la GPLv3) mais illustre au moins le fait que la GPLv3 est compatible avec &agrave; peu pr&egrave;s tout ce qui &eacute;tait compatible GPLv2.

source: The GNU Affero GPL version 3 has also been brought into the fold. The original Affero GPL was designed to ensure that all users of a web application would be able to receive its source. The GNU Affero GPL version 3 broadens this goal: it is applicable to all network-interactive software, so it will also work well for programs like game servers. The additional provision is also more flexible, so that if someone uses AGPLed source in an application without a network interface, they'll only have to provide source in the same sort of way the GPL has always required. By making these two licenses compatible, developers of network-interactive software will be able to strengthen their copyleft while still building on top of the mature body of GPLed code available to them.
fr: La licence GNU Affero GPL version 3 a aussi &eacute;t&eacute; int&eacute;gr&eacute;e dans la r&eacute;flexion. La licence initiale Affero GPL &eacute;tait destin&eacute;e &agrave; assurer aux utilisateurs d'une application web un acc&egrave;s &agrave; ses sources. L'Affero GPL version 3 &eacute;tend cet objectif&nbsp;: elle s'applique &agrave; tous les logiciels en r&eacute;seaux, donc elle s'applique bien aussi aux programmes comme les serveurs de jeux. Les termes suppl&eacute;mentaires sont aussi plus flexibles, donc si quelqu'un utilise des sources sous AGPL dans un programme sans interface r&eacute;seau, il n'aurait qu'&agrave; fournir les sources de la m&ecirc;me fa&ccedil;on que dans la GPL. En rendant les deux licences compatibles, les d&eacute;veloppeurs de logiciels seront en mesure de renforcer leur gauche d'auteur tout en capitalisant sur les portions de code m&ucirc;res &agrave; leur disposition sous licence GPL.

source: More Ways for Developers to Provide Source
fr: Plus de fa&ccedil;ons pour les d&eacute;veloppeurs de fournir les sources
