Repository: gitGNU/gnu_www-fr
Catalog: licenses/quick-guide-gplv3.*.po
Languages: fr

source: One of the fundamental requirements of the GPL is that when you distribute object code to users, you must also provide them with a way to get the source. GPLv2 gave you a few ways to do this, and GPLv3 keeps those intact with some clarification. It also offers you new ways to provide source when you convey object code over a network. For instance, when you host object code on a web or FTP server, you can simply provide instructions that tell visitors how to get the source from a third-party server. Thanks to this new option, fulfilling this requirement should be easier for many small distributors who only make a few changes to large bodies of source.
fr: Une des exigences fondamentales de la GPL est que quand vous distribuez du code compil&eacute; aux utilisateurs, vous devez aussi leur fournir une fa&ccedil;on d'obtenir les sources du code. La GPLv2 vous fournissait quelques fa&ccedil;ons de le faire, et la GPLv3 les laisse intacte avec quelques clarifications. La GPLv3 vous offre aussi de nouvelles fa&ccedil;on de fournir les sources quand vous transf&eacute;rez les codes compil&eacute;s via le r&eacute;seau. Par exemple, quand vous h&eacute;bergez du code compil&eacute; sur le web ou sur des serveurs FTP, vous pouvez tout simplement fournir des instructions pour indiquer aux visiteurs comment obtenir le code sourced'un serveur tiers. Gr&acirc;ce &agrave; cette nouvelle option, satisfaire &agrave; l'exigence de disponibilit&eacute; du code source devrait &ecirc;tre sensiblement plus facile pour bon nombre de petits distributeurs qui font seulement de petites modifications &agrave; des grands corpus de codes source.

source: The new license also makes it much easier to convey object code via BitTorrent. First, people who are merely downloading or seeding the torrent are exempt from the license's requirements for conveying the software. Then, whoever starts the torrent can provide source by simply telling other torrent users where it is available on a public network server.
fr: La nouvelle licence devrait aussi simplifier la transmission des codes compil&eacute;s via BitTorrent. Tout d'abord, les gens qui se contentent de t&eacute;l&eacute;charger ou de partager le torrent sont exempt&eacute;s des exigences de la licence pour cette transmission du logiciel. Ensuite, quiconque initie le torrent doit fournir la source simplement en disant aux autres utilisateurs du torrent sur quel serveur public elle est disponible.

source: These new options help keep the GPL in line with community standards for offering source, without making it harder for users to get.
fr: Ces nouvelles options aident &agrave; conserver la GPL en phase avec les usages de la communaut&eacute; concernant la mise &agrave; disposition des sources, sans rendre l'obtention de ces sources plus dure pour les utilisateurs.

source: Less Source to Distribute: New System Libraries Exception
fr: Moins de sources &agrave; distribuer&nbsp;: de nouvelles exceptions pour les biblioth&egrave;ques syst&egrave;mes

source: Both versions of the GPL require you to provide all the source necessary to build the software, including supporting libraries, compilation scripts, and so on. They also draw the line at System Libraries: you're not required to provide the source for certain core components of the operating system, such as the C library.
fr: Les deux versions de la GPL requi&egrave;rent que vous fournissiez toutes les sources n&eacute;cessaires &agrave; la construction du logiciel, y compris les biblioth&egrave;ques utilis&eacute;es, les scripts de compilation, etc. Elles d&eacute;finissent aussi la limite des biblioth&egrave;ques syst&egrave;mes&nbsp;: vous n'avez pas &agrave; fournir les codes sources de certains &eacute;l&eacute;ments de c&oelig;ur du syst&egrave;me d'exploitation, tels que les biblioth&egrave;ques C.

source: GPLv3 has adjusted the definition of System Library to include software that may not come directly with the operating system, but that all users of the software can reasonably be expected to have. For example, it now also includes the standard libraries of common programming languages such as Python and Ruby.
fr: La GPLv3 a ajust&eacute; la d&eacute;finition des biblioth&egrave;ques syst&egrave;mes pour y inclure les logiciels qui ne rentrent pas directement dans le syst&egrave;med'exploitation, mais dont on peut raisonnablement attendre que tous les utilisateurs du logiciel les aient. Par exemple, cela inclut les biblioth&egrave;ques standards des langages de programmation usuels tels que Python et Ruby.

source: The new definition also makes it clear that you can combine GPLed software with GPL-incompatible System Libraries, such as OpenSolaris' C library, and distribute them both together. These changes will make life easier for free software distributors who want to provide these combinations to their users.
fr: Cette nouvelle d&eacute;finition clarifie aussi le fait que vous pouvez combiner un logiciel GPL avec des biblioth&egrave;ques syst&egrave;mes incompatibles avec la GPL, telle que la biblioth&egrave;que C d'OpenSolaris, et les distribuer de mani&egrave;re combin&eacute;e. Ces modifications simplifieront la vie des distributeurs de logiciels libres qui souhaitent fournir ces combinaisons &agrave; leurs utilisateurs.

source: A Global License
fr: Une licence globale

source: GPLv2 talks about &quot;distribution&quot; a lot&mdash;when you share the program with someone else, you're distributing it. The license never says what distribution is, because the term was borrowed from United States copyright law. We expected that judges would look there for the definition. However, we later found out that copyright laws in other countries use the same word, but give it different meanings. Because of this, a judge in such a country might analyze GPLv2 differently than a judge in the United States.
fr: La GPLv2 parle beaucoup de &laquo;&nbsp;distribution&nbsp;&raquo; [NdT&nbsp;: to distribute]&nbsp;: quand vous partagez le programme avec quelqu'un d'autre, vous le distribuez. La licence ne pr&eacute;cise jamais de quelle distribution il s'agit, dans la mesure o&ugrave; le terme a &eacute;t&eacute; emprunt&eacute; aux lois des &Eacute;tats-Unis sur les copyrights. Nous nous attendions &agrave; ce que les juges y chercheraient la d&eacute;finition du terme. Toutefois, nous avons d&eacute;couvert plus tard que les lois similaires des autres pays utilisaient le m&ecirc;me terme, mais dans d'autres acceptions du terme. De fait, un juge dans un tel pays pourrait interpr&eacute;ter la GPLv2 diff&eacute;remment qu'un juge des &Eacute;tats-Unis.

source: GPLv3 uses a new term, &quot;convey,&quot; and provides a definition for that term. &quot;Convey&quot; has the same meaning we intended for &quot;distribute,&quot; but now that this is explained directly in the license, it should be easy for people everywhere to understand what we meant. There are other minor changes throughout the license that will also help ensure it is applied consistently worldwide.
fr: La GPLv3 utilise un nouveau terme, &laquo;&nbsp;transfert&nbsp;&raquo; [NdT&nbsp;: to convey], et en fournit une d&eacute;finition. Ce &laquo;&nbsp;transfert&nbsp;&raquo; a le m&ecirc;me sens que nous souhaitions donner &agrave; &laquo;&nbsp;distribution&nbsp;&raquo;, mais maintenant que le terme est directement d&eacute;fini dans la licence, il sera dor&eacute;navant facile aux gens o&ugrave; qu'ils soient de comprendre ce que nous voulions dire. Il y a par ailleurs quelques autres modifications mineures diss&eacute;min&eacute;es dans la licence qui vont aussi aider &agrave; garantir que l'application serait la m&ecirc;me de par le monde.

source: When the Rules Are Broken: A Smooth Path to Compliance
fr: Quand les r&egrave;gles sont viol&eacute;es&nbsp;: un chemin facilit&eacute; vers leur respect

source: Under GPLv2, if you violated the license in any way, your rights were automatically and permanently lost. The only way to get them back was to petition the copyright holder. While a strong defense against violations is valuable, this policy could cause a lot of headache when someone accidentally ran afoul of the rules. Asking all the copyright holders for a formal restoration of the license could be burdensome and costly: a typical GNU/Linux distribution draws upon the work of thousands.
fr: Sous la GPLv2, si vous avez viol&eacute; la licence d'une quelconque fa&ccedil;on, vos droits seront automatiquement perdus et ce de mani&egrave;re permanente. La seule fa&ccedil;on de les retrouver est d'en faire la requ&ecirc;te &eacute;crite aupr&egrave;s des d&eacute;tenteurs des droits d'auteur. Bien qu'une d&eacute;fense solide contre de telles violations soit souhaitable, cette politique pouvait causer de longues migraines lorsque quelqu'un violait involontairement ces r&egrave;gles. Demander &agrave; tous les d&eacute;tenteurs des droits d'auteurs un accord formel pour la restauration de sa licence pouvait &ecirc;tre ardu et co&ucirc;teux&nbsp;: une distribution GNU/Linux typique se fonde sur le travail de milliers de gens.

source: GPLv3 offers a reprieve for good behavior: if you violate the license, you'll get your rights back once you stop the violation, unless a copyright holder contacts you within 60 days. After you receive such a notice, you can have your rights fully restored if you're a first-time violator and correct the violation within 30 days. Otherwise, you can work out the issue on a case-by-case basis with the copyright holders who contacted you, and your rights will be restored afterward.
fr: La GPLv3 propose une remise de peine pour bonne conduite&nbsp;: si vous violez la licence, vous r&eacute;cup&eacute;rerez vos droits une fois que vous arr&ecirc;tez votre infraction, &agrave; moins qu'un d&eacute;tenteur des droits d'auteur ne vous contacte sous 60 jours. Apr&egrave;s r&eacute;ception d'une telle notification, vos r&eacute;cup&eacute;rerez pleinement vos droits si c'est votre premi&egrave;re infraction et si vous la corrigez sous 30 jours. Sinon, vous pouvez arranger l'affaire directement avec le d&eacute;tenteur des droits qui a pris contact avec vous, et vos droits seront alors aussi r&eacute;tablis.

source: Compliance with the GPL has always been the top priority of the FSF Compliance Lab and other groups enforcing the license worldwide. These changes ensure that compliance remains the top priority for enforcers, and gives violators incentive to comply.
fr: Le respect de la GPL a toujours &eacute;t&eacute; la premi&egrave;re priorit&eacute; du FSF Compliance Lab et d'autres groupes cherchant &agrave; mettre en &oelig;uvre la licence &agrave; l'&eacute;chelle mondiale. Ces modifications assurent que le respect de la licence reste la premi&egrave;re priorit&eacute; pour ces gens, et incitent ceux qui violent les termes de la licence &agrave; la respecter.

source: The Latest and Greatest
fr: L'apoth&eacute;ose

source: Some of these changes probably seem less important to you than others. That's okay. Every project is different, and needs different things from its license. But odds are that a number of these improvements will help you and your work.
fr: Certaines de ces modifications vous semblent certainement moins importantes que d'autres. C'est normal. Chaque projet est diff&eacute;rent et attend diff&eacute;rentes choses de sa licence. Mais il y a de fortes chances qu'un certain nombre de ces am&eacute;liorations vous aident dans votre travail.

source: And taken as a whole, all these upgrades represent something more: we made a better copyleft. It does more to protect users' freedom, but it also enables more cooperation in the free software community. But updating the license is only part of the job: in order for people to get the benefits it offers, developers need to use GPLv3 for their projects, too. By releasing your own software under the new license, everyone who deals with it&mdash;users, other developers, distributors, even lawyers&mdash;will benefit. We hope you'll use GPLv3 for your next release.
fr: Prises dans leur ensemble, toutes ces am&eacute;liorations illustrent une derni&egrave;re chose&nbsp;: nous avons r&eacute;alis&eacute; une meilleure gauche d'auteur. Elle permet de mieux prot&eacute;ger les libert&eacute;s des utilisateurs, et elle facilite aussi la coop&eacute;ration avec la communaut&eacute; du logiciel libre. Mais la mise &agrave; jour de la licence n'est qu'une partie du travail&nbsp;: afin que les gens profitent des avantages qu'elle apporte, il faut aussi que les d&eacute;veloppeurs utilisent la GPLv3 dans leurs projets. En publiant votre propre logiciel sous cette nouvelle licence, tout le monde qui aura affaire &agrave; votre logiciel en profitera, que ce soient les utilisateurs, les autres d&eacute;veloppeurs, les distributeurs ou m&ecirc;me les avocats. Nous esp&eacute;rons que vous utiliserez la GPLv3 lors de la prochaine sortie de votre logiciel.

source: If you'd like to learn more about upgrading your project to GPLv3, the FSF Compliance Lab would be happy to assist you. On <a class="reference external" href="http://www.fsf.org/licensing/">our web site</a>, you can find <a class="reference external" href="http://www.fsf.org/licensing/licenses/gpl-howto.html">basic instructions for using the license</a>, and an <a class="reference external" href="http://www.fsf.org/licensing/licenses/gpl-faq.html">FAQ addressing common concerns</a> that people have about it. If your situation is more complicated than that, please <a class="reference external" href="mailto:licensing&#64;fsf.org">contact us</a> and we'll do what we can to help you with your transition. Together, we can help protect freedom for all users.
fr: Si vous souhaitez en apprendre plus sur le passage de votre projet vers la GPLv3, le FSF Compliance Lab serait enchant&eacute; de vous aider. Sur <a class="reference external" href="http://www.fsf.org/licensing/">notre site web</a>, vous pouvez trouver <a class="reference external" href="http://www.fsf.org/licensing/licenses/gpl-howto.html">des informations de base pour utiliser la licence</a>, et une <a class="reference external" href="http://www.fsf.org/licensing/licenses/gpl-faq.html">FAQ r&eacute;pondant aux questions usuelles</a> que se posent les gens &agrave; son propos. Si votre cas est plus compliqu&eacute; que cela, prenez <a class="reference external" href="mailto:licensing@fsf.org">contact avec nous</a> et nous ferons tout notre possible pour vous aider dans cette transition. Ensemble, nous pouvons aider &agrave; prot&eacute;ger la libert&eacute; de tous les utilisateurs.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide without royalty in any medium provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Marc Chauvet.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions
