Repository: gitGNU/gnu_www-fr
Catalog: licenses/translations.*.po
Languages: fr

source: Unofficial Translations - GNU Project - Free Software Foundation (FSF)
fr: Traductions non officielles - GNU Project - Free Software Foundation (FSF)

source: GNU, FSF, Free Software Foundation, Linux, Copyleft, Licenses
fr: GNU, FSF, Free Software Foundation, Linux, Copyleft, Licences

source: Unofficial Translations
fr: Traductions non officielles

source: Information about unofficial translations
fr: &Agrave; propos des traductions non officielles

source: The reason the FSF does not approve these translations as officially valid is that checking them would be difficult and expensive (needing the help of bilingual lawyers in other countries). Even worse, if an error did slip through, the results could be disastrous for the whole free software community. As long as the translations are unofficial, they can't do any harm, and we hope they help more people understand the GPL.
fr: La raison pour laquelle la FSF n'approuve pas ces traductions comme &eacute;tant officiellement valides, c'est que leur v&eacute;rification serait difficile et co&ucirc;teuse (besoin de l'aide de juristes bilingues dans d'autres pays). Et pire, si une erreur se glissait, les cons&eacute;quences pourraient &ecirc;tre d&eacute;sastreuses pour toute la communaut&eacute; du logiciel libre. Tant que ces traductions ne sont pas officielles, elles ne peuvent pas faire de d&eacute;g&acirc;ts, et nous esp&eacute;rons qu'elles aideront plus de gens &agrave; comprendre la GPL.

source: We give permission to publish translations of the GNU GPL, LGPL, AGPL, and FDL into other languages, provided that you (1) label your translations as unofficial (see below for how to do this), to inform people that they do not count legally as substitutes for the authentic version, and (2) you agree to install changes at our request, if we learn from other friends of GNU that changes are necessary to make the translation clearer.
fr: Nous permettons la publication de traductions de la GNU GPL, de la LGPL, de l'AGPL ou de la FDL dans d'autres langues, pourvu que (1) vous sp&eacute;cifiiez dans vostraductions qu'elles ne sont pas officielles (voir plus loin comment faire), que vous informiez qu'elles ne tiennent pas lieu l&eacute;galement de substitution &agrave; la version originale, et (2) que vous autorisiez &agrave; ajouter des modifications &agrave; notre demande, si nous apprenons par d'autres amis de GNU que des modifications sont n&eacute;cessaires pour rendre la traduction plus claire.

source: To label your translations as unofficial, please add the following text at the beginning, both in English and in the language of the translation&mdash;replacing <em>language</em> with the name of that language:
fr: Pour sp&eacute;cifier que votre traduction n'est pas officielle, veuillez ajoutez le texte suivant au d&eacute;but, &agrave; la fois en anglais et dans la langue de la traduction, en rempla&ccedil;ant &laquo;language&raquo; par le nom de cette langue&nbsp;:

source: This is an unofficial translation of the GNU General Public License into <tt>language</tt>. It was not published by the Free Software Foundation, and does not legally state the distribution terms for software that uses the GNU GPL&mdash;only the original English text of the GNU GPL does that. However, we hope that this translation will help <tt>language</tt> speakers understand the GNU GPL better.
fr: This is an unofficial translation of the GNU General Public License into <tt>language</tt>. It was not published by the Free Software Foundation, and does not legally state the distribution terms for software that uses the GNU GPL&mdash;only the original English text of the GNU GPL does that. However, we hope that this translation will help <tt>language</tt> speakers understand the GNU GPL better.<br />Traduction&nbsp;:<br />Ceci est une traduction non officielle de la GNU General Public License en fran&ccedil;ais. Elle n'a pas &eacute;t&eacute; publi&eacute;e par la Free Software Foundation, et ne d&eacute;termine pas les termes de distribution pour les logiciels qui utilisent la GNU GPL -- seul le texte anglais original de la GNU GPL en a le droit. Cependant, nous esp&eacute;rons que cette traduction aidera les francophones &agrave; mieux comprendre la GNU GPL.

source: Replace &ldquo;GNU General Public License&rdquo; and &ldquo;GPL&rdquo; with the name and abbreviation of the license you're translating, if it's not the GPL.
fr: Veuillez remplacer &laquo;&nbsp;GNU General Public License&nbsp;&raquo; et &laquo;&nbsp;GPL&nbsp;&raquo; par le nom et l'abr&eacute;viation de la licence que vous traduisez s'il ne s'agit pas de la GPL.

source: The GNU General Public License, version 3
fr: La Licence G&eacute;n&eacute;rale Publique GNU (GNU GPL) version 3.0

source: If you make a translation (of any license), please inform the GNU Translation Managers <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>. They will check to make sure that your translation follows the above guidelines and make a link to it from this page.
fr: Si vous faites une traduction (de n'importe quelle licence), veuillez en informer les responsables de la traduction de GNU <a href="mailto:web-translators&#64;gnu.org">&lt;web-translators&#64;gnu.org&gt;</a>. Ils s'assureront que votre traduction respecte les r&egrave;gles pr&eacute;c&eacute;dentes et ajouteront un lien vers votre traduction sur cette page.

source: <code>[es-ar]</code> <a href="http://www.spanish-translator-services.com/espanol/t/gnu/gpl-ar.html">Argentinian Spanish</a> translation of the GPL
fr: <code>[es-ar]</code> Traduction en <a href="http://www.spanish-translator-services.com/espanol/t/gnu/gpl-ar.html">espagnol argentin</a> de la GPL

source: <code>[en-gb]</code> <a href="http://people.csse.uwa.edu.au/jmd/gpl_en.txt"> British English</a> translation of the GPL
fr: <code>[en-gb]</code> Traduction en <a href="http://people.csse.uwa.edu.au/jmd/gpl_en.txt">anglais britannique</a> de la GPL

source: <code>[zh-cn]</code> <a href="http://bergwolf.googlepages.com/gplv3_zh"> Chinese (Simplified)</a> translation of the GPL
fr: <code>[zh-cn]</code> Traduction en <a href="http://bergwolf.googlepages.com/gplv3_zh">chinois simplifi&eacute;</a> de la GPL

source: <code>[nl]</code> <a href="http://bartbeuving.files.wordpress.com/2008/07/gpl-v3-nl-101.pdf"> Dutch</a> translation of the GPL (PDF)
fr: <code>[nl]</code> Traduction en <a href="http://bartbeuving.files.wordpress.com/2008/07/gpl-v3-nl-101.pdf">n&eacute;erlandais</a> de la GPL (PDF)

source: <code>[fi]</code> <a href="http://www.turre.com/licenses/gpl_fi.html"> Finnish</a> translation of the GPL
fr: <code>[fi]</code> Traduction en <a href="http://www.turre.com/licenses/gpl_fi.html">finnois</a> de la GPL

source: <code>[fr]</code> <a href="http://www.april.org/groupes/trad-gpl/doc/GPLv3/www.rodage.org/gpl-3.0.fr.html"> French</a> translation of the GPL
fr: <code>[fr]</code> Traduction en <a href="http://www.april.org/groupes/trad-gpl/doc/GPLv3/www.rodage.org/gpl-3.0.fr.html">fran&ccedil;ais</a> de la GPL

source: <code>[de]</code> <a href="http://www.gnu.de/documents/gpl-3.0.de.html"> German</a> translation of the GPL
fr: <code>[de]</code> Traduction en <a href="http://www.gnu.de/documents/gpl-3.0.de.html">allemand</a> de la GPL

source: <code>[he]</code> <a href="http://law.co.il/gplv3">Hebrew</a> translation of the GPL
fr: <code>[he]</code> Traduction en <a href="http://law.co.il/gplv3">h&eacute;breu</a> de la GPL

source: <code>[it]</code> <a href="http://katolaz.homeunix.net/gplv3"> Italian</a> translation of the GPL
fr: <code>[it]</code> Traduction en <a href="http://katolaz.homeunix.net/gplv3">italien</a> de la GPL

source: <code>[fa]</code> <a href="http://www.kaveh.org/gnu/gplv3-fa.html">Persian (Farsi)</a> translation of the GPL
fr: <code>[fa]</code> Traduction en <a href="http://www.kaveh.org/gnu/gplv3-fa.html">farsi</a> de la GPL

source: <code>[sr]</code> <a href="http://alas.matf.bg.ac.yu/~mr99164/ojl-3.0.html"> Serbian</a> translation of the GPL
fr: <code>[sr]</code> Traduction en <a href="http://alas.matf.bg.ac.yu/~mr99164/ojl-3.0.html">serbe</a> de la GPL

source: <code>[es]</code> <a href="http://www.viti.es/gnu/licenses/gpl.html">Spanish</a> translation of the GPL
fr: <code>[es]</code> Traduction en <a href="http://www.viti.es/gnu/licenses/gpl.html">espagnol</a> de la GPL

source: <code>[uk]</code> <a href="http://www.linux.kiev.ua/ua/devel/licenses/gnu-gpl/"> Ukrainian</a> translation of the GPL
fr: <code>[uk]</code> Traduction en <a href="http://www.linux.kiev.ua/ua/devel/licenses/gnu-gpl/">ukrainien</a> de la GPL

source: Translations Underway
fr: Traductions en cours

source: The following translation efforts are underway, please contact the person/team if you are willing to help.
fr: Les efforts de traduction suivants sont en cours, veuillez contacter la personne/&eacute;quipe si vous souhaiter l'aider.

source: <code>[pt-br]</code> Brazilian Portuguese (<a href="http://gpl3brasil.pbwiki.com/GPLv3">1</a>), (<a href="http://www.fsfla.org/svnwiki/trad/GPLv3">2</a> &mdash; effort lead by FSFLA)
fr: <code>[pt-br]</code> Traduction en portugais br&eacute;silien (<a href="http://gpl3brasil.pbwiki.com/GPLv3">1</a>), (<a href="http://www.fsfla.org/svnwiki/trad/GPLv3">2</a> &mdash; effort men&eacute; par FSFLA)

source: <code>[ca]</code> <a href="http://www.softcatala.cat/wiki/GPL3">Catalan</a>
fr: <code>[ca]</code> Traduction en <a href="http://www.softcatala.cat/wiki/GPL3">catalan</a>

source: <code>[zh-tw]</code> <a href="http://wiki.debian.org.hk/w/GPLv3"> Chinese (Traditional)</a>
fr: <code>[zh-tw]</code> Traduction en <a href="http://wiki.debian.org.hk/w/GPLv3">chinois traditionnel</a>

source: <code>[fr]</code> French, <a href="mailto:trad-gnu@april.org">&lt;trad-gnu@april.org&gt;</a>
fr: <code>[fr]</code> Traduction en fran&ccedil;ais <a href="mailto:trad-gnu@april.org">&lt;trad-gnu@april.org&gt;</a>

source: <code>[ko]</code> <a href="http://wiki.kldp.org/wiki.php/GNU/GPLV3Translation">Korean</a>
fr: <code>[ko]</code> Traduction en <a href="http://wiki.kldp.org/wiki.php/GNU/GPLV3Translation">cor&eacute;en</a>

source: <code>[pt]</code> <a href="http://gpl3.neoscopio.org">Portuguese</a>
fr: <code>[pt]</code> Traduction en <a href="http://gpl3.neoscopio.org">portugais</a>

source: <code>[ro]</code> <a href="http://ro.wikipedia.org/wiki/GPL_(licen%C8%9Ba,_versiunea_3)">Romanian</a>
fr: <code>[ro]</code> Traduction en <a href="http://ro.wikipedia.org/wiki/GPL_(licen%C8%9Ba,_versiunea_3)">roumain</a>

source: <code>[ru]</code> <a href="http://code.google.com/p/gpl3rus/wiki/LatestRelease">Russian</a>
fr: <code>[ru]</code> Traduction en <a href="http://code.google.com/p/gpl3rus/wiki/LatestRelease">russe</a>

source: <code>[es]</code> <a href="http://www.fsfla.org/svnwiki/trad/GPLv3"> Spanish</a> &mdash; effort lead by FSFLA
fr: <code>[es]</code> Traduction en <a href="http://www.fsfla.org/svnwiki/trad/GPLv3">espagnol</a> &mdash; effort men&eacute; par FSFLA

source: <code>[sv]</code> <a href="http://www.ucme.se/gpl-3.0.sv.htm">Swedish</a>
fr: <code>[sv]</code> Traduction en <a href="http://www.ucme.se/gpl-3.0.sv.htm">su&eacute;dois</a>

source: <code>[tr]</code> <a href="http://tr.pardus-wiki.org/index.php?title=%C3%87eviri:GNU_GPL_s%C3%BCr%C3%BCm_3_Gayr%C4%B1resm%C3%AE_%C3%87evirisi&amp;action=edit">Turkish</a>
fr: <code>[tr]</code> Traduction en <a href="http://tr.pardus-wiki.org/index.php?title=%C3%87eviri:GNU_GPL_s%C3%BCr%C3%BCm_3_Gayr%C4%B1resm%C3%AE_%C3%87evirisi&amp;action=edit">turc</a>

source: The GNU Lesser General Public License, version 3
fr: La Licence G&eacute;n&eacute;rale Publique Amoindrie GNU (GNU LGPL) version 3.0

source: If you make a translation, please inform the GNU Translation Managers <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>. They will check to make sure that your translation follows the above guidelines and make a link to it from this page.
fr: Si vous faites une traduction (de n'importe quelle licence), veuillez en informer les responsables de la traduction de GNU <a href="mailto:web-translators&#64;gnu.org">&lt;web-translators&#64;gnu.org&gt;</a>. Ils s'assureront que votre traduction respecte les r&egrave;gles pr&eacute;c&eacute;dentes et ajouteront un lien vers votre traduction sur cette page.

source: <code>[de]</code> <a href="http://www.gnu.de/documents/lgpl-3.0.de.html"> German</a> translation of the LGPL
fr: <code>[de]</code> Traduction en <a href="http://www.gnu.de/documents/lgpl-3.0.de.html">allemand</a> de la LGPL

source: <code>[ja]</code> <a href="http://www.finecheats.com/lgpl.html"> Japanese</a> translation of the LGPL
fr: <code>[ja]</code> Traduction en <a href="http://www.finecheats.com/lgpl.html">japonais</a> de la LGPL

source: <code>[mt]</code> <a href="http://www.dexsun.com/gnu/mt/v3/lgpl.html"> Maltese</a> translation of the LGPL
fr: <code>[mt]</code> Traduction en <a href="http://www.dexsun.com/gnu/mt/v3/lgpl.html">maltais</a> de la LGPL

source: <code>[fa]</code> <a href="http://www.kaveh.org/gnu/lgplv3-fa.html">Persian (Farsi)</a> translation of the LGPL
fr: <code>[fa]</code> Traduction en <a href="http://www.kaveh.org/gnu/lgplv3-fa.html">farsi</a> de la LGPL

source: <code>[es]</code> <a href="http://www.viti.es/gnu/licenses/lgpl.html">Spanish</a> translation of the LGPL
fr: <code>[es]</code> Traduction en <a href="http://www.viti.es/gnu/licenses/lgpl.html">espagnol</a> de la LGPL

source: <code>[pt-br]</code> <a href="http://www.fsfla.org/svnwiki/trad/LGPLv3"> Brazilian Portuguese</a>
fr: <code>[pt-br]</code> Traduction en <a href="http://www.fsfla.org/svnwiki/trad/LGPLv3">portugais brésilien</a> de la LGPL

source: <code>[es]</code> <a href="http://www.fsfla.org/svnwiki/trad/LGPLv3"> Spanish</a> (both are lead by FSFLA)
fr: <code>[es]</code> Traduction en <a href="http://www.fsfla.org/svnwiki/trad/LGPLv3">espagnol</a> de la LGPL (les deux sont menées par FSFLA)

source: The GNU Free Documentation License
fr: La licence GNU de documentation libre

source: Up-to-date translations (GFDL 1.2):
fr: Traductions &agrave; jour (GFDL 1.2)&nbsp;:

source: <code>[af]</code> <a href="http://www.poespas.co.za/wiki/index.php/GNU_Vrye_Dokumentasie_Lisensie">Afrikaans</a> translation of the GFDL
fr: <code>[af]</code> Traduction en <a href="http://www.poespas.co.za/wiki/index.php/GNU_Vrye_Dokumentasie_Lisensie">afrikaans</a> de la GFDL

source: <code>[ar]</code> <a href="http://ar.wikipedia.org/wiki/%D9%88%D9%8A%D9%83%D9%8A%D8%A8%D9%8A%D8%AF%D9%8A%D8%A7:%D9%86%D8%B5_%D8%B1%D8%AE%D8%B5%D8%A9_%D8%AC%D9%86%D9%88_%D9%84%D9%84%D9%88%D8%AB%D8%A7%D8%A6%D9%82_%D8%A7%D9%84%D8%AD%D8%B1%D8%A9">Arabic</a> translation of the GFDL
fr: <code>[ar]</code> Traduction en <a href="http://ar.wikipedia.org/wiki/%D9%88%D9%8A%D9%83%D9%8A%D8%A8%D9%8A%D8%AF%D9%8A%D8%A7:%D9%86%D8%B5_%D8%B1%D8%AE%D8%B5%D8%A9_%D8%AC%D9%86%D9%88_%D9%84%D9%84%D9%88%D8%AB%D8%A7%D8%A6%D9%82_%D8%A7%D9%84%D8%AD%D8%B1%D8%A9">arabe</a> de la GFDL

source: <code>[ca]</code> <a href="http://www.softcatala.org/llicencies/fdl-ca.html">Catalan</a> translation of the GFDL
fr: <code>[ca]</code> Traduction en <a href="http://www.softcatala.org/llicencies/fdl-ca.html">catalan</a> de la GFDL

source: <code>[zh-cn]</code> <a href="http://www.thebigfly.com/gnu/FDLv1.2/"> Chinese (Simplified)</a> translation of the GFDL
fr: <code>[zh-cn]</code> Traduction en <a href="http://www.thebigfly.com/gnu/FDLv1.2/">chinois simplifi&eacute;</a> de la GFDL

source: <code>[zh-tw]</code> <a href="http://edt1023.sayya.org/license/fdl.zh-tw.html">Chinese (Traditional)</a> translation of the GFDL
fr: <code>[zh-tw]</code> Traduction en <a href="http://edt1023.sayya.org/license/fdl.zh-tw.html">chinois traditionnel</a> de la GFDL

source: <code>[fa]</code> <a href="http://www.kaveh.org/gnu/fdl-fa.html">Farsi</a> translation of the GFDL
fr: <code>[fa]</code> Traduction en <a href="http://www.kaveh.org/gnu/fdl-fa.html">farsi</a> de la GFDL

source: <code>[de]</code> German translation of the GFDL (<a href="http://www.giese-online.de/gnufdl-de.html">1</a>) (<a href="http://home.arcor.de/rybaczyk/licenses/fdl-1.2.de.html">2</a>)
fr: <code>[de] </code> Traductions en allemand fr la GFDL (<a href="http://www.giese-online.de/gnufdl-de.html">1</a>), (<a href="http://home.arcor.de/rybaczyk/licenses/fdl.de.html">2</a>)

source: <code>[el]</code> <a href="http://el.wikipedia.org/wiki/%CE%92%CE%B9%CE%BA%CE%B9%CF%80%CE%B1%CE%AF%CE%B4%CE%B5%CE%B9%CE%B1:%CE%86%CE%B4%CE%B5%CE%B9%CE%B1_%CE%95%CE%BB%CE%B5%CF%8D%CE%B8%CE%B5%CF%81%CE%B7%CF%82_%CE%A4%CE%B5%CE%BA%CE%BC%CE%B7%CF%81%CE%AF%CF%89%CF%83%CE%B7%CF%82_GNU">Greek</a> translation of the GFDL
fr: <code>[el]</code> Traduction en <a href="http://el.wikipedia.org/wiki/&Beta;&iota;&kappa;&iota;&pi;&alpha;&#943;&delta;&epsilon;&iota;&alpha;:&#902;&delta;&epsilon;&iota;&alpha;_&Epsilon;&lambda;&epsilon;&#973;&theta;&epsilon;&rho;&eta;&sigmaf;_&Tau;&epsilon;&kappa;&mu;&eta;&rho;&#943;&omega;&sigma;&eta;&sigmaf;_GNU">grec</a> de la GFDL

source: <code>[he]</code> <a href="http://kinneret.berlios.de/doc/he/gfdl_license.html">Hebrew</a> translation of the GFDL
fr: <code>[he]</code> Traduction en <a href="http://kinneret.berlios.de/doc/he/gfdl_license.html">h&eacute;breu</a> de la GFDL

source: <code>[it]</code> <a href="http://cvs.savannah.gnu.org/viewvc/*checkout*/www-it/fdl-1.2-it.html?revision=1.1&amp;root=www-it">Italian</a> translation of the GFDL
fr: <code>[it]</code> Traduction en <a href="http://cvs.savannah.gnu.org/viewvc/*checkout*/www-it/fdl-1.2-it.html?revision=1.1&amp;root=www-it">italien</a> de la GFDL

source: <code>[ja]</code> <a href="http://www.opensource.jp/fdl/fdl.ja.html.euc-jp" id="GFDLJapaneseTranslation">Japanese</a> translation of the GFDL
fr: <code>[ja]</code> Traduction en <a href="http://www.opensource.jp/fdl/fdl.ja.html.euc-jp" id="GFDLJapaneseTranslation">japonais</a> de la GFDL

source: <code>[ko]</code> <a href="http://korea.gnu.org/people/chsong/copyleft/fdl-1.2.ko.html">Korean</a> translation of the GFDL
fr: <code>[ko]</code> Traduction en <a href="http://korea.gnu.org/people/chsong/copyleft/fdl-1.2.ko.html">co&eacute;ren</a> de la GFDL

source: <code>[pl]</code> <a href="http://gnu.org.pl/text/gfdl12-pl.html">Polish</a> translation of the GFDL
fr: <code>[pl]</code> Traduction en <a href="http://gnu.org.pl/text/gfdl12-pl.html">polonais</a> de la GFDL

source: <code>[pt-br]</code> <a href="http://www.ic.unicamp.br/~norton/fdl.html">Portuguese (Brazilian)</a> translation of the GFDL
fr: <code>[pt-br]</code> Traduction en <a href="http://www.ic.unicamp.br/~norton/fdl.html">portugais br&eacute;silien</a> de la GFDL

source: <code>[ro]</code> <a href="http://ro.wikipedia.org/wiki/GNU_FDL">Romanian</a> translation of the GFDL
fr: <code>[ro]</code> Traduction en <a href="http://ro.wikipedia.org/wiki/GNU_FDL">roumain</a> de la GFDL

source: <code>[es]</code> <a href="http://curso-sobre.berlios.de/gfdles/">Spanish</a> translation of the GFDL (TXT, HTML, and XML format)
fr: <code>[es]</code> Traduction en <a href="http://curso-sobre.berlios.de/gfdles/">espagnol</a> de la GFDL (TXT, HTML, and XML format)

source: <code>[tg]</code> <a href="http://ilazki.thinkgeek.co.uk/gnu/gfdl.tg.html">Tajik</a> translation of the GFDL
fr: <code>[tg]</code> Traduction en <a href="http://ilazki.thinkgeek.co.uk/gnu/gfdl.tg.html">tajik</a> de la GFDL

source: <code>[vi]</code> <a href="http://vi.wikisource.org/wiki/GFDL"> Vietnamese</a> translation of the GFDL
fr: <code>[vi]</code> Traduction en <a href="http://vi.wikisource.org/wiki/GFDL">vietnamien</a> de la GFDL

source: <code>[cy]</code> <a href="http://cy.wikipedia.org/wiki/GNU_FDL/cyfieithiad_FDL">Welsh</a> translation of the GFDL
fr: <code>[cy]</code> Traduction en <a href="http://cy.wikipedia.org/wiki/GNU_FDL/cyfieithiad_FDL">gallois</a> de la GFDL

source: The translations below are based on version 1.1 of the GFDL; therefore they are not only unofficial, but also outdated. You can read about the changes between 1.1 and 1.2 in <a href="/licenses/fdl.html">the main GFDL page</a>.
fr: Les traductions ci-dessous sont bas&eacute;es sur la version 1.1 de la GFDL; par cons&eacute;quent, elles ne sont non seulement non officielles, mais &eacute;galement p&eacute;rim&eacute;es. Vous pouvez lire les informations sur les changements entre la version 1.1 et 1.2 sur la <a href="/licenses/fdl.html">page principale de la GFDL</a>.

source: <code>[fr]</code> French translations of the GFDL (<a href="http://cesarx.free.fr/gfdlf.html">1</a>) (<a href="http://www.IDEALX.org/fr/doc/gfdl/gfdl.html">2</a>)
fr: <code>[fr]</code> Traductions en fran&ccedil;ais de la GFDL (<a href="http://cesarx.free.fr/gfdlf.html">1</a>), (<a href="http://www.IDEALX.org/fr/doc/gfdl/gfdl.html">2</a>)

source: <code>[de]</code> <a href="http://nautix.sourceforge.net/docs/fdl.de.html" id="GFDLGermanTranslation">German</a> translation of the GFDL
fr: <code>[de]</code> Traduction en <a href="http://nautix.sourceforge.net/docs/fdl.de.html" id="GFDLGermanTranslation">allemand</a> de la GFDL

source: <code>[hi]</code> <a href="http://geocities.com/alkuma/linux/fdl.html">Hindi</a> translation of the GFDL
fr: <code>[hi]</code> Traduction en <a href="http://geocities.com/alkuma/linux/fdl.html">hindi</a> de la GFDL

source: <code>[it]</code> <a href="http://www.softwarelibero.it/gnudoc/fdl.it.html" id="GFDLItalianTranslation">Italian</a> translation of the GFDL
fr: <code>[it]</code> Traduction en <a href="http://www.softwarelibero.it/gnudoc/fdl.it.html" id="GFDLItalianTranslation">italien</a> de la GFDL

source: <code>[ko]</code> <a href="http://korea.gnu.org/people/chsong/copyleft/fdl.ko.html">Korean</a> translation of the GFDL
fr: <code>[ko]</code> Traduction en <a href="http://korea.gnu.org/people/chsong/copyleft/fdl.ko.html">cor&eacute;en</a> de la GFDL

source: <code>[pl]</code> <a href="http://gnu.org.pl/text/gfdl11-pl.html">Polish</a> translation of the GFDL
fr: <code>[pl]</code> Traduction en <a href="http://gnu.org.pl/text/gfdl11-pl.html">polonais</a> de la GFDL

source: <code>[pt-br]</code> <a href="http://www.ead.unicamp.br/minicurso/bw/texto/fdl.pt.html">Portuguese</a> (Brazilian) translation of the GFDL
fr: <code>[pt-br]</code> Traduction en <a href="http://www.ead.unicamp.br/minicurso/bw/texto/fdl.pt.html">portugais br&eacute;silien</a> de la GFDL

source: <code>[ru]</code> <a href="http://www.infolex.narod.ru/gpl_gnu/gfdlrus.html">Russian</a> translation of the GFDL
fr: <code>[ru]</code> Traduction en <a href="http://www.infolex.narod.ru/gpl_gnu/gfdlrus.html">russe</a> de la GFDL

source: <code>[es]</code> Spanish translations of the GFDL (<a href="http://www.geocities.com/larteaga/gnu/gfdl.html">1</a>) (<a href="http://gugs.sindominio.net/licencias/fdl-es.html">2</a>)
fr: <code>[es]</code> Traductions en espagnol de la GFDL (<a href="http://www.geocities.com/larteaga/gnu/gfdl.html">1</a>), (<a href="http://gugs.sindominio.net/licencias/fdl-es.html">2</a>)

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
