Repository: gitGNU/gnu_www-fr
Catalog: licenses/why-not-lgpl.*.po
Languages: fr

source: Why you shouldn't use the Lesser GPL for your next library - GNU Project - Free Software Foundation (FSF)
fr: Pourquoi vous ne devriez pas utiliser la LGPL pour votre prochaine biblioth&egrave;que - GNU Project - Free Software Foundation (FSF)

source: Why you shouldn't use the Lesser GPL for your next library
fr: Pourquoi vous ne devriez pas utiliser la LGPL pour votre prochaine biblioth&egrave;que

source: The GNU Project has two principal licenses to use for libraries. One is the GNU Lesser GPL; the other is the ordinary GNU GPL. The choice of license makes a big difference: using the Lesser GPL permits use of the library in proprietary programs; using the ordinary GPL for a library makes it available only for free programs.
fr: Le projet GNU a principalement deux licences utilisables pour les biblioth&egrave;ques. L'une est la GNU Lesser GPL&nbsp;; l'autre est la GNU GPL ordinaire. Le choix de la licence a un gros impact&nbsp;: utiliser la Lesser GPL permet l'utilisation de la biblioth&egrave;que dans des programmes propri&eacute;taires; utiliser la GPL ordinaire pour une biblioth&egrave;que la rend disponible uniquement pour les programmes libres.

source: Which license is best for a given library is a matter of strategy, and it depends on the details of the situation. At present, most GNU libraries are covered by the Lesser GPL, and that means we are using only one of these two strategies, neglecting the other. So we are now seeking more libraries to release <strong>under the ordinary GPL</strong>.
fr: Le choix de la meilleure licence pour une biblioth&egrave;que donn&eacute;e est une affaire de strat&eacute;gie, et, est fonction de la situation. En ce moment, la plupart des biblioth&egrave;ques GNU sont couvertes par la Lesser GPL, et cela signifie que nous n'utilisons qu'une de ces deux strat&eacute;gies, en omettant l'autre. Donc nous recherchons maintenant &agrave; diffuser plus de biblioth&egrave;ques <strong>sous la GPL ordinaire</strong>.

source: Proprietary software developers have the advantage of money; free software developers need to make advantages for each other. Using the ordinary GPL for a library gives free software developers an advantage over proprietary developers: a library that they can use, while proprietary developers cannot use it.
fr: Les d&eacute;veloppeurs de logiciels propri&eacute;taires ont l'avantage de l'argent; Les d&eacute;veloppeurs de logiciels libres doivent s'avantager les uns les autres. Utiliser la GPL ordinaire pour une biblioth&egrave;que donne aux d&eacute;veloppeurs de logiciels libres un avantage sur les d&eacute;veloppeurs propri&eacute;taires&nbsp;: une biblioth&egrave;que qu'ils peuvent utiliser alors que les d&eacute;veloppeurs propri&eacute;taires ne peuvent pas.

source: Using the ordinary GPL is not advantageous for every library. There are reasons that can make it better to use the Lesser GPL in certain cases. The most common case is when a free library's features are readily available for proprietary software through other alternative libraries. In that case, the library cannot give free software any particular advantage, so it is better to use the Lesser GPL for that library.
fr: Utiliser la GPL ordinaire n'est pas un avantage pour toutes les biblioth&egrave;ques. Il y a des raisons qui font qu'il est mieux d'utiliser la Lesser GPL dans certains cas. Cela se produit commun&eacute;ment lorsque les caract&eacute;ristiques d'une biblioth&egrave;que libre sont d&eacute;j&agrave; disponibles pour les logiciels propri&eacute;taires au travers d'une autre biblioth&egrave;que. Dans ce cas, la biblioth&egrave;que ne peut donner au logiciel libre un quelconque avantage, donc il est mieux d'utiliser la Lesser GPL pour cette biblioth&egrave;que.

source: This is why we used the Lesser GPL for the GNU C library. After all, there are plenty of other C libraries; using the GPL for ours would have driven proprietary software developers to use another&mdash;no problem for them, only for us.
fr: C'est pourquoi nous avons utilis&eacute; la Lesser GPL pour la biblioth&egrave;que GNU C. Apr&egrave;s tout, il y a beaucoup d'autres biblioth&egrave;ques C&nbsp;; utiliser la GPL pour la n&ocirc;tre aurait amen&eacute; les d&eacute;veloppeurs de logiciels propri&eacute;taires &agrave; en utiliser une autre &mdash; c'est bon pour eux, pas pour nous.

source: However, when a library provides a significant unique capability, like GNU Readline, that's a horse of a different color. The Readline library implements input editing and history for interactive programs, and that's a facility not generally available elsewhere. Releasing it under the GPL and limiting its use to free programs gives our community a real boost. At least one application program is free software today specifically because that was necessary for using Readline.
fr: Toutefois, lorsqu'une biblioth&egrave;que offre une fonctionnalit&eacute; vraiment unique en son genre, comme GNU Readline, c'est une toute autre histoire. La biblioth&egrave;que Readline met en œuvre l'&eacute;dition et l'historique des entr&eacute;es pour les programmes interactifs, et ce m&eacute;canisme n'est g&eacute;n&eacute;ralement pas disponible ailleurs. La diffuser sous la GPL et limiter son utilisation aux logiciels libres donne &agrave; notre communaut&eacute; un gain r&eacute;el. Il y a au moins un programme applicatif qui est libre aujourd'hui pr&eacute;cis&eacute;ment car cela &eacute;tait n&eacute;cessaire pour utiliser Readline.

source: If we amass a collection of powerful GPL-covered libraries that have no parallel available to proprietary software, they will provide a range of useful modules to serve as building blocks in new free programs. This will be a significant advantage for further free software development, and some projects will decide to make software free in order to use these libraries. University projects can easily be influenced; nowadays, as companies begin to consider making software free, even some commercial projects can be influenced in this way.
fr: Si nous amassons une collection de puissantes biblioth&egrave;ques couvertes par la GPL, qui n'ont pas d'&eacute;quivalent disponible en logiciels propri&eacute;taires, elles offriront un lot de modules utiles qui serviront de pierre angulaire pour de nouveaux logiciels libres. Ce sera un avantage significatif pour aider le d&eacute;veloppement du logiciel libre, et certains projets d&eacute;cideront de lib&eacute;rer leur code afin d'utiliser ces biblioth&egrave;ques. Les projets universitaires peuvent facilement &ecirc;tre influenc&eacute;s; de nos jours, puisque les compagnies commencent &agrave; envisager de lib&eacute;rer le code, des projets commerciaux peuvent &ecirc;tre &eacute;galement influenc&eacute;s.

source: Proprietary software developers, seeking to deny the free competition an important advantage, will try to convince authors not to contribute libraries to the GPL-covered collection. For example, they may appeal to the ego, promising &ldquo;more users for this library&rdquo; if we let them use the code in proprietary software products. Popularity is tempting, and it is easy for a library developer to rationalize the idea that boosting the popularity of that one library is what the community needs above all.
fr: Les d&eacute;veloppeurs de logiciels propri&eacute;taires, cherchant &agrave; nier la libre comp&eacute;tition comme un avantage important, essaieront de convaincre les auteurs de ne pas contribuer &agrave; des collections de biblioth&egrave;ques couvertes par la GPL. Par exemple, ils peuvent faire appel &agrave; l'ego, promettant &laquo;&nbsp;plus d'utilisateurs pour cette biblioth&egrave;que&nbsp;&raquo; si nous les laissons utiliser le code dans des produits de logiciels propri&eacute;taires. La popularit&eacute; est tentante, et il est facile pour un d&eacute;veloppeur de biblioth&egrave;que de rationaliser l'id&eacute;e que d'augmenter la popularit&eacute; de cette biblioth&egrave;que est ce dont la communaut&eacute; a besoin plus que tout.

source: But we should not listen to these temptations, because we can achieve much more if we stand together. We free software developers should support one another. By releasing libraries that are limited to free software only, we can help each other's free software packages outdo the proprietary alternatives. The whole free software movement will have more popularity, because free software as a whole will stack up better against the competition.
fr: Mais nous ne devrions pas suivre ces tentations, car nous pouvons accomplir bien plus si nous restons ensemble. Nous, les d&eacute;veloppeurs de logiciels libres devrions nous aider les uns les autres. En diffusant des biblioth&egrave;ques qui sont limit&eacute;es au logiciel libre uniquement, nous pouvons aider nos &laquo;&nbsp;ensembles&nbsp;&raquo; de logiciels libres &agrave; surpasser les alternatives propri&eacute;taires. L'ensemble du mouvement du logiciel libre aura plus de popularit&eacute;, car le logiciel libre dans son ensemble progressera mieux contre la comp&eacute;tition.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Michel Rodriguez.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
