Repository: gitGNU/gnu_www-fr
Catalog: links/links.*.po
Languages: fr

source: CPSR is a public-interest alliance of computer scientists and others concerned about the impact of computer technology on society. We work to influence decisions regarding the development and use of computers because those decisions have far-reaching consequences and reflect our basic values and priorities.
fr: CPSR (Professionnels de l'informatique pour la responsabilit&eacute; sociale) est une alliance d'int&eacute;r&ecirc;t public de d'informaticiens et d'autres, concern&eacute;s par l'impact de la technologie informatique sur la soci&eacute;t&eacute;. Nous travaillons &agrave; influencer les d&eacute;cisions concernant le d&eacute;veloppement et l'utilisation des ordinateurs car ces d&eacute;cisions ont des cons&eacute;quences profondes et refl&egrave;tent nos valeurs et priorit&eacute;s premi&egrave;res.

source: The American Civil Liberties Union is the nation's foremost advocate of individual rights &mdash; litigating, legislating, and educating the public on a broad array of issues affecting individual freedom in the United States.
fr: L'Union am&eacute;ricaine pour les libert&eacute;s civiles est l'avocat national le plus en vue des droits individuels (plaider, l&eacute;gif&eacute;rer et &eacute;duquer le public sur une s&eacute;rie &eacute;tendue de questions qui affectent la libert&eacute; individuelle aux &Eacute;tats-Unis).

source: The GILC comprises of members from American Civil Liberties Union, the Electronic Privacy Information Center, Human Rights Watch, the Internet Society, Privacy International, the Association des Utilisateurs d'Internet, and other civil liberties and human rights organizations. They advocate the prohibition of censorship of on-line communication, and insist that on-line free expression should not be restricted by indirect means such as excessively restrictive governmental or private controls over computer hardware or software, telecommunications infrastructure, or other essential components of the Internet.
fr: The GILC (Campagne globale pour la libert&eacute; sur l'Internet) dont font partie des membres de l'Union am&eacute;ricaine pour les libert&eacute;s civiles, du Centre d'information sur la vie-priv&eacute; &eacute;lectronique, de Surveillance des droits de l'Homme (Human Rights Watch), la Soci&eacute;t&eacute; de l'Internet (Internet Society), Vie-priv&eacute; International (Privacy International), l'Association des utilisateurs de l'Internet et d'autres organisations pour les libert&eacute;s civiles et les droits de l'Homme. Ils d&eacute;fendent l'interdicion de la censure sur la communication en ligne et insistent sur le fait que la libert&eacute; d'expression en ligne ne doit pas &eacute;tre restreinte par des moyens indirects tels que les contr&ocirc;les excessivement restrictifs du gouvernement ou des priv&eacute;s sur le logiciel et le mat&eacute;riel informatique, l'infrastructure des t&eacute;l&eacute;communications ou d'autres composantes essentielles de l'Internet.

source: This site fights legislation to ban peer to peer software.
fr: Ce site combat la loi qui veut bannir les logiciels pair-&agrave;-pair.

source: Electronic Frontiers Australia Inc. (EFA) is a non-profit national organisation representing Internet users concerned with on-line freedoms and rights.
fr: Electronic Frontiers Australia Inc. (Fronti&egrave;res &eacute;lectroniques Australie, EFA) est une organisation nationale &agrave; but non-lucratif repr&eacute;sentant les internautes concern&eacute;s par les droits et libert&eacute;s en ligne.

source: Hosting
fr: H&eacute;bergement

source: These sites provide hosting for free software packages, focused on source code. We don't list other well-known hosting sites since they have advertisements or other encouragement for proprietary software. As usual, contact us at &lt;webmasters@gnu.org&gt; if you have suggestions for the list.
fr: Ces sites fournissent l'h&eacute;bergement pour les paquetages de logiciels libres, focalis&eacute;s sur le code source. (Nous ne citons pas les autres sites bien connus d'h&eacute;bergement car ils ont des publicit&eacute;s et autres encouragements pour les logiciels propri&eacute;taires. Comme toujours, contactez-nous &agrave; &lt;webmasters@gnu.org&gt; si vous avez des suggestions &agrave; ajouter &agrave; cette liste).

source: <a href="http://gna.org/">Gna</a>, the hosting site provided by FSF France, with support from the French company Free.
fr: <a href="http://gna.org/">Gna</a>, le site d'h&eacute;bergement fourni par FSF France, avec le soutien de la soci&eacute;t&eacute; fran&ccedil;aise Free.

source: <a href="http://sfccp.net">sfccp.net</a>, the San Francisco Community Colocation Project provides a location for non-profit organizations to host their own servers.
fr: <a href="http://sfccp.net">sfccp.net</a>, the San Francisco Community Colocation Project (Projet de colocalisation de la communaut&eacute; de San Francisco) fournit un emplacement pour les organisations &agrave; but non-lucratif, pour h&eacute;berger leur propres serveurs.

source: News about free software
fr: Nouvelles &agrave; propos des logiciels libres

source: These sites offer updated news about GNU and other free software.
fr: Ces sites proposent des nouvelles mises &agrave; jour &agrave; propos des logiciels libres et (dans certains cas) des logiciels GNU.

source: <a href="http://planet.gnu.org">planet.gnu.org</a>, aggregation of blogs and news announcements from GNU packages.
fr: <a href="http://planet.gnu.org">planet.gnu.org</a>, un agrégateur de blogs et de nouvelles sur les paquetages GNU.

source: <a href="http://www.changelog.org">changelog.log,</a> aggregation of ChangeLog entries from GNU and GNOME projects.
fr: <a href="http://www.changelog.org">changelog.log</a>, agrégation des entrées ChangeLog des projets GNU et GNOME.

source: <a href="http://singapore.gnu.googlepages.com/press">Press/News</a>, free software news from a Singapore GNU users group.
fr: <a href="http://singapore.gnu.googlepages.com/press">Press/News</a> - Nouvelles &agrave; propos des logiciels libres d'un groupe d'utilisateurs de GNU.

source: <a href="http://news.northxsouth.com">news.northxsouth.com</a>, news about free software in Latin America.
fr: <a href="http://news.northxsouth.com">news.northxsouth.com</a>, Nouvelles &agrave; propos des logiciels libres en Am&eacute;rique latine.

source: <a href="http://gnuticias.es.gnu.org">GNUticias</a>, news about free software and the GNU Project (in Spanish).
fr: <a href="http://gnuticias.es.gnu.org">GNUticias</a>, Nouvelles &agrave; propos des logiciels libres et du projet GNU (en espagnol).

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
