Repository: gitGNU/gnu_www-fr
Catalog: links/links.*.po
Languages: fr

source: Links to Other Free Software Sites - GNU Project - Free Software Foundation (FSF)
fr: Liens vers d'autres sites de logiciels libres - GNU Project - Free Software Foundation (FSF)

source: Links to Other Free Software Sites
fr: Liens vers d'autres sites de logiciels libres

source: To help promote knowledge of free software that isn't <a href="/software/software.html#TOCDescriptionsOfGNUSoftware">GNU software distributed by the FSF</a>, we have collected the following links to other web sites that contain free software, or is directly related to the issue of free software.
fr: Pour aider &agrave; la promotion de la connaissance des logiciels libres autres que les <a href="/software/software.fr.html#TOCDescriptionsOfGNUSoftware">logiciels GNU distribu&eacute;s par la FSF</a>, nous avons rassembl&eacute; ces liens vers d'autres sites qui h&eacute;bergent un ou plusieurs logiciels libres ou qui sont en rapport direct avec le logiciel libre.

source: We do not have links to web sites of the well-known GNU/Linux system distributions, or to the well-known BSD system distributions, because all those sites explicitly describe, and facilitate access to, various non-free programs. We would be glad to know of other free software web sites that we could link to here.
fr: Nous n'avons pas de liens vers les sites Web des distributions connues du syst&egrave;me GNU/Linux ou du syst&egrave;me BSD, car tous ces sites d&eacute;crivent explicitement et facilitent l'acc&egrave;s &agrave; divers programmes non-libres. Nous serions heureux de conna&icirc;tre d'autres sites Web de logiciels libres que nous pourrions ajouter ici.

source: <em><span class="highlight">The FSF is not responsible for the content of other web sites, or how up-to-date their content is.</span></em>
fr: <em><span class="highlight">Veuillez noter que la FSF n'est pas reponsable du contenu d'autres sites Web ni de leur &eacute;tat de mise &agrave; jour.</span></em>

source: Free GNU/Linux distributions
fr: Distributions GNU/Linux libres

source: These are the <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> distributions we know of which only include and only propose free software. They reject non-free applications, non-free programming platforms, non-free drivers, or non-free firmware &ldquo;blobs&rdquo;. If by mistake they do include any, they remove it. To learn more about what makes for a free GNU/Linux distribution, see our <a href="/philosophy/free-system-distribution-guidelines.html">Guidelines for Free System Distributions</a>.
fr: Ce sont les distributions <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a> que nous connaissons qui ne contiennent et ne proposent que des logiciels libres. Elles rejettent toutes applications, plateformes de d&eacute;veloppement, pilotes et firmware non-libres. Si par erreur elles en incluaient un, elles le suppriment d&egrave;s qu'elles s'en rendent compte. Pour en savoir plus sur ce qui rend une distribution GNU/Linux libre, consulter nos <a href="/philosophy/free-system-distribution-guidelines.fr.html">Recommandations pour les distributions syst&egrave;me libres</a>.

source: If you know of a distribution that may qualify but isn't listed here, please ask the distribution's maintainers if they want to follow these free software principles. If they do, and they would like their distribution to be listed here, they should write to &lt;gnu@gnu.org&gt;. Some distributions are making efforts to move toward a completely free system. We thank them for their on-going work to achieve that goal, and hope to list them here some day.
fr: Si vous connaissez une distribution qui r&eacute;ponde &agrave; ces crit&egrave;res, mais qui n'est pas mentionn&eacute;e ici, veuillez demander aux mainteneurs de la distribution s'ils veulent suivre ces principes des logiciels libres. Si c'est le cas et qu'ils veuillent que leur distribution soit cit&eacute;e ici, ils doivent &eacute;crire &agrave; &lt;gnu@gnu.org&gt;. Certaines distributions font des efforts pour migrer vers un syst&egrave;me totalement libre. Nous les remercions pour leur travail pour atteindre ce but, et nous esp&eacute;rons les mentionner ici un jour.

source: All of the distributions that follow are installable to a computer hard drive and most can be run live. They are listed in no particular order. We list <a href="companies.html">companies that sell hardware preinstalled with a free GNU/Linux distribution</a> separately.
fr: Toutes les distributions qui suivent sont installables sur un disque dur d'ordinateur et peuvent pour la plupart &ecirc;tre ex&eacute;cut&eacute;es &agrave; partir d'un lecteur de CD/DVD. Elles ne sont pas class&eacute;es dans un ordre particulier.

source: <a href="http://www.gnewsense.org/">gNewSense</a>, a GNU/Linux distribution based on Debian and Ubuntu, with sponsorship from the FSF.
fr: <a href="http://www.gnewsense.org/">gNewSense</a>, une distribution GNU/Linux bas&eacute;e sur Debian et Ubuntu, sponsoris&eacute;e par la the FSF.

source: <a href="http://www.ututo.org/www/">Ututo</a>, a GNU/Linux distribution based on Gentoo. It was the first fully free GNU/Linux system recognized by the GNU Project.
fr: <a href="http://www.ututo.org/www/">Ututo</a>, une distribution GNU/Linux bas&eacute;e sur Gentoo. C'&eacute;tait le premier syst&egrave;me GNU/Linux totalement libre reconnu par le Projet GNU.

source: <a href="http://dynebolic.org">Dynebolic</a>, a GNU/Linux distribution that places special emphasis on audio and video editing.
fr: <a href="http://dynebolic.org">Dynebolic</a>, une distribution GNU/Linux mettant particuli&egrave;rement l'accent sur l'&eacute;dition audio et vid&eacute;o.

source: <a href="https://www.musix.org.ar">Musix GNU+Linux</a>, a GNU+Linux distribution based on Knoppix, with special emphasis on audio production.
fr: <a href="https://www.musix.org.ar/wiki/index.php/Documentation">Musix GNU+Linux</a>, une distribution GNU/Linux bas&eacute;e sur Knoppix, mettant particuli&egrave;rement l'accent sur la production audio.

source: <a href="http://www.blagblagblag.org/">BLAG</a>, BLAG Linux and GNU, a GNU/Linux distribution based on Fedora.
fr: <a href="http://www.blagblagblag.org/">BLAG</a>, BLAG Linux and GNU, une distribution GNU/Linux bas&eacute;e sur Fedora.

source: <a href="http://trisquel.uvigo.es/">Trisquel</a>, a GNU/Linux distribution oriented to small enterprises, domestic users and educational centers.
fr: <a href="http://trisquel.uvigo.es/">Trisquel</a>, une distribution GNU/Linux orientée vers les petites entreprises, les particuliers et les centres éducatifs.

source: The following distributions have expressed their intent to follow the Guidelines for Free System Distributions, and are currently under review:
fr: Les distributions suivantes ont exprimé leur intention de suivre le <a href="/philosophy/free-system-distribution-guidelines.fr.html">Guide de recommandations pour les distributions système libres</a> et sont en cours d'examen&nbsp;:

source: <a href="http://livecd.gnustep.org/">GNUstep Live</a>, a GNU/Linux distribution with a user interface based on <a href="http://www.gnustep.org/">GNUstep</a>, a free implementation of the Cocoa/OpenStep framework.
fr: <a href="http://livecd.gnustep.org/">GNUstep Live</a>, une distribution GNU/Linux utilisant une interface utilisateur bas&eacute;e sur <a href="http://www.gnustep.org/">GNUStep desktop</a>, une mise en &oelig;uvre libre du framework Cocoa/OpenStep.

source: Other free operating systems
fr: Autres syst&egrave;mes d'exploitation libres

source: We would especially like to know of other free operating systems that have a policy not to include, or recommend, non-free software. Developers of such operating systems that wish us to be aware of their system should contact &lt;gnu@gnu.org&gt;. These systems also follow our <a href="/philosophy/free-system-distribution-guidelines.html">Guidelines for Free System Distributions</a>.
fr: Nous aimerions particuli&egrave;rement conna&icirc;tre d'autres syst&egrave;mes d'exploitation libres qui ont pour politique de ne pas inclure ou recommander de logiciels non-libres. Les d&eacute;veloppeurs de tels syst&egrave;mes d'exploitation qui souhaiteraient que nous soyons avertis de leur syst&egrave;me doivent contacter &lt;gnu@gnu.org&gt;.Ces syst&egrave;mes suivent aussi nos <a href="/philosophy/free-system-distribution-guidelines.fr.html">Recommandations pour des distributions syst&egrave;me libres</a>.

source: <a href="http://www.jnode.org/">JNode</a>, a free operating system written in Java
fr: <a href="http://www.jnode.org/">JNode</a>, un syst&egrave;me d'exploitation libre &eacute;crit en Java

source: Collections of free software
fr: Collections de logiciels libres

source: <a href="http://www.delorie.com">DJ Delorie's site</a>.
fr: <a href="http://www.delorie.com">Site de DJ Delorie</a>

source: <a href="http://www.emacswiki.org/cgi-bin/wiki/ElispArea">GNU EmacsWiki: ElispArea</a>
fr: <a href="http://www.emacswiki.org/cgi-bin/wiki/ElispArea">GNU EmacsWiki&nbsp;: ElispArea</a>

source: <a href="http://ftp.back2roots.org/geekgadgets/">GNU programs for the Amiga and BeOS</a>
fr: <a href="http://ftp.back2roots.org/geekgadgets/">Programmes GNU pour Amiga et BeOS</a>

source: <a href="/software/for-windows.html">A short list of free software for Microsoft Windows</a>, for the Windows user who is curious about free software.
fr: <a href="/software/for-windows.html">Une courte liste de logiciels libres pour Microsoft Windows</a>, pour les utilisateurs Windows curieux sur les logiciels libres.

source: Free software documentation
fr: Documentation de logiciels libres

source: The documentation at these sites may be older than the latest <a href="/doc/doc.html">versions distributed by GNU</a>.
fr: Les documentations sur ces sites peuvent &ecirc;tre plus anciennes que les derni&egrave;res <a href="/doc/doc.html">versions distribu&eacute;es par GNU</a>.

source: <a href="http://en.flossmanuals.net/">Floss Manuals</a>, a collection of free manuals for free software.
fr: <a href="http://en.flossmanuals.net/">Floss Manuals</a>, une collection de manuels libres sur les logiciels libres.

source: <a href="http://www.delorie.com/gnu/docs/">GNU manuals at delorie.com.</a>
fr: <a href="http://www.delorie.com/gnu/docs/">Manuels GNU sur delorie.com.</a>

source: <a href="http://www.mibsoftware.com/reuse/">Reuse RKT</a> provides links to FAQs, standards and references.
fr: <a href="http://www.mibsoftware.com/reuse/">Reuse RKT</a> fournit des liens vers des FAQ, des standards et des r&eacute;f&eacute;rences.

source: <a href="/software/gnujdoc/gnujdoc.html">GNUjdoc</a> is a central archive of Japanese translations of GNU documents.
fr: <a href="/software/gnujdoc/gnujdoc.html">GNUjdoc</a> est une archive centrale des traductions en japonais des documents GNU.

source: Unofficial GNU sites
fr: Sites GNU non-officiels

source: <a href="http://www.cs.pdx.edu/~trent/gnu">Trent's pages.</a>
fr: <a href="http://www.cs.pdx.edu/~trent/gnu">Les pages de Trent</a>

source: <a href="http://www.gnu.cz/">A GNU page in Czech.</a>
fr: <a href="http://www.gnu.cz/">Un site GNU en tchèque</a>.

source: <a href="http://www.gnuino.org/">A Spanish introduction to free software.</a>
fr: <a href="http://www.gnuino.org/">Une introduction en espagnol aux logiciels libres</a>.

source: Free knowledge &amp; free culture
fr: Connaissance et culture libres

source: <a href="http://www.wikipedia.org">Wikipedia.org</a> - The Free Encyclopedia.
fr: <a href="http://www.wikipedia.org">Wikipedia.org</a>, l'encyclopédie libre.

source: <a href="http://www.ourproject.org">OurProject.org</a> - Free Software &amp; Free Knowledge for a Free Society (mostly in Spanish).
fr: <a href="http://www.ourproject.org">OurProject.org</a>, logiciels libres et connaissance libre pour une soci&eacute;t&eacute; libre (presque enti&egrave;rement en espagnol).

source: <a href="http://www.mutopiaproject.org/">Mutopia</a> - collects and distributes free music, and information about free music.
fr: <a href="http://www.mutopiaproject.org/">Mutopia</a>, collecte et distribue de la musique libre et des informations sur la musique libre.

source: Organizations related to free software
fr: Organisations en rapport avec le logiciel libre

source: <a href="http://mx.gnu.org">GNU Mexico</a> - The Mexican branch of the GNU Project
fr: <a href="http://mx.gnu.org">GNU Mexico</a> - La branche mexicaine du projet GNU

source: <a href="http://es.gnu.org">GNU Spain</a> - The Spanish branch of the GNU Project
fr: <a href="http://es.gnu.org">GNU Spain</a> - La branche espagnole du Projet GNU

source: <a href="http://it.gnu.org">GNU Italia</a> - The Italian branch of the GNU Project
fr: <a href="http://it.gnu.org">GNU Italia</a> - La branche italienne du Projet GNU

source: <a href="http://gnu.org.in/">FSF India</a>, Free Software Foundation India.
fr: <a href="http://gnu.org.in/">FSF India</a>, Free Software Foundation Inde.

source: <a href="http://www.fsfla.org">FSF Latin America</a>, Free Software Foundation Latin America
fr: <a href="http://www.fsfla.org">FSF Latin America</a>, Free Software Foundation Amérique latine

source: <a href="http://www.belgeler.org/">Belgeler.org</a> - A very compherensive Turkish Translation project including philosophical writings about Free Software
fr: <a href="http://www.belgeler.org/">Belgeler.org</a> - Un projet de traduction turque tr&egrave;s complet comprenant des articles philosophiques sur les logiciels libres

source: <a href="http://www.april.org/">APRIL</a>
fr: <a href="http://www.april.org/">APRIL</a> - Association pour la promotion et la défense du logiciel libre

source: <a href="http://eupat.ffii.org/patente/">European Software Patent Horror Gallery</a>
fr: <a href="http://eupat.ffii.org/patente/">La galerie des horreurs des brevets logiciels europ&eacute;enne</a>

source: <a href="http://swpat.ffii.org/">FFII: Protecting Information Innovation against the Abuse of the Patent System</a>
fr: <a href="http://swpat.ffii.org/">FFII&nbsp;: Protection de l'innovation de l'information contre les abus du syst&egrave;me des brevets</a>

source: <a href="http://www.icot.or.jp/">ICOT Free Software</a> (in Japanese)
fr: <a href="http://www.icot.or.jp/">ICOT Free Software</a> (en japonais)

source: <a href="http://www.publiclibraryofscience.org">Public Library of Science</a> organizes support for online public libraries of science.
fr: <a href="http://www.publiclibraryofscience.org">Public Library of Science</a> organise le support pour des biblioth&egrave;ques publiques en ligne de science

source: <a href="http://www.opencores.org">OpenCores.Org</a> is a volunteer group interested in developing hardware, with a similar ethos to the free software movement.
fr: <a href="http://www.opencores.org">OpenCores.Org</a> est un groupe de volontaires int&eacute;ress&eacute;s dans le d&eacute;veloppement de mat&eacute;riel, avec un &eacute;thos similaire &agrave; celui du mouvement du logiciel libre

source: <a href="http://www.openstreetmap.org">OpenStreetMap is a free editable map of the whole world. OpenStreetMap allows you to freely view, edit and use geographical data in a collaborative way.</a>
fr: <a href="http://www.openstreetmap.org">OpenStreetMap est une mappemonde librement modifiable. OpenStreetMap vous permet de voir, modifier et utiliser gratuitement des donn&eacute;es g&eacute;ographiques de mani&egrave;re collaborative</a>.

source: <a href="http://www.vhdl.org/fmf">The Free Model Foundry</a> - for electrical engineers, free simulation models of digital components.
fr: <a href="http://www.vhdl.org/fmf">The Free Model Foundry</a> - pour les ing&eacute;nieurs en &eacute;lectricit&eacute;, mod&egrave;les de simulation de composants num&eacute;riques libres.

source: <a href="http://www.crynwr.com/cgi-bin/ezmlm-cgi/0/">Archives</a> of the Free Software Business mailing list
fr: <a href="http://www.crynwr.com/cgi-bin/ezmlm-cgi/0/">Archives</a> de la liste de diffusion Free Software Business

source: <a href="http://www.ffii.org">Association For a Free Informational Infrastructure (FFII)</a>
fr: <a href="http://www.ffii.org">Association pour une infrastructure informationnelle libre (FFII)</a>

source: <a href="http://www.ofset.org" name="OFSET">OFSET</a> - The Organization for Free Software in Education and Teaching.
fr: <a href="http://www.ofset.org" name="OFSET">OFSET</a> - Organisation pour les logiciels libres dans l'&eacute;ducation et l'enseignement.

source: <a href="http://www.plugincinema.com/plugin/plugin_cinema/pffp.htm/">pFFP</a> - The plugincinema Free Film Project promotes the use of free software to make and distribute films.
fr: <a href="http://www.plugincinema.com/plugin/plugin_cinema/pffp.htm/">pFFP</a> - Le plugincinema Free Film Project promeut l'utilisation de logiciels libres pour faire et distribuer des films.

source: <a href="http://www.softwarelivre.org">Free Software Project in Brazil</a>
fr: <a href="http://www.softwarelivre.org">Projet de logiciels libres au Br&eacute;sil</a>

source: <a href="http://avoir.uwc.ac.za">African Virtual Open Initiatives and Resources</a>, an organization dedicated to create opportunities for development and education with Free Software in Africa.
fr: <a href="http://avoir.uwc.ac.za">African Virtual Open Initiatives and Resources</a>, une organisation d&eacute;di&eacute;e &agrave; la cr&eacute;ation d'opportunit&eacute; pour le d&eacute;veloppement et l'&eacute;ducation &agrave; l'aide de logiciels libres en Afrique.

source: <a href="http://www.gnu.org/gugve">GUGVe</a>, promoting free software in Venezuela.
fr: <a href="http://www.gnu.org/gugve">GUGVe</a>, promotion des logiciels libres au Venezuela.

source: <a href="http://www.gnulinuxclub.org">GnuLinuxClub.org</a>, dedicated to the propagation and usage of GNU/Linux and Free Software among the general computer users community.
fr: <a href="http://www.gnulinuxclub.org">GnuLinuxClub.org</a>, d&eacute;di&eacute;e &agrave; la propagation et l'utilisation de GNU/Linux et des logiciels libres dans la communaut&eacute; g&eacute;n&eacute;rale des utilisateurs d'ordinateur.

source: <a href="http://techmeet.org">techmeet.org</a>, a site for discussing free website revision systems and arranging conferences on the topic.
fr: <a href="http://techmeet.org">techmeet.org</a>, un site de discussion sur les syst&egrave;mes de r&eacute;vision de sites Web libres et d'organisation de conf&eacute;rences sur le sujet.

source: <a href="http://www.vialibre.org.ar">Fundacion via libre</a>, an organization which promotes sharing and development of the knowledge based on free software movement principles.
fr: <a href="http://www.vialibre.org.ar">Fundacion via libre</a>, une organisation qui promeut le partage et le d&eacute;veloppement des connaissances bas&eacute;s sur les principes du mouvement pour les logiciels libres.

source: <a href="http://www.sugarlabs.org/">Sugar Labs</a>, an organization set up to continue development of the Sugar desktop environment.
fr: <a href="http://www.sugarlabs.org/">Sugar Labs</a>, une organisation dédié à continuer le développement de l'environnement de bureau Sugar.

source: Companies that support free software development, and exclusively free software development
fr: Sociétés qui soutiennent le développement de logiciels libres et exclusivement le développement de logiciels libres

source: <a href="http://www.solis.coop.br/fred.php?sys_date=&amp;section=17">Solis Coop</a> (partly in Portuguese)
fr: <a href="http://www.solis.coop.br/fred.php?sys_date=&amp;section=17">Solis Coop</a> (en partie en portugais)

source: <a href="http://www.propus.com.br">Propus Software Livre</a> (partly in Portuguese)
fr: <a href="http://www.propus.com.br">Propus Software Livre</a> (en partie en portugais)

source: <a href="http://www.prosa.it/">PROSA</a> (partly in Italian)
fr: <a href="http://www.prosa.it/">PROSA</a> (en partie en italien)

source: <a href="http://www.sra.co.jp/public/sra/product/wingnut/">Wingnut Project</a> (in Japanese)
fr: <a href="http://www.sra.co.jp/public/sra/product/wingnut/">Wingnut Project</a> (en japonais)

source: Organizations that work for freedom in computer development and electronic communications
fr: Organisations qui &oelig;uvrent pour la libert&eacute; dans le d&eacute;veloppement des ordinateurs et des communications &eacute;lectroniques

source: The OpenCores project exists to further the aims of the Open IP Core definition, which has the following tenets: information on using the hardware must be available; the design of the hardware must be available; design software for hardware must be available.
fr: Le projet OpenCores existe pour pousser plus loin les buts de la d&eacute;finition de Open IP Core, qui a les principes suivants&nbsp;: les informations sur l'utilisation du mat&eacute;riel doivent &ecirc;tre disponibles&nbsp;; la conception du mat&eacute;riel doit &ecirc;tre disponible&nbsp;; la conception du logiciel pour le mat&eacute;riel doit &ecirc;tre disponible.

source: Chilling Effects is a collection point for cease and desist notices concerning online activity &mdash; we invite visitors to enter C&amp;Ds they have received or sent. The website collects the C&amp;Ds in a searchable database and hyperlinks them to explanations of the legal issues.
fr: Chilling Effects est une collection d'ordonnance de cesser et de s'abstenir concernant l'activit&eacute; en ligne (nous invitons les visiteurs &agrave; saisir les ordonnances qu'ils ont re&ccedil;ues ou envoy&eacute;es). Le site Web rassemble les ordonnances dans une base de donn&eacute;es et ajoute des hyperliens &agrave; celles-ci vers les explications des probl&egrave;mes juridiques.

source: The League for Programming Freedom is an organization that opposes software patents and user interface copyrights.
fr: La ligue pour la libert&eacute; de programmation (League Programmming Freedom) est une organisation qui s'oppose aux brevets logiciels et au copyrights sur les interfaces utilisateur.

source: The Free Protocols Foundation (FPF) is an independent public forum, dedicated to the support of patent-free protocols.
fr: La fondation pour les protocoles libres (Free Protocols Foundation, FPF) est un forum public ind&eacute;pendant d&eacute;di&eacute; au soutien des protocoles libres de brevets.

source: EFF, the Electronic Frontier Foundation, is a non-profit, non-partisan organization working in the public interest to protect fundamental civil liberties, including privacy and freedom of expression, in the arena of computers and the Internet.
fr: EFF, la Electronic Frontier Foundation (Fondation de la fronti&egrave;re &eacute;lectronique), est une organisation non-partisanne, &agrave; but non-lucratif qui &oelig;uvre dans l'int&eacute;r&ecirc;t du public pour prot&eacute;ger les libert&eacute;s civiles fondamentales, comme le respect de la vie priv&eacute;e et la libert&eacute; d'expression, dans le domaine des ordinateurs et d'Internet.

source: EPIC is a public interest research center in Washington, D.C. It was established in 1994 to focus public attention on emerging civil liberties issues and to protect privacy, the First Amendment, and constitutional values.
fr: EPIC est un centre de recherche d'int&eacute;r&ecirc;t public &agrave; Washington, D.C. Il a &eacute;t&eacute; &eacute;tabli en 1994 pour attirer l'attention du public sur les probl&egrave;mes &eacute;mergents de libert&eacute; civile et pour prot&eacute;ger la vie priv&eacute;e, le Premier amendement et les valeurs constitutionnelles.
