Repository: gitGNU/gnu_www-fr
Catalog: doc/expanding.*.po
Languages: fr

source: Expanding Bookstore Availability - GNU Project - Free Software Foundation (FSF)
fr: Étendre la disponibilité en librairie - GNU Project - Free Software Foundation (FSF)

source: Instructions to Friends of GNU on how to get GNU Press books into their local bookstores
fr: Instructions aux amis de GNU sur la manière d'obtenir des livres de GNU Press dans leurs librairies locales.

source: First visit the <a href="http://shop.fsf.org/category/books/">FSF Online Shop</a> to familiarize yourself with the current title list, and see if any new ones have been announced.
fr: Visitez d'abord la <a href="http://shop.fsf.org/category/books/">boutique en ligne de la FSF</a> pour vous familiariser avec la liste des titres disponibles et pour voir si de nouveaux ont été annoncés.

source: Contact several bookstores in your region with good-sized technical sections. Don't select more than one branch each of chain stores. Find out whether they stock GNU Press books, and whether or not all their distributors stock GNU Press books.
fr: Contactez plusieurs librairies dans votre région avec des rayons techniques importants. Ne sélectionnez pas plus d'une branche par chaîne de librairies. Trouvez s'ils ont en stock des livres de GNU Press et si leurs distributeurs ont en stock des livres de GNU Press.

source: One useful technique is to look through the store for books about Richard Stallman or his work&mdash;in particular, <cite>Free As In Freedom</cite>. Then you can say to the buyer, &ldquo;You carry <tt>N</tt> different books about Stallman's work, including his biography, but you don't carry his own book.&rdquo; This technique is sometimes effective, since it provides a reason for them to be interested.
fr: Une technique utile est de regarder dans les rayons s'il y a des livres sur Richard Stallman ou sur son œuvre &mdash;&nbsp;en particulier, <cite>Free As In Freedom</cite>. Vous pouvez alors dire au libraire «&nbsp;Vous avez <tt>N</tt> livres différents sur l'œuvre de Richard Stallman, mais vous n'avez pas son propre livre&nbsp;». Cette technique est parfois efficace car elle lui donne une raison d'être intéressé.

source: If the bookstore does not stock GNU Press books but one or more of their distributors does:
fr: Si la librairie n'a pas de livres de GNU Press en stock mais qu'un ou plusieurs des distributeurs en ont&nbsp;:

source: Call or visit the store and ask to speak to the person in charge of technical book section. (The average person working on the store floor cannot help you in this matter.) Ask why they don't hold GNU books in stock. Point out to the bookstore that the GNU project provides many of the main programs used by programmers and system administrators, and that they are missing stocking the definitive books for these programs. This may be sufficient to encourage the bookstore to inquire to their distributor.
fr: Appelez ou rendez visite à la librairie et demandez à parler à la personne en charge du rayon des livres techniques. (Le personnel travaillant dans la librairie ne peut pas vous aider sur ce sujet). Demandez-lui pourquoi il n'a pas de livres sur GNU en stock. Indiquez au libraire que le projet GNU fournit beaucoup des programmes principaux utilisés par les programmeurs et les administrateurs système, et qu'il n'y a pas de livres sur ces programmes en rayon. Ceci devrait être suffisant pour encourager le libraire à se renseigner auprès de son distributeur.

source: If some or all of the bookstore's distributors do not supply GNU Press books: Ask the bookstore employee the name and telephone number of the distributors they purchase from&mdash;doing the same for 3 or 4 computer bookshops will give a good picture of the main distributors in your region to focus on.
fr: Si un ou plusieurs des distributeurs ne proposent pas de livres de GNU Press, demandez à l'employé de la librairie le nom et le numéro de téléphone des distributeurs chez qui ils se fournissent &mdash;&nbsp;faire la même chose dans 3 ou 4 librairies spécialisées en informatique vous donnera une bonne vision des distributeurs principaux sur lesquels se concentrer dans votre région.

source: Telephone the distributors to verify whether they do or don't stock GNU Press books. If not, find out the name of the person responsible for specifying which books the distributor stocks.
fr: Téléphonez aux distributeurs pour vérifier s'ils ont des livres GNU Press en stock. Si ce n'est pas le cas, trouvez le nom de la personne responsable du choix des livres que propose le distributeur.

source: Tell the purchasing manager you are ringing on behalf of GNU Press. Explain what the GNU project is, making sure the purchasing manager is clear the GNU project publishes definitive books for a range of programs published as part of the GNU project, and that the programs are common to many. Point the purchasing manager to the www.gnupress.org web site. Sometimes a purchasing manager will be sufficiently technically oriented to discuss the ubiquity of programs such as GNU Make and GCC. Once the purchasing manager has understood these issues, he is likely to want to see samples of GNU Press books, perhaps two or three titles to get a feel for the breadth and depth of coverage and the quality of writing style. At this stage, you should contact GNU Press to co-ordinate. Send email to <a href="mailto:press@gnu.org">&lt;press@gnu.org&gt;</a>.
fr: Dites au responsable des achats que vous intervenez pour le compte de GNU Press. Expliquez ce qu'est le projet GNU, en vous assurant que le responsable des achats comprend bien que le Projet GNU publie des livres de référence pour tout un panel de programmes publiés par le Projet GNU et que ces programmes sont connus de beaucoup. Indiquez au responsable des achats le site Web www.gnupress.org. Quelquefois, un responsable des achats a suffisamment de bagage technique pour discuter de l'ubiquité de programmes tels que GNU Make et GCC. Une fois que le responsable des achats a compris les tenants et les aboutissants, il voudra certainement voir des exemplaires des livres de GNU Press, peut-être deux ou trois titres pour se faire une idée de la qualité, de la couverture du sujet et du style d'écriture. À ce moment-là, prenez contact avec GNU Press pour vous coordonnez. Envoyez un courriel à <a href="mailto:press@gnu.org">&lt;press@gnu.org&gt;</a>.

source: When making your sales pitch, good books to mention are <cite>GNU Make</cite>, <cite>MDK</cite> and <cite>Free Software Free Society</cite>. This gives a cross section of technical manual, &ldquo;fun&rdquo; book and philosophical book.
fr: Quand vous faites votre boniment, de bons livres à mentionner sont <cite>GNU Make</cite>, <cite>MDK</cite> et <cite>Free Software Free Society</cite>. Cela donne un aperçu pour manuel technique, un livre «&nbsp;humoristique&nbsp;» et un livre philosophique.

source: Find out when it is convenient to contact the purchasing manager after he has received the sample books. Call the purchasing manager around the designated time. If he isn't available, repeat contact attempts in around 10 day intervals.
fr: Demandez au responsable des achats le meilleur moment pour le contacter après avoir reçu les exemplaires. Rappelez le responsable des achats aux environs de la date indiquée. S'il n'est pas disponible, essayez de le rappeler par intervalles de 10 jours.

source: When the purchasing manager has agreed to carry GNU Press books, a contract will need to be drawn up. This should be done between GNU Press <a href="mailto:press@gnu.org">&lt;press@gnu.org&gt;</a> and the distributor directly.
fr: Quand le responsable des achats est d'accord pour proposer des livres de GNU Press, un contrat devra être signé. Ceci doit être fait entre GNU Press <a href="mailto:press@gnu.org">&lt;press@gnu.org&gt;</a> et le distributeur directement.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
