Repository: gitGNU/gnu_www-fr
Catalog: doc/gnupresspub.*.po
Languages: fr

source: Documentation of the GNU Project: GNU Press - Published Documentation
fr: Documentation du Projet GNU : GNU Press - Documentation publiée

source: GNU Press &mdash; Published Documentation
fr: GNU Press &mdash; Documentation publiée

source: GNU Press publishes affordable books on computer science using freely distributable licenses. We are the publishing department of the Free Software Foundation, a non-profit organization. All our proceeds directly support the <a href="http://www.fsf.org/">Free Software Foundation</a> and <a href="/">Project GNU</a>.
fr: GNU Press publie des livres abordables sur l'informatique en utilisant des licences de distribution libres. Nous sommes le département de la publication de la Free Software Foundation, une organisation à but non-lucratif. Toutes nos recettes soutiennent directement la <a href="http://www.fsf.org/">Free Software Foundation</a> et le <a href="/home.fr.html">Projet GNU</a>.

source: GNU Documentation is unique because of our attitude towards it. We believe the reader should be free to copy and redistribute it, just like our software. Originally, all our documentation was released under a short <a href="/licenses/licenses.html#WhatIsCopyleft"> Copyleft</a> license, or under the <a href="/licenses/licenses.html#GPL">GNU General Public License (GPL)</a> itself; in 2001 the <a href="/licenses/licenses.html#FDL"> Free Documentation License (FDL)</a> was created to address certain needs that were not met by licenses originally designed for software. For more detailed information on our theory of free documentation, please see Richard Stallman's essay, &ldquo;<a href="/philosophy/free-doc.html">Free Software and Free Manuals</a>&rdquo;.
fr: La documentation GNU est unique à cause de notre attitude à son égard. Nous pensons que le lecteur doit être libre de copier, mettre à jour et redistribuer la documentation GNU, tout comme nos logiciels. À l'origine, notre documentation était publiée sous une courte licence de <a href="/licenses/licenses.fr.html#WhatIsCopyleft">copyleft</a> ou sous la <a href="/licenses/licenses.fr.html#GPL">GNU General Public License (GPL)</a>. En 2001, la <a href="/licenses/licenses.fr.html#FDL">GNU Free Documentation License (FDL)</a> a été créée pour répondre aux besoins qui n'étaient pas couverts par les licences conçues à l'origine pour les logiciels. Pour plus d'informations sur la documentation libre, veuillez consulter l'essai de <a href="http://www.stallman.org/">Richard Stallman</a>, «&nbsp;<a href="/philosophy/free-doc.fr.html">Logiciels libres et manuels libres</a>&nbsp;».

source: Our original mission was just printing manuals of GNU software programs. We are now expanding into the fields of general computer science and computer science philosophy as well. Our new &ldquo;Philosophy of Software Freedom&rdquo; series will examine the free software philosophy from a number of different angles, such as law, ethics, and business. We hope to bring the discussion into the mainstream, and show how the free software philosophy can be applied to seemingly unrelated fields, such as classical musical composition and art.
fr: Notre mission originelle était d'imprimer seulement les manuels des logiciels GNU. Nous étendons à présent nos publications à des domaines tels que l'informatique générale ou la philosophie informatique. Notre nouvelle série «&nbsp;Philosophie sur la liberté des logiciels&nbsp;» examinera la philosophie des logiciels libres sous différents angles, comme le droit, l'éthique ou le commerce. Nous espérons porter le débat dans la société, et montrer comment la philosophie des logiciels libres peut être appliquée à des domaines apparemment sans rapport comme la composition de musique classique et l'art.

source: We welcome inquiries from <a href="/doc/potentialauthors.html"> potential authors</a>, and are especially interested in working with <a href="/doc/teachingprofessionals.html">computer science teachers</a> to create more materials for classroom use.
fr: Nous accueillons volontiers des requêtes <a href="/doc/potentialauthors.fr.html">d'auteur potentiels</a> et nous sommes particulièrement intéressés pour travailler avec des <a href="/doc/teachingprofessionals.fr.html">professeurs d'informatique</a> pour créer plus de supports pour une utilisation en classe.

source: Please help us write more documentation for Project GNU! New software packages are being written daily by this world-wide movement. For information on how to help, click here.
fr: Veuillez nous aider à écrire plus de documentation pour le Projet GNU&nbsp;! De nouveaux paquetages logiciels sont écrits chaque jour par ce mouvement mondial. Pour des informations sur la façon d'aider, <a href="/help/help.fr.html#helpgnu">cliquez ici</a>.

source: Please help us get our books into more bookstores. <b><a href="/doc/expanding.html">Expanding Bookstore Availability</a></b> is an article written by a volunteer on how you can help to increase the distribution of GNU Press books where you live.
fr: Veuillez nous aider pour que nos livres soient présents dans les librairies. <b><a href="/doc/expanding.fr.html">Étendre la disponibilité en librairie</a></b> est un article écrit par un volontaire sur la manière d'aider à augmenter la distribution des livres de GNU Press où vous vivez.

source: <a href="http://shop.fsf.org/category/books/">List of books in print</a>
fr: <a href="http://shop.fsf.org/category/books/">Liste des livres imprimés</a>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
