Repository: gitGNU/gnu_www-fr
Catalog: doc/teachingprofessionals.*.po
Languages: fr

source: Documentation of the GNU project - Information for Teaching Professionals
fr: Documentation du Projet GNU - Information pour les enseignants professionnels

source: Information for Teaching Professionals
fr: Information pour les enseignants professionnels

source: The GNU Press is committed to producing well-written, authoritative books on computer science and related legal issues at prices that are affordable to students. We are currently in the process of creating supportive teaching materials for classroom use for existing and new manuals. If you would like to help with this process, please contact <a href="mailto:press@gnu.org">&lt;press@gnu.org&gt;</a>.
fr: GNU Press s'investit pour produire les livres bien écrits et qui font autorité en informatique et sur les problèmes légaux associés, à des prix abordables pour les étudiants. Nous sommes en train de créer des supports pour l'enseignement pour des manuels existants et nouveaux. Si vous voulez nous aider, veuillez contacter <a href="mailto:press@gnu.org">&lt;press@gnu.org&gt;</a>.

source: Examination and Desk Copy Policy
fr: Politique d'examen et de copie pour les classes

source: Examination copies for course adoption are available at 50% off list price. Desk copies of GNU Press titles adopted for classroom use as required texts are available gratis. All requests should be made on department letterhead and include a bookstore purchase order.
fr: Les copies d'examen pour l'adoption de cours sont disponibles à moitié prix. Les copies des titres GNU Press adoptés pour l'utilisation en classe ainsi que les textes requis sont disponibles gratuitement. Toutes les requêtes doivent être faite sur papier à en-tête du département et contenir un ordre d'achat de livres.

source: <a href="/doc/bibliography.html">Bibliography of Legal writings on the GPL</a>
fr: <a href="/doc/bibliography.html">Bibliographie des ouvrages de droits sur la GPL</a>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
