Repository: gitGNU/gnu_www-fr
Catalog: server/banner.*.po
Languages: fr

source: <span class="netscape4"><a href="#content">Skip to content</a> | | <a href="#searcher">Skip to search</a> | </span><a href="#translations">Translations of this page</a>
fr: <span class="netscape4"><a href="#content">Aller au contenu</a> | | <a href="#searcher">Aller à la recherche</a> | </span><a href="#translations">Traductions de cette page</a>

source: <a href="#navigation">Skip to navigation</a>
fr: <a href="#navigation">Aller au contenu</a>

source: Sign up for the <em>Free Software Supporter</em>
fr: Abonnez-vous au <em>Free Software Supporter</em>

source: A monthly update on GNU and the FSF
fr: Une lettre mensuelle sur GNU et la FSF

source: <input type="text" id="frmEmail" name="email" size="15" maxlength="80" value="you@example.com" onfocus="this.value=''" /> &nbsp; <input type="submit" value="Ok" />
fr: <input type="text" id="frmEmail" name="email" size="15" maxlength="80" value="vous@exemple.com" onfocus="this.value=''" /> &nbsp; <input type="submit" value="Ok" />

source: <a href="/">The GNU Operating System</a>
fr: <a href="/">Le syst&egrave;me d'exploitation GNU</a>

source: <a href="/gnu/gnu.html">History</a>
fr: <a href="/gnu/gnu.fr.html">Histoire</a>

source: <a href="/philosophy/philosophy.html">Philosophy</a>
fr: <a href="/philosophy/philosophy.fr.html">Philosophie</a>

source: <a href="/licenses/licenses.html">Licenses</a>
fr: <a href="/licenses/licenses.fr.html">Licences</a>

source: <a href="/software/software.html">Downloads</a>
fr: <a href="/software/software.fr.html">Téléchargements</a>

source: <a href="/help/help.html">Help&nbsp;GNU</a>
fr: <a href="/help/help.fr.html">Aidez&nbsp;GNU</a>

source: <a href="https://www.fsf.org/associate/support_freedom?referrer=4052">Join the FSF!</a>
fr: <a href="https://www.fsf.org/associate/support_freedom?referrer=4052">Rejoignez la FSF&nbsp;!</a>

source: <label class="netscape4" for="phrase">Search:</label> <input name="phrase" id="phrase" type="text" size="18" accesskey="s" value="Why GNU/Linux?" /> <input type="submit" value="Search" />
fr: <label class="netscape4" for="phrase">Recherche&nbsp;:</label> <input name="phrase" id="phrase" type="text" size="18" accesskey="s" value="Pourquoi GNU/Linux&nbsp;?" /> <input type="submit" value="Rechercher" />

source: Be 1 of 750 Free Software Supporters in our year end fundraiser
fr: Soyez l'un des 750 soutiens du logiciel libre pour notre collecte de fonds de fin d'année
