Repository: gitGNU/gnu_www-fr
Catalog: server/sitemap.*.po
Languages: fr

source: Webserver Sitemap - GNU Project - Free Software Foundation (FSF)
fr: Plan du site - GNU Project - Free Software Foundation (FSF)

source: Webserver Sitemap
fr: Plan du site

source: <a href="/">Home</a>
fr: <a href="/home.fr.shtml">Accueil</a>

source: <a href="/gnu/gnu.html">About</a>
fr: <a href="/gnu/gnu.fr.html">À propos de GNU</a>

source: <a href="/software/software.html">Free Software</a>
fr: <a href="/software/software.fr.html">Logiciels libres</a>

source: <a href="/philosophy/philosophy.html">Philosophy</a>
fr: <a href="/philosophy/philosophy.fr.html">Philosophie</a>

source: <a href="/licenses/licenses.html">Licenses</a>
fr: <a href="/licenses/licenses.fr.html">Licences</a>

source: <a href="/server/sitemap.html">Sitemap</a>
fr: <a href="/server/sitemap.fr.html">Plan du site</a>

source: <a href="/help/help.html">Help Us</a>
fr: <a href="/help/help.fr.html">Aider GNU</a>

source: <a href="http://www.fsf.org/campaigns/priority.html" style="font-weight: bold;" title="Help or suggest a priority project for the Free Software community">Help a priority project</a>
fr: <a href="http://www.fsf.org/campaigns/priority.html" style="font-weight: bold;" title="Aider ou suggérer un projet prioritaire pour la Free Software community">Aider un projet prioritaire</a>

source: <a href="http://gplv3.fsf.org/" style="font-weight: bold;" title="Help revise the GNU FDL and SFDL">Help revise GNU licenses</a>
fr: <a href="http://gplv3.fsf.org/" style="font-weight: bold;" title="Aider à réviser la GNU FDL et la SFDL">Aider à la révision de licences GNU</a>

source: <a href="/distros/free-distros.html" style="font-weight: bold;" title="Free GNU/Linux distributions">Free&nbsp;GNU/Linux&nbsp;distributions</a>
fr: <a href="/distros/free-distros.html" style="font-weight: bold;" title="Distributions libres GNU/Linux">Distributions&nbsp;libres&nbsp;GNU/Linux</a>

source: <a href="http://directory.fsf.org/" title="Browse our directory of free software projects">Free&nbsp;Software&nbsp;Directory</a>
fr: <a href="http://directory.fsf.org/" title="Parcourir notre répertoire de projets de logiciels libres">Répertoire&nbsp;des&nbsp;logiciels&nbsp;libres</a>

source: <a href="/software/" title="List of GNU software packages">GNU software packages</a>
fr: <a href="/software/software.fr.html" title="Liste des paquetages logiciels GNU">Paquetages&nbsp;logiciels&nbsp;GNU</a>

source: Stay up to date
fr: Rester informé

source: <a href="http://www.fsf.org/register_form">Get&nbsp;email&nbsp;alerts&nbsp;from&nbsp;the&nbsp;FSF</a>
fr: <a href="http://www.fsf.org/register_form">Recevoir&nbsp;des&nbsp;courriels&nbsp;d'alertes&nbsp;de&nbsp;la&nbsp;FSF</a>

source: <a href="/keepingup.html" title="Keep up to date with the latest news from the GNU project">Keeping Up</a>
fr: <a href="/keepingup.fr.html" title="Rester informé des dernières nouvelles sur le projet GNU">Rester informé</a>

source: <a href="http://lists.gnu.org" title="Discuss with other free software users and developers">GNU Mailing Lists</a>
fr: <a href="http://lists.gnu.org" title="Discuter avec d'autres utilisateurs et développeurs de logiciels libres">Liste de diffusion de GNU</a>

source: <a href="/people/speakers.html">GNU Speakers</a>
fr: <a href="/people/speakers.html">Orateurs GNU</a>

source: <a href="/gnu/gnu-user-groups.html" title="Meet people in your area who use and develop free software">GNU User Groups</a>
fr: <a href="/gnu/gnu-user-groups.fr.html" title="Rencontrer des gens dans votre région qui utilisent et développent des logiciels libres">Groupes d'utilisateurs GNU</a>

source: <a href="/press/press.html">Press Information</a>
fr: <a href="/press/press.html">Presse</a>

source: For developers
fr: Pour les développeurs

source: <a href="http://savannah.gnu.org/" title="Get involved in one of our free software projects">Development projects</a>
fr: <a href="http://savannah.gnu.org/" title="Contribuer à l'un de nos projets de logiciels libres">Projets de développement</a>

source: <a href="/software/devel.html" title="Are you a developer? Get access to developer resources">Developer resources</a>
fr: <a href="/software/devel.html" title="Vous êtes un développeur&nbsp;? Accédez aux ressources pour développeur">Ressources pour développeur</a>

source: Support the FSF
fr: Soutenez la FSF

source: <a href="http://www.fsf.org/associate/support_freedom/join_fsf"><strong>Join the FSF today!</strong></a>
fr: <a href="http://www.fsf.org/associate/support_freedom/join_fsf"><strong>Rejoignez la FSF aujourd'hui&nbsp;!</strong></a>

source: <a href="http://www.fsf.org/associate/support_freedom/donate">Donate to the FSF today!</a>
fr: <a href="http://www.fsf.org/associate/support_freedom/donate">Faites un don à la FSF aujourd'hui&nbsp;!</a>

source: <a href="http://order.fsf.org/">Buy manuals and gear</a>
fr: <a href="http://order.fsf.org/">Acheter des manuels et des accessoires</a>

source: <a href="/thankgnus/thankgnus.html">Thank GNUs</a>
fr: <a href="/thankgnus/thankgnus.html">Merci aux GNUs</a>

source: For fun
fr: Humour

source: <a href="/graphics/graphics.html">GNU Graphics and Art</a>
fr: <a href="/graphics/graphics.fr.html">Illustrations GNU</a>

source: <a href="/fun/humor.html">Laugh along with GNU</a>
fr: <a href="/fun/humor.html">Rire avec GNU</a>

source: <a href="/music/">GNU Music and Songs</a>
fr: <a href="/music/">Musiques et chansons GNU</a>

source: Other resources
fr: Autres ressources

source: <a href="/jobs">Free Software Jobs</a>
fr: <a href="/jobs">Emplois dans les logiciels libres</a>

source: <a href="http://donate.fsf.org/">Donate online to the FSF</a>
fr: <a href="http://donate.fsf.org/">Dons en ligne à la FSF</a>

source: <a href="/gnu/thegnuproject.html">The GNU Project</a>
fr: <a href="/gnu/thegnuproject.fr.html">Le Projet GNU</a>

source: <a href="/gnu/">About the GNU Project</a>
fr: <a href="/gnu/gnu.fr.html">À propos du Projet GNU</a>

source: <a href="/keepingup.html">Keeping Up With GNU/FSF</a>
fr: <a href="/keepingup.fr.html">Rester informé sur GNU et la FSF</a>

source: <a href="/press/">FSF/GNU Press Information</a>
fr: <a href="/press/">Articles de presse sur la FSF et GNU</a>

source: <a href="/events.html">Coming events</a> (and some <a href="/events/events.html">past events</a>)
fr: <a href="/events.html">Événements à venir</a> (et quelques <a href="/events/events.html">événements passés</a>)

source: Available <a href="/software/software.html">free software</a>
fr: <a href="/software/software.fr.html">Logiciels libres</a> disponibles

source: Latest releases of GNU software are cataloged in the <a href="http://directory.fsf.org/">Free Software Directory</a> under <a href= "http://directory.fsf.org/GNU/">All GNU Packages</a>
fr: Les dernières versions des logiciels GNU sont catalogués dans le <a href="http://directory.fsf.org/">Répertoire des logiciels libres</a> sous la rubrique <a href= "http://directory.fsf.org/GNU/">Tous les paquetages GNU</a>

source: <a href="/non-gnu/">Non-GNU Free Software</a>
fr: <a href="/non-gnu/">Logiciels libres non-GNU</a>

source: <a href="/software/year2000.html">Year 2000</a> issues.
fr: Problèmes de <a href="/software/year2000.html">l'an 2000</a>.

source: <a href="/gwm/">GNU Writing Movement</a>
fr: <a href="/gwm/">Le mouvement d'écriture de GNU</a>

source: <a href="/education/">GNU and Education</a> is about Free Software for students and teachers, and Free learning resources
fr: <a href="/education/education.fr.html">GNU et l'éducation</a> concerne les logiciels libres pour les étudiants et les enseignants, et les ressources d'apprentissage libres

source: A list of <a href= "/education/software.html">Educational Free Software and Savannah Projects</a>
fr: Une liste de <a href= "/education/software.html">Projets de logiciels libres pour l'éducation et de projets Savannah</a>

source: <a href="/education/freelearning.html">Free Learning Resources</a> advocates and lists free encyclopedia, textbook, and otherwise curriculum projects
fr: <a href="/education/freelearning.html">Ressources d'apprentissage libres</a> liste les livres, encyclopédie et autres ressources de savoir libres

source: <a href="/encyclopedia/">The Free Encylopedia Project</a>
fr: <a href="/encyclopedia/">Le Projet d'encyclopédie libre</a>

source: GNU Information Service in <a href= "/japan/toc.html">Japanese</a>
fr: Service d'information GNU en <a href= "/japan/toc.html">japonais</a>

source: <a href="/people/speakers.html">Speakers</a> who can speak on behalf of the GNU project and the Free Software Movement.
fr: <a href="/people/speakers.html">Orateurs</a> qui peuvent parler au nom du Projet GNU et du Mouvement pour le logiciel libre.

source: <a href="/people/people.html">GNU's Who's Who</a> - the people of the GNU project
fr: <a href="/people/people.html">Who's Who de GNU</a> - les personnes du Projet GNU

source: <a href="/bulletins/bulletins.html">GNUs Bulletins</a> Archive - the Newsletter of the FSF (no longer published)
fr: Archive des <a href="/bulletins/bulletins.html">Bulletins GNU</a> - la lettre de la FSF (n'est plus publiée)

source: The <a href="/graphics/graphics.html">GNU Art Gallery</a> and the <a href="/fun/humor.html">GNU Fun Page</a>
fr: La <a href="/graphics/graphics.fr.html">Galerie des illustrations GNU</a> et la page <a href="/fun/humor.html">Humour GNU</a>

source: <a href="/music/">GNU Music</a>
fr: <a href="/music/">Musiques GNU</a>

source: <a href="/testimonials/">GNU Testimonials</a>
fr: <a href="/testimonials/">Témoignages sur GNU</a>

source: <a href="/licenses/">Licenses</a>
fr: <a href="/licenses/licenses.fr.html">Licences</a>

source: <a href="/philosophy/license-list.html">Various Licenses and our Comments about Them</a>
fr: <a href="/philosophy/license-list.fr.html">Diverses licences et nos commentaires à leur sujet</a>

source: <a href="/copyleft/copyleft.html">What is Copyleft?</a>
fr: <a href="/copyleft/copyleft.fr.html">Qu'est-ce que le copyleft&nbsp;?</a>

source: The <a href="/copyleft/gpl.html">GNU General Public License</a> (also available as a <a href= "/copyleft/gpl.txt">text file</a> and its <a href= "/copyleft/copyleft.html#translations">unofficial translations</a>)
fr: La licence <a href="/copyleft/gpl.html">GNU General Public License</a> (également disponible en <a href= "/copyleft/gpl.txt">fichier texte</a> et ses <a href= "/copyleft/copyleft.fr.html#translations">traductions non-officielles</a>)

source: The <a href="/copyleft/fdl.html">GNU Free Documentation License</a> (also available as a <a href= "/copyleft/fdl.txt">text file</a> and its <a href= "/copyleft/copyleft.html#GFDLtranslations">unofficial translations</a>)
fr: La licence <a href="/copyleft/fdl.html">GNU Free Documentation License</a> (également disponible en <a href= "/copyleft/fdl.txt">fichier texte</a> est ses <a href= "/copyleft/copyleft.fr.html#GFDLtranslations">traductions non-officielles</a>)

source: <a href="/philosophy/why-gfdl.html">Why you should use the GNU Free Documentation License</a>
fr: <a href="/philosophy/why-gfdl.fr.html">Pourquoi utiliser la licence GNU Free Documentation License</a>

source: The <a href="/copyleft/lesser.html">GNU Lesser General Public License</a> (also available as a <a href= "/copyleft/lesser.txt">text file</a> and its <a href= "/copyleft/copyleft.html#LGPLtranslations">unofficial translations</a>)
fr: La licence <a href="/copyleft/lesser.html">GNU Lesser General Public License</a> (également disponible en <a href= "/copyleft/lesser.txt">fichier texte</a> et ses <a href= "/copyleft/copyleft.fr.html#LGPLtranslations">traductions non-officielles</a>)

source: <a href="/philosophy/why-not-lgpl.html">Why you shouldn't use the Lesser GPL for your next library</a>
fr: <a href="/philosophy/why-not-lgpl.fr.html">Pourquoi vous ne devriez pas utiliser la Lesser GPL pour votre prochaine bibliothèque</a>

source: <a href="/copyleft/copying-1.0.html">Version 1 of the GNU General Public License</a>
fr: <a href="/copyleft/copying-1.0.html">Version 1 de la licence GNU General Public License</a>

source: What to do if you see a <a href= "/copyleft/gpl-violation.html">possible violation</a> of the <a href="/copyleft/gpl.html">GPL</a>, the <a href= "/copyleft/lesser.html">LGPL</a>, or the <a href= "/copyleft/fdl.html">GFDL</a>
fr: Que faire si vous constatez une <a href= "/licenses/gpl-violation.fr.html">possible violation</a> de la <a href="/copyleft/gpl.html">GPL</a>, de la <a href= "/copyleft/lesser.html">LGPL</a> ou de la <a href= "/copyleft/fdl.html">GFDL</a>

source: <a href="/licenses/gpl-faq.html">Frequently Asked Questions about the GNU Licenses</a>
fr: <a href="/licenses/gpl-faq.fr.html">Foire aux questions sur les licences GNU</a>

source: <a href="/philosophy/philosophy.html">Philosophical texts</a>
fr: <a href="/philosophy/philosophy.fr.html">Textes philosophiques</a>

source: <a href="/philosophy/free-sw.html">What is Free Software?</a>
fr: <a href="/philosophy/free-sw.fr.html">Qu'est-ce qu'un logiciel libre&nbsp;?</a>

source: <a href="/philosophy/words-to-avoid.html">Confusing Words</a> Which You Might Want to Avoid
fr: <a href="/philosophy/words-to-avoid.fr.html">Mots confus</a> que vous devriez éviter

source: <a href= "/philosophy/open-source-misses-the-point.html">"Open Source Software" or "Free Software"?</a>
fr: <a href= "/philosophy/open-source-misses-the-point.fr.html">&laquo;&nbsp;Logiciels open source&nbsp;&raquo; ou &laquo;&nbsp;Logiciels libres&nbsp;&raquo;&nbsp;?</a>

source: <a href="/patent-examp/">Harmful Software Patents</a>
fr: <a href="/patent-examp/">Brevets logiciels dangereux</a>

source: <a href="/help/help.html#helpgnu">Write Free Software</a>
fr: <a href="/help/help.fr.html#helpgnu">Écrire des logiciels libres</a>

source: <a href="/projects/help-wanted.html">Help wanted</a> with existing GNU software
fr: <a href="/projects/help-wanted.html">Besoin d'aide</a> sur les logiciels GNU existants

source: List of <a href="/prep/tasks.html">other software tasks</a> you can work on
fr: Liste des <a href="/prep/tasks.html">autres tâches sur les logiciels</a> sur lesquelles vous pouvez travailler

source: <a href="/software/devel.html">GNU Software Developer Resources</a>
fr: <a href="/software/devel.html">Ressources pour développeur de logiciels GNU</a>

source: <a href="/help/help.html#documentation">Write Free Documentation</a>
fr: <a href="/help/help.fr.html#documentation">Écrire de la documentation libre</a>

source: <a href="/prep/standards.html">GNU Coding Standards</a>
fr: <a href="/prep/standards.html">Standards de codage GNU</a>

source: <a href="/prep/maintain.html">Information For maintainers of GNU Software</a>
fr: <a href="/prep/maintain.html">Informations pour les mainteneurs de logiciels GNU</a>

source: <a href="/help/evaluation.html">Evaluation Guidelines for GNU Software</a>
fr: <a href="/help/evaluation.html">Recommandations d'évaluation pour les logiciels GNU</a>

source: <a href="/prep/">GNU Project Information</a>
fr: <a href="/prep/">Informations sur le Prjoet GNU</a>

source: <a href="/brave-gnu-world/brave-gnu-world.html">Brave GNU World</a>, the monthly GNU column (and its <a href= "/brave-gnu-world/translations.html">translations</a>)
fr: <a href="/brave-gnu-world/brave-gnu-world.html">Brave GNU World</a>, l'éditorial mensuel de GNU (et ses <a href= "/brave-gnu-world/translations.html">traductions</a>)

source: The GNU Project <a href="/server/server.html">Webserver</a>
fr: Le <a href="/server/server.html">serveur Web</a> du Projet GNU

source: <a href="/server/whatsnew.html">What's New</a>!!
fr: <a href="/server/whatsnew.fr.html">Quoi de neuf&nbsp;?</a>

source: <a href="/server/list-mirrors.html">Mirrors</a> of and <a href="/server/mirror.html">How To Mirror</a> this site
fr: <a href="/server/list-mirrors.html">Miroirs</a> et <a href="/server/mirror.html">Comment faire un miroir</a> de ce site

source: <a href= "/server/standards/README.translations.html">Translating</a> GNU web pages into other languages
fr: <a href= "/server/standards/README.translations.fr.html">Traduction</a> des pages Web de GNU dans d'autres langues

source: <a href="/spanish/">GNU Spanish Translation Team</a>
fr: <a href="/spanish/">L'équipe de traduction espagnole de GNU</a>

source: <a href="/server/privacy-policy.html">Privacy Policy</a>
fr: <a href="/server/privacy-policy.html">Politique de confidentialité</a>

source: <a href= "/server/standards/readme_index.html">Guidelines</a> for GNU Web Site Volunteers
fr: <a href= "/server/standards/readme_index.html">Recommandations</a> pour les volontaires du site Web de GNU

source: List of <a href="/server/tasks.html">tasks (14k characters)</a> to make this web <a href= "/server/server.html">site</a> better, please help with us do them!
fr: Liste des <a href="/server/tasks.fr.html">tâches</a> à faire pour améliorer ce <a href= "/server/server.html">site Web</a>. Merci de nous aider&nbsp;!

source: <a href="/award/">Awards Archive</a>
fr: <a href="/award/">Archives des distinctions</a>

source: <a href="/award/2001/">Award 2001</a>
fr: <a href="/award/">Distinctions 2001</a>

source: <a href="/wwwhurdes/">Old Hurd website</a>
fr: <a href="/wwwhurdes/">Ancien site Web de Hurd</a>

source: <a href="/help/help.html">Helping the GNU Project</a>
fr: <a href="/help/help.fr.html">Aider le Projet GNU</a>

source: Please <a href="/order/order.html">Buy from the FSF</a>
fr: Veuillez <a href="/order/order.html">Acheter à la FSF</a>

source: Pleas? buy a <a href="/order/deluxe.html">Deluxe Distributions</a>
fr: Veuillez acheter une <a href="/order/deluxe.html">Distribution Deluxe</a>

source: Please <a href="/help/donate.html">Donate Money</a>
fr: Veuillez <a href="/help/donate.html">Faire un don</a>

source: <a href= "/help/donate.html#BecomeAPatronOfTheFSF">Become a Patron of the FSF</a>
fr: <a href= "/help/donate.html#BecomeAPatronOfTheFSF">Devenir un bienfaiteur de la FSF</a>

source: Please <a href="/help/help.html#helpgnu">Write Free Software</a>
fr: Veuillez <a href="/help/help.fr.html#helpgnu">Écrire des logiciels libres</a>

source: <a href="/prep/tasks.html">Unstarted tasks</a> you can work on
fr: <a href="/prep/tasks.html">Tâches non commencées</a> sur lesquelles vous pouvez travailler

source: <a href="/volunteers/">GNU Project Volunteers</a>
fr: <a href="/volunteers/">Les volontaires du Projet GNU</a>

source: <a href="/help/gethelp.html">Getting help with GNU software</a>
fr: <a href="/help/gethelp.html">Obtenir de l'aide avec les logiciels GNU</a>

source: <a href="/doc/doc.html">Documentation for GNU software</a> and <a href="/manual/manual.html">Manuals online</a>
fr: <a href="/doc/doc.html">Documentation pour les logiciels GNU</a> et <a href="/manual/manual.html">Manuels en ligne</a>

source: <a href="http://mail.gnu.org/">GNU mailing lists</a>
fr: <a href="http://mail.gnu.org/">Listes de diffusion de GNU</a>

source: <a href="/prep/service.html">GNU Service Directory</a>
fr: <a href="/prep/service.html">Annuaire des services de GNU</a>

source: <a href="http://directory.fsf.org/" id= "FreeSoftwareCatalog" name="FreeSoftwareCatalog">Free Software Catalog</a>
fr: <a href="http://directory.fsf.org/" id= "FreeSoftwareCatalog" name="FreeSoftwareCatalog">Catalogue des logiciels libres</a>

source: <a href="/software/year2000.html">Year 2000 Information</a>
fr: <a href="/software/year2000.html">Informations sur l'an 2000</a>

source: <a href="/usenet/">GNU Newsgroups</a>
fr: <a href="/usenet/">Groupes de discussion sur GNU</a>

source: Getting GNU software
fr: Obtenir des logiciels GNU

source: <a href="/order/order.html">Ordering CDs, Books, Reference Cards, and T-Shirts</a> ( <a href= "http://order.fsf.org/">online ordering is available</a>)
fr: <a href="/order/order.html">Commander des CD, des livres, des cartes de références et des T-Shirts</a> ( <a href= "http://order.fsf.org/">Commande en ligne disponible</a>)

source: <a href="/gear/">Order GNU Gear</a>
fr: <a href="/gear/">Commander des accessoires GNU</a>

source: <a href="/order/deluxe.html">Deluxe Distributions</a>
fr: <a href="/order/deluxe.html">Distributions Deluxe</a>

source: <a href="/order/ftp.html">Downloading via FTP</a>
fr: <a href="/order/ftp.html">Téléchargement par FTP</a>

source: <a href="/links/links.html">Links to other free software sites</a>
fr: <a href="/links/links.fr.html">Liens vers d'autres sites de logiciels libres</a>

source: International FSF
fr: La FSF à l'international

source: <a href="http://fsfla.org">FSF Latin America</a>
fr: <a href="http://fsfla.org">FSF Amérique latine</a>

source: <a href="http://fsf.org.in">FSF India</a>
fr: <a href="http://fsf.org.in">FSF Inde</a>

source: Miscellaneous
fr: Divers

source: <a href="/jobs/jobs.html">Free software job openings</a>
fr: <a href="/jobs/jobs.html">Emplois dans les logiciels libres</a>

source: <a href="/gnu/gnu-user-groups.html">Listing of GNU user groups</a>
fr: <a href="/gnu/gnu-user-groups.html">Liste des groupes d'utilisateurs GNU</a>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution int&eacute;grale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit pr&eacute;serv&eacute;e.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: C&eacute;dric Corazza.<br /> R&eacute;vision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Derni&egrave;re mise-&agrave;-jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
