Repository: gitGNU/gnu_www-fr
Catalog: server/takeaction.*.po
Languages: fr

source: Take Action - GNU Project - Free Software Foundation (FSF)
fr: Agir - GNU Project - Free Software Foundation (FSF)

source: Take Action
fr: Agir

source: Items on this page for: <a href="#act">Activists</a> - <a href="#dev">Developers</a> - <a href="#sys">Sysadmins</a> - <a href="#web">Webmasters</a> - <a href="#xlate">Translators</a>.
fr: Actions pour&nbsp;: <a href="#act">Activistes</a> - <a href="#dev">Développeurs</a> - <a href="#sys">Administrateurs système</a> - <a href="#web">Webmasters</a> - <a href="#xlate">Traducteurs</a>.

source: For Free Software Activists&hellip;
fr: Pour les militants du logiciel libre&hellip;

source: Support current FSF campaigns
fr: Soutenir les campagnes actuelles de la FSF

source: Please support the <a href="http://www.fsf.org/campaigns">FSF campaigns</a>, currently including: <a href="http://www.fsf.org/campaigns/drm.html">against DRM</a>, <a href="http://windows7sins.org/">Windows&nbsp;7&nbsp;sins</a>, <a href="http://playogg.org/">PlayOGG</a>, <a href="http://endsoftpatents.org/">against software patents</a>, <a href="http://www.fsf.org/campaigns/odf.html">OpenDocument</a>, <a href="http://www.coreboot.org/">free BIOS</a>, and <a href="http://www.fsf.org/campaigns/acta/">against ACTA</a>. The overall community site for the global movement for free software is <a href="http://libreplanet.org/">LibrePlanet</a>.
fr: Merci de soutenir les <a href="http://www.fsf.org/campaigns">campagnes de la FSF</a>, ce qui englobe actuellement&nbsp;: <a href="http://www.fsf.org/campaigns/drm.html">contre les DRM</a>, <a href="http://windows7sins.org/">Windows&nbsp;7&nbsp;sins</a>, <a href="http://playogg.org/">PlayOGG</a>, <a href="http://endsoftpatents.org/">contre les brevets logiciels</a>, <a href="http://www.fsf.org/campaigns/odf.html">OpenDocument</a>, <a href="http://www.coreboot.org/">BIOS libre</a> et <a href="http://www.fsf.org/campaigns/acta/">contre ACTA</a>. Le site de toute la communauté pour le mouvement mondial en faveur du logiciel libre est <a href="http://libreplanet.org/">LibrePlanet</a>.

source: Help fight software patents
fr: Aider à combattre les brevets logiciels

source: Please help <a href="http://endsoftpatents.org/">end software patents</a> worldwide. Please also support <a href="http://eupat.ffii.org/">anti-software patent efforts in Europe</a> specifically. Watch and share the movie <a href="http://patentabsurdity.com"><cite>Patent Absurdity</cite></a>.
fr: Aidez, s'il vous plaît, à <a href="http://endsoftpatents.org/">arrêter les brevets logiciels</a> dans le monde. Merci de soutenir aussi, en particulier, <a href="http://eupat.ffii.org/">les efforts contre ces brevets logiciels en Europe</a>. Regardez et partagez le film <a href="http://patentabsurdity.com"><cite>L'absurdité des brevets</cite></a>.

source: Call on WIPO to change its name and mission
fr: Appeler l'OMPI à changer son nom et sa mission

source: Please <a href="http://fsfeurope.org/documents/wiwo.en.html">support this declaration</a> calling on WIPO to change its name and mission.
fr: Merci de <a href="http://fsfeurope.org/documents/wiwo.en.html">soutenir cette déclaration</a> qui appelle l'OMPI à changer de nom et de mission.

source: Enhance the Free Software Directory
fr: Améliorer le répertoire des logiciels libres

source: Start a GNU/Linux User Group in your area, and send us your group's information
fr: Montez un Groupe d'utilisateurs GNU/Linux dans votre région et envoyez-nous les informations sur votre groupe

source: For more information: <a href="http://libreplanet.org/wiki/Group_list">GNU Users Groups</a>.
fr: Pour plus d'informations, visitez notre page sur les <a href="http://libreplanet.org/wiki/Group_list">groupes d'utilisateurs GNU</a>.

source: For Software Developers&hellip;
fr: Pour les développeurs de logiciels&hellip;

source: Contribute to high priority free software projects
fr: Contribuer à des projets de logiciels libres hautement prioritaires

source: As listed on the FSF's <a href="http://www.fsf.org/campaigns/priority.html">high-priority projects web page</a>.
fr: Comme indiqué sur la <a href="http://www.fsf.org/campaigns/priority.html">page web des projets hautement prioritaires</a> de la FSF.

source: Contribute to GNUstep
fr: Contribuer au projet GNUstep

source: Please contribute as a user and developer to <a href="http://www.gnustep.org">GNUstep</a>, a free object-oriented framework for application development, and help it achieve the status of a complete and featured desktop environment.
fr: Veuillez contribuer en tant qu'utilisateur et développeur à <a href="http://www.gnustep.org">GNUstep</a>, un environnement de développement libre orienté objet pour le développement d'applications et aidez-le à atteindre l'état d'environnement de développement complet et fonctionnel.

source: Take over an unmaintained GNU package
fr: Reprendre un paquetage GNU non maintenu

source: These GNU packages are looking for a maintainer: <a href="/software/alive/">alive</a>, <a href="/software/dotgnu-forum/">dotgnu-forum</a>, <a href="/software/dr-geo/">dr-geo</a>, <a href="/software/ggradebook/">ggradebook</a>, <a href="/software/gleem/">gleem</a>, <a href="/software/gnu-queue/">gnu-queue</a>, <a href="/software/goldwater/">goldwater</a>, <a href="/software/halifax/">halifax</a>, <a href="/software/orgadoc/">orgadoc</a>, <a href="/software/pgccfd/">pgccfd</a>, <a href="/software/polyxmass/">polyxmass</a>, <a href="/software/quickthreads/">quickthreads</a>, <a href="/software/snakecharmer/">snakecharmer</a>, <a href="/software/sxml/">sxml</a>, <a href="/software/trueprint/">trueprint</a>. We are also looking for a co-maintainer for the CASE tool <a href="/software/ferret/">ferret</a> and the bug tracking tool <a href="/software/gnats/">gnats</a>. See the package web pages for specific information, and <a href="/help/evaluation.html#whatmeans">this general information about GNU packages and maintenance</a>, and then email <a href="mailto:maintainers@gnu.org">maintainers@gnu.org</a> if you have time and interest in taking over one of these projects.
fr: Ces paquetages GNU sont à la recherche d'un repreneur&nbsp;: <a href="/software/alive/">alive</a>, <a href="/software/dotgnu-forum/">dotgnu-forum</a>, <a href="/software/dr-geo/">dr-geo</a>, <a href="/software/ggradebook/">ggradebook</a>, <a href="/software/gleem/">gleem</a>, <a href="/software/gnu-queue/">gnu-queue</a>, <a href="/software/goldwater/">goldwater</a>, <a href="/software/halifax/">halifax</a>, <a href="/software/orgadoc/">orgadoc</a>, <a href="/software/pgccfd/">pgccfd</a>, <a href="/software/polyxmass/">polyxmass</a>, <a href="/software/quickthreads/">quickthreads</a>, <a href="/software/snakecharmer/">snakecharmer</a>, <a href="/software/sxml/">sxml</a>, <a href="/software/trueprint/">trueprint</a>. Nous recherchons aussi un co-mainteneur pour l'outil CASE <a href="/software/ferret/">ferret</a> et l'outil de suivi de bogues <a href="/software/gnats/">gnats</a>. Consultez les pages web de ces paquetages pour des informations détaillées, ainsi que les <a href="/help/evaluation.html#whatmeans">informations générales au sujet des paquetages GNU et de leur maintenance</a>, et ensuite envoyez un courriel à <a href="mailto:maintainers@gnu.org">maintainers@gnu.org</a> si vous avez le temps et l'envie d'adopter un de ces projets.

source: Contribute to the development of a GNU package
fr: Contribuer au développement d'un paquetage GNU

source: See &ldquo;<a href="http://savannah.gnu.org/people">help wanted</a>&rdquo; requests from the maintainers of many packages.
fr: Consultez les <a href="http://savannah.gnu.org/people">appels à l'aide</a> des mainteneurs de nombreux paquetages.

source: GNU configure for Python packages
fr: GNU configure pour les paquetages Python

source: We need a <a href="/prep/standards/standards.html#Configuration">standard GNU configure</a> and make system for Python-based packages that use Python's <tt>build.py</tt> method. This would be immediately helpful for <a href="/software/bazaar/">GNU Bazaar</a> and <a href="/software/mediagoblin/">GNU MediaGoblin</a>.
fr: Nous avons besoin d'un <a href="/prep/standards/standards.html#Configuration">GNU configure standard</a> et d'un système basé sur make pour les paquetages écrits en Python qui utilisent sa méthode avec <tt>build.py</tt>. Ceci serait immédiatement utile pour <a href="/software/bazaar/">GNU Bazaar</a> et <a href="/software/mediagoblin/">GNU MediaGoblin</a>.

source: Make your program a GNU package
fr: Faire de votre programme un paquetage GNU

source: To make your free software package part of the GNU System, see this <a href="http://www.gnu.org/help/evaluation.html">information on starting your application</a>.
fr: Pour que votre paquetage logiciel libre fasse partie du système GNU, voir ces <a href="http://www.gnu.org/help/evaluation.html">informations pour commencer votre application</a>.

source: For System Administrators&hellip;
fr: Pour les administrateurs système&hellip;

source: Help with administration of Savannah
fr: Aidez à l'administration de Savannah

source: Help maintain the <a href="http://savannah.gnu.org/">free software hosting site</a> sponsored by GNU: <a href="http://savannah.gnu.org/maintenance/HowToBecomeASavannahHacker"> more information</a>.
fr: Aidez à maintenir <a href="http://savannah.gnu.org/">le site d'hébergement du logiciel libre</a> financé par GNU&nbsp;: <a href="http://savannah.gnu.org/maintenance/HowToBecomeASavannahHacker"> plus d'informations</a>.

source: For Webmasters&hellip;
fr: Pour les Webmasters&hellip;

source: Join the GNU webmasters team
fr: Rejoignez l'équipe des webmasters de GNU

source: <a href="http://www.gnu.org/people/webmeisters.html">More information</a>.
fr: <a href="http://www.gnu.org/people/webmeisters.html">Plus d'informations</a>.

source: For Translators&hellip;
fr: Pour les traducteurs&hellip;

source: Join a GNU translation team
fr: Rejoignez une équipe de traduction de GNU

source: Help maintain and update translations of www.gnu.org: <a href="http://www.gnu.org/server/standards/README.translations.html">more information</a>.
fr: Aidez à maintenir et à mettre à jour les traductions de www.gnu.org&nbsp;: <a href="http://www.gnu.org/server/standards/README.translations.fr.html">plus d'informations</a>.

source: Finally, the separate page <a href="/help/help.html">How You Can Help the GNU Project</a> has more details and additional items.
fr: Enfin, visitez la page dédiée <a href="/help/help.fr.html">Comment aider le Projet GNU</a> pour plus d'informations ainsi que d'autres demandes d'aide.

source: Action items for: <a href="#act">Activists</a> - <a href="#dev">Developers</a> - <a href="#sys">Sysadmins</a> - <a href="#web">Webmasters</a> - <a href="#xlate">Translators</a>.
fr: Actions pour&nbsp;: <a href="#act">Activistes</a> - <a href="#dev">Développeurs</a> - <a href="#sys">Administrateurs système</a> - <a href="#web">Webmasters</a> - <a href="#xlate">Traducteurs</a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.

source: Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
fr: Cette page peut-être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise-à-jour&nbsp;:
