Repository: gitGNU/gnu_www-fr
Catalog: server/tasks.*.po
Languages: fr

source: Tasks to do for www.gnu.org - GNU Project - Free Software Foundation (FSF)
fr: Tâches à faire pour www.gnu.org - GNU Project - Free Software Foundation (FSF)

source: Tasks to do for www.gnu.org
fr: Tâches à faire pour www.gnu.org

source: Here are many possible tasks for improving the GNU web pages. If you would like to help with one of them, please e-mail <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a> BEFORE you do any work on them.
fr: Voici les nombreuses tâches à faire pour améliorer les pages Web de GNU. Si vous voulez aider pour l'une d'entre elles, veuillez écrire à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a> AVANT de faire quoi que ce soit.

source: Accessibility
fr: Accessibilité

source: Investigate how www.gnu.org could provide better accessibility to all regardless of disability.
fr: Cherchez comment www.gnu.org pourrait améliorer l'accessibilité.

source: A good place to start is the <a href="http://www.w3.org/WAI/">Web Accessibility Initiative (WAI)</a>.
fr: Un bon site où commencer est <a href="http://www.w3.org/WAI/">Web Accessibility Initiative (WAI)</a>.

source: Other resources on and off the web could also be checked.
fr: Autres ressources à consulter.

source: People at or near MIT could check with MIT's <a href="http://web.mit.edu/atic/www/">Adaptive Technology for Information and Computing</a> in person.
fr: Les personnes du MIT ou proches du MIT peuvent s'informer en personne auprès du département <a href="http://web.mit.edu/atic/www/">Adaptive Technology for Information and Computing</a> (Technologies adaptatives pour l'information et l'informatique).

source: People who have access to similar centers at other schools, organizations, and companies could check with them.
fr: Les personnes qui ont accès à des centres ,sociétés ou des organismes similaires peuvent s'informer auprès d'eux.

source: Disabled users of the web could also be interviewed, and perhaps even added to the webmasters team for this task and others.
fr: Vous pouvez aussi vous entretenir avec des personnes ayant des problèmes d'accessibilité sur le Web et peut-être même les faire adhérer à l'équipe de webmestres pour ce problème en particulier.

source: Site Scripting
fr: Scripts Web

source: Set up manual indexing using the system proposed by Miloslav Nic. See the email exchange for more details on what is to be done.
fr: Effectuer une indexation mauelle en utilisant le système proposé par Miloslav Nic. Consulter l'échange de courriels pour plus de détails sur ce qui peut être fait.

source: <a name="fun">in directory /fun/ include</a>
fr: <a name="fun">dans le répertoire /fun/ contient</a>

source: cgi-bin scripts that
fr: des scripts cgi-bin qui

source: conduct a dialog with GNU Emacs's doctor.el and convert it into HTML.
fr: effectuent un dialogue avec doctor.el de GNU Emacs et le convertissent en HTML.

source: get a zippyism from GNU Emacs's yow.el and convert it into HTML.
fr: prennent un «&nbsp;zippyisme&nbsp;» de yow.el de GNU Emacs et le convertissent en HTML.

source: feed zippyisms to GNU Emacs's doctor and convert it into HTML.
fr: envoient des «&nbsp;zippyismes&nbsp;» à doctor de GNU Emacs et le convertissent en HTML.

source: Roland McGrath has done some of this on his <a href="http://www.frob.com/~roland">home pages</a>. Ask him if you can copy his work over to http://www.gnu.org.
fr: Roland McGrath en a effectué quelques-uns sur sa <a href="http://www.frob.com/~roland">page d'accueil</a>. Demandez-lui si vous pouvez copier son travail sur http://www.gnu.org.

source: Format Conversions
fr: Conversions de format

source: We are looking for people to volunteer to convert documentation from various formats to the <a href="/software/texinfo/texinfo.html">Texinfo</a> format. This is something we need occasionally. We would like to have a list of people we could ask on these occasions. If you want to volunteer, please send mail to <a href="mailto:gvc@gnu.org">&lt;gvc@gnu.org&gt;</a>.
fr: Nous cherchons des volontaires pour convertir de la documentation en divers formats vers le format <a href="/software/texinfo/texinfo.html">Texinfo</a>. C'est quelque chose dont nous avons besoin de temps en temps. Nous voudrions avoir une liste de gens à qui le demander en ces occasions. Si vous êtes volontaire, veuillez envoyer un courriel à <a href="mailto:gvc@gnu.org">&lt;gvc@gnu.org&gt;</a>.

source: Rewrite the various philosophy pages and bulletins in <a href="/software/texinfo/texinfo.html">Texinfo</a> and convert to HTML using texi2html. They could then be easily included in:
fr: Réécrire les diverses pages et articles sur la philosophie en <a href="/software/texinfo/texinfo.html">Texinfo</a> et les convertir en HTML en utilisant texi2html. Ils peuvent alors être facilement inclus dans&nbsp;:

source: the <a href="http://ftp.gnu.org/gnu/GNUinfo">/gnu/GNUinfo</a> subdirectory of <a href="http://ftp.gnu.org/">ftp.gnu.org</a>
fr: le sous-répertoire <a href="http://ftp.gnu.org/gnu/GNUinfo">/gnu/GNUinfo</a> de <a href="http://ftp.gnu.org/">ftp.gnu.org</a>

source: the etc/ subdirectory of the GNU Emacs distribution
fr: le sous-répertoire etc/ de la distribution GNU Emacs

source: in the GNU system's Info tree
fr: dans l'arbre Info du système GNU

source: other useful locations.
fr: d'autres emplacements utiles.

source: Writing Web Pages
fr: Écrire des pages Web

source: Write web pages for GNU programs that lacks web pages on our server or whose web pages are obsolete using our <a href="/software/boilerplate_software.html">software boilerplate</a> as a template. Also read our <a href="/server/standards/README.software.html">software page standards</a>.
fr: Écrire des pages Web pour les programmes GNU qui n'ont pas de pages Web sur notre serveur ou dont le contenu est obsolète en utilisant le <a href="/software/boilerplate_software.html">canevas 'software'</a> comme modèle. Lire également notre <a href="/server/standards/README.software.html">page sur les standards de pages pour les logiciels</a>.

source: Work on improving our <a href="/server/sitemap.html">sitemap</a>.
fr: Travailler à améliorer notre <a href="/server/sitemap.html">plan de site</a>.

source: Design a better sitemap that helps people find all places on the website easily. The sitemap should highlight particularly important parts of sub-pages. (For example, the philosophy listing on the site map should have under it links to some particularly useful essays on the philosophy page).
fr: Concevoir un plan de site meilleur qui aident les gens à trouver tous les emplacements du site Web facilemnt. Le plan de site doit mettre en valeur les parties particulièrement importantes des sous-pages. (Par exemple, le listing Philosophie dans le plan du site doit contenir des liens vers des articles particulièrement utiles de la page Philosophie).

source: Come up with several different ways of presenting the sitemap, that consider both the differences in
fr: Créer différent moyens de présenter le plan du site, en tenant compte des différences

source: how people perceive web pages, and
fr: dont les gens perçoivent les pages Web, et

source: how people use the site.
fr: de la façon dont les gens utilisent le site.

source: Also, the idea of creating a programatically generated sitemap has been proposed; this would primarily be a tool to aid in writing by hand a more easily navigated sitemap.
fr: L'idée de créer un plan du site généré par programme a aussi été proposée&nbsp;; ce serait essentiellement un outil pour aider à écrire manuellement un plan de site plus facile à utiliser.

source: Graphics
fr: Illustrations

source: Remove JPEG artifacts from all PNG pictures. You do this by removing "loose" pixels and turning them into 1bpp (in case of black/white drawings).
fr: Supprimer les artéfacts JPEG de toutes les images PNG. Ceci s'effectue en supprimant les pixels «&nbsp;loose&nbsp;» et en les transformant en 1bpp (dans le cas d'illustrations en noir et blanc).

source: Create new <a href="/graphics/graphics.html">graphics</a> for our web pages. We mostly want to have nicer drawings like the ones we already have and perhaps in more colors.
fr: Créer de nouvelles <a href="/graphics/graphics.fr.html">illustrations</a> pour nos pages Web. Nous voulons surtout avoir de plus beaux dessins comme ceux que nous avons déjà et peut-être en plus de couleurs.

source: Validation and Broken Links
fr: Validation et liens orphelins

source: Check all the web pages for well formedness, consistency with our HTML style sheet, and webmaster guidelines. All web pages need to be valid to their specific DTD, (the <a href="http://validator.w3.org">W3C Validator</a> is a good place to start).
fr: Vérifier que toutes les pages Web sont bien formées, qu'elles respectent notre feuille de style HTML et les recommandations des webmestres. Toutes les pages Web doivent être valides en regard de leur DTD spécifique (le <a href="http://validator.w3.org">Validateur du W3C</a> est un bon point de départ).

source: Help is needed <a href="/server/standards/README.webmastering.html#poldeadlink">repairing broken links</a>. There are numerous <a href="/server/standards/README.webmastering.html#polsymlink">symlinks</a>, so please do not break these in your repair efforts. Time and care is needed to track down broken links, and in most cases find suitable replacements. Please ensure that our <a href="/server/standards/README.webmastering.html#poladdlink">linking</a> <a href="/server/standards/README.webmastering.html#pollinking">policy</a> is followed in finding replacements.
fr: De l'aide est demandée <a href="/server/standards/README.webmastering.html#poldeadlink">pour la réparation des liens orphelins</a>. Il y a de nombreux <a href="/server/standards/README.webmastering.html#polsymlink">symlinks</a>, aussi, veuillez ne pas les corrompre lors des réparations. Du temps et du soin sont nécessaires pour traquer les liens orphelins, et dans la plupart des cas, leur trouver une substitution appropriée. Veuillez vous assurer que notre <a href="/server/standards/README.webmastering.html#pollinking">politique</a> de <a href="/server/standards/README.webmastering.html#poladdlink">liens</a> est respectée en trouvant des liens de substitution.

source: Localization
fr: Localisation

source: Help <a href="/server/standards/README.translations.html">translate GNU web pages</a> from English into other languages. You can either join an existing translation team, or form a new one. Check the <a href="/server/standards/README.translations.html#TranslationsUnderway">existing translation teams</a>.
fr: Aider à <a href="/server/standards/README.translations.fr.html">la traduction des pages Web de GNU</a> de l'anglais vers d'autres langues. Vous pouvez rejoindre une équipe de traduction existante ou en créer une nouvelle. Consulter les <a href="/server/standards/README.translations.fr.html#TranslationsUnderway">équipes de traduction existantes</a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.

source: Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
fr: Cette page peut-être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>.

source: Updated:
fr: Dernière mise-à-jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
