Repository: gitGNU/gnu_www-fr
Catalog: server/whatsnew.*.po
Languages: fr

source: What's New in and about the GNU Project - GNU Project - Free Software Foundation (FSF)
fr: Quoi de neuf à propos du Projet GNU&nbsp;? - GNU Project - Free Software Foundation (FSF)

source: What's New in and about the GNU Project
fr: Quoi de neuf à propos du Projet GNU&nbsp;?

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Pour les questions et requ&ecirc;tes relatives &agrave; la FSF &amp; GNU&nbsp;: <a href="mailto:gnu&#64;gnu.org"><em>gnu&#64;gnu.org</em></a>. Autres <a href="/home.fr.html#ContactInfo">moyens pour contacter</a> la FSF. Merci d'envoyer des commentaires sur cette page web &agrave; <a href="mailto:webmasters&#64;gnu.org"><em>webmasters&#64;gnu.org</em></a>

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter <a href="/server/standards/README.translations.fr.html">Traductions de README</a> pour des informations sur la coordination et la soumission de traduction de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution int&eacute;grale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit pr&eacute;serv&eacute;e.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: C&eacute;dric Corazza.<br /> R&eacute;vision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Derni&egrave;re mise-&agrave;-jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page

source: <a href="/events.tmp.html"><strong>Coming Events</strong></a> | <a href="/keepingup.html"><strong>Keeping Up With GNU/FSF</strong></a> | <a href="/press/press.html"><strong>Press Information</strong></a> and <a href="/press/press.html#releases"><strong>Releases</strong></a>
fr: <a href="/events.tmp.html"><strong>Événemants à venir</strong></a> | <a href="/keepingup.fr.html"><strong>Restez informé sur GNU et la FSF</strong></a> | <a href="/press/press.html"><strong>Presse</strong></a> et <a href="/press/press.html#releases"><strong>Publications</strong></a>

source: 19 September 2008
fr: 19 septembre 2008

source: <a href="http://www.fsf.org/news/thank-you-sgi">Thank you SGI for freeing the GNU/Linux 3d desktop!</a>
fr: <a href="http://www.fsf.org/news/thank-you-sgi">Merci à SGI pour avoir libéré le bureau 3D GNU/Linux&nbsp;!</a>

source: 4 September 2008
fr: 4 septembre 2008

source: French citizens -- Hadopi plans to adopt a law, 'Loi Creation et Internet', which would punish people who fail to 'respect' copyright on the Internet. Numerama presents <a href="http://www.numerama.com/magazine/9854-10-bonnes-raisons-de-dire-NON-a-la-loi-Hadopi.html">ten reasons to reject this law</a>.
fr: Citoyens français -- Hadopi projette de faire adopter une loi&nbsp;: «&nbsp;Loi Création et Internet&nbsp;», qui punirait les gens qui ne «&nbsp;respectent&nbsp;» pas le droit d'auteur sur Internet. Numerama présente <a href="http://www.numerama.com/magazine/9854-10-bonnes-raisons-de-dire-NON-a-la-loi-Hadopi.html">Dix bonnes raisons de rejeter cette loi</a>.

source: 21 August 2008
fr: 21août 2008

source: The FSF is taking nominations for its two annual awards, the Award for the Advancement of Free Software and the Award for Projects of Social Benefit. <a href="http://www.fsf.org/news/2008FSAwardsCall">Submit your nominations for the 2008 Free Software Awards</a> -- Nominations are requested by 31 October 2008.
fr: La FSF collecte les nominations pour ses deux récompenses annuelles, la Récompense pour l'avancement du logiciel libre et la Récompense pour les projets pour le bénéfice social. <a href="http://www.fsf.org/news/2008FSAwardsCall">Soumettez vos nominations pour les Free Software Awards 2008 </a> -- Les nominations doivent être envoyées avant le 31 octobre 2008.

source: 31 July 2008
fr: 31 juillet 2008

source: The FSF has published an article revealing the restrictions Apple is using to block GPLv3-covered software from its iPhone platform, to prevent users from sharing and modifying free software on their portable computers. Please <a href="http://www.fsf.org/blogs/community/why-free-software-and-apples-iphone-dont-mix">read and share the article</a> with your friends, family, colleagues and collaborators.
fr: La FSF a publié un article révélant les restrictions qu'utilise Apple pour bloquer les logiciels couverts par la GPLv3 pour sa plateforme iPhone, pour empêcher les utilisateurs de partager ou de modifier les logiciels libres sur leurs portables. Veuillez <a href="http://www.fsf.org/blogs/community/why-free-software-and-apples-iphone-dont-mix">lire et partager cet article</a> avec vos amis, votre famille, vos collègues et collaborateurs.

source: 11 July 2008
fr: 11 juillet 2008

source: Read and share these <a href="http://www.fsf.org/blogs/community/5-reasons-to-avoid-iphone-3g">5 reasons to avoid iPhone 3G</a> with friends, family and coworkers. The iPhone's DRM prevents free software from being run on it at all, and gives Apple the authority to determine what can legally be installed by anyone on their own mobile computer.
fr: Veuillez lire et partager ces <a href="http://www.fsf.org/blogs/community/5-reasons-to-avoid-iphone-3g">5 raisons pour éviter l'iPhone 3G</a> avec vos amis, votre famille et vos collègues. Les DRM de l'iPhone empêchent l'exécution de logiciels libres sur celui-ci, et donne à Apple l'autorité de déterminer ce qui peut être installé par quiconque sur leurs téléphones portables.

source: 24 June 2008
fr: 24 juin 2008

source: <a href="http://defectivebydesign.org/fight-the-canadian-dmca">Fight the Canadian DMCA!</a>.
fr: <a href="http://defectivebydesign.org/fight-the-canadian-dmca">Combattez le DMCA canadien&nbsp;!</a>.

source: 20 June 2008
fr: 20 juin 2008

source: <a href="http://www.fsf.org/campaigns/acta/">Take action on ACTA -- the Anti-Counterfeiting Trade Agreement</a>.
fr: <a href="http://www.fsf.org/campaigns/acta/">Agissez contre l'<acronym title="Anti-Counterfeiting Trade Agreement">ACTA</acronym></a> (Accord commercial contre la contre-façon).

source: 14 May 2008
fr: 14 mai 2008

source: The Free Software Foundation (FSF) has marked a milestone in their PlayOgg.org campaign with the announcement that National Public Radio (NPR) news station WBUR Boston has begun worldwide webcasting in the free audio format Ogg Vorbis. The WBUR stream is available at <a href="http://www.wbur.org/listen/">http://www.wbur.org/listen/</a>, or you can go directly to <a href="http://www.wbur.org/listen/feed/ogg.m3u">http://www.wbur.org/listen/feed/ogg.m3u</a>.
fr: La Free Software Foundation (FSF) a posé un jalon dans sa campagne PlayOgg.org avec l'annonce de la radio d'information nationale publique (NPR) Boston WBUR qui a commencé à émettre des émissions sur le Web au format audio Ogg Vorbis. Le flux WBUR est disponible sur <a href="http://www.wbur.org/listen/">http://www.wbur.org/listen/</a>, ou vous pouvez vous rendre directement sur <a href="http://www.wbur.org/listen/feed/ogg.m3u">http://www.wbur.org/listen/feed/ogg.m3u</a>.

source: 5 March 2008
fr: 5 mars 2008

source: GNU has applied to be an organization in Google's Summer of Code 2008 program. If you'd like to participate, as a mentor, a student, or in any other way, please see the <a href="/software/soc-projects/ideas.html">SoC project suggestions so far</a> and the <a href="/software/soc-projects/guidelines.html">additional SoC guidelines</a>.
fr: GNU a posé sa candidature pour être une des organisations du programme Google's Summer of Code 2008. Si vous souhaitez participer, comme tuteur, étudiant ou d'une quelconque autre façon, veuillez consulter les <a href="/software/soc-projects/ideas.html">suggestions du projet SoC</a> et les <a href="/software/soc-projects/guidelines.html">recommandations SoC supplémentaires</a>.

source: 24 January 2008
fr: 24 janvier 2008

source: We're in the closing days of our winter fundraising drive. We need 70 more members to reach our goal of 500 by the end of the month. <a href="http://www.fsf.org/join">Join today</a>, and help spread the word by adding our <a href="http://www.fsf.org/associate/widget">fundraising widget</a> to your blog or web site!
fr: Nous arrivons dans les derniers jours de notre collecte de fonds hivernale. Nous avons besoin de 70 membres supplémentaires pour atteindre notre but de 500 à la fin du mois. <a href="http://www.fsf.org/join">Adhérez aujourd'hui</a> et aidez à passer le mot en ajoutant notre <a href="http://www.fsf.org/associate/widget">widget de collecte de fonds</a> sur votre blog ou votre site Web&nbsp;!

source: What was New in Prior Years
fr: Quelles étaient les nouvelles les années précédentes&nbsp;?
