Repository: gitGNU/gnu_www-fr
Catalog: music/music.*.po
Languages: fr

source: GNU Music and Songs
fr: Musiques et chants du GNU

source: A Listening GNU
fr: Un GNU qui écoute

source: This is a collection of music and songs for the amusement of all hackers.
fr: Ceci est une collection de musiques et chansons pour l'amusement de tous les hackers.

source: Read the <a href="/music/free-software-song.html">lyrics, score, and source code</a> of the Free Software Song.
fr: Lisez les <a href="/music/free-software-song.html">paroles, partitions, et le code source</a> de la Free Software Song (Chanson du Logiciel Libre).

source: Hear the Song <a href="/music/free-software-song.au">sung</a> by <a href="http://www.stallman.org/">Richard Stallman</a> himself. (If you are not used to a meter of 7/8, you may perceive it as inability to keep time.)
fr: Écoutez la chanson <a href="/music/free-software-song.au">chantée</a> par <a href="http://www.stallman.org/">Richard Stallman</a> lui même. (Si vous n'êtes pas habitué à un rythme de 7/8, vous pouvez penser à une incapacité à suivre le tempo.)

source: Hear the Song <a href="/music/FreeSWSong.ogg">performed</a> in a good Bulgarian style.
fr: Écoutez la chanson <a href="/music/FreeSWSong.ogg">interprétée</a> dans un bon style Bulgare.

source: Hear Katie Herzog <a href="/music/free-software-song-herzog.ogg">perform</a> the Free Software Song, released under <a href="http://creativecommons.org/licenses/by-nc-nd/3.0/">CC BY-NC-ND</a>.
fr: Écoutez Katie Herzog <a href="/music/free-software-song-herzog.ogg">interpréter</a> la Free Software Song, diffusée sous licence <a href="http://creativecommons.org/licenses/by-nc-nd/3.0/">CC BY-NC-ND</a>.

source: <a href="till_there_was_gnu.html">'Till There Was GNU</a>
fr: <a href="till_there_was_gnu.html">'Jusqu'au jour où vint GNU</a>

source: The <a href="/music/blues-song.html">Programmer's Blues</a> song!
fr: La chanson <a href="/music/blues-song.html">Blues du Programmeur</a>

source: <a href="/music/gdb-song.html">The GDB Song</a>!
fr: <a href="/music/gdb-song.html">La chanson de GDB</a>!

source: <a href="/fun/jokes/vi.song.html">Addicted to vi</a>.
fr: <a href="/fun/jokes/vi.song.html">Intoxiqué à vi</a>.

source: <a href="/fun/jokes/welcome-to-gnu-emacs.html">GNU Emacs Song</a>.
fr: <a href="/fun/jokes/welcome-to-gnu-emacs.html">Chanson de GNU Emacs</a>.

source: <a href="/fun/jokes/gnu-song.html">The GNU Song</a>
fr: <a href="/fun/jokes/gnu-song.html">La chanson du GNU</a>

source: <a href="/fun/jokes/musical-pickup.html">Musical pick-up!</a>
fr: <a href="/fun/jokes/musical-pickup.html">Reprise musicale!</a>

source: <a href="/fun/jokes/eternal-flame.ogg">"God wrote in Lisp code"</a> (See also the <a href="/fun/jokes/eternal-flame.html">lyrics</a>.)
fr: <a href="/fun/jokes/eternal-flame.ogg">"Dieu écrivit en code Lisp"</a> (Voir aussi les <a href="/fun/jokes/eternal-flame.html">paroles</a>.)

source: <a href="/fun/jokes/hackersong.html">If the Beatles were Hackers&#8230;</a>
fr: <a href="/fun/jokes/hackersong.html">Si les Beatles eurent-été des hackers&#8230;</a>

source: <a href="/fun/jokes/nobody-owns.html">Nobody owns this song</a>
fr: <a href="/fun/jokes/nobody-owns.html">Personne ne posséde cette chanson</a>

source: <a href="/fun/jokes/wonderful-code.html">What a Wonderful Code</a>
fr: <a href="/fun/jokes/wonderful-code.html">Quel code merveilleux</a>

source: <a href="/fun/jokes/vim-songs.html">VIM Songs</a>
fr: <a href="/fun/jokes/vim-songs.html">Chansons de VIM</a>

source: <a href="/fun/jokes/hap-bash.html">Happiness is a bash prompt</a>
fr: <a href="/fun/jokes/hap-bash.html">La joix est un prompt Bash</a>

source: <a href="/fun/jokes/hackforfreedom.html">Hack for Freedom Song</a>
fr: <a href="/fun/jokes/hackforfreedom.html">Hack pour la chanson de la liberté</a>

source: <a href="http://infinite-hands.draketo.de">Infinite Hands</a>
fr: <a href="http://infinite-hands.draketo.de">Mains infinies</a>

source: Happiness is a bash prompt
fr: La joix est un prompt Bash

source: You can also listen to Richard Stallman's appearances on the <a href="http://web.mit.edu/echemi/www/">Dinnertime Sampler</a> show on <a href="http://wmbr.mit.edu/">WMBR</a>, the MIT Campus Radio Station. In these shows, Richard shares some examples of his electric musical tastes with you, the listener.
fr: Vous pouvez aussi écouter les interventions de Richard Stallman lors du show <a href="http://web.mit.edu/echemi/www/">Dinnertime Sampler</a> sur <a href="http://wmbr.mit.edu/">WMBR</a>, la station radio du campus MIT (MIT Campus Radio Station). Dans ces shows, Richard partages quelques exemples de ses goûts musicaux électriques avec vous qui l'écoutez.

source: <a href="http://web.mit.edu/echemi/www/stallman.html">March 23<sup>rd</sup> 2005</a>
fr: <a href="http://web.mit.edu/echemi/www/stallman.html">23 Mars 2005</a>

source: <a href="http://web.mit.edu/echemi/www/040324.html">March 24<sup>th</sup> 2004</a>
fr: <a href="http://web.mit.edu/echemi/www/040324.html">24 Mars 2004</a>
