Repository: gitGNU/gnu_www-fr
Catalog: server/standards/README.translations.*.po
Languages: fr

source: Guide to Translating Web Pages on www.gnu.org - GNU Project - Free Software Foundation (FSF)
fr: Guide de traduction des pages web de www.gnu.org - GNU Project - Free Software Foundation (FSF)

source: Guide to Translating Web Pages on www.gnu.org
fr: Guide de traduction des pages web de www.gnu.org

source: <a href="/graphics/atypinggnu.html">
fr: <a href="/graphics/atypinggnu.fr.html">

source: A Typing GNU
fr: Un GNU tapant à la machine

source: A Typing GNU Hacker
fr: Un hacker GNU sur son clavier

source: Translating gnu.org with its many articles and keeping them updated is a complex task which requires careful organization. Translators are grouped into teams, one for each language, and each team normally has a coordinator. However, there are some languages for which no team has been formed yet, and sometimes a team lacks a coordinator.
fr: Traduire gnu.org et ses nombreux articles, puis les maintenir à jour, est une tâche complexe qui demande une bonne organisation. Les traducteurs sont regroupés en équipes, une par langue, et normalement chaque équipe a un coordinateur. Cependant il y a des langues pour lesquelles aucune équipe n'a encore été formée, et parfois une équipe manque de coordinateur.

source: Team Coordinators use software tools to update pages efficiently for partial changes. One of these tools is a program called <strong>GNUnited Nations</strong> (GNUN) that makes it very easy to maintain and keep track of translations that need to be updated; it was developed ad hoc by our current GNU Translations Manager Yavor Doganov.
fr: Les coordinateurs d'équipes <em>(Team Coordinators)</em> utilisent des outils logiciels pour mettre à jour efficacement les modifications partielles. L'un de ces outils est un programme appelé <strong>GNUnited Nations</strong> (GNUN), qui facilite grandement la maintenance et le suivi des traductions nécessitant une mise à jour&nbsp;; il a été développé pour cet usage par notre gestionnaire des traductions <em>(Translation Manager)</em>, Yavor Doganov.

source: The Translations Manager is the person in charge of the overall organization of teams and is generally involved in training new Team Coordinators.
fr: Le gestionnaire des traductions est la personne en charge de l'organisation globale des équipes, et s'occupe en général de former les coordinateurs d'équipes.

source: As a Team Member, you can contribute to translations without knowing anything about GNUN, but you can help at more levels if you know how to use it.
fr: Comme membre d'une équipe, vous pouvez contribuer aux traductions sans rien connaître de GNUN, mais vous pouvez aider à d'autres niveaux si vous savez l'utiliser.

source: Who can help
fr: Qui peut aider

source: All teams are always looking for new volunteers. Basically, there is a task for everyone in the translation process: we need people with good language skills, as well as people with good technical skills or willing to learn some simple technical skills.
fr: Toutes les équipes recherchent constamment de nouveaux volontaires. En gros, il y a une tâche pour chacun dans le processus de traduction&nbsp; nous avons besoin de gens ayant un bon niveau linguistique, aussi bien que des gens ayant un bon niveau technique ou désireux d'acquérir quelques techniques simples.

source: If you have a deep understanding of written English and a rich command of your native language, you can certainly engage in translation, or do proof-reading. Writing good English is not necessary.
fr: Si vous avez une très bonne compréhension de l'anglais écrit et maîtrisez les subtilités de votre langue maternelle, vous pouvez certainement vous mettre à la traduction, ou bien à la relecture. Il n'est pas nécessaire de bien écrire l'anglais.

source: If your understanding of English is not first class, or if you don't know English at all but have a good mastery of your mother tongue, you can help review other people's translations to make sure they read well and have a good style.
fr: Si votre compréhension de l'anglais n'est pas d'un niveau très élevé, ou si vous ne savez pas du tout l'anglais mais avez une bonne maîtrise de votre langue maternelle, vous pouvez aider à réviser les traductions d'autres personnes pour faire en sorte qu'elles se lisent facilement et que leur style soit correct.

source: If you are a native English speaker, and you can read another language, even if not quickly and easily, you can still help improve translations in that language. Translators sometimes misunderstand English idioms and expressions and write translations that are misleading or even incorrect. These errors are obvious to the native English speaker&mdash;you can indicate possible errors and explain the intended meaning, and others can retranslate that part.
fr: Si vous êtes anglophone et pouvez lire une autre langue, pas nécessairement couramment, vous pouvez tout de même améliorer les traductions dans cette langue. Parfois les traducteurs ne comprennent pas les expressions anglaises idiomatiques et font des traductions qui dévient le sens de la phrase ou même sont incorrectes. Ces erreurs sont évidentes pour un anglophone. Vous pouvez indiquer les erreurs possibles et expliquer ce que veut dire la phrase, puis d'autres peuvent retraduire ce passage.

source: If you are inclined or willing to go for the more technical side of the translation process, you can help further; for example, by preparing translated texts for publication.
fr: Si vous avez des dispositions pour aborder l'aspect plus technique du processus de traduction, ou envie de le faire, vous pouvez apporter une aide supplémentaire&nbsp;; par exemple en préparant les textes pour la publication.

source: How to Participate
fr: Comment participer

source: As a Team Member
fr: Comme membre d'une équipe

source: Please read the <a href="#general-guide">General Guide for Translations</a> below and then contact the relevant <a href="#teams">translation team</a>. Each team has its own system of organizing the work. Thus, to join an existing team, you need to get detailed information from that team. The Team Coordinator will be able to guide you through their specific methods. If you don't get an answer from the team in two weeks, write to the Translations Manager <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>.
fr: Veuillez lire le <a href="#general-guide">Guide général des traductions</a> ci-dessous, et ensuite contacter <a href="#teams">l'équipe de traducteurs</a> appropriée. Chaque équipe organise le travail à sa manière. Ainsi, en rejoignant une équipe, vous devez vous renseigner de façon détaillée auprès de cette équipe. Le coordinateur de l'équipe sera à même de vous initier à ses méthodes spécifiques. Si au bout de deux semaines vous n'avez pas de réponse de l'équipe, écrivez au gestionnaire des traductions <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>.

source: As an Occasional Contributor
fr: Comme contributeur occasionnel

source: If you just want to submit a new translation and are not interested in collaborating regularly, follow the <a href="#general-guide">General Guide for Translations</a> below and then send your translation to the appropriate <a href="#teams"> Team Coordinator</a> if there is one, or to the Translations Manager <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a> if there is no team or coordinator for your language.
fr: Si vous voulez simplement soumettre une nouvelle traduction mais ne souhaitez pas collaborer régulièrement, suivez le <a href="#general-guide">Guide général des traductions</a> ci-dessous, puis envoyez votre traduction au <a href="#teams">coordinateur d'équipe</a> approprié, s'il y en a un, ou bien au gestionnaire des traductions <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a> s'il n'y a pas d'équipe ni de coordinateur pour votre langue.

source: As a Team Coordinator
fr: Comme coordinateur d'équipe

source: If you would like to form a new team or become a Team Coordinator, please read this entire page and then get in touch with the Translations Manager <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>.
fr: Si vous voulez former une nouvelle équipe ou devenir coordinateur d'équipe, veuillez lire cette page en entier et ensuite contacter le gestionnaire des traductions <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>.

source: General Guide for Translations
fr: Guide général des traductions

source: Here are our specific goals for our translated pages.
fr: Voici les objectifs spécifiques qui nous fixons aux traductions de nos pages.

source: Accuracy
fr: La précision

source: In order to produce a translation which is accurate and faithful to the original, you need to be familiar with the basic concepts of the GNU Project and the specific terminology used in gnu.org:
fr: Afin de produire une traduction précise et fidèle à l'original, vous devez vous familiariser avec les concepts de base du projet GNU et la terminologie spécifique utilisée sur gnu.org.

source: &ldquo;Copyleft&rdquo; is a term that can be difficult to translate in some languages. It is a pun on the word &ldquo;Copyright&rdquo; based on the two meanings of &ldquo;right&rdquo;: ethical and directional. You can read the article <a href="/copyleft/copyleft.html">What is Copyleft?</a> to learn more about it and see how it has been translated into other languages. You will see that in most cases it has not been translated at all, so if you can't find a good translation for it in your language, the only option may be to use the English word.
fr: «&nbsp;Copyleft&nbsp;» est un terme qui peut être difficile à traduire dans certaines langues. C'est un jeu de mots sur «&nbsp;copyright&nbsp;», basé sur les deux sens de «&nbsp;right&nbsp;»&nbsp;: le sens éthique et le sens directionnel. Vous pouvez lire l'article <a href="/copyleft/copyleft.fr.html">Qu'est-ce que le copyleft&nbsp;?</a> pour en apprendre plus et voir comment ce mot a été traduit dans d'autres langues. Vous verrez que la plupart du temps il n'a pas été traduit du tout, aussi, si vous ne pouvez pas trouver de bonne traduction pour votre langue, la seule option est peut-être d'utiliser le mot anglais.

source: See the <a href="/philosophy/fs-translations.html">Translations of the Term &ldquo;Free Software&rdquo;</a> in several languages.
fr: Regardez les <a href="/philosophy/fs-translations.fr.html">Traductions du terme «&nbsp;logiciel libre&nbsp;»</a> (<em>Free Software</em>) dans plusieurs langues.

source: You can learn more about specific terms and the GNU philosophy by reading some articles such as the following, among others that you may find useful:
fr: Vous pouvez en apprendre plus sur les termes spécifiques en usage dans la philosophie GNU en lisant, entre autres articles que vous pourriez trouver utiles, quelques-uns des articles ci-dessous&nbsp;:

source: <a href="/philosophy/free-sw.html">What is Free Software?</a>
fr: <a href="/philosophy/free-sw.fr.html">Définition d'un logiciel libre</a>

source: <a href="/philosophy/categories.html">Categories of Free and Nonfree Software</a>
fr: <a href="/philosophy/categories.fr.html">Catégories de logiciels libres et non libres</a>

source: <a href="/philosophy/words-to-avoid.html">Words to Avoid</a>
fr: <a href="/philosophy/words-to-avoid.fr.html">Mots ou phrases prêtant à confusion, que vous devriez éviter (ou utiliser avec précaution)</a>

source: <a href="/gnu/why-gnu-linux.html">What's in a Name?</a>
fr: <a href="/gnu/why-gnu-linux.fr.html">Qu'y a-t-il dans un nom&nbsp;?</a>

source: <a href="/philosophy/open-source-misses-the-point.html">Open Source Misses the Point of Free Software</a>
fr: <a href="/philosophy/open-source-misses-the-point.fr.html">Pourquoi l'«&nbsp;open source&nbsp;» passe à coté du problème que soulève le logiciel libre</a>

source: When translating &ldquo;GNU's Not Unix&rdquo;, please ensure that the translation remains recursive. If a recursive translation cannot be conceived, use the following format (this is an example for Swedish): &ldquo;GNU's Not Unix (<span xml:lang="sv" lang="sv"> GNU &auml;r inte Unix</span>)&rdquo;.
fr: Quand vous traduisez <em>GNU's Not Unix</em> (GNU N'est pas Unix), veuillez vous assurez que la traduction reste récursive. S'il est impossible de concevoir une traduction récursive, utilisez la forme suivante&nbsp;: «&nbsp;GNU's Not Unix&nbsp;» (GNU är inte Unix).

source: Translators Manual
fr: Manuel des traducteurs

source: You may also want to read the <a href="/software/trans-coord/manual/web-trans/">GNU Web Translators Manual</a> if you wish to have a better understanding of how our translation system works. But please talk to the team first; most probably you will not be required to read it in order to start helping.
fr: Vous pouvez également lire avec profit le <a href="/software/trans-coord/manual/web-trans/">GNU Web Translators Manual</a> si vous souhaitez mieux comprendre comment fonctionne notre système de traduction. Mais veuillez d'abord contacter l'équipe&nbsp;; il est très probable que vous ne serez pas obligé de le lire pour commencer à vous rendre utile.

source: What to Translate
fr: Ce qu'il faut traduire

source: All essays and articles in the following directories should be translated in all available languages, but you should first browse our <a href="/server/standards/translations/priorities.html">Web Translation Priorities</a>:
fr: Tous les essais et articles des répertoires ci-dessous devraient être traduits dans toutes les langues possibles, mais vous devriez d'abord consulter la page <a href="/server/standards/translations/priorities.html">Web Translation Priorities</a>&nbsp;:

source: Again, please coordinate with your language team before starting any work, to get clear instructions on how to proceed and to avoid duplicating efforts.
fr: Une fois de plus, veuillez vous mettre en rapport avec l'équipe de traduction de votre langue avant de commencer tout travail, pour prendre des instructions précises sur la manière de procéder, et pour éviter de dupliquer le travail.

source: <em><strong>Note:</strong></em> The material in the <code>software/</code> directory pertains to individual GNU packages. If you would like to translate something in that directory, please talk with the maintainers of the package to see what they would like to do.
fr: <em><strong>Note&nbsp;:</strong></em> Le contenu du répertoire <code>software/</code> se rapporte aux paquetages individuels GNU. Si vous voulez traduire quelque chose dans ce répertoire, adressez-vous aux mainteneurs du paquetage pour voir ce qu'ils veulent faire.

source: Guide for Team Coordinators
fr: Guide pour les coordinateurs d'équipes

source: If there is no team established for your language or a new Team Coordinator is needed, we will be grateful if you undertake that task. To volunteer, write to the Translations Manager <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>, but please first read the following explanation of what a Team Coordinator does specifically, apart from what has been described in the General Guide.
fr: Si votre langue n'a pas d'équipe constituée ou qu'elle a besoin d'un nouveau coordinateur d'équipe, et que vous acceptez cette tâche, vous aurez toute notre reconnaissance. Pour vous porter volontaire, écrivez au gestionnaire des traductions <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a> mais d'abord, outre ce qui est décrit dans le guide général, veuillez lire l'explication ci-dessous sur le rôle du coordinateur d'équipe,

source: First, let's look at the tools that we use in our website to process translations and to keep them updated.
fr: D'abord, voyons les outils que nous utilisons sur notre site web pour gérer les traductions et les maintenir à jour.

source: Tools to Help Translators
fr: Outils pour aider les traducteurs

source: We use .po (Portable Object) files to process and maintain translations. A .po file contains the original text and its translation, divided in paragraphs. We do it this way so that, when there is a change in the English version of a page, our system will generate an updated .po file showing the strings that have changed. The translator then updates the translation of those strings.
fr: Nous utilisons des fichier .po (portable object) pour gérer et maintenir à jour les traductions. Un fichier .po contient le texte original et sa traduction, divisés en paragraphes. Nous procédons de cette façon pour que, si la version anglaise d'une page est modifiée, notre système génère un fichier .po actualisé montrant les chaînes qui ont changé. Ensuite, le traducteur met à jour la traduction de ces chaînes.

source: To edit a .po file, use <a href="/software/emacs/">GNU Emacs</a> (install <em>gettext-el</em> to automatically switch to PO mode) or any .po file editor.
fr: Pour éditer un fichier .po, utilisez <a href="/software/emacs/">GNU Emacs</a> (installez <em>gettext-el</em> pour basculer automatiquement en mode PO) ou n'importe quel éditeur de fichier .po.

source: How is the .po file used? GNUnited Nations (GNUN), a build system for www.gnu.org translations, generates a .pot file (.po template) of an original HTML article; whenever there is a change in the original article, the .pot file is regenerated to merge the changes. Finally, it regenerates the translations in HTML format. For further information see <a href="/software/gnun/">GNUnited Nations (GNUN)</a>.
fr: Comment est utilisé le fichier .po&nbsp;? GNUnited Nations (GNUN), un système de compilation des traductions de gnu.org, génère un fichier .pot <em>(.po template)</em> à partir d'un article original en HTML&nbsp;; lorsque l'article original est modifié, le fichier .pot est régénéré pour intégrer les modifications. À la fin du processus, il régénère les traductions au format HTML. Pour plus ample information, voyez <a href="/software/gnun/">GNUnited Nations (GNUN)</a>.

source: Keeping Translations Current
fr: Maintenir les traductions à jour

source: For all translations to be kept current, if you decide to become a Team Coordinator, you should subscribe to the <a href="http://lists.gnu.org/mailman/listinfo/www-commits">www-commits</a> mailing list. Then you will be sent one email for each page that is modified in <em>CVS</em> (for the www module). The traffic is around 4-5 mails per day, more on weekends. It's suggested that you burst through them about once a week to make sure the translations are current. You may also use &ldquo;<em><code>make report TEAM=LANG</code></em>&rdquo; if you have <a href="/software/gnun/">GNUN</a> installed.
fr: Pour que toutes les traductions restent à jour, si vous décider de devenir coordinateur d'une équipe, vous devez vous abonner à la liste de diffusion <a href="http://lists.gnu.org/mailman/listinfo/www-commits">www-commits</a>. Vous recevrez alors un courriel pour chaque page qui est modifiée dans le cvs (pour le module www). Le trafic est d'environ 4 ou 5 courriels par jour, un peu plus le week-end. Nous vous suggérons de sauvegarder tout ces courriels et de les examiner une fois par semaine pour vous assurer que les traductions sont à jour. Vous pouvez aussi utiliser <code>make report TEAM=LANG</code> si vous avez installé <a href="/software/gnun/">GNUN</a>.

source: A coordinator should also read and be well acquainted with the following documentation:
fr: Un coordinateur doit également lire et bien connaître la documentation suivante&nbsp;:

source: After you have read at least the first two manuals and this entire page, please contact the Translations Manager <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a> for further assistance.
fr: Une fois que vous aurez lu au moins les deux premiers manuels, ainsi que cette page en entier, merci de contacter le gestionnaire des traductions <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a> qui vous assistera dans les étapes ultérieures.

source: Translation Teams
fr: Équipes de traduction&nbsp;:

source: Volunteers to establish new teams are more than welcome and will be assisted during the learning process.
fr: Les volontaires désirant créer de nouvelles équipes sont plus que bienvenus et nous les assisterons pendant la mise en route.

source: Contact the Translations Manager <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a> if you would like to form a new team or become a Team Coordinator and be listed as the translation Team Coordinator for your language.
fr: Contactez le gestionnaire des traductions <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a> si vous voulez former une nouvelle équipe de traduction ou devenir coordinateur de traduction, et être listé comme coordinateur de l'équipe de traduction pour votre langue.

source: In the following list, the language code is followed by the name of the language, and by the name and contact details of the translation Team Coordinator.
fr: Dans la liste ci-dessous, les codes de langues sont suivis du nom de la langue, ainsi que du nom et des coordonnées du coordinateur de l'équipe de traduction.

source: <code>ar</code> - <a href="https://savannah.nongnu.org/projects/www-ar">Arabic</a> (New coordinator needed)
fr: <code>ar</code> - <a href="https://savannah.nongnu.org/projects/www-ar">Arabe</a> (Nouveau coordinateur demandé)

source: <code>az</code> - Azerbaijani (<a href="https://savannah.gnu.org/users/igrar">Igrar Huseynov</a> - New coordinator needed)
fr: <code>az</code> - Azéri (<a href="https://savannah.gnu.org/users/igrar">Igrar Huseynov</a> - Nouveau coordinateur demandé)

source: <code>bg</code> - <a href="https://savannah.gnu.org/projects/www-bg">Bulgarian</a> (<a href="https://savannah.gnu.org/users/yavor">Yavor Doganov</a>)
fr: <code>bg</code> - <a href="https://savannah.gnu.org/projects/www-bg">Bulgare</a> (<a href="https://savannah.gnu.org/users/yavor">Yavor Doganov</a>)

source: <code>bn</code> - <a href="https://savannah.gnu.org/projects/www-bn">Bengali</a> (<a href="https://savannah.gnu.org/users/suzan">Khandakar Mujahidul Islam</a> - New coordinator needed)
fr: <code>bn</code> - <a href="https://savannah.gnu.org/projects/www-bn">Bengalî</a> (<a href="https://savannah.gnu.org/users/suzan">Khandakar Mujahidul Islam</a> - Nouveau coordinateur demandé)

source: <code>cs</code> - <a href="https://savannah.gnu.org/projects/www-cs">Czech</a> (New coordinator needed)
fr: <code>cs</code> - <a href="https://savannah.gnu.org/projects/www-cs">Czech</a> (Nouveau coordinateur demandé)

source: <code>da</code> - <a href="https://savannah.gnu.org/projects/www-da">Danish</a> (<a href="https://savannah.gnu.org/users/erikg">Erik Gravgaard</a> - New coordinator needed)
fr: <code>da</code> - <a href="https://savannah.gnu.org/projects/www-da">Danois</a> (<a href="https://savannah.gnu.org/users/erikg">Erik Gravgaard</a> - Nouveau coordinateur demandé)

source: <code>de</code> - <a href="https://savannah.gnu.org/projects/www-de">German</a> (<a href="https://savannah.gnu.org/users/joeko">Joerg Kohne</a>)
fr: <code>de</code> - <a href="https://savannah.gnu.org/projects/www-de">Allemand</a> (<a href="https://savannah.gnu.org/users/joeko">Joerg Kohne</a>)

source: <code>el</code> - <a href="https://savannah.gnu.org/projects/www-el">Greek</a> (<a href="https://savannah.gnu.org/users/gzarkadas">Georgios Zarkadas</a>)
fr: <code>el</code> - <a href="https://savannah.gnu.org/projects/www-el">Grec</a> (<a href="https://savannah.gnu.org/users/gzarkadas">Georgios Zarkadas</a>)
