Repository: gitGNU/gnu_www-fr
Catalog: server/standards/README.translations.*.po
Languages: fr

source: <code>eo</code> - <a href="https://savannah.gnu.org/projects/www-eo">Esperanto</a> (<a href="https://savannah.gnu.org/users/civodul">Ludovic Court&egrave;s</a> - New coordinator needed)
fr: <code>eo</code> - <a href="https://savannah.gnu.org/projects/www-eo">Esperanto</a> (<a href="https://savannah.gnu.org/users/civodul">Ludovic Courtès</a> - Nouveau coordinateur demandé)

source: <code>es</code> - <a href="https://savannah.gnu.org/projects/www-es">Spanish</a> (<a href="https://savannah.gnu.org/users/xavi_">Xavier Reina</a>)
fr: <code>es</code> - <a href="https://savannah.gnu.org/projects/www-es">Espagnol</a> (<a href="https://savannah.gnu.org/users/xavi_">Xavier Reina</a>)

source: <code>fa</code> - <a href="https://savannah.gnu.org/projects/www-fa">Farsi/Persian</a> (<a href="https://savannah.gnu.org/users/esmaeeli">Abbas Esmaeeli Some&lsquo;eh</a>)
fr: <code>fa</code> - <a href="https://savannah.gnu.org/projects/www-fa">Farsi/Persan</a> (<a href="https://savannah.gnu.org/users/esmaeeli">Abbas Esmaeeli Some&lsquo;eh</a>)

source: <code>fi</code> - <a href="https://savannah.gnu.org/projects/www-fi">Finnish</a> (<a href="https://savannah.gnu.org/users/solarius">Ville</a> - New coordinator needed)
fr: <code>fi</code> - <a href="https://savannah.gnu.org/projects/www-fi">Finnois</a> (<a href="https://savannah.gnu.org/users/solarius">Ville</a> - Nouveau coordinateur demandé)

source: <code>fr</code> - <a href="https://savannah.gnu.org/projects/www-fr">French</a> (<a href="https://savannah.gnu.org/users/barbier">Denis Barbier</a>)
fr: <code>fr</code> - <a href="https://savannah.gnu.org/projects/www-fr">Français</a> (<a href="https://savannah.gnu.org/users/barbier">Denis Barbier</a>)

source: <code>he</code> - <a href="https://savannah.gnu.org/projects/www-he">Hebrew</a> (New coordinator needed)
fr: <code>he</code> - <a href="https://savannah.gnu.org/projects/www-he">Hébreu</a> (Nouveau coordinateur demandé)

source: <code>id</code> - <a href="https://savannah.gnu.org/projects/www-id">Indonesian</a> (New coordinator needed)
fr: <code>id</code> - <a href="https://savannah.gnu.org/projects/www-id">Indonésien</a> (Nouveau coordinateur demandé)

source: <code>it</code> - <a href="https://savannah.gnu.org/projects/www-it">Italian</a> (<a href="https://savannah.gnu.org/users/pescetti">Andrea Pescetti</a>)
fr: <code>it</code> - <a href="https://savannah.gnu.org/projects/www-it">Italien</a> (<a href="https://savannah.gnu.org/users/pescetti">Andrea Pescetti</a>)

source: <code>ja</code> - <a href="https://savannah.gnu.org/projects/www-ja">Japanese</a> (<a href="https://savannah.gnu.org/users/mhatta">Masayuki Hatta</a>)
fr: <code>ja</code> - <a href="https://savannah.gnu.org/projects/www-ja">Japonais</a> (<a href="https://savannah.gnu.org/users/mhatta">Masayuki Hatta</a>)

source: <code>ko</code> - Korean (Song Chang-hun <a href="mailto:chsong@gnu.org">&lt;chsong@gnu.org&gt;</a> - New coordinator needed)
fr: <code>ko</code> - Coréen (Song Chang-hun <a href="mailto:chsong@gnu.org">&lt;chsong@gnu.org&gt;</a> - Nouveau coordinateur demandé)

source: <code>ku</code> - <a href="https://savannah.gnu.org/projects/www-ku">Kurdish</a> (New coordinator needed)
fr: <code>ku</code> - <a href="https://savannah.gnu.org/projects/www-ku">Kurde</a> (Nouveau coordinateur demandé)

source: <code>ml</code> - <a href="https://savannah.gnu.org/projects/www-ml">Malayalam</a> (New coordinator needed)
fr: <code>ml</code> - <a href="https://savannah.gnu.org/projects/www-ml">Malayalam</a> (Nouveau coordinateur demandé)

source: <code>nb</code> - <a href="https://savannah.gnu.org/projects/www-nb">Norwegian Bokm&aring;l</a> (<a href="https://savannah.gnu.org/users/att"> Andreas Tolfsen</a>)
fr: <code>nb</code> - <a href="https://savannah.gnu.org/projects/www-nb">Norvégien Bokm&aring;l</a> (<a href="https://savannah.gnu.org/users/att"> Andreas Tolfsen</a>)

source: <code>nl</code> - <a href="https://savannah.gnu.org/projects/www-nl">Dutch</a> (<a href="https://savannah.gnu.org/users/tuijldert">Tom Uijldert</a>)
fr: <code>nl</code> - <a href="https://savannah.gnu.org/projects/www-nl">Néerlandais</a> (<a href="https://savannah.gnu.org/users/tuijldert">Tom Uijldert</a>)

source: <code>nn</code> - Norwegian Nynorsk (<a href="https://savannah.gnu.org/users/att">Andreas Tolfsen</a>, permanent coordinator needed)
fr: <code>nn</code> - <a href="https://savannah.gnu.org/projects/www-nb">Norvégien Nynorsk</a> (<a href="https://savannah.gnu.org/users/att">Andreas Tolfsen</a>, coordinateur permanent demandé)

source: <code>pl</code> - <a href="https://savannah.gnu.org/projects/www-pl">Polish</a> (<a href="https://savannah.gnu.org/users/jsowoc">Jan Owoc</a>)
fr: <code>pl</code> - <a href="https://savannah.gnu.org/projects/www-pl">Polonais</a> (<a href="https://savannah.gnu.org/users/jsowoc">Jan Owoc</a>)

source: <code>pt</code> - Portuguese (New coordinator needed)
fr: <code>pt</code> - Portugais (Nouveau coordinateur demandé)

source: <code>pt-br</code> - <a href="https://savannah.gnu.org/projects/www-pt-br">Brazilian Portuguese</a> (New coordinator needed)
fr: <code>pt-br</code> - <a href="https://savannah.gnu.org/projects/www-pt-br">Portugais brésilien</a> (Nouveau coordinateur demandé)

source: <code>ro</code> - <a href="https://savannah.gnu.org/projects/www-ro">Romanian</a> (<a href="https://savannah.gnu.org/users/buzdugan">Laurentiu Buzdugan</a>)
fr: <code>ro</code> - <a href="https://savannah.gnu.org/projects/www-ro">Roumain</a> (<a href="https://savannah.gnu.org/users/buzdugan">Laurentiu Buzdugan</a>)

source: <code>ru</code> - <a href="https://savannah.nongnu.org/projects/www-ru">Russian</a> (<a href="https://savannah.gnu.org/users/jimcrow">Anatoly A. Kazantsev</a>, <a href="https://savannah.gnu.org/users/ineiev">Pavel Kharitonov</a>)
fr: <code>ru</code> - <a href="https://savannah.nongnu.org/projects/www-ru">Russe</a> (<a href="https://savannah.gnu.org/users/jimcrow">Anatoly A. Kazantsev</a>, <a href="https://savannah.gnu.org/users/ineiev">Pavel Kharitonov</a>)

source: <code>sk</code> - <a href="https://savannah.nongnu.org/projects/www-sk">Slovak</a> (<a href="https://savannah.gnu.org/users/dominiks">Dominik Smatana</a> - New coordinator needed)
fr: <code>sk</code> - <a href="https://savannah.nongnu.org/projects/www-sk">Slovaque</a> (<a href="https://savannah.gnu.org/users/dominiks">Dominik Smatana</a> - Nouveau coordinateur demandé)

source: <code>sq</code> - <a href="https://savannah.gnu.org/projects/www-sq">Albanian</a> (<a href="https://savannah.gnu.org/users/beso">Besnik Bleta</a>)
fr: <code>sq</code> - <a href="https://savannah.gnu.org/projects/www-sq">Albanais</a> (<a href="https://savannah.gnu.org/users/beso">Besnik Bleta</a>)

source: <code>sr</code> - <a href="https://savannah.gnu.org/projects/www-sr">Serbian</a> (<a href="https://savannah.gnu.org/users/Ctpajgep">Strahinya Radich</a>)
fr: <code>sr</code> - <a href="https://savannah.gnu.org/projects/www-sr">Serbe</a> (<a href="https://savannah.gnu.org/users/Ctpajgep">Strahinya Radich</a>)

source: <code>th</code> - <a href="https://savannah.gnu.org/projects/www-th">Thai</a> (New coordinator needed)
fr: <code>th</code> - <a href="https://savannah.gnu.org/projects/www-th">Thaï</a> (Nouveau coordinateur demandé)

source: <code>tl</code> - <a href="https://savannah.gnu.org/projects/www-tl">Tagalog</a> (New coordinator needed)
fr: <code>tl</code> - <a href="https://savannah.gnu.org/projects/www-tl">Tagalog</a> (Nouveau coordinateur demandé)

source: <code>tr</code> - <a href="https://savannah.gnu.org/projects/www-tr">Turkish</a> (<a href="https://savannah.gnu.org/users/exalted">Ali Servet D&ouml;nmez</a>)
fr: <code>tr</code> - <a href="https://savannah.gnu.org/projects/www-tr">Turc</a> (<a href="https://savannah.gnu.org/users/exalted">Ali Servet Dönmez</a>)

source: <code>uk</code> - <a href="https://savannah.gnu.org/projects/www-uk">Ukrainian</a> (<a href="https://savannah.nongnu.org/users/sudyr">Evgeniy Sudyr</a>)
fr: <code>uk</code> - <a href="https://savannah.gnu.org/projects/www-uk">Ukrainien</a> (<a href="https://savannah.nongnu.org/users/sudyr">Evgeniy Sudyr</a>)

source: <code>zh-cn</code> - <a href="https://savannah.gnu.org/projects/www-zh-cn">Simplified Chinese</a> (<a href="https://savannah.gnu.org/users/monnand"> Nan Deng</a>, <a href="https://savannah.gnu.org/users/zeuux">Bill Xu</a>, <a href="https://savannah.gnu.org/users/chxiaobin">Chen Xiaobin</a>)
fr: <code>zh-cn</code> - <a href="https://savannah.gnu.org/projects/www-zh-cn">Chinois simplifié</a> (<a href="https://savannah.gnu.org/users/monnand"> Nan Deng</a>, <a href="https://savannah.gnu.org/users/zeuux">Bill Xu</a>, <a href="https://savannah.gnu.org/users/chxiaobin">Chen Xiaobin</a>)

source: <code>zh-tw</code> - <a href="https://savannah.gnu.org/projects/www-zh-cn">Traditional Chinese</a> (<a href="https://savannah.gnu.org/users/monnand"> Nan Deng</a>, <a href="https://savannah.gnu.org/users/zeuux">Bill Xu</a>, <a href="https://savannah.gnu.org/users/chxiaobin">Chen Xiaobin</a>)
fr: <code>zh-tw</code> - <a href="https://savannah.gnu.org/projects/www-zh-cn">Chinois traditionnel</a> (<a href="https://savannah.gnu.org/users/monnand"> Nan Deng</a>, <a href="https://savannah.gnu.org/users/zeuux">Bill Xu</a>, <a href="https://savannah.gnu.org/users/chxiaobin">Chen Xiaobin</a>)

source: <code>??</code> - Not available? Then this line is reserved for you.
fr: <code>??</code> - Langue non disponible&nbsp;? Alors cette ligne vous est réservée.

source: <strong>Note:</strong> <em>English (<code>en</code>)</em> is a special case. The bulk of the site is written in English, which is the de-facto language of the GNU Project. We <em>occasionally</em> need original documents written in other languages translated into English. It is best to notify the team coordinator of your language that you volunteer, because we always contact them first. If there is no team coordinator and you are willing to help with this, please contact <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt; </a>.
fr: <strong>Note&nbsp;:</strong> <em>L'anglais (<code>en</code>)</em> est un cas à part. Pour l'essentiel, ce site est écrit en anglais, qui est de fait la langue du projet GNU. Nous avons <em>occasionnellement</em> besoin de traduire en anglais des documents originaux écrits dans d'autres langues. Il est recommandé de contacter le coordinateur de l'équipe de traduction de votre langue pour lui signaler que vous vous portez volontaire, car nous le contactons toujours en premier. S'il n'existe pas d'équipe de traduction dans votre langue et que vous voulez nous aider pour cela, merci de nous contacter à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: L'équipe française utilise la liste de diffusion trad-gnu&#64;april.org pour se coordonner.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes générales concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF.

source: Please send broken links and other corrections or suggestions to <a href="mailto:bug-baz@gnu.org">&lt;bug-baz@gnu.org&gt;</a>.
fr: Veuillez indiquer (en anglais) les liens orphelins et autres corrections ou suggestions à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
fr: Cette page peut-être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Mathieu Stumpf.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:
