Repository: gitGNU/gnu_www-fr
Catalog: philosophy/*-doj-tunney.*.po
Languages: fr

source: FSF Statement in Response to Proposed Revised Final Judgment in Microsoft vs. United States
fr: D&eacute;claration de la FSF en r&eacute;ponse &agrave; la proposition de jugement d&eacute;finitif r&eacute;vis&eacute; dans le proc&egrave;s Microsoft contre les &Eacute;tats-Unis

source: January 28, 2002
fr: Le 28 janvier 2002

source: Dear Ms Hesse,
fr: Ch&egrave;re Mme Hesse,

source: I am Professor of Law at Columbia University Law School in New York, and General Counsel (<i>pro bono publico</i>) of the Free Software Foundation, a non-profit &sect;501(c)(3) corporation organized under the laws of the Commonwealth of Massachusetts, with its headquarters in Boston. I make this statement under the provisions of 15 U.S.C. &sect; 16(d) concerning the Proposed Revised Final Judgment (hereinafter &ldquo;the Settlement&rdquo;) in <i>United States v. Microsoft Corp</i>.
fr: Je suis professeur de droit &agrave; la Columbia University Law School de New York et Avocat conseil g&eacute;n&eacute;ral (<i>pro bono publico</i>) de la Free Software Foundation, un organisme &agrave; but non lucratif &sect;&nbsp;501(c)(3) selon les lois du Commonwealth du Massachusetts, dont le si&egrave;ge se situe &agrave; Boston. Je fais cette d&eacute;claration sur les dispositions du 15 <abbr title="United States Code">U.S.C.</abbr> &sect;&nbsp;16(d) concernant la proposition de jugement d&eacute;finitif r&eacute;vis&eacute; (nomm&eacute; ci-apr&egrave;s le &laquo;&nbsp;<em>r&egrave;glement judiciaire</em>&nbsp;&raquo;) de <i>Les &Eacute;tats-Unis contre Microsoft Corporation</i>.

source: The remedies sought to be effected in the Settlement are, in their broad outline, appropriate and reasonable measures for the abatement of the illegal conduct proven by the United States at trial. The goal of such remedies is to require that Defendant affirmatively assist the restoration of competition in the market in which the Defendant has been shown to have illegally maintained a monopoly in violation of 15 U.S.C. &sect;2. The remedies embodied in the Settlement would substantially achieve that goal, appropriately furthering the Government's pursuit of the public interest, if the Settlement were amended to rectify certain details one-sidedly favorable to the Defendant's goal of continuing its illegal monopoly.
fr: Les voies de recours recherch&eacute;es dans le <em>r&egrave;glement judiciaire</em> sont, dans les grandes lignes, des mesures appropri&eacute;es et raisonnables pour l'arr&ecirc;t de la proc&eacute;dure pour conduite ill&eacute;gale prouv&eacute;e par les &Eacute;tats-Unis au proc&egrave;s. Le but de telles voies de recours est d'exiger du <em>d&eacute;fendant</em> de v&eacute;ritablement aider &agrave; r&eacute;tablir la concurrence dans le march&eacute; pour lequel il a &eacute;t&eacute; d&eacute;montr&eacute; que le <em>d&eacute;fendant</em> avait maintenu ill&eacute;galement un monopole en violation du 15 U.S.C. &sect;&nbsp;2. Les voies de recours englob&eacute;es dans le <em>r&egrave;glement judiciaire</em> atteindraient substantiellement ce but en continuant de fa&ccedil;on appropri&eacute;e la poursuite du gouvernement dans l'int&eacute;r&ecirc;t public, si le <em>r&egrave;glement judiciaire</em> &eacute;tait amend&eacute; pour rectifier certains d&eacute;tails uniquement favorables au but du <em>d&eacute;fendant</em> de continuer son monopole ill&eacute;gal.

source: Defendant&mdash;in the interest of continuing unabated its illegal monopoly&mdash;has artfully drafted certain clauses of the Settlement so as to hobble potential competition, giving the appearance of affirmatively assisting to undo its wrong, but covertly assisting instead in its continuance.
fr: Le <em>d&eacute;fendant</em> &mdash; dans l'int&eacute;r&ecirc;t de la poursuite inchang&eacute;e de son monopole ill&eacute;gal &mdash; a astucieusement r&eacute;dig&eacute; certaines clauses du <em>r&egrave;glement judiciaire</em> de sorte &agrave; entraver la concurrence potentielle, en donnant l'impression de v&eacute;ritablement aider &agrave; corriger son erreur, mais en aidant en fait de fa&ccedil;on voil&eacute;e sa poursuite.

source: The District Court found that the Defendant had illegally maintained a monopoly in the market for Intel-compatible PC operating systems. (Findings of Fact, November 19, 1999, &para;19.) The mechanism of that monopolization, the court found, was the attempt to establish exclusive control of &ldquo;application program interfaces&rdquo; (&ldquo;APIs&rdquo;) to which applications developers resort for operating system services, so as to prevent the possibility of &ldquo;cross-platform&rdquo; development threatening Defendant's operating systems monopoly. (Findings of Fact, &para;80 and <i>passim</i>.)
fr: La Cour de district a prouv&eacute; que le <em>d&eacute;fendant</em> avait ill&eacute;galement maintenu un monopole sur le march&eacute; des syst&egrave;mes d'exploitation pour <abbr title="Personal Computer">PC</abbr> compatibles Intel. (Constatations des faits, le 19 novembre 1999, &para;&nbsp;19.) Le m&eacute;canisme de ce monopole, ainsi que l'a trouv&eacute; la Cour, &eacute;tait la tentative d'&eacute;tablir un contr&ocirc;le exclusif des &laquo;&nbsp;interfaces de programmation&nbsp;&raquo;(&laquo;&nbsp;<abbr title="Application Program Interfaces">API</abbr>&nbsp;&raquo;) auxquelles les d&eacute;veloppeurs d'applications ont recours pour les services de syst&egrave;mes d'exploitation, de sorte &agrave; emp&ecirc;cher la possibilit&eacute; de d&eacute;veloppement &laquo;&nbsp;multiplateforme&nbsp;&raquo; (&laquo;&nbsp;cross-platform&nbsp;&raquo;) mena&ccedil;ant le monopole sur les syst&egrave;mes d'exploitation du <em>d&eacute;fendant</em>. (Constatations des faits, &para;&nbsp;80 et <i>passim</i>).

source: The Settlement accordingly makes appropriate provision to require Microsoft to provide access to full and complete technical information about its APIs on non-discriminatory terms, so as to prevent Defendant's prior conduct in erecting artificial and illegal barriers to entry to the monopolized market.
fr: Le <em>r&egrave;glement judiciaire</em> stipule en cons&eacute;quence une clause appropri&eacute;e pour obliger Microsoft &agrave; donner un acc&egrave;s complet &agrave; toutes les informations techniques sans restriction au sujet de ses API en des termes non discriminatoires, afin d'emp&ecirc;cher que se reproduise la conduite initiale du <em>d&eacute;fendant</em> d'&eacute;riger des barri&egrave;res artificielles et ill&eacute;gales pour entrer dans le march&eacute; monopolis&eacute;.

source: But the precise terms of the Settlement create a series of artful technical loopholes vitiating the primary intention.
fr: Mais les termes pr&eacute;cis du <em>r&egrave;glement judiciaire</em> cr&eacute;e une s&eacute;rie d'&eacute;chappatoires astucieuses qui vicient l'intention initiale.

source: Section III(D) provides that:
fr: La section III(D) stipule que&nbsp;:

source: Starting at the earlier of the release of Service Pack 1 for Windows XP or 12 months after the submission of this Final Judgment to the Court, Microsoft shall disclose to ISVs, IHVs, IAPs, ICPs, and OEMs, for the sole purpose of interoperating with a Windows Operating System Product, via the Microsoft Developer Network (&ldquo;MSDN&rdquo;) or similar mechanisms, the APIs and related Documentation that are used by Microsoft Middleware to interoperate with a Windows Operating System Product. (emphasis added)
fr: &Agrave; compter au plus t&ocirc;t &agrave; partir de la publication du Service Pack 1 pour Windows XP ou douze mois apr&egrave;s la soumission de ce jugement d&eacute;finitif &agrave; la Cour, Microsoft devra r&eacute;v&eacute;ler aux <abbr title="Fournisseur d'acc&egrave;s &agrave; Internet">FAI</abbr>, aux vendeurs de mat&eacute;riel ind&eacute;pendants (&laquo;&nbsp;<abbr title="Independent Hardware Vendor">IHV</abbr>&nbsp;&raquo;), aux fournisseurs de services Internet (&laquo;&nbsp;<abbr title="Internet Access Provider">IAP</abbr>&nbsp;&raquo;), aux fournisseurs de contenu ind&eacute;pendants (&laquo;&nbsp;<abbr title="Independent Content Provider">ICP</abbr>&nbsp;&raquo;) et aux assembleurs (&laquo;&nbsp;<abbr title="Original Equipment Manufacturer">OEM</abbr>&nbsp;&raquo;), <i>dans le seul but de s'interfacer avec le syst&egrave;me d'exploitation Windows</i>, via le Microsoft Developer Network (&laquo;&nbsp;MSDN&nbsp;&raquo;) ou tout autre m&eacute;canisme similaire, les API et leurs documentations relatives utilis&eacute;es par les logiciels de couches interm&eacute;diaires (&laquo;&nbsp;middleware&nbsp;&raquo;) de Microsoft Middleware pour s'interfacer avec un syst&egrave;me d'exploitation de Microsoft. (l'emphase est ajout&eacute;e)

source: The &ldquo;sole purpose&rdquo; requirement means that Defendant does not have to make any such API information available to developers of software whose purpose it is to make competing Intel-compatible PC operating systems. Only those who make programs that interoperate with Windows Operating Systems Products may receive such information. Under &sect; III(I)(3), an applications developer who has received licensed information concerning Defendant's APIs could be prohibiting from sharing that information with a maker of a competing Intel-compatible PC operating system, for the purpose of interoperating with that competing product. Under &sect;III(I)(2), if a potential competitor in the market for Intel-compatible PC operating systems also makes applications products, it can even be prohibited from using licensed information it receives in order to make those applications interoperate with Defendant's products also interoperate with its own competing operating system. What should be a provision requiring Defendant to share information with potential competitors in the monopolized market turns out, after Defendant's careful manipulation, to be a provision for sharing information &ldquo;solely&rdquo; with people other than competitors in the monopolized market. The same language has been inserted into &sect;III(E), thus similarly perverting the intention of the Settlement with respect to Communications Protocols.
fr: La condition de &laquo;&nbsp;seul but&nbsp;&raquo; signifie que le <em>d&eacute;fendant</em> n'a pas &agrave; rendre disponibles de telles informations sur les API aux d&eacute;veloppeurs dont le but est de faire jouer la concurrence sur les syst&egrave;mes d'exploitation PC compatibles Intel. Seuls ceux qui font des programmes pour s'interfacer avec les syst&egrave;mes d'exploitation Windows peuvent recevoir de telles informations. Sous le &sect;&nbsp;III(I)(3), un d&eacute;veloppeur d'applications qui a re&ccedil;u des informations sous licence concernant des API du <em>d&eacute;fendant</em> pourrait &ecirc;tre interdit de partager ces informations avec un concurrent dans le domaine des syst&egrave;mes d'exploitation PC compatibles Intel, dans le but de l'interfacer avec ce produit concurrent. Sous le &sect;&nbsp;III(I)(2), si un concurrent potentiel sur le march&eacute; des syst&egrave;mes d'exploitation PC compatibles Intel fait &eacute;galement des applications, il peut m&ecirc;me lui &ecirc;tre interdit d'utiliser ces informations sous licence qu'il a re&ccedil;u afin d'interfacer ces applications avec les produits du <em>d&eacute;fendant</em> pour &eacute;galement s'interfacer avec son propre syst&egrave;me d'exploitation concurrent. Que vaudrait une clause obligeant le <em>d&eacute;fendant</em> &agrave; partager des informations avec ses concurrents potentiels dans le march&eacute; monopolis&eacute; si elle devenait, apr&egrave;s de soigneuses manipulations du <em>d&eacute;fendant</em>, une clause de partage des informations &laquo;&nbsp;uniquement&nbsp;&raquo; avec des personnes autres que les comp&eacute;titeurs du march&eacute; monopolis&eacute;. Le m&ecirc;me langage a &eacute;t&eacute; ins&eacute;r&eacute; dans le &sect;&nbsp;III(E), pervertissant ainsi de mani&egrave;re similaire l'intention du <em>r&egrave;glement judiciaire</em> au regard des protocoles de communications.

source: Defendant has not merely engaged in this undertaking with a goal to the exclusion of potential future competitors from the monopolized market. In the teeth of the evidence, long after having been proved to have behaved with exaggerated contempt for the antitrust laws, Defendant is attempting in the very Judgment delivered against it to exclude from the market its most vigorous current competitor.
fr: Le <em>d&eacute;fendant</em> ne s'est pas seulement engag&eacute; dans cette entreprise avec l'intention d'exclure ses futurs concurrents potentiels du march&eacute; monopolis&eacute;. En d&eacute;pit de l'&eacute;vidence, bien longtemps apr&egrave;s qu'il ait &eacute;t&eacute; prouv&eacute; qu'il avait agi total des lois antitrust, le <em>d&eacute;fendant</em> essaie dans le tout dernier jugement qui lui est adress&eacute; d'exclure du march&eacute; son plus vigoureux concurrent.

source: Defendant's most significant present challenger in the Intel-compatible PC operating systems market is the collection of &ldquo;free software,&rdquo; which is free in the sense of freedom, not necessarily in price: thousands of programs written collaboratively by individuals and organizations throughout the world, and made available under license terms that allow everyone to freely use, copy, modify and redistribute all the program code. That free software, most of it licensed under the terms of the Free Software Foundation's GNU General Public License (&ldquo;the GPL&rdquo;) represents both an operating system, known as GNU, and an enormous corpus of applications programs that can run on almost all existing architectures of digital computers, including Intel-compatible PCs. Through one such free software component, an operating system &ldquo;kernel&rdquo; called Linux, written by thousands of individuals and distributed under the GPL, the GNU operating system can execute on Intel-compatible PC's, and by combining Linux with other free software, GNU can perform all the functions performed by Windows. Non-Microsoft Middleware can execute on Intel-compatible PCs equipped with components of GNU and Linux. Intel-compatible PCs so equipped currently account for more than 30% of the installed server base in the United States, according to independent industry obsevers.
fr: Le challengeur le plus significatif du <em>d&eacute;fendant</em> sur le march&eacute; des syst&egrave;mes d'exploitation PC compatibles Intel est l'ensemble de &laquo;&nbsp;logiciels libres&nbsp;&raquo;, libres au sens de la libert&eacute;, pas n&eacute;cessairement du prix&nbsp;: des milliers de programmes &eacute;crits en collaboration par des particuliers ou des organisations de par le monde et rendus disponibles sous des termes de licence qui autorisent quiconque &agrave; utiliser, copier, modifier et redistribuer tout le code du programme. Ces logiciels libres, dont la plupart sont sous la Licence G&eacute;n&eacute;rale Publique &laquo;&nbsp;theGPL&nbsp;&raquo;) de la Free Software Foundation repr&eacute;sente &agrave; la fois un syst&egrave;me d'exploitation, connu sous le nom de GNU, et un &eacute;norme ensemble de programmes qui fonctionnent sur presque toutes les architectures d'ordinateurs num&eacute;riques, y compris les PC compatibles Intel. Et avec l'un de ces logiciels libres, un &laquo;&nbsp;noyau&nbsp;&raquo; de syst&egrave;me d'exploitation appel&eacute; Linux, &eacute;crit par des milliers de particuliers et distribu&eacute; sous les termes de la GPL, le syst&egrave;me d'exploitation GNU peut fonctionner sur les PC compatibles Intel, et en combinant Linux avec d'autres logiciels libres, GNU peut r&eacute;aliser toutes les fonctions r&eacute;alis&eacute;es par Windows. Les logiciels de couches interm&eacute;diaires non-Microsoft peuvent fonctionner sur des PC compatibles Intel &eacute;quip&eacute;s des composants de GNU et Linux. Des PC compatibles Intel ainsi &eacute;quip&eacute;s repr&eacute;sentent plus de 30&nbsp;% de la base de serveurs install&eacute;e aux &Eacute;tats-Unis selon des observateurs de l'industrie ind&eacute;pendants.

source: The District Court found that &ldquo;by itself, Linux's open-source development model shows no signs of liberating that operating system from the cycle of consumer preferences and developer incentives that, when fueled by Windows' enormous reservoir of applications, prevents non-Microsoft operating systems from competing.&rdquo; (Findings of Fact, November 5, 1999, &para;50.) (referring, confusingly, to the combination of GNU, Linux, and other programs simply as &ldquo;Linux.&rdquo;) The District Court correctly found that in order to compete effectively with Defendant in the desktop operating systems market for Intel-compatible PCs, systems equipped with the free software operating system should be able to interoperate with &ldquo;the enormous reservoir&rdquo; of Windows applications.
fr: La Cour de district a trouv&eacute; que &laquo;&nbsp;en soi, le mod&egrave;le de d&eacute;veloppement open-source de Linux ne montre aucun signe qui lib&egrave;re ce syst&egrave;me d'exploitation du cycle des pr&eacute;f&eacute;rences du consommateur et des motivations du d&eacute;veloppeur qui, aliment&eacute; par l'&eacute;norme r&eacute;servoir d'applications de Windows, emp&ecirc;cherait les syst&egrave;mes d'exploitation non-Microsoft de rentrer en concurrence.&nbsp;&raquo; (Constatations des faits, le 5 novembre 1999, &para;&nbsp;50.) (se r&eacute;f&eacute;rant, confus&eacute;ment, &agrave; la combinaison de GNU, Linux et d'autres programmes sous le seul terme &laquo;&nbsp;Linux&nbsp;&raquo;.) La Cour de district a correctement conclus qu'afin que la concurrence soit effective avec le <em>d&eacute;fendant</em> dans le march&eacute; des syst&egrave;mes d'exploitation de bureau pour les PC compatibles Intel, les syst&egrave;mes &eacute;quip&eacute;s de syst&egrave;mes d'exploitation libres devraient &ecirc;tre capables de s'interfacer avec l'&laquo;&nbsp;&eacute;norme r&eacute;servoir&nbsp;&raquo; d'applications de Windows.

source: There is no inherent barrier to such interoperation, only an artificial barrier illegally erected by Defendant. If Defendant were required to release information concerning its APIs to the developers of free software, GNU, Linux, the X windowing system, the WINE Windows emulator, and other relevant free software could interoperate directly with all applications that have been developed for Windows. Anyone could execute Windows applications programs bought from any developer on Intel-compatible PC's equipped with the competing free software operating system. And because, as the District Court found, the cost structure of free software is very much lower than Defendant's, the competing operating system product is and would continue to be available at nominal prices. (Findings of Fact, November 5, 1999, &para; 50.)
fr: Il n'y a pas de barri&egrave;re inh&eacute;rente &agrave; un tel interfa&ccedil;age, seulement une barri&egrave;re artificielle &eacute;rig&eacute;e ill&eacute;galement par le <em>d&eacute;fendant</em>. Si le <em>d&eacute;fendant</em> &eacute;tait contraint de donner les informations concernant ses API aux d&eacute;veloppeurs de logiciels libres, GNU, Linux, le syst&egrave;me de fen&ecirc;trage X, l'&eacute;mulateur Windows WINE et d'autres logiciels libres appropri&eacute;s pourraient s'interfacer directement avec toutes les applications qui ont &eacute;t&eacute; d&eacute;velopp&eacute;es pour Windows. N'importe qui pourrait faire fonctionner des applications Windows achet&eacute;es chez n'importe quel d&eacute;veloppeur sur un PC compatible Intel &eacute;quip&eacute; du syst&egrave;me d'exploitation libre concurrent. Et car, comme l'a d&eacute;montr&eacute; la Cour de district, le co&ucirc;t de la structure des logiciels libres est tr&egrave;s en dessous de celui du <em>d&eacute;fendant</em>, le syst&egrave;me d'exploitation libre concurrent est et continuerait &agrave; &ecirc;tre disponible &agrave; des prix symboliques. (Constatations des faits, le 5 novembre 1999, &para;&nbsp;50).

source: That would be too effective a form of competition, from the Defendant's point of view. For this reason, Defendant has included in the Settlement the terms that exclude from API documentation precisely those to whom it would be most logically addressed: potential competitors seeking access to the monopolized market. If the Settlement were enforced according to its intention, the result would be immediate and vigorous competition between Defendant and the parties against whom, the District Court found, Defendant was illegally maintaining a barrier. The Settlement should be amended to level that barrier, which the current language inserted by Defendant artfully maintains. The language of &sect;&sect;III(D) and III(E) should be amended to require Defendant to release timely and accurate API information to all parties seeking to interoperate programs with either Windows Operating System Products or applications written to interoperate with Windows Operating System Products.
fr: Ce serait une forme de concurrence trop efficace, du point de vue du <em>d&eacute;fendant</em>. Pour cette raison, le <em>d&eacute;fendant</em> a inclus dans le <em>r&egrave;glement judiciaire</em> les termes qui excluent de l'acc&egrave;s &agrave; la documentation des API pr&eacute;cis&eacute;ment ceux &agrave; qui elle se serait le plus logiquement adress&eacute;e&nbsp;: les concurrents potentiels cherchant &agrave; acc&eacute;der au march&eacute; monopolis&eacute;. Si le <em>r&egrave;glement judiciaire</em> &eacute;tait mis en application selon son intention premi&egrave;re, le r&eacute;sultat serait une concurrence imm&eacute;diate et vigoureuse entre le <em>d&eacute;fendant</em> et les parties contre lesquelles, ainsi que l'a d&eacute;montr&eacute; la Cour de district, le <em>d&eacute;fendant</em> maintenait ill&eacute;galement une barri&egrave;re. Le <em>r&egrave;glement judiciaire</em> devrait &ecirc;tre amend&eacute; pour lever cette barri&egrave;re que le langage actuellement ins&eacute;r&eacute; par le <em>d&eacute;fendant</em> maintient astucieusement. Le langage des &sect;&nbsp;III(D) et &sect;&nbsp;III(E) devrait &ecirc;tre amend&eacute; pour requ&eacute;rir du <em>d&eacute;fendant</em> de publier les informations opportunes et appropri&eacute;es sur les API &agrave; toutes les parties cherchant &agrave; interfacer des programmes soit avec les syst&egrave;mes d'exploitation Windows, soit des applications &eacute;crites pour s'interfacer avec les syst&egrave;mes d'exploitation Windows.
