Repository: gitGNU/gnu_www-fr
Catalog: philosophy/*-doj-tunney.*.po
Languages: fr

source: For the same reason, Defendant's attempt to continue denying the free software development community access to its APIs through the imposition of royalty requirements, in &sect;III(I)(1), should be removed. As the District Court recognized, free software development means that everyone in the world has access, without payment of royalties or prohibition of redistribution, to the &ldquo;source code&rdquo; of the software. All APIs and other interfaces are fully available at all times to anyone who wants to interoperate with the existing programs. This, and the ability to reuse existing program code in new programs without payment of royalties or license fees, permits vast numbers of interoperable, high-quality programs to be written by a mixture of volunteers and professional project developers for free distribution. By authorizing Defendant to engage in non-reciprocity by charging royalties for the same information about its programs, thus purposefully ousting volunteer developers, and by prohibiting &ldquo;sublicensing,&rdquo; thus precluding profit-making developers from seeking interoperability with volunteers, the Settlement is craftily perverted into a mechanism whereby Defendant can continue to withhold API information so as to preclude the operations of potential competitors. The Settlement should be modified so that &sect;III(I)(1) requires reciprocity, by precluding the imposition of royalties on developers who make their own APIs fully available without payment of royalties or license fees, and so that &sect;III(I)(3) precludes limitation on sublicensing, and requires Defendant to release API information on terms reciprocal to those on which competitors make their own API information available.
fr: Pour la m&ecirc;me raison, la tentative du <em>d&eacute;fendant</em> de continuer &agrave; d&eacute;nier l'acc&egrave;s &agrave; la communaut&eacute; de d&eacute;veloppement de logiciels libres &agrave; ses API par l'imposition d'une redevance, dans le &sect;&nbsp;III(I)(1), devrait &ecirc;tre supprim&eacute;e. Comme l'a reconnu la Cour de district, le d&eacute;veloppement de logiciels libres signifie que quiconque dans le monde a acc&egrave;s, sans paiement de redevance ou interdiction de redistribution, au &laquo;&nbsp;code source&nbsp;&raquo; du logiciel. Toutes les API et les autres interfaces sont totalement disponibles, tout le temps, pour quiconque veut s'interfacer avec les programmes existants. Cela ainsi que la possibilit&eacute; de r&eacute;utiliser le code du programme dans de nouveaux programmes sans paiement de redevance permet l'&eacute;criture d'un grand nombre de programmes de grande qualit&eacute; et interop&eacute;rables, par un m&eacute;lange de volontaires et de d&eacute;veloppeurs de projet professionnels pour une distribution libre. En autorisant le <em>d&eacute;fendant</em> engager sans r&eacute;ciprocit&eacute; le paiement d'une redevance pour les m&ecirc;mes informations concernant ses programmes, &eacute;vin&ccedil;ant ainsi sciemment les d&eacute;veloppeurs volontaires, et en interdisant la &laquo;&nbsp;sous-licence&nbsp;&raquo;, interdisant ainsi aux d&eacute;veloppeurs &agrave; but lucratif de chercher l'interop&eacute;rabilit&eacute; avec des volontaires, le <em>r&egrave;glement judiciaire</em> est ing&eacute;nieusement perverti en un m&eacute;canisme par lequel le <em>d&eacute;fendant</em> peut continuer &agrave; retenir les informations sur les API afin d'interdire les op&eacute;rations des concurrents potentiels. Le <em>r&egrave;glement judiciaire</em> devrait &ecirc;tre modifi&eacute; pour que le &sect;&nbsp;III(I)(1) requiert la r&eacute;ciprocit&eacute;, en interdisant l'imposition d'une redevance ou de droits aux d&eacute;veloppeurs qui rendent leurs propres API disponibles sans paiement de redevance ou de droits, et aussi que le &sect;&nbsp;III(I)(3) interdise la limitation sur les sous-licences et requiert du <em>d&eacute;fendant</em> de publier les informations sur les API en des termes r&eacute;ciproques &agrave; ceux utilis&eacute;s par les concurrents pour leurs propres API.

source: In one additional provision Defendant has attempted to subvert the intention of the Settlement in order to preclude effective competition by the Intel-compatible free software operating system. Under &sect; III(J)(1), Defendant may refuse to disclose &ldquo;portions of APIs or Documentation or portions or layers of Communications Protocols the disclosure of which would compromise the security of anti-piracy, anti-virus, software licensing, digital rights management, encryption or authentication systems, including without limitation, keys, authorization tokens or enforcement criteria.&rdquo; This provision is so indefinite that Defendant can be expected to argue that all APIs and Communications Protocols connected with the security and authentication aspects of electronic commerce (including especially &ldquo;without limitation&rdquo; keys and authorization tokens, which are the basic building blocks of all electronic commerce systems) can be kept secret. At present, all such protocols and APIs are public, which is appropriate because&mdash;as computer security experts would testify if, as it should, the District Court seeks evidentiary supplementation under 15 U.S.C. 16(f)(1)&mdash;security is not attained in the computer communications field by the use of secret protocols, but rather by the use of scientifically-refereed and fully public protocols, whose security has been tested by full exposure in the scientific and engineering communities. If this provision were enforced as currently drafted, Defendant could implement new private protocols, extending or replacing the existing public protocols of electronic commerce, and then use its monopoly position to exclude the free software operating system from use of that de facto industry standard embodied in its new unpublicized APIs and Protocols. Defendant then goes further in &sect; III(J)(2), according to itself the right to establish criteria of &ldquo;business viability&rdquo; without which it may deny access to APIs. Considering that its primary competition results from a development community led by non-profit organizations and relying heavily on non-commercial and volunteer developers, one can only conclude that Defendant is once again seeking the appearance of cooperation with the rule of law, while preparing by chicane to deny its injured competitors their just remedy.
fr: Dans une clause suppl&eacute;mentaire, le <em>d&eacute;fendant</em> a tent&eacute; de subvertir l'intention du <em>r&egrave;glement judiciaire</em> afin d'interdire la concurrence effective du syst&egrave;me d'exploitation libre compatible Intel. Sous le &sect;&nbsp;III(J)(1), le <em>d&eacute;fendant</em> peut refuser de d&eacute;voiler &laquo;&nbsp;des parties des API ou de la documentation ou des parties ou des couches des protocoles de communications dont la publication compromettrait la s&eacute;curit&eacute; anti-piratage, anti-virus, de licence, de gestion des droits num&eacute;riques, de chiffrement ou d'authentification des syst&egrave;mes, y compris et sans s'y limiter, les cl&eacute;s, les jetons d'autorisation tokens ou les jetons de crit&egrave;re d'application.&nbsp;&raquo; Cette clause est si vague que l'on peut s'attendre &agrave; ce que le <em>d&eacute;fendant</em> avance que toutes les API et les protocoles de communications en relation avec la s&eacute;curit&eacute; et les aspects d'authentification du commerce &eacute;lectronique (y compris particuli&egrave;rement &laquo;&nbsp;sans s'y limiter&nbsp;&raquo; les cl&eacute;s et les jetons d'autorisation qui sont les briques de base de tout syst&egrave;me de commerce &eacute;lectronique) peuvent &ecirc;tre garder secrets. Maintenant, de tels protocoles et APi sont publics, ce qui est appropri&eacute; &mdash; ainsi que l'attesteraient des experts en s&eacute;curit&eacute; si, comme elle le devrait, la Cour de district demande un compl&eacute;ment d'information sous le paragraphe 15 U.S.C. &sect;&nbsp;16(f)(1)-- car la s&eacute;curit&eacute; n'est pas atteinte dans le domaine des communications informatiques par l'usage de protocoles secrets mais plut&ocirc;t par l'utilisation de protocoles scientifiquement r&eacute;f&eacute;renc&eacute; et totalement publics, dont la s&eacute;curit&eacute; a &eacute;t&eacute; totalement &eacute;prouv&eacute;e dans les communaut&eacute;s de scientifiques et d'ing&eacute;nieurs. Si cette clause &eacute;tait appliqu&eacute;e telle quelle, le <em>d&eacute;fendant</em> pourrait mettre en &oelig;uvre de nouveaux protocoles priv&eacute;s, &eacute;tendre ou remplacer les protocoles publics existants de commerce &eacute;lectronique et alors utiliser sa position de monopole pour emp&ecirc;cher les syst&egrave;mes d'exploitation libres d'utiliser ce standard de fait de l'industrie incorpor&eacute; dans ses nouveaux protocoles et API non-publiques. Le <em>d&eacute;fendant</em> va alors plus loin dans le &sect;&nbsp;III(J)(2), s'accordant &agrave; lui-m&ecirc;me le droit d'&eacute;tablir les crit&egrave;res de &laquo;&nbsp;viabilit&eacute; commerciale&nbsp;&raquo; sans lequels il peut interdire l'acc&egrave;s aux API. Consid&eacute;rant que sa premi&egrave;re concurrence r&eacute;sulte d'une communaut&eacute; de d&eacute;veloppement men&eacute;e par des organisations &agrave; but non lucratif et reposant fortement sur des d&eacute;veloppeurs non-commerciaux et volontaires, on ne peut que conclure que le <em>d&eacute;fendant</em> cherche encore une fois &agrave; montrer l'apparence de la coop&eacute;ration avec la loi, tout en pr&eacute;parant par tromperie &agrave; d&eacute;nier &agrave; ses concurrents l&eacute;s&eacute;s leur juste r&eacute;paration.

source: The Free Software Foundation not only authors and distributes the GNU General Public License, and in other ways facilitates the making of free software by others, it also manufactures and distributes free software products of its own, particularly the GNU operating system, and sells compilations of its own and others' free software. The Foundation sustains specific injury from the violations set forth in the complaint that are not remedied by (and indeed are specifically excluded from) the Settlement. The Foundation and the other free software developers with whom it acts are the single most significant competitor to the Defendant in the monopolized market, and the adoption of the Settlement as drafted, with its terms so carefully designed by Defendant to preclude its effective competition, would be a travesty. We urge that the Settlement be amended as we have described.
fr: La Free Software Foundation n'est pas seulement l'auteur et le distributeur de la Licence g&eacute;n&eacute;rale publique GNU, et par d'autres moyens facilitateur pour la r&eacute;alisation de logiciels libres par d'autres, elle fabrique &eacute;galement et distribue ses propres produits libres, et particuli&egrave;rement le syst&egrave;me d'exploitation GNU; elle vend aussi des compilations de logiciels libres, les siens ou ceux des autres. La fondation subit un pr&eacute;judice sp&eacute;cifique des abus invoqu&eacute;s dans la plainte qui ne sont pas r&eacute;par&eacute;s (et en fait sont sp&eacute;cifiquement exclus) dans le <em>r&egrave;glement judiciaire</em>. La fondation et les autres d&eacute;veloppeurs de logiciels libres avec lesquels elle agit sont le seul concurrent significatif du <em>d&eacute;fendant</em> sur le march&eacute; monopolis&eacute; et l'adoption du <em>r&egrave;glement judiciaire</em> tel que propos&eacute;, avec ces termes si soigneusement choisis par le <em>d&eacute;fendant</em> pour interdire une concurrence effective, serait une parodie. Nous vous pressons donc d'amender le <em>r&egrave;glement judiciaire</em> ainsi que nous l'avons d&eacute;crit.

source: Very truly yours,<br /> Eben Moglen
fr: Tr&egrave;s sinc&egrave;rement v&ocirc;tre,<br /> Eben Moglen

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
