Repository: gitGNU/gnu_www-fr
Catalog: philosophy/*-ethos.*.po
Languages: fr

source: Don't Let &lsquo;Intellectual Property&rsquo; Twist Your Ethos
fr: Ne laissez pas la «&nbsp;propriété intellectuelle&nbsp;» déformer votre ethos

source: by <a href="http://www.stallman.org/">Richard M. Stallman</a>
fr: par <a href="http://www.stallman.org/">Richard M. Stallman</a>

source: June 09, 2006
fr: le 9 juin 2006

source: Most free software licenses are based on copyright law, and for good reason: Copyright law is much more uniform among countries than contract law, which is the other possible choice.
fr: La plupart des licences de logiciel libre sont basées sur la loi sur le copyright, et pour une bonne raison&nbsp;: La loi du copyright est beaucoup plus uniforme dans les pays que la loi du contrat, qui est l'autre choix possible.

source: There's another reason not to use contract law: It would require every distributor to get a user's formal assent to the contract before providing a copy. To hand someone a CD without getting his signature first would be forbidden. What a pain in the neck!
fr: Il y a une autre raison pour ne pas utiliser la loi du contrat&nbsp;: elle pourrait nécessiter à chaque distributeur d'obtenir un assentiment formel de l'utilisateur au contrat avant de fournir une copie. Détenir un CD sans signer d'abord serait interdit. Quel coup&nbsp;!

source: It's true that in countries like China, where copyright law is generally not enforced, we may also have trouble enforcing free software license agreements, as Heather Meeker suggests in her recent LinuxInsider column, <a href= "http://www.linuxinsider.com/story/50421.html">&ldquo;Only in America? Copyright Law Key to Global Free Software Model&rdquo;</a>.
fr: C'est vrai que dans les pays comme la Chine, où la loi sur le copyright n'est généralement pas respectée, nous pourrions avoir des difficultés pour faire respecter les accords d'une licence de logiciel libre comme le suggère Heather Meeker récemment dans les colonnes du LinuxInsider, <a href="http://www.linuxinsider.com/story/50421.html">«&nbsp; Seulement aux États-Unis&nbsp;? Clé de la loi sur le copyright pour le modèle global du logiciel libre&nbsp;»</a>.

source: However, this is not a reason to press for more copyright enforcement in China. Although we would use it to protect people's freedom, we have to recognize that mostly it would be used by the likes of Microsoft, Disney and Sony to take it away.
fr: Toutefois, ce n'est pas une raison pour pousser pour plus de respect du copyright en Chine. Bien que nous l'utilisions pour protéger la liberté des gens, nous devons reconnaître qu'il est surtout utilisé par des sociétés comme Microsoft, Disney et Sony pour la rejeter.

source: Ironically, we might have more success enforcing copyright in China than Microsoft, Disney and Sony &mdash; because what we would want to do is easier.
fr: Ironiquement, nous aurions plus de succès pour faire respecter le copyright en Chine que Microsoft, Disney et Sony &mdash; parce que ce que nous voulons faire est plus facile.

source: No Chinese Laundry
fr: Pas de blanchisserie chinoise

source: Nonetheless, Meeker's claim that this leads to a global problem is simply absurd. You can't &ldquo;launder&rdquo; material copyrighted in the U.S. by moving it through China, as she ought to know.
fr: Pour le moins, la déclaration de Meeker que ceci conduit à un problème global est simplement absurde. Nous ne pouvons pas «&nbsp;blanchir&nbsp;» le matériel avec un copyright aux États-Unis en les déplaçant vers la Chine, comme elle devrait le savoir.

source: If someone violates the GNU GPL by distributing a non-free modified version of GCC in the U.S., it won't make any difference if it was obtained or modified in China. U.S. copyright law will be enforced just the same.
fr: Si quelqu'un viole la GNU GPL en distribuant une version modifié non libre de GCC aux États-Unis, ça ne fera pas de différence si c'est obtenu ou modifié en Chine. La loi sur le copyright sera appliquée quand même.

source: Although this error might seem to be the central point of Meeker's article, it is not. The real central point of the article is the perspective embodied in her use of the term &ldquo;intellectual property&rdquo;. She uses this term pervasively as though it refers to something coherent &mdash; something it makes sense to talk about and think about. If you believe that, you have accepted the article's hidden assumption.
fr: Bien que cette erreur pourrait sembler être le point central de l'article de Meeker, le vrai point central de l'article est la perspective incarnée dans son usage de l'expression de «&nbsp;propriété intellectuelle&nbsp;». Elle utilise partout cette expression comme si ça se référait à quelque chose de cohérent &mdash; quelque chose qui a un sens pour en parler et le penser. Si vous croyez ça, vous acceptez le postulat caché de l'article.

source: Loose Language
fr: Langage vague

source: Other &ldquo;intellectual property&rdquo; laws don't even share that much with them. The implication that you can treat them all as the same thing is fundamentally misleading.
fr: D'autres lois sur la «&nbsp;propriété intellectuelle&nbsp;» ne partagent même pas grand chose entre elles. L'implication que vous pouvez les traiter toutes comme la même chose est fondamentalement trompeur.

source: Along with the term &ldquo;intellectual property&rdquo; goes a false understanding of what these laws are for. Meeker speaks of an &ldquo;ethos&rdquo; of &ldquo;intellectual property&rdquo; that exists in the U.S. because &ldquo;intellectual property is in the Constitution.&rdquo; That's the mother of all mistakes.
fr: En plus l'expression de «&nbsp;propriété intellectuelle&nbsp;» étend une fausse compréhension de ce pour quoi ces lois sont faites. Meeker parle d'un «&nbsp;ethos&nbsp;» ou «&nbsp;propriété intellectuelle&nbsp;» qui existe aux États-Unis parce que la «&nbsp;propriété intellectuelle est dans la Constitution&nbsp;». C'est la plus grosse erreur.

source: What does the Constitution say about them? What is its ethos? It is nothing like the &ldquo;intellectual property ethos&rdquo; that Meeker imagines.
fr: Que dit la constitution sur elles&nbsp;? Quel est leur ethos&nbsp;? Rien de tel que l'«&nbsp;ethos de la propriété intellectuelle&nbsp;» que Meeker imagine.

source: Failure to Execute
fr: Échec à l'exécution

source: What the Constitution says is that copyright law and patent law are optional. They need not exist. It says that if they do exist, their purpose is to provide a public benefit &mdash; to promote progress by providing artificial incentives.
fr: Ce que la Constitution dit est que la loi sur le copyright et la loi sur le brevet sont optionnelles. Elles n'ont pas besoin d'exister. Elle dit qui si elles existent, leur but est de fournir un bénéfice public &mdash; pour promouvoir le progrès en fournissant des encouragements artificiels.

source: They are not rights that their holders are entitled to; they are artificial privileges that we might, or might not, want to hand out to encourage people to do what we find useful.
fr: Il n'y a pas de droits que leurs détenteurs ont&nbsp;; ce sont des privilèges artificiels que nous pourrions ou pas distribuer pour encourager les gens à faire ce que nous trouvons utile.

source: It's a wise policy. Too bad Congress &mdash; which has to carry it out on our behalf &mdash; takes its orders from Hollywood and Microsoft instead of from us.
fr: C'est une sage politique. Un trop mauvais Congrès &mdash; qui l'exécute en notre nom &mdash; prend ses ordres d'Hollywood et Microsoft à notre place.

source: If you appreciate the U.S. Constitution's wisdom, don't let &ldquo;intellectual property&rdquo; into your ethos; don't let the &ldquo;intellectual property&rdquo; meme infect your mind.
fr: Si vous appréciez la sagesse de la Constitution des États-Unis, ne laissez pas la «&nbsp;propriété intellectuelle&nbsp;» dans votre ethos&nbsp;; ne laissez pas la «&nbsp;meme «&nbsp;propriété intellectuelle&nbsp;» vous infecter <sup><a href="#TransNote1">1</a></sup>.

source: Practically speaking, copyright and patent and trademark law have only one thing in common: Each is legitimate only as far as it serves the public interest. Your interest in your freedom is a part of the public interest that must be served.
fr: En pratique, les lois sur le copyright et le brevet et les marques ont une seule chose en commun&nbsp;: chacune est légitime seulement tant qu'elle sert l'intérêt public. Votre intérêt pour votre liberté est une part de l'intérêt public qui doit être servi.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;: <ol><li id="TransNote1">Voir «&nbsp;Viruses of the mind&nbsp;».</li></ol>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.

source: Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
fr: Cette page peut-être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: patrau.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:
