Repository: gitGNU/gnu_www-fr
Catalog: philosophy/*-word-attachments.*.po
Languages: fr

source: We Can Put an End to Word Attachments - GNU Project - Free Software Foundation (FSF)
fr: Finissons-en avec les pièces jointes Word - GNU Project - Free Software Foundation (FSF)

source: GNU, FSF, Free Software Foundation, Linux, general, public, license, gpl, general public license, freedom, software, power, rights, word, attachment, word attachment, microsoft
fr: GNU, FSF, Free Software Foundation, Linux, générale, publique, licence, gpl, licence publique générale, liberté, logiciel, pouvoir, droits, word, pièce jointe, pièce jointe word, microsoft

source: This essay explains why Microsoft Word attachments to email are bad, and describes what you can do to help stop this practice.
fr: Cet essai explique pourquoi les pièces jointes Word aux courriels sont une mauvaise pratique et décrit ce que vous pouvez faire pour aider à arrêter cette pratique.

source: We Can Put an End to Word Attachments
fr: Finissons-en avec les pièces jointes Word&nbsp;!

source: by <strong>Richard M. Stallman</strong>
fr: par <strong>Richard M. Stallman, janvier 2002</strong>

source: Most computer users use Microsoft Word. That is unfortunate for them, since Word is proprietary software, denying its users the freedom to study, change, copy, and redistribute it. And because Microsoft changes the Word file format with each release, its users are locked into a system that compels them to buy each upgrade whether they want a change or not. They may even find, several years from now, that the Word documents they are writing this year can no longer be read with the version of Word they use then.
fr: La plupart des utilisateurs d'ordinateurs utilisent Microsoft Word. C'est bien dommage pour eux, puisque Word est un logiciel propriétaire, et prive donc ses utilisateurs de la liberté de l'étudier, de le modifier, de le copier et de le redistribuer. Et, du fait que Microsoft change le format de fichier Word lors des changements de version, ses utilisateurs sont prisonniers d'un cercle vicieux qui les contraint à acheter chaque mise à jour, qu'ils désirent changer ou non. Ils pourront même s'apercevoir, dans quelques années, que les documents Word qu'ils rédigent aujourd'hui ne pourront plus être lus avec la version de Word qu'ils utiliseront alors.

source: But it hurts us, too, when they assume we use Word and send us (or demand that we send them) documents in Word format. Some people publish or post documents in Word format. Some organizations will only accept files in Word format: I heard from someone that he was unable to apply for a job because resumes had to be Word files. Even governments sometimes impose Word format on the public, which is truly outrageous.
fr: Mais cela nous porte atteinte quand ils supposent que nous utilisons Word nous aussi, et nous envoient (ou nous demandent de leur envoyer) des documents au format Word. Certains publient ou postent des documents au format Word. Des organisations n'acceptent que les fichiers au format Word&nbsp;: quelqu'un m'a dit qu'il n'avait pas pu postuler pour un travail parce que les curriculum vitae devaient être au format Word. Même des gouvernements imposent parfois l'usage du format Word aux citoyens, ce qui est franchement déplacé.

source: For us users of free operating systems, receiving Word documents is an inconvenience or an obstacle. But the worst impact of sending Word format is on people who might switch to free systems: they hesitate because they feel they must have Word available to read the Word files they receive. The practice of using the secret Word format for interchange impedes the growth of our community and the spread of freedom. While we notice the occasional annoyance of receiving a Word document, this steady and persistent harm to our community usually doesn't come to our attention. But it is happening all the time.
fr: Recevoir des documents Word est bien sûr une gêne et un obstacle pour nous, utilisateurs de systèmes d'exploitation libres. Mais le pire est encore l'envoi de documents Word à des personnes qui franchiraient peut-être le pas vers des systèmes libres&nbsp;: ces personnes hésitent car elles pensent devoir disposer de Word pour lire les fichiers Word qu'elles reçoivent. Cette pratique de l'utilisation du format fermé de Word pour les échanges gêne la croissance de notre communauté et le rayonnement de la liberté. Et bien que nous ayons conscience de l'ennui occasionnel que constitue la réception d'un document Word, ce mal constant et persistant infligé à notre communauté n'atteint généralement pas notre attention. Pourtant, il se manifeste tout le temps.

source: Worst of all, it has already done so. Microsoft Office 2007 uses by default a format based on the patented OOXML format. (This is the one that Microsoft got declared an &ldquo;open standard&rdquo; by political manipulation and packing standards committees.) The actual format is not entirely OOXML, and it is not entirely documented. Microsoft offers a gratis patent license for OOXML on terms which do not allow free implementations. We are thus beginning to receive Word files in a format that free programs are not even allowed to read.
fr: Et le pire, c'est qu'il l'a déjà fait. Microsoft Office 2007 utilise le format breveté OOXML par défaut. (C'est celui que Microsoft a réussi à faire déclarer comme «&nbsp;standard ouvert&nbsp;» par manipulation politique et en infiltrant les comités de standards). Microsoft offre une licence gratuite pour OOXML dont les termes ne permettent pas de mises en &oelig;uvre libres. Nous allons par conséquent commencer à recevoir des fichiers Word dans un format que les programmes libres ne sont pas autorisés à lire.

source: I therefore make a practice of responding to Word attachments with a polite message explaining why the practice of sending Word files is a bad thing, and asking the person to resend the material in a nonsecret format. This is a lot less work than trying to read the somewhat obfuscated ASCII text in the Word file. And I find that people usually understand the issue, and many say they will not send Word files to others any more.
fr: J'ai pris l'habitude de répondre aux pièces jointes Word par un message poli expliquant pourquoi il est mauvais d'envoyer des fichiers Word, et priant la personne de renvoyer le document dans un format qui ne soit pas secret. Cela fait bien moins de travail que d'essayer de lire le texte dans l'ASCII abscons d'un fichier Word. Et il se trouve souvent des gens pour comprendre le problème, et beaucoup disent qu'ils n'enverront plus de documents Word aux autres.

source: To make this effort efficient, you will probably want to develop a canned reply that you can quickly send each time it is necessary. I've included two examples: the version I have been using recently, followed by a new version that teaches a Word user how to convert to other useful formats. They are followed by several suggestions sent by other people.
fr: Pour rendre cet effort efficace, vous voudrez sans doute développer une réponse «&nbsp;de série&nbsp;», que vous pourrez envoyer rapidement à chaque fois que nécessaire. J'ai donc inclus ci-dessous deux exemples&nbsp;: la version que j'ai utilisée récemment, suivie d'une nouvelle version qui apprend à un utilisateur de Word comment convertir vers d'autres formats utiles. Ils sont suivis par plusieurs suggestions envoyées par d'autres personnes.

source: You can use these replies verbatim if you like, or you can personalize them or write your own. By all means construct a reply that fits your ideas and your personality&mdash;if the replies are personal and not all alike, that will make the campaign more effective.
fr: Vous pouvez utiliser ces réponses telles quelles si vous le désirez, vous pouvez les personnaliser, ou encore écrire les vôtres. Essayez autant que possible de construire une réponse qui corresponde à vos opinions et à votre personnalité&nbsp;: si les réponses sont personnalisées et toutes différentes, cela rendra la campagne plus efficace.

source: These replies are meant for individuals who send Word files. When you encounter an organization that imposes use of Word format, that calls for a different sort of reply; there you can raise issues of fairness that would not apply to an individual's actions.
fr: Ces réponses sont destinées à des personnes physiques ayant envoyé des fichiers Word. Quand vous rencontrez une organisation qui impose l'utilisation du format Word, une réponse d'un autre type s'impose&nbsp;; vous pouvez alors soulevez le problème de l'équité, qui ne s'appliquerait pas pour des actions individuelles.

source: This page talks about Word attachments, since they are by far the most common case. However, the same issues apply with other proprietary formats, such as PowerPoint and Excel. Please feel free to adapt the replies to cover those as well, if you wish.
fr: Cette page parle des pièces jointes Word, puisqu'elles représentent de loin le cas le plus courant. Cependant, les mêmes problèmes s'appliquent aux autres formats propriétaires, comme PowerPoint et Excel. Veuillez adapter les réponses pour couvrir ces cas aussi, si vous le désirez.

source: With our numbers, simply by asking, we can make a difference.
fr: En nombre, et simplement en demandant, nous pouvons changer les choses.

source: <em>You sent the attachment in Microsoft Word format, a secret proprietary format, so I cannot read it. If you send me the plain text, HTML, or PDF, then I could read it.</em>
fr: <em>Vous m'avez envoyé une pièce jointe au format Microsoft Word, format propriétaire et tenu secret, ce qui fait que je ne peux le lire. Si vous me l'envoyez au format texte brut, HTML ou PDF, je serai alors en mesure d'en prendre connaissance.</em>

source: <em>Sending people documents in Word format has bad effects, because that practice puts pressure on them to use Microsoft software. In effect, you become a buttress of the Microsoft monopoly. This specific problem is a major obstacle to the broader adoption of GNU/Linux. Would you please reconsider the use of Word format for communication with other people?</em>
fr: <em>Envoyer aux gens des documents au format Word est mauvais, parce que cela les force à utiliser des logiciels de Microsoft. Vous vous constituez ainsi pilier du monopole de Microsoft. Ce problème précis constitue un obstacle majeur à l'adoption massive de GNU/Linux. Pourriez-vous, s'il vous plaît, reconsidérer l'utilisation du format Word pour communiquer avec les autres&nbsp;?</em>

source: <em>You sent the attachment in Microsoft Word format, a secret proprietary format, so it is hard for me to read. If you send me plain text, HTML, or PDF, then I will read it.</em>
fr: <em>Vous m'avez envoyé une pièce jointe au format Microsoft Word, format propriétaire et tenu secret, ce qui fait que je ne peux le lire. Si vous me l'envoyez au format texte brut, HTML ou PDF, je serai alors en mesure d'en prendre connaissance.</em>

source: <em>Distributing documents in Word format is bad for you and for others. You can't be sure what they will look like if someone views them with a different version of Word; they may not work at all.</em>
fr: <em>La diffusion de documents au format Word est mauvaise pour vous et pour les autres. Vous ne pouvez être sûr de la manière dont ils seront affichés si quelqu'un les regarde avec une version différente de Word&nbsp;; ils peuvent même ne pas fonctionner du tout.</em>

source: <em>But above all, sending people Word documents puts pressure on them to use Microsoft software and helps to deny them any other choice. In effect, you become a buttress of the Microsoft monopoly. This pressure is a major obstacle to the broader adoption of free software. Would you please switch to a different way of sending files to other people, instead of Word format?</em>
fr: <em>Mais par dessus tout, envoyer aux gens des documents Word les force à utiliser des produits Microsoft et leur interdit tout autre choix. Dans les faits, vous vous constituez ainsi pilier du monopole de Microsoft. Cette pratique constitue un obstacle majeur pour une large adoption du logiciel libre. Pourriez-vous s'il vous plaît, utiliser autre chose que des documents Word pour communiquer avec les autres&nbsp;?</em>

source: <em>To convert the file to HTML using Word is simple. Open the document, click on File, then Save As, and in the Save As Type strip box at the bottom of the box, choose HTML Document or Web Page. Then choose Save. You can then attach the new HTML document instead of your Word document. Note that Word changes in inconsistent ways&mdash;if you see slightly different menu item names, please try them.</em>
fr: <em>Il est aisé de convertir le fichier en HTML depuis Word. Ouvrez le document, «&nbsp;cliquez&nbsp;» sur «&nbsp;Fichier&nbsp;», puis «&nbsp;Enregistrer sous&nbsp;», et dans la boîte de dialogue «&nbsp;Enregistrer au format&nbsp;» au bas de la boîte, choisissez «&nbsp;Document HTML&nbsp;» ou «&nbsp;Page Web&nbsp;». Puis choisissez «&nbsp;Enregistrer&nbsp;». Vous pouvez alors attacher le nouveau document HTML à la place du document Word. Notez que Word change de façon imprévisible&nbsp;; si vous observez des noms légèrement différents pour les choix de menu, merci de les essayer.</em>

source: <em>To convert to plain text is almost the same&mdash;instead of HTML Document, choose Text Only or Text Document as the Save As Type.</em>
fr: <em>Convertir en texte brut se fait quasiment de la même manière&nbsp;: au lieu de «&nbsp;Document HTML&nbsp;», choisissez «&nbsp;Texte seulement&nbsp;» dans «&nbsp;Enregistrer au format&nbsp;».</em>

source: <em>See http://www.gnu.org/philosophy/no-word-attachments.html for more about this issue.</em>
fr: <em>Consulter <a href="http://www.gnu.org/philosophy/no-word-attachments.fr.html">http://www.gnu.org/philosophy/no-word-attachments.fr.html</a> pour plus d'informations sur ce problème.</em>

source: Here's another approach, suggested by Bob Chassell. It requires that you edit it for the specific example, and it presumes you have a way to extract the contents and see how long they are.
fr: Voici une autre approche, proposée par Bob Chassell. Elle nécessite que vous l'éditiez pour votre exemple, et elle requiert que vous disposiez d'un système pour extraire le contenu et en déterminer la longueur.

source: <em>I am puzzled. Why did you choose to send me 876,377 bytes in your recent message when the content is only 27,133 bytes?</em>
fr: <em>Je suis surpris. Pourquoi avez-vous choisi de m'envoyer 876 377 octets dans votre dernier message, alors que le contenu utile se réduit à seulement 27 133 octets&nbsp;?</em>

source: <em>You sent me five files in the non-standard, bloated .doc format that is Microsoft's secret, rather than in the international, public, and more efficient format of plain text.</em>
fr: <em>Vous m'avez envoyé cinq fichiers au format .doc, non-standard, dense et tenu secret par Microsoft, plutôt que dans le format texte pur, international, public et plus efficace.</em>

source: <em>Microsoft can (and did recently in Kenya and Brazil) have local police enforce laws that prohibit students from studying the code, prohibit entrepeneurs starting new companies, and prohibit professionals offering their services. Please don't give them your support.</em>
fr: <em>Microsoft peut (et l'a fait récemment au Kenya et au Brésil) disposer de forces de polices locales pour faire respecter des lois qui interdisent aux étudiants d'analyser le code, qui interdisent à des entrepreneurs de construire de nouvelles sociétés, et qui interdisent à des professionnels d'offrir leurs services. S'il vous plaît, n'apportez pas votre soutien à ces actions&nbsp;!</em>

source: <em>Please avoid sending me Word or PowerPoint attachments.<br /> See http://www.gnu.org/philosophy/no-word-attachments.html</em>
fr: <em>S'il vous plaît, évitez de m'envoyer des pièces jointes au format Word ou PowerPoint.<br />Voir <a href="http://www.gnu.org/philosophy/no-word-attachments.fr.html">http://www.gnu.org/philosophy/no-word-attachments.fr.html</a></em>

source: Father Martin Sylvester offers <a href="/philosophy/sylvester-response.html">a more lengthy response</a> that adds the concept that it is a discourtesy to send Word attachments to a recipient when you don't know that they can read them.
fr: Le Père Martin Sylvester offre <a href="/philosophy/sylvester-response.fr.html">une réponse plus longue</a> qui ajoute le concept de manque de courtoisie d'envoyer des fichiers joint Word à un destinataire quand on ignore s'il est capable de les lire.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.<br />Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2002, 2007 Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2002, 2007 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Jean-Jacques Puig.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
