Repository: gitGNU/gnu_www-fr
Catalog: philosophy/*_doom.*.po
Languages: fr

source: MyDoom and You
fr: MyDoom et Vous

source: by <a href="http://stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: Other evils involving information rather than physical violence were common also. For instance, some New York police regularly lied on the witness stand, and even made up a word for it: instead of &ldquo;testifying&rdquo;, they described court appearances as &ldquo;testilying&rdquo;. Some New York programmers fell into the lawful but socially destructive practice of proprietary software: they offered other people attractive software packages without source code, and exacted a promise not to share them with anyone else.
fr: D'autres mauvaises actions ayant trait &agrave; l'information cette fois et non &agrave; la violence physique &eacute;taient &eacute;galement courants. Par exemple, des policiers de New York avaient l'habitude de mentir &agrave; la barre des t&eacute;moins, et ils avaient m&ecirc;me invent&eacute; un mot pour cela&nbsp;: &laquo;&nbsp;testilying&nbsp;&raquo;<sup><a href="#TransNote1">1</a></sup>. Certains programmeurs de New York s'adonnaient &agrave; une pratique l&eacute;gale mais socialement n&eacute;faste, celle du logiciel propri&eacute;taire&nbsp;: ils proposaient &agrave; d'autres personnes des ensembles logiciels s&eacute;duisants sans le code source, et exigeaient d'eux la promesse de ne les partager avec personne d'autre.

source: We can be pretty sure that some New Yorkers have committed murder, because they have been tried and convicted for it. We do not know whether anyone in the free software community participated in the development of MyDoom. The developers have not been identified; they know who they are, but you and I can only speculate. We could speculate that users of GNU/Linux developed the virus to attack SCO. We could speculate that Microsoft developed the virus so it would be blamed on us. We could speculate that disgruntled former SCO employees developed the virus to get even. But there is no evidence for any of these speculations.
fr: Nous pouvons &ecirc;tre certains que des New-yorkais ont commis des meurtres, parce qu'ils ont &eacute;t&eacute; jug&eacute;s et condamn&eacute;s pour cela. Nous ne savons pas si quelqu'un dans la communaut&eacute; du libre a particip&eacute; au d&eacute;veloppement de MyDoom. Les d&eacute;veloppeurs n'ont pas &eacute;t&eacute; identifi&eacute;s; ils savent qui ils sont, mais &agrave; part cela vous et moi en sommes r&eacute;duits aux sp&eacute;culations. Nous pouvons imaginer que des utilisateurs de GNU/Linux aient d&eacute;velopp&eacute; le virus pour s'attaquer &agrave; SCO. Nous pouvons imaginer que Microsoft ait d&eacute;velopp&eacute; le virus pour que nous soyons accus&eacute;s. Nous pouvons imaginer que d'anciens employ&eacute;s de SCO, m&eacute;contents, aient d&eacute;velopp&eacute; le virus pour se venger. Mais aucune preuve ne vient apppuyer toutes ces sp&eacute;culations.

source: If some day we find out that those who developed the virus were free software users, then my virtual community will be in the same situation as New York City and Cambridge: proved to have had some members who acted destructively.
fr: Si l'on d&eacute;couvre un jour que ceux qui ont d&eacute;velopp&eacute; le virus &eacute;taient des utilisateurs de logiciels libres, alors ma communaut&eacute; virtuelle sera dans la m&ecirc;me situation que New York et Cambridge&nbsp;: on aura prouv&eacute; que certains de ses membres ont agi de fa&ccedil;on destructrice.

source: This should not surprise anyone. The free software community numbers in the tens of millions, larger than New York or even Shanghai. It is hardly to be expected that so many people would all be ethical. Our community is self-selected for at least partial rejection of one unethical practice, proprietary software, but even that doesn't guarantee perfection. The presence of a few wrongdoers among many millions is no surprise&mdash;and no excuse for guilt by association.
fr: Cela ne devrait &eacute;tonner personne. La communaut&eacute; du libre compte des dizaines de millions de membres, elle est plus grande que New York ou m&ecirc;me Shangha&iuml;. On peut difficilement imaginer que ces gens sont tous moralement irr&eacute;prochables. Notre communaut&eacute; est compos&eacute;e de gens qui d&eacute;cident eux-m&ecirc;mes d'y appartenir parce qu'ils rejettent au moins partiellement une pratique immorale &mdash; les logiciels propri&eacute;taires &mdash; mais m&ecirc;me cette attitude ne garantit pas la perfection. La pr&eacute;sence de quelques brebis galeuses parmi des millions de gens n'est pas une surprise, et ce n'est pas une excuse pour la culpabilit&eacute; par association.

source: I am confident that nearly all readers of this article have nothing to do with developing the MyDoom virus. So if someone is accusing you, don't act defensive. You have no more to do with the virus than your accuser, so stand tall and say so.
fr: Je suis persuad&eacute; que pratiquement tous les lecteurs de cet article n'ont rien &agrave; voir avec le d&eacute;veloppement du virus MyDoom. Alors si quelqu'un vous accuse, ne soyez pas sur la d&eacute;fensive. Vous n'avez pas plus &agrave; voir avec le virus que votre accusateur, alors gardez la t&ecirc;te haute et dites-le.

source: If anyone has knowledge or evidence about who developed the virus, I hope he or she will come forth and make an accusation against specific people based on specific proof. But nobody should make accusations without proof, and there is no excuse for guilt by association. Not in New York, not in Cambridge, and not in the Free World.
fr: Si quelqu'un a des informations sur les d&eacute;veloppeurs de ce virus, j'esp&egrave;re qu'il ou elle va se manifester et accuser des gens bien pr&eacute;cis avec des preuves bien pr&eacute;cises. Mais personne ne devrait accuser sans preuves, et la culpabilit&eacute; par association n'est pas excusable. Ni &agrave; New York, ni &agrave; Cambridge, ni dans le monde (du) libre.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Note du traducteur</b>&nbsp;:<br /><ol><li id="TransNote1">Jeu de mots entre &laquo;&nbsp;testifying&nbsp;&raquo; (t&eacute;moigner) et&laquo;&nbsp;lying&nbsp;&raquo; (mentir).</li></ol>

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Bruno Menan.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
