Repository: gitGNU/gnu_www-fr
Catalog: philosophy/15-years-of-free-software.*.po
Languages: fr

source: 15 Years of Free Software - - GNU Project - Free Software Foundation (FSF)
fr: 15 ans de logiciels libres - GNU Project - Free Software Foundation (FSF)

source: GNU, FSF, Free Software Foundation, freedom, Richard Stallman, rms, free software movement
fr: GNU, FSF, Free Software Foundation, libert&eacute;, Richard Stallman, rms, mouvement du logiciel libre

source: Richard Stallman discusses the history of the movement to develop a free operating system.
fr: Richard Stallman parle de l'histoire du mouvement pour d&eacute;velopper un syst&egrave;me d'exploitation libre.

source: 15 Years of Free Software
fr: 15 ans de logiciels libres

source: by <strong>Richard M. Stallman</strong>
fr: par <strong>Richard M. Stallman</strong>

source: It is now just over 15 years since the beginning of the Free Software Movement and the GNU Project. We have come a long way.
fr: Cela va faire juste 15 ans depuis le d&eacute;but du mouvement des logiciels libres et du projet GNU. Cela en fait du chemin&nbsp;!

source: In 1984, it was impossible to use a modern computer without installing a proprietary operating system, which you would have to obtain under a restrictive license. No one was allowed to share software freely with fellow computer users, and hardly anyone could change software to fit his or her own needs. The owners of software had erected walls to divide us from each other.
fr: En 1984, il &eacute;tait impossible d'utiliser un ordinateur moderne sans installer de syst&egrave;me d'exploitation propri&eacute;taire, obtenu sous licence restrictive. Personne n'&eacute;tait autoris&eacute; &agrave; partager librement de logiciels avec des amis, et quasiment personne ne pouvait modifier de logiciels pour qu'ils s'adaptent &agrave; ses besoins. Les &eacute;diteurs de logiciels avaient &eacute;rig&eacute; des murs pour nous diviser les uns des autres.

source: The GNU Project was founded to change all that. Its first goal: to develop a Unix-compatible portable operating system that would be 100% free software. Not 95% free, not 99.5%, but 100%&mdash;so that users would be free to redistribute the whole system, and free to change and contribute to any part of it. The name of the system, GNU, is a recursive acronym meaning &ldquo;GNU's Not Unix&rdquo;&mdash;a way of paying tribute to Unix, while at the same time saying that GNU is something different. Technically, GNU is like Unix. But unlike Unix, GNU gives its users freedom.
fr: Le projet GNU a &eacute;t&eacute; fond&eacute; pour changer tout cela. Son premier objectif&nbsp;: d&eacute;velopper un syst&egrave;me d'exploitation portable et compatible Unix qui serait &agrave; 100% libre. Pas libre &agrave; 95%, pas &agrave; 99.5%, mais &agrave; 100%. Les utilisateurs seraient ainsi libres de redistribuer le syst&egrave;me entier, libres de modifier et contribuer &agrave; n'importe laquelle de ses parties. Le nom de ce syst&egrave;me, GNU, est un acronyme r&eacute;cursif signifiant &laquo;&nbsp;GNU's Not Unix&nbsp;&raquo; (GNU n'est pas Unix), une mani&egrave;re de rendre hommage &agrave; Unix, tout en disant que GNU est quelque chose de diff&eacute;rent. Techniquement, GNU est comme Unix. Mais contrairement &agrave; Unix, GNU accorde la libert&eacute; &agrave; ses utilisateurs.

source: It took many years of work, by hundreds of programmers, to develop this operating system. Some were paid by the Free Software Foundation and by free software companies; most were volunteers. A few have become famous; most are known mainly within their profession, by other hackers who use or work on their code. All together have helped to liberate the potential of the computer network for all humanity.
fr: Cela a pris des ann&eacute;es de travail, des centaines de programmeurs, pour d&eacute;velopper ce syst&egrave;me d'exploitation. Certains &eacute;taient pay&eacute;s par la Fondation pour le logiciel libre et par des entreprises en logiciel libre, mais la plupart &eacute;taient des volontaires. Certains sont devenus c&eacute;l&egrave;bres&nbsp;; la plupart sont connus dans leur profession, par d'autres hackers qui utilisent ou travaillent sur leur code. Tous ensemble, ils ont aid&eacute; &agrave; lib&eacute;rer le potentiel du r&eacute;seau informatique pour toute l'humanit&eacute;.

source: In 1991, the last major essential component of a Unix-like system was developed: Linux, the free kernel written by Linus Torvalds. Today, the combination of GNU and Linux is used by millions of people around the world, and its popularity is growing. This month, we announced release 1.0 of <acronym title="GNU Network Object Model Environment">GNOME</acronym>, the GNU graphical desktop, which we hope will make the GNU/Linux system as easy to use as any other operating system.
fr: En 1991, le dernier &eacute;l&eacute;ment essentiel &agrave; un syst&egrave;me semblable &agrave; Unix a &eacute;t&eacute; d&eacute;velopp&eacute;&nbsp;: Linux, le noyau libre &eacute;crit par Linus Torvalds. Aujourd'hui, la combinaison de GNU et de Linux est utilis&eacute;e par des millions de gens dans le monde, et sa popularit&eacute; ne fait qu'augmenter. Ce mois-ci, on annon&ccedil;ait la sortie de <acronym title="GNU Network Object Model Environment">GNOME</acronym> version 1.0, le bureau graphique GNU, qui, nous l'esp&eacute;rons, rendra le syst&egrave;me GNU/Linux aussi facile &agrave; utiliser que n'importe quel autre syst&egrave;me d'exploitation.

source: But our freedom is not permanently assured. The world does not stand still, and we cannot count on having freedom five years from now, just because we have it today. Free software faces difficult challenges and dangers. It will take determined efforts to preserve our freedom, just as it took to obtain freedom in the first place. Meanwhile, the operating system is just the beginning&mdash;now we need to add free applications to handle the whole range of jobs that users want to do.
fr: Mais notre libert&eacute; n'est pas assur&eacute;e pour l'avenir. Le monde avance et nous ne pouvons pas &ecirc;tre s&ucirc;rs d'avoir les m&ecirc;mes libert&eacute;s dans cinq ans, juste parce que nous les avons aujourd'hui. Le logiciel libre fait face &agrave; de graves probl&egrave;mes et dangers. Cela demandera des efforts pour pr&eacute;server notre libert&eacute;, comme cela en a demand&eacute; pour l'obtenir. En attendant, le syst&egrave;me d'exploitation n'est que le commencement. Nous avons maintenant besoin d'ajouter des applications libres pour couvrir l'ensemble des t&acirc;ches que les utilisateurs voudraient effectuer.

source: In future columns, I will be writing about the specific challenges facing the free software community, and other issues affecting freedom for computer users, as well as developments affecting the GNU/Linux operating system.
fr: Dans un futur article, j'&eacute;crirai &agrave; propos des d&eacute;fis sp&eacute;cifiques auxquels doit faire face la communaut&eacute; du libre, et dans d'autres colonnes, &agrave; propos des probl&egrave;mes relatifs &agrave; la libert&eacute; des utilisateurs ou au d&eacute;veloppement du syst&egrave;me d'exploitation GNU/Linux.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 1999 Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 1999 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Nicolas Robin<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
