Repository: gitGNU/gnu_www-fr
Catalog: philosophy/amazon.*.po
Languages: fr

source: (Formerly) Boycott Amazon! - GNU Project - Free Software Foundation (FSF)
fr: (Anciennement) Boycottez Amazon&nbsp;! - GNU Project - Free Software Foundation (FSF)

source: Boycott Amazon!
fr: Boycottez Amazon&nbsp;!

source: The FSF decided to end its boycott of Amazon in September 2002. (We forgot to edit this page at the time.) We could not tell the precise result of the lawsuit against Barnes and Noble, but it did not seem to be very harmful to the defendent. And Amazon had not attacked anyone else.
fr: La FSF a d&eacute;cid&eacute; de mettre fin au boycott d'Amazon en septembre 2002. (&Agrave; cette &eacute;poque nous avions oubli&eacute; d'&eacute;diter cette page). Nous ne saurions dire le r&eacute;sultat pr&eacute;cis du proc&egrave;s contre Barnes and Noble, mais il n'a pas sembl&eacute; &ecirc;tre tr&egrave;s nocif pour le d&eacute;fendant. Et Amazon n'a attaqu&eacute; personne d'autre.

source: Amazon has got a number of other menacing patents since then, but has not as yet used them for aggression. Perhaps it will not do so. If it does, we will take a look at how to denounce it.
fr: Amazon poss&egrave;de un certain nombre d'autres brevets mena&ccedil;ants depuis lors, mais ne les a pas employ&eacute;s jusqu'ici de mani&egrave;re agressive. Peut-&ecirc;tre que cela ne durera pas. Si c'est le cas, nous verrons comment le d&eacute;noncer.

source: The rest of this page is as it was in 2001 while the boycott was active.
fr: La suite de cette page est telle qu'elle &eacute;tait en 2001 &agrave; l'&eacute;poque o&ugrave; le boycott &eacute;tait actif.

source: Why we boycott Amazon
fr: Pourquoi nous boycottons Amazon

source: Amazon has obtained a <a href="/philosophy/amazonpatent.html">US patent (5,960,411)</a> on an important and obvious idea for E-commerce: an idea sometimes known as one-click purchasing. The idea is that your command in a web browser to buy a certain item can carry along information about your identity. (It works by sending the server a &ldquo;cookie&rdquo;, a kind of ID code that your browser received previously from the same server.)
fr: Amazon a obtenu un <a href="/philosophy/amazonpatent.html">brevet aux USA (5.960.411)</a> sur une id&eacute;e importante et &eacute;vidente du e-commerce&nbsp;: l'id&eacute;e que la transmission de votre commande par un navigateur web pour acheter un article puisse acheminer des informations sur votre identit&eacute;. (Cela fonctionne en renvoyant un &laquo;&nbsp;cookie&nbsp;&raquo;, une sorte de code d'identification que votre navigateur a re&ccedil;u pr&eacute;c&eacute;demment du m&ecirc;me serveur).

source: Amazon has sued to block the use of this simple idea, showing that they truly intend to monopolize it. This is an attack against the World Wide Web and against E-commerce in general.
fr: Amazon a intent&eacute; un proc&egrave;s pour bloquer l'utilisation de cette simple id&eacute;e, d&eacute;montrant leur r&eacute;elle volont&eacute; de la monopoliser. Ceci est une attaque contre le World Wide Web et contre le commerce &eacute;lectronique en g&eacute;n&eacute;ral.

source: The idea patented here is just that a company can give you something which you can subsequently show them to identify yourself for credit. This is nothing new: a physical credit card does the same job, after all. But the US Patent Office issues patents on obvious and well-known ideas every day. Sometimes the result is a disaster.
fr: L'id&eacute;e en question est qu'une entreprise puisse vous donner quelque chose que vous pouvez ensuite leur montrer pour vous identifier et &ecirc;tre accr&eacute;dit&eacute;. Ce n'est pas nouveau&nbsp;: une carte de cr&eacute;dit effectue le m&ecirc;me travail, apr&egrave;s tout. Mais l'Office am&eacute;ricain des brevets et des marques (USPTO) (&eacute;quivalent de l'INPI) valide tous les jours des brevets sur des id&eacute;es &eacute;videntes et bien connues. Parfois, le r&eacute;sultat est und&eacute;sastre.

source: Today Amazon is suing one large company. If this were just a dispute between two companies, it would not be an important public issue. But the patent gives Amazon the power over anyone who runs a web site in the US (and any other countries that give them similar patents)&mdash;power to control all use of this technique. Although only one company is being sued today, the issue affects the whole Internet.
fr: Aujourd'hui Amazon intente un proc&egrave;s &agrave; une grande entreprise. S'il s'agissait d'une simple dispute entre deux entreprises, il n'y aurait de cons&eacute;quence publique importante. Mais le brevet donne &agrave; Amazon le pouvoir sur quiconque exploite un site internet aux USA (et dans chaque autre pays leur fournissant un brevet similaire) &mdash; celui de contr&ocirc;ler toute utilisation de cette technique. Bien qu'une seule entreprise soit poursuivie aujourd'hui, ce probl&egrave;me affecte Internet globalement.

source: Amazon is not alone at fault in what is happening. The US Patent Office is to blame for having very low standards, and US courts are to blame for endorsing them. And US patent law is to blame for authorizing patents on information-manipulating techniques and patterns of communication&mdash;a policy that is harmful in general. (See <a href="http://progfree.org">http://progfree.org/</a> for more information about the broader issue of <a href="http://progfree.org/Patents/patents.html">software patents</a>.)
fr: Amazon n'est pas le seul fautif dans ce qui se passe. Le US Patent Office est &agrave; blamer pour se reposer sur des standards d&eacute;valu&eacute;s, les tribunaux am&eacute;ricains sont &agrave; blamer pour les avaliser. Et la loi am&eacute;ricaine sur les brevets est &agrave; blamer pour autoriser des brevets sur des techniques de calcul et de traitement des donn&eacute;es et des mod&egrave;les de communication &mdash; une politique n&eacute;faste en g&eacute;n&eacute;ral. (Voir <a href="http://progfree.org/">http://lpf.ai.mit.edu</a> pour plus d'informations sur la question des <a href="http://progfree.org/Patents/patents.html">brevets logiciels</a>).

source: Foolish government policies gave Amazon the opportunity&mdash;but an opportunity is not an excuse. Amazon made the choice to obtain this patent, and the choice to use it in court for aggression. The ultimate moral responsibility for Amazon's actions lies with Amazon's executives.
fr: Des politiques gouvernementales farfelues ont fourni cette opportunit&eacute; &agrave; Amazon, mais une opportunit&eacute; n'est pas une excuse. Amazon a fait le choix d'obtenir ce brevet, et le choix de l'utiliser lors du proc&egrave;s. L'ultime responsabilit&eacute; morale des actions d'Amazon incombe &agrave; ses dirigeants.

source: But we do not have to wait passively for the court to decide the freedom of E-commerce. There is something we can do right now: we can refuse to do business with Amazon. Please do not buy anything from Amazon until they promise to stop using this patent to threaten or restrict other web sites.
fr: Mais nous n'avons pas &agrave; attendre passivement que le tribunal d&eacute;cide de la libert&eacute; du e-commerce. Il y a quelque chose que nous pouvons faire d&egrave;s maintenant&nbsp;: nous pouvons refuser de commercer avec Amazon. S'il vous pla&icirc;t, n'achetez rien chez Amazon jusqu'&agrave; ce qu'ils promettent de ne plus utiliser ce brevet pour menacer ou limiter d'autres sites web.

source: If you are the author of a book sold by Amazon, you can provide powerful help to this campaign by putting this text into the &ldquo;author comment&rdquo; about your book, on Amazon's web site. (Alas, it appears they are refusing to post these comments for authors.)
fr: Si vous &ecirc;tes l'auteur d'un livre vendu par Amazon, vous pouvez fournir une aide pr&eacute;cieuse &agrave; cette campagne en int&eacute;grant ce texte dans votre &laquo;&nbsp;pr&eacute;face&nbsp;&raquo;, sur le site web d'Amazon. (Il appara&icirc;t qu'ils refusent de poster ces commentaires pour les auteurs).

source: If you have suggestions, or if you simply support the boycott, please send mail to <a href="mailto:amazon@gnu.org">&lt;amazon@gnu.org&gt;</a> to let us know.
fr: Si vous avez des suggestions, ou si simplement vous soutenez le boycott, envoyez, s'il vous pla&icirc;t, un email &agrave; <a href="mailto:amazon&#64;gnu.org">&lt;amazon&#64;gnu.org&gt;</a> pour nous tenir au courant.

source: Amazon's response to people who write about the patent contains a subtle misdirection which is worth analyzing:
fr: La r&eacute;ponse d'Amazon aux personnes qui &eacute;crivent sur le brevet comporte une orientation subtilement trompeuse qui vaut le coup d'&ecirc;tre analys&eacute;e&nbsp;:

source: The patent system is designed to encourage innovation, and we spent thousands of hours developing our 1-ClickR shopping feature.
fr: The patent system is designed to encourage innovation, and we spent thousands of hours developing our 1-ClickR shopping feature.<br />Traduction&nbsp;:<br />Le syst&egrave;me de brevet est con&ccedil;u pour encourager l'innovation, et nous avons consacr&eacute; des milliers d'heures &agrave; d&eacute;velopper notre fonctionnalit&eacute; 1-ClickR shopping &mdash; acheter en un clic.

source: If they did spend thousands of hours, they surely did not spend it thinking of the general technique that the patent covers. So if they are telling the truth, what did they spend those hours doing?
fr: S'ils ont r&eacute;ellement pass&eacute; des milliers d'heures, ils ne l'ont certainement pas fait &agrave; r&eacute;fl&eacute;chir &agrave; la technique g&eacute;n&eacute;rale couverte par le brevet. Donc, s'ils disent la v&eacute;rit&eacute;, &agrave; quoi ont-ils pass&eacute; ces heures&nbsp;?

source: Perhaps they spent some of the time writing the patent application. That task was surely harder than thinking of the technique. Or perhaps they are talking about the time it took designing, writing, testing, and perfecting the scripts and the web pages to handle one-click shopping. That was surely a substantial job. Looking carefully at their words, it seems the &ldquo;thousands of hours developing&rdquo; could include either of these two jobs.
fr: Peut-&ecirc;tre ont-ils pass&eacute; du temps &agrave; d&eacute;crire l'application du brevet. Cette t&acirc;che fut assur&eacute;ment plus ardue que de r&eacute;fl&eacute;chir &agrave; la technique. Ou peut-&ecirc;tre &eacute;voquent-ils le temps qu'il a fallu pour concevoir, &eacute;crire, tester et perfectionner les scripts et les pages web pour mettre en place des achats &agrave; un clic. Ce fut certainement un travail substantiel. En regardant leurs mots attentivement, il semble que les &laquo;milliers d'heures de d&eacute;veloppement&raquo; puisse inclure chacun de ces deux aspects.

source: But the issue here is not about the details in their particular scripts (which they do not release to us) and web pages (which are copyrighted anyway). The issue here is the general idea, and whether Amazon should have a monopoly on that idea.
fr: Mais le probl&egrave;me ici n'est pas &agrave; propos des d&eacute;tails de leurs scripts (qu'ils ne nous ont pas diffus&eacute;s) et des pages web (qui sont sous copyright de toutes fa&ccedil;ons). Le probl&egrave;me r&eacute;side ici dans l'id&eacute;e g&eacute;n&eacute;rale, et si Amazon devrait en avoir le monopole.

source: Are you, or I, free to spend the necessary hours writing our own scripts, our own web pages, to provide one-click shopping? Even if we are selling something other than books, are we free to do this? That is the question. Amazon seeks to deny us that freedom, with the eager help of a misguided US government.
fr: Sommes-nous, vous ou moi, libres de passer le temps n&eacute;cessaire &agrave; &eacute;crire nos propres scripts, nos propres pages web pour proposer des fonctionnalit&eacute;s d'achat &agrave; un clic&nbsp;? M&ecirc;me si nous vendons autre chose que des livres, sommes-nous libres de le faire&nbsp;? L&agrave; est la question. Amazon cherche &agrave; nous priver de cette libert&eacute;, avec l'aide empress&eacute;e d'un gouvernement am&eacute;ricain mal avis&eacute; (ou pire).

source: When Amazon sends out cleverly misleading statements like the one quoted above, it demonstrates something important: they do care what the public thinks of their actions. They must care&mdash;they are a retailer. Public disgust can affect their profits.
fr: Lorsque Amazon diffuse des formulations intelligemment d&eacute;voy&eacute;es telles que celle mentionn&eacute;e ci-dessus, cela d&eacute;montre une chose importante&nbsp;: ils sont tr&egrave;s attentifs &agrave; ce que le public pense de leurs actions. Ils doivent &ecirc;tre attentifs &mdash; ils sont d&eacute;taillants. Une aversion du public peut avoir des cons&eacute;quences sur leurs profits.

source: People have pointed out that the problem of software patents is much bigger than Amazon, that other companies might have acted just the same, and that boycotting Amazon won't directly change patent law. Of course, these are all true. But that is no argument against this boycott!
fr: Certaines personnes mettent en avant que le probl&egrave;me des brevets sur les logiciels va bien au-del&agrave; d'Amazon, que d'autres entreprises auraient pu agir de fa&ccedil;on similaire, et que le boycott d'Amazon ne changera pas directement la loi sur les brevets. Bien s&ucirc;r, tout ceci est vrai. Mais &ccedil;a n'est pas un argument contre ce boycott&nbsp;!

source: If we mount the boycott strongly and lastingly, Amazon may eventually make a concession to end it. And even if they do not, the next company which has an outrageous software patent and considers suing someone will realize there can be a price to pay. They may have second thoughts.
fr: Si nous mettons en place un boycott fort et durable, Amazon pourrait &eacute;ventuellement faire une concession pour y mettre un terme. Et m&ecirc;me s'ils ne le font pas, la prochaine entreprise disposant d'un brevet logiciel outrageux qui envisagerait de faire un proc&egrave;s &agrave; quelqu'un r&eacute;alisera qu'il y a un prix &agrave; payer. Elle pourrait reconsid&eacute;rer la question.

source: The boycott can also indirectly help change patent law&mdash;by calling attention to the issue and spreading demand for change. And it is so easy to participate that there is no need to be deterred on that account. If you agree about the issue, why <em>not</em> boycott Amazon?
fr: Le boycott peut aussi aider &agrave; modifier la loi sur les brevets &mdash; en attirant l'attention sur la question et en propageant la demande de changement. Et il est si facile de participer qu'il n'y a pas de raison d'&ecirc;tre d&eacute;courag&eacute; dans ce cas. Si vous &ecirc;tes d'accord sur la question, pourquoi <em>ne pas</em> boycotter Amazon&nbsp;?

source: To help spread the word, please put a note about the boycott on your own personal web page, and on institutional pages as well if you can. Make a link to this page; updated information will be placed here.
fr: Pour nous aider &agrave; diffuser cette information, faites, s'il vous pla&icirc;t, une note sur le boycott sur vos pages web personnelles, et cr&eacute;ez un lien vers cette page, une information &agrave; jour y figurera.

source: Why the Boycott Continues Given that the Suit has Settled
fr: Pourquoi le boycott continue alors que les poursuites juridiques ont cess&eacute;

source: Amazon.com reported in March 2002 that it had settled its long-running patent-infringement suit against Barnes and Noble over its 1-Click checkout system. The details of the settlement were not disclosed.
fr: Amazon.com annon&ccedil;a en mars 2002 que les longues poursuites contre Barnes and Noble concernant le brevet sur le syst&egrave;me 1-Click ont cess&eacute; &agrave; travers un arrangement. Les d&eacute;tails de l'accord n'ont pas &eacute;t&eacute; divulgu&eacute;s.

source: Since the terms were not disclosed, we have no way of knowing whether this represents a defeat for Amazon such as would justify ending the boycott. Thus, we encourage everyone to continue the boycott.
fr: Puisque les termes de l'accord n'ont pas &eacute;t&eacute; divulgu&eacute;s, nous n'avons aucune chance de savoir si cela repr&eacute;sente une d&eacute;faite pour Amazon telle que cela justifierait la fin du boycott. Ainsi, nous encourageons chacun &agrave; continuer le boycott.

source: Updates and Links
fr: Mises &agrave; jour et liens

source: In this section, we list updates and links about issues related to Amazon.com, their business practices, and stories related to the boycott. New information is added to the bottom of this section.
fr: Dans cette section, nous &eacute;num&eacute;rons des mises &agrave; jour et des liens concernant Amazon.com, leurs m&eacute;thodes d'affaires, et les histoires li&eacute;es au boycott. Chaque nouvelle information est ajout&eacute;e en bas de cette section.

source: Tim O'Reilly has sent Amazon an <a href="http://www.oreilly.com/pub/a/oreilly/ask_tim/2000/amazon_patent.html">open letter</a> disapproving of the use of this patent, stating the position about as forcefully as possible given an unwillingness to stop doing business with them.
fr: Tim O'Reilly a envoy&eacute; &agrave; Amazon une <a href="http://www.oreilly.com/ask_tim/amazon_patent.html">lettre ouverte</a> d&eacute;sapprouvant l'utilisation de ce brevet, en appuyant cette opinion avec autant de force que possible, en stoppant &agrave; contrecœur ses affaires avec eux.

source: <a href="http://www.stallman.org/">Richard M. Stallman</a> has written a <a href="/philosophy/amazon-rms-tim.html">letter to Tim O'Reilly</a> in regard to the statement by Jeff Bezos, <acronym title="Chief Executive Officer">CEO</acronym> of Amazon, which called for software patents to last just 3 or 5 years.
fr: <a href="http://www.stallman.org/">Richard M. Stallman</a> a &eacute;crit une <a href="/philosophy/amazon-rms-tim.fr.html">lettre &agrave; Tim O'Reilly</a> &agrave; propos des propos tenus par Jeff Bezos, <acronym title="Chief Executive Officer">CEO</acronym> d'Amazon, qui lan&ccedil;ait un appel pour que les brevets ne durent que 3 ou 5 ans.

source: Paul Barton-Davis <a href="mailto:pbd@op.net">&lt;pbd@op.net&gt;</a>, one of the founding programmers at Amazon, <a href="http://www.equalarea.com/paul/amazon-1click.html">writes</a> about the Amazon Boycott.
fr: Paul Barton-Davis <a href="mailto:pbd&#64;op.net">&lt;pbd&#64;op.net&gt;</a>, un des programmeurs fondateurs &agrave; Amazon, <a href="http://www.op.net/~pbd/amazon-1click.html">a &eacute;crit</a> &agrave; propos du boycott d'Amazon.

source: Nat Friedman wrote in with an <a href="/philosophy/amazon-nat.html">Amazon Boycott success story</a>.
fr: Nat Friedman &agrave; &eacute;crit &agrave; ce propos les <a href="/philosophy/amazon-nat.fr.html">aventures du boycott d'Amazon</a>.

source: On the side, Amazon is doing <a href="http://www.salon.com/tech/log/1999/10/28/amazon/index.html">other obnoxious things</a> in another courtroom, too.
fr: Par ailleurs, Amazon est aussi en train de pr&eacute;parer <a href="http://www.salon.com/tech/log/1999/10/28/amazon/index.html">d'autres choses naus&eacute;abondes</a> dans une autre cour d'assises.

source: See <a href="http://progfree.org">http://progfree.org/</a> for more information about the broader issue of <a href="http://progfree.org/Patents/patents.html">software patents</a>.
fr: Voir <a href="http://progfree.org">http://lpf.ai.mit.edu/</a> pour plus d'informations &agrave; propos des probl&egrave;mes des <a href="http://progfree.org/Patents/patents.html">brevets logiciels</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Pascal Desroche<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
