Repository: gitGNU/gnu_www-fr
Catalog: philosophy/bdk.*.po
Languages: fr

source: The Ballad of Dennis Karjala
fr: La ballade de Dennis Karjala

source: THE BALLAD OF DENNIS KARJALA
fr: LA BALLADE DE DENNIS KARJALA

source: <cite>A political comment in the form of a broadside ballad, by Timothy R. Phillips</cite>
fr: <cite>Un commentaire politique en forme de ballade par Timothy R. Phillips</cite>

source: Come all you brave songwriters, and listen unto me,<br /> I'll tell you of a man who fought all for our liberty.<br /> With nothing but a web site and a stout heart in his breast,<br /> he fought the Disney company and the greedy Gershwin Trust.<br />
fr: Venez, valeureux troubadours, et &eacute;coutez-moi,<br />je vous parlerai d'un homme qui a tout combattu pour notre libert&eacute;.<br />Avec rien qu'un site web et un cœur vaillant dans la poitrine,<br />il a combattu la soci&eacute;t&eacute; Disney et l'avide fiduciaire Gerschwin.<br />

source: It wasn't many years ago, in nineteen and seventy-eight,<br /> they added nineteen years onto the term of copyright;<br /> then said the movie barons and the proud high-lords of song,<br /> &ldquo;our copyrights will suit us well if they can last this long.&rdquo;<br />
fr: Ce n'&eacute;tait pas il y a bien des ann&eacute;es, en mil neuf cent soixante-dix-huit,<br />ils avaient ajout&eacute; dix-neuf ans sur le terme d'un droit d'auteur;<br />alors dirent les barons du cin&eacute;ma et les fiers seigneurs de la chanson,<br />&laquo;&nbsp;nos droits d'auteurs nous si&eacute;ront bien s'ils peuvent durer ce temps&nbsp;&raquo;.<br />

source: But when the nineteen extra years were nearly past and done,<br /> those same proud barons then returned with cash to Washington.<br /> &ldquo;We want another twenty years, we hate the public domain.<br /> And here's some cash that you can use to fund your next campaign.&rdquo;<br />
fr: Mais quand les dix-neuf ans suppl&eacute;mentaires furent presque atteints,<br />Ces m&ecirc;mes fiers barons s'en retourn&egrave;rent avec de l'argent &agrave; Washington.<br />&laquo;&nbsp;Nous voulons vingt ann&eacute;es de plus, nous ha&iuml;ssons le domaine public.<br />Et voici de l'argent pour financer votre prochaine campagne&nbsp;&raquo;.<br />

source: Then up spoke Dennis Karjala in Arizona's land,<br /> &ldquo;Rise up, rise up my merry men! for we must take our stand<br /> all for the Constitution, or the lords of copyright<br /> will steal away our books and music in their haughty might.&rdquo;<br />
fr: Alors parla Dennis Karjala en pays d'Arizona,<br />&laquo;&nbsp;Levez-vous, levez-vous mes joyeux compagnons! car nous devons tous r&eacute;sister<br />pour notre Constitution, ou les ma&icirc;tres du droit d'auteur<br />voleront nos livres et notre musique dans leur hautaine puissance&nbsp;&raquo;.<br />

source: Then up rose Dennis's merry men, they gathered to his cause:<br /> The wise man Peter Jaszi, well learned in the laws;<br /> and Mary Brandt, the valiant maid from Mississippi's land,<br /> with a hundred alligators that all wait on her command.<br />
fr: Alors se lev&egrave;rent les joyeux compagnons de Dennis, ils s'&eacute;taient ralli&eacute;s &agrave; sa cause&nbsp;:<br />Le sage Peter Jaszi, bien renseign&eacute; sur les lois;<br />et Mary Brandt, Dame vaillante du pays du Mississipi,<br />avec une centaine d'alligators attendant ses ordres.<br />

source: &ldquo;Oh Congressmen, you are deceived! the lords of Hollywood<br /> have made you to forget your oath to serve the common good.&rdquo;<br /> &ldquo;Hush you, Dennis Karjala, your egghead words are rash.<br /> We'll listen to the film-lords, and to their ready cash.&rdquo;<br />
fr: &laquo;&nbsp;&Ocirc; Messieurs du Congr&egrave;s, que vous avez &eacute;t&eacute; dup&eacute;s&nbsp;! Les seigneurs d'Hollywood<br />vous ont fait oublier votre serment de servir le bien commun&nbsp;&raquo;.<br />&laquo;&nbsp;Taisez-vous, Dennis Karjala, vos mots d'intellectuel sont hardis.<br />Nous &eacute;couterons les seigneurs du film, et leur argent qui nous attend&nbsp;&raquo;.<br />

source: &ldquo;Alas for us, my merry men! the Congress is beguiled,<br /> the public domain is put to nought, and freedom is reviled.<br /> Now let us warn the people with a web-page on the net.<br /> Though our proud foes are mighty, perhaps we'll beat them yet.&rdquo;<br />
fr: &laquo;&nbsp;H&eacute;las pour nous, mes joyeux compagnons&nbsp;! Le Congr&egrave;s est s&eacute;duit,<br />le domaine public est ramen&eacute; &agrave; n&eacute;ant, et la libert&eacute; injuri&eacute;e.<br />C&eacute;ans, avertissons le peuple &agrave; l'aide d'une page sur la toile.<br />Bien que nos fiers ennemis soient puissants, peut-&ecirc;tre les battrons-nous cependant&nbsp;&raquo;.<br />

source: Now Dennis posts his web-page on a node in cyber-space<br /> and Mary Brandt with her alligators back in her own place,<br /> launches a web-wide mailing list where messages will run,<br /> that the evil that the song-lords plan might somehow be undone.<br />
fr: Alors Dennis posta sa page web sur un nœud du cyber-espace<br />et Mary Brandt avec ses alligators, de retour en son pays,<br />lan&ccedil;a un vaste publipostage sur la toile, o&ugrave; les messages circul&egrave;rent,<br />que le d&eacute;moniaque plan des seigneurs de la chanson pourrait &ecirc;tre quelque peu d&eacute;fait.<br />

source: The President sits in his house with an Intern at his feet,<br /> and a Congresswoman comes to him with words so honey-sweet.<br /> The President, he signs the bill: for twenty years more by law,<br /> song-barons will suck the public's life into their greedy maw.<br />
fr: Le Pr&eacute;sident s'assit en sa demeure avec un apothicaire &agrave; ses pieds,<br />et une membre du Congr&egrave;s vint &agrave; lui avec des paroles si douceureuses.<br />Et le Pr&eacute;sident signa le projet de loi&nbsp;: pour vingt ann&eacute;es de plus, de par la loi,<br />Les barons de la chanson aspireront la vie publique dans leur avide panse.<br />

source: &ldquo;Alas for us, my merry men, alas for the public domain.<br /> The people's right is thrown aside all for the film-lords' gain.<br /> But let us fight on 'til the day the barons in their greed<br /> are cast down from their seat, and song and letters will be freed.&rdquo;<br />
fr: &laquo;&nbsp;H&eacute;las pour nous, mes joyeux compagnons, h&eacute;las pour le domaine public.<br />Le droit du peuple est mis &agrave; bas pour le seul b&eacute;n&eacute;fice des seigneurs du film.<br />Mais battons-nous jusqu'au jour o&ugrave; les barons dans leur avidit&eacute;<br />seront renvers&eacute;s de leurs tr&ocirc;nes, et la chanson et les lettres seront lib&eacute;r&eacute;es&nbsp;&raquo;.<br />

source: <i>Copyright &copy; 2000 by Timothy R. Phillips. The author thanks Peter Jaszi, Mary Brandt Jensen, and Dennis Karjala for allowing him to portray them in mythological garb. This ballad may be reprinted freely as long as the words are unaltered and this notice is included.</i>
fr: <i>Copyright &copy; 2000 par Timothy R. Phillips. L'auteur remercie Peter Jaszi, Mary Brandt Jensen, et Dennis Karjala pour l'avoir autoris&eacute; &agrave; les d&eacute;peindre en costumes mythologiques. Cette ballade peut &ecirc;tre reproduite tant que les mots restent inalt&eacute;r&eacute;s et la notice incluse.</i>

source: First posted January 27, 2000.<br /> Last updated January 27, 2000.
fr: Premi&egrave;re publication, le 27 janvier 2000<br />Derni&egrave;re mise &agrave; jour, le 27 janvier 2000

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
