Repository: gitGNU/gnu_www-fr
Catalog: philosophy/boldrin-levine.*.po
Languages: fr

source: Review: Boldrin and Levine, &ldquo;The case against intellectual property&rdquo; - GNU Project - Free Software Foundation (FSF)
fr: Critique&nbsp;: Boldrin et Levine, &laquo;&nbsp;L'affaire contre la propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; - GNU Project - Free Software Foundation (FSF)

source: Review: Boldrin and Levine, &ldquo;The case against intellectual property&rdquo;
fr: Critique&nbsp;: Boldrin et Levine, &laquo;&nbsp;L'affaire contre la propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: <a href="http://www.researchoninnovation.org/tiip/archive/issue2003_2.html">http://www.researchoninnovation.org/tiip/archive/issue2003_2.html</a> contains a paper by Boldrin and Levine entitled &ldquo;The case against intellectual property&rdquo;. It argues on economic grounds that authors can make money by selling their work even in a world where everyone can copy.
fr: <a href="http://www.researchoninnovation.org/tiip/archive/issue2003_2.html">&lt;http://www.researchoninnovation.org/tiip/archive/issue2003_2.html&gt;</a> contient un texte de Boldrin et Levine intitul&eacute; &laquo;&nbsp;L'affaire contre la propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;. Il plaide sur des fondements &eacute;conomiques que les auteurs peuvent faire de l'argent en vendant leur travail, m&ecirc;me dans un monde o&ugrave; tout le monde peut copier.

source: You've probably heard the superficial argument that &ldquo;If the program is free, you will only sell one copy&rdquo;. The obvious response is that today there are companies that sell thousands of copies a month. But this paper provides another response: it shows why people who are fully aware of the economic consequences of the freedom to copy would pay a high price for &ldquo;the first copy&rdquo;.
fr: Vous avez probablement entendu parler de l'argument fallacieux qui dit que &laquo;&nbsp;si le programme est libre, vous ne vendrez qu'une seule copie&nbsp;&raquo;. La r&eacute;ponse &eacute;vidente est qu'aujourd'hui, il y a des soci&eacute;t&eacute;s qui vendent des milliers de copies chaque mois. Mais cet article fournit une autre r&eacute;ponse&nbsp;: il montre pourquoi les gens qui sont si pr&eacute;occup&eacute;s des cons&eacute;quences &eacute;conomiques de la libert&eacute; de copie paieraient un tr&egrave;s fort prix pour &laquo;&nbsp;la premi&egrave;re copie&nbsp;&raquo;.

source: <a href="/philosophy/words-to-avoid.html#IntellectualProperty">The term &ldquo;intellectual property&rdquo; is biased and spreads confusion.</a> The bias is easy to see&mdash;by calling copyright and patents and trademarks &ldquo;property&rdquo;, it leads people to think that criticizing them is &ldquo;opposing property rights&rdquo;. The confusion is less evident: by lumping copyright and patents and trademarks together, it leads people to treat them as one thing, to ignore their large differences and consider them as a single issue in terms of their meager similarities.
fr: <a href="/philosophy/words-to-avoid.fr.html#IntellectualProperty">Le terme &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; est partial et s&egrave;me la confusion.</a> Le parti pris est facile &agrave; voir &mdash; en appelant droit d'auteur, brevets et marques &laquo;&nbsp;propri&eacute;t&eacute;&nbsp;&raquo;, il conduit les gens &agrave; penser que les critiquer c'est &laquo;&nbsp;s'opposer aux droits de propri&eacute;t&eacute;&nbsp;&raquo;. La confusion est moins &eacute;vidente&nbsp;: en mettant dans le m&ecirc;me panier droit d'auteur, brevets et marques, cela conduit les gens &agrave; les traiter comme une seule entit&eacute;, &agrave; ignorer leurs grandes diff&eacute;rences et &agrave; les consid&eacute;rer comme un seul probl&egrave;me en termes de leurs maigres similarit&eacute;s.

source: This usually means ignoring social and ethical aspects of copyrights, and the different social and ethical aspects of patents, and considering both copyrights and patents as a single issue in narrow economic terms. The proponents of harshly restrictive copyrights and patents then present an economic argument that is so simple that it gives an appearance of being irrefutable.
fr: Ceci signifie habituellement l'ignorance des aspects sociaux et &eacute;thiques du droit d'auteur, et les diff&eacute;rents aspects sociaux et &eacute;thiques des brevets, et la consid&eacute;ration des droits d'auteurs et des brevets comme un seul probl&egrave;me en termes &eacute;conomiques &eacute;troits. Les adeptes de droits d'auteur et de brevets &acirc;prement restrictifs pr&eacute;sentent alors un argument qui est si simple qu'il donne l'impression d'&ecirc;tre irr&eacute;futable.

source: I normally respond by showing the aspects of the situation that have been ignored by treating the issue as a purely economic one. Boldrin and Levine's paper takes on that simple economic argument on its own terms, and shows the gaps in it, gaps that the apparent simplicity tends to hide.
fr: J'y r&eacute;ponds d'habitude en montrant les aspects de la situation qui ont &eacute;t&eacute; ignor&eacute;s en traitant le probl&egrave;me comme &eacute;tant purement &eacute;conomique. L'article de Boldrin et Levine prend ce simple argument &eacute;conomique litt&eacute;ralement, et montre ses lacunes, lacunes que l'apparente simplicit&eacute; tend &agrave; cacher.

source: I believe we should continue to reject the term &ldquo;intellectual property&rdquo;. We need to call attention to the non-economic aspects of copyrights and the different non-economic aspects of patents. However, Boldrin and Levine's arguments will be useful for responding to people who insist on narrowing their values to economics.
fr: Je pense que nous devrions continuer &agrave; rejeter le terme &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;. Nous avons besoin de porter notre attention sur les aspects non &eacute;conomiques des droits d'auteur et sur les diff&eacute;rents aspects non &eacute;conomiques des brevets. Quoiqu'il en soit, les arguments de Boldrin et Levine seront utiles pour r&eacute;pondre aux personnes qui insistent pour restreindre leurs valeurs au seul point de vue &eacute;conomique.

source: The paper is addressed to economists and somewhat mathematical. Popularization of its ideas would be useful.
fr: L'article s'adresse aux &eacute;conomistes et quelque peu math&eacute;maticiens. La vulgarisation de ses id&eacute;es serait utile.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2003 Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2003 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
