Repository: gitGNU/gnu_www-fr
Catalog: philosophy/bsd.*.po
Languages: fr

source: BSD License Problem - GNU Project - Free Software Foundation (FSF)
fr: Le probl&egrave;me de la licence BSD - GNU Project - Free Software Foundation (FSF)

source: The BSD License Problem
fr: Le probl&egrave;me de la licence BSD

source: The two major categories of free software license are <a href="/copyleft/copyleft.html">copyleft</a> and <a href="/philosophy/categories.html#Non-CopyleftedFreeSoftware"> non-copyleft </a>. <a href="/licenses/license-list.html#GPLCompatibleLicenses">Copyleft licenses</a> such as the <a href="/copyleft/gpl.html">GNU GPL</a> insist that modified versions of the program must be free software as well. Non-copyleft licenses do not insist on this. <a href="/philosophy/why-copyleft.html">We recommend copyleft</a>, because it protects freedom for all users, but non-copylefted software can still be free software, and useful to the free software community.
fr: Les deux cat&eacute;gories principales de licences libres sont les licences <a href="/copyleft/copyleft.fr.html">copyleft&eacute;es</a> et les licences <a href="/philosophy/categories.fr.html#Non-CopyleftedFreeSoftware">non copyleft&eacute;es</a>. <a href="/licenses/license-list.fr.html#GPLCompatibleLicenses">Les licences copyleft&eacute;es</a> comme la <a href="/copyleft/gpl.html">GNU GPL</a> insistent sur le fait que les versions modifi&eacute;es d'un programme doivent aussi &ecirc;tre des logiciels libres. Les licences non copyleft&eacute;es n'insistent pas sur ce point. <a href="/philosophy/why-copyleft.fr.html">Nous recommandons le copyleft</a>, car il prot&egrave;ge la libert&eacute; de tous les utilisateurs, mais le logiciel non copyleft&eacute; est n&eacute;anmoins utile pour la communaut&eacute; du logiciel libre.

source: There are many variants of simple <a href="/licenses/license-list.html#GPLCompatibleLicenses">non-copyleft free software licenses</a>, such as the Expat license, FreeBSD license, X10 license, the X11 license, and the two BSD (Berkeley Software Distribution) licenses. Most of them are equivalent except for details of wording, but the license used for BSD until 1999 had a special problem: the <q>obnoxious BSD advertising clause.</q> It said that every advertisement mentioning the software must include a particular sentence:
fr: Il y a diff&eacute;rentes <a href="/licenses/license-list.fr.html#GPLCompatibleLicenses">licences libres non copyleft&eacute;es</a>, dont les licences Expat, FreeBSD, X10, X11, la licence FreeBSD et les deux licences BSD (Berkeley System Distribution). La plupart de ces licences non copyleft&eacute;es sont &eacute;quivalentes &agrave; part sur des d&eacute;tails de formulation, mais la licence utilis&eacute;e par BSD jusqu' en 1999 avait un probl&egrave;me sp&eacute;cial&nbsp;: &laquo;&nbsp;l'odieuse clause de publicit&eacute; BSD&nbsp;&raquo;, qui conduisait &agrave; une sorte d'embouteillage pour promouvoir le logiciel libre. La clause demandait que chaque publicit&eacute; mentionnant le logiciel devait inclure une citation particuli&egrave;re&nbsp;:

source: Initially the obnoxious BSD advertising clause was used only in the Berkeley Software Distribution. That did not cause any particular problem, because including one sentence in an ad is not a great practical difficulty.
fr: Initialement, l'odieuse clause de publicit&eacute; BSD &eacute;tait seulement utilis&eacute;e dans le syst&egrave;me BSD, cela ne causerait pas de probl&egrave;me majeur. Inclure une citation dans une publicit&eacute; n'est pas tr&egrave;s difficile dans la pratique

source: If other developers who used BSD-like licenses had copied the BSD advertising clause verbatim&mdash;including the sentence that refers to the University of California&mdash;then they would not have made the problem any bigger.
fr: Si d'autres d&eacute;veloppeurs qui utilisent des licences de style BSD copient la clause de publicit&eacute; BSD mot pour mot, en incluant la citation qui r&eacute;f&egrave;re &agrave; l'universit&eacute; de Californie, alors ils ne rendraient pas le probl&egrave;me plus grave.

source: But, as you might expect, other developers did not copy the clause verbatim. They changed it, replacing &ldquo;University of California&rdquo; with their own institution or their own names. The result is a plethora of licenses, requiring a plethora of different sentences.
fr: Mais, comme vous pouvez vous en douter, les autres d&eacute;veloppeurs ne copient pas la clause mot pour mot. Ils ont chang&eacute; la citation requise, rempla&ccedil;ant &laquo;&nbsp;University of California&nbsp;&raquo; par leur propre organisation et leur propres noms. Le r&eacute;sultat est une pl&eacute;thore de programmes demandant de citer une pl&eacute;thore de citations diff&eacute;rentes.

source: When people put many such programs together in an operating system, the result is a serious problem. Imagine if a software system required 75 different sentences, each one naming a different author or group of authors. To advertise that, you would need a full-page ad.
fr: Quand les gens incluent de tels programmes ensemble dans un syst&egrave;me d'exploitation, le r&eacute;sultat est un probl&egrave;me s&eacute;rieux. Imaginez unsyst&egrave;me compos&eacute; de logiciels demandant 75 citations diff&eacute;rentes, chacune nommant un auteur ou groupe d'auteurs diff&eacute;rent. Vous ne pourriez pas en faire la promotion sans moins d'une pleine page de publicit&eacute;.

source: This might seem like extrapolation ad absurdum, but it is actual fact. In a 1997 version of NetBSD, I counted 75 of these sentences. (Fortunately NetBSD has decided to stop adding them, and to remove those it could.)
fr: Cela put sembler une extrapolation absurde, mais c'est un fait r&eacute;el. Dans une version de NetBSD de 1997, j'en ai compt&eacute; 75. Je ne serais pas surpris si la liste avait grandi aujourd'hui.

source: To address this problem, in my &ldquo;spare time&rdquo; I talk with developers who have used BSD-style licenses, asking them if they would please remove the advertising clause. Around 1996 I spoke with the developers of FreeBSD about this, and they decided to remove the advertising clause from all of their own code. In May 1998 the developers of Flick, at the University of Utah, removed this clause.
fr: Pour s'attaquer &agrave; ce probl&egrave;me, je parle &agrave; mes moments perdus avec des d&eacute;veloppeurs qui ont utilis&eacute; une licence de style BSD, en leurdemandant de supprimer la clause de publicit&eacute;. En 1996, j'en ai parl&eacute; aux d&eacute;veloppeurs de FreeBSD, et ils ont d&eacute;cid&eacute; de supprimer la clause de publicit&eacute; de leur propre code. En mai 1998 les d&eacute;veloppeurs de Flick &agrave; l'universit&eacute; d'Utah ont supprim&eacute; leur clause.

source: Dean Hal Varian at the University of California took up the cause, and championed it with the administration. In June 1999, after two years of discussions, the University of California removed this clause from the license of BSD.
fr: Le doyen Hal Varian de l'Universit&eacute; de Californie &agrave; pris parti pour la cause et s'en est fait le porte parole aupr&egrave;s de l'administration. En juin 1999, apr&egrave;s deux ans de discussions, l'universit&eacute; de Californie a supprim&eacute; cette clause de la licence de BSD.

source: Thus, there is now a new BSD license which does not contain the advertising clause. Unfortunately, this does not eliminate the legacy of the advertising clause: similar clauses are still present in the licenses of many packages which are not part of BSD. The change in license for BSD has no effect on the other packages which imitated the old BSD license; only the developers who made them can change them.
fr: Ainsi, il y a d&eacute;sormais une nouvelle licence BSD, qui ne contient pas les clauses de publicit&eacute;. Malheureusement, elle n'&eacute;limine par l'h&eacute;ritage des clauses de publicit&eacute;: des clauses similaires sont toujours pr&eacute;sentes dans les sources de beaucoup de logiciels qui ne font pas partie de BSD. La modification de la licence de BSD n'a pas d'effet sur les autres logiciels qui ont imit&eacute; l'ancienne licence BSD; seuls les d&eacute;veloppeurs qui les ont fait peuvent les modifier.

source: But if they followed Berkeley's lead before, maybe Berkeley's change in policy will convince some of them to change. It's worth asking.
fr: Mais s'ils ont suivi l'exemple de Berkeley auparavant, peut-&ecirc;tre que la modification de la politique de Berkeley convaincra certain d'entre eux de changer. &Ccedil;a vaut le coup de demander.

source: So if you have a favorite package which still uses the BSD license with the advertising clause, please ask the maintainer to look at this web page, and consider making the change.
fr: Ainsi, si vous avez un logiciel favori qui utilise toujours la licence BSD avec la clause de publicit&eacute;, veuillez demander au mainteneur de lire cet article et de r&eacute;fl&eacute;chir &agrave; effectuer la modification.

source: And if you want to release a program as non-copylefted free software, please don't use the advertising clause. Instead of copying the BSD license from some released package&mdash;which might still have the old version of the license in it&mdash;please copy the license from X11.
fr: Et si vous voulez distribuer un logiciel libre non-copyleft&eacute;, je vous prie de ne pas utiliser la clause de publicit&eacute;. &Agrave; la place de copier la licence BSD d'un logiciel distribu&eacute; (qui pourrait toujours contenir l'ancienne version de la licence), copiez la licence de X11.

source: You can also help spread awareness of the issue by not using the term &ldquo;BSD-style&rdquo;, and not saying &ldquo;the BSD license&rdquo; which implies there is only one. You see, when people refer to all non-copyleft free software licenses as &ldquo;BSD-style licenses&rdquo;, some new free software developer who wants to use a non-copyleft free software license might take for granted that the place to get it is from BSD. He or she might copy the license with the advertising clause, not by specific intention, just by chance.
fr: Vous pouvez aussi aider &agrave; &eacute;tendre l'int&eacute;r&ecirc;t accord&eacute; au probl&egrave;me en n'utilisant pas le terme &laquo;&nbsp;style BSD&nbsp;&raquo; et en ne disant pas &laquo;&nbsp;la licence BSD&nbsp;&raquo;, ce qui implique qu'il n'y en a qu'une. Voyez vous, quand on utilise le terme &laquo;&nbsp;licences BSD&nbsp;&raquo; pour se r&eacute;f&eacute;rer &agrave; toutes les licences libres non copyleft&eacute;es, on peut amener de nouveaux d&eacute;veloppeurs de logiciels libres qui veulent utiliser une licence non copyleft&eacute;e &agrave; prendre pour acquit que le moyen d'y arriver est la licence BSD. Il ou elle pourrait copier la licence avec la clause de publicit&eacute;, pas en tant que d&eacute;cision ferme, mais juste par d&eacute;faut.

source: If you would like to cite one specific example of a non-copyleft license, and you have no particular preference, please pick an example which has no particular problem. For instance, if you talk about &ldquo;X11-style licenses&rdquo;, you will encourage people to copy the license from X11, which avoids the advertising clause for certain, rather than take a risk by randomly chosing one of the two BSD licenses.
fr: Ainsi, si vous voulez citer un exemple pr&eacute;cis de licence non copyleft&eacute;e et que vous n'avez pas de pr&eacute;f&eacute;rence particuli&egrave;re, je vous prie d'utiliser un exemple sans probl&egrave;me particulier. Par exemple, si vous sugg&eacute;rez l'utilisation d'une &laquo;&nbsp;licence de style X11&nbsp;&raquo;, vous encouragerez les d&eacute;veloppeurs &agrave; imiter X11 et &agrave; &eacute;viter la clause de publicit&eacute; plut&ocirc;t que de prendre un risque en imitant l'une ou l'autre des licences BSD.

source: When you want to refer specifically to one of the BSD licenses, please always state which one: the &ldquo;original BSD license&rdquo; or the &ldquo;revised BSD license&rdquo;.
fr: Quand vous souhaitez faire r&eacute;f&eacute;rence sp&eacute;cifiquement &agrave; une des licences BSD, citez svp laquelle: &laquo;&nbsp;la licence BSD originale&nbsp;&raquo; ou la &laquo;&nbsp;la licence BSD modifi&eacute;e&nbsp;&raquo;.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Benjamin Drieu.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions ce cette page
