Repository: gitGNU/gnu_www-fr
Catalog: philosophy/can-you-trust.*.po
Languages: fr

source: When someone uses GPG to send you an encrypted document, and you use GPG to decode it, the result is an unencrypted document that you can read, forward, copy, and even re-encrypt to send it securely to someone else. A treacherous computing application would let you read the words on the screen, but would not let you produce an unencrypted document that you could use in other ways. GPG, a free software package, makes security features available to the users; they use it. Treacherous computing is designed to impose restrictions on the users; it uses them.
fr: Quand quelqu'un emploie GPG pour vous envoyer un document chiffr&eacute;, et que vous utilisez GPG pour le d&eacute;coder, le r&eacute;sultat est un document non cod&eacute; que vous pouvez lire, transf&eacute;rer, copier, et m&ecirc;me re-chiffrer pour l'envoyer de mani&egrave;re s&eacute;curis&eacute;e &agrave; quelqu'un d'autre. Une application de l'«&nbsp;informatique d&eacute;loyale&nbsp;» vous laisserait lire les mots sur l'&eacute;cran, mais ne vous permettrait pas de produire un document non cod&eacute; que vous pourriez utiliser d'autres mani&egrave;res. GPG, un logiciel libre, aide &agrave; mettre en place des dispositifs de s&eacute;curit&eacute; disponibles pour les utilisateurs ; ils l'utilisent. L'«&nbsp;informatique d&eacute;loyale&nbsp;» est con&ccedil;ue pour imposer des restrictions aux utilisateurs ; dans ce cas c'est elle qui les «&nbsp;utilise&nbsp;».

source: The supporters of treacherous computing focus their discourse on its <a name="beneficial">beneficial uses</a>. What they say is often correct, just not important.
fr: Les supporters de l'informatique d&eacute;loyale concentrent leur discours sur son <a name="beneficial">utilisation b&eacute;n&eacute;fique</a>. Ce qu'ils disent est souventcorrect, mais sans importance.

source: Like most hardware, treacherous computing hardware can be used for purposes which are not harmful. But these uses can be implemented in other ways, without treacherous computing hardware. The principal difference that treacherous computing makes for users is the nasty consequence: rigging your computer to work against you.
fr: Comme la plupart des appareils, les &eacute;quipements de l'informatique d&eacute;loyale peuvent &ecirc;tre utilis&eacute;s &agrave; des fins qui ne sont pas dommageables.Mais leurs utilisations peuvent &ecirc;tre mises en &oelig;uvre par d'autres moyens, sans utiliser d'équipement de l'informatique d&eacute;loyale. La principale diff&eacute;rence de l'informatique d&eacute;loyale pour les utilisateurs est sa f&acirc;cheuse cons&eacute;quence&nbsp;: la manipulation de votre ordinateur pour qu'il travaille contre vous.

source: What they say is true, and what I say is true. Put them together and what do you get? Treacherous computing is a plan to take away our freedom, while offering minor benefits to distract us from what we would lose.
fr: Ce qu'ils disent est vrai, et ce que je dis est vrai. Mettez-les ensemble et qu'obtenez-vous&nbsp;&nbsp;? L'informatique d&eacute;loyale est un plan pour retirer votre libert&eacute; tout en offrant des b&eacute;n&eacute;fices mineurs pour nous distraire de ce que nous perdrions.

source: Microsoft presents palladium as a security measure, and claims that it will protect against viruses, but this claim is evidently false. A presentation by Microsoft Research in October 2002 stated that one of the specifications of palladium is that existing operating systems and applications will continue to run; therefore, viruses will continue to be able to do all the things that they can do today.
fr: Microsoft pr&eacute;sente Palladium comme un dispositif de s&eacute;curit&eacute;, et pr&eacute;tend qu'il prot&eacute;gera vos donn&eacute;es contre les virus. Mais ce discours est &eacute;videmment faux. Une pr&eacute;sentation r&eacute;alis&eacute;e par Microsoft Research (le d&eacute;partement Recherche/D&eacute;veloppement de Microsoft) en octobre 2002 a montr&eacute; qu'une des caract&eacute;ristiques de Palladium consiste &agrave; permettre aux syst&egrave;mes d'exploitation et aux applications existantes de continuer de fonctionner ; donc, les virus continueront &agrave; faire toutes les choses qu'ils font aujourd'hui.

source: When Microsoft speaks of &ldquo;security&rdquo; in connection with palladium, they do not mean what we normally mean by that word: protecting your machine from things you do not want. They mean protecting your copies of data on your machine from access by you in ways others do not want. A slide in the presentation listed several types of secrets palladium could be used to keep, including &ldquo;third party secrets&rdquo; and &ldquo;user secrets&rdquo;&mdash;but it put &ldquo;user secrets&rdquo; in quotation marks, recognizing that this somewhat of an absurdity in the context of palladium.
fr: Quand Microsoft parle de «&nbsp;s&eacute;curit&eacute;&nbsp;» &agrave; propos de Palladium, il ne s'agit pas de notre d&eacute;finition de la s&eacute;curit&eacute; : prot&eacute;ger votre machine contre des choses que vous ne voulez pas. Elle signifie prot&eacute;ger vos donn&eacute;es stock&eacute;es sur votre machine contre l'acc&egrave;s par vous, d'une mani&egrave;re que d'autres ne veulent pas. Un diaporama dans la pr&eacute;sentation montre plusieurs types d'informations secr&egrave;tes que Palladium pourrait conserver, y compris des secrets de tiers et des «&nbsp;secrets d'utilisateurs&nbsp;» - mais «&nbsp;secrets d'utilisateurs&nbsp;» est mis entre guillemets, ce qui signifie que Palladium n'est pas v&eacute;ritablement con&ccedil;u pour ce type d'informations.

source: The presentation made frequent use of other terms that we frequently associate with the context of security, such as &ldquo;attack&rdquo;, &ldquo;malicious code&rdquo;, &ldquo;spoofing&rdquo;, as well as &ldquo;trusted&rdquo;. None of them means what it normally means. &ldquo;Attack&rdquo; doesn't mean someone trying to hurt you, it means you trying to copy music. &ldquo;Malicious code&rdquo; means code installed by you to do what someone else doesn't want your machine to do. &ldquo;Spoofing&rdquo; doesn't mean someone fooling you, it means you fooling palladium. And so on.
fr: Dans la pr&eacute;sentation on trouve fr&eacute;quemment d'autres termes que nous associons habituellement &agrave; la notion de s&eacute;curit&eacute;, tels que «&nbsp;attaque&nbsp;», «&nbsp;code malveillant&nbsp;», «&nbsp;spoofing&nbsp;», ainsi que «&nbsp;confiance&nbsp;» (trusted). Aucun d'eux ne d&eacute;signe ce que signifie normalement ces mots. Une «&nbsp;attaque&nbsp;» ne signifie pas que quelqu'un essaye de vous blesser. Il signifie que vous essayez de copier de la musique. «&nbsp;Code malveillant&nbsp;» signifie un code install&eacute; par vous pour faire ce que quelqu'un d'autre ne veut pas que votre machine fasse. «&nbsp;Spoofing&nbsp;» ne signifie pas quelqu'un qui vous dupe, il signifie que vous dupez Palladium. Et ainsi de suite.

source: A previous statement by the palladium developers stated the basic premise that whoever developed or collected information should have total control of how you use it. This would represent a revolutionary overturn of past ideas of ethics and of the legal system, and create an unprecedented system of control. The specific problems of these systems are no accident; they result from the basic goal. It is the goal we must reject.
fr: Un rapport pr&eacute;c&eacute;dent, &eacute;crit par les partisans de Palladium a &eacute;nonc&eacute; le principe de base suivant&nbsp;: que celui qui a d&eacute;velopp&eacute; ou a rassembl&eacute; l'information devrait avoir le contr&ocirc;le total de la fa&ccedil;on dont vous l'utilisez. Ceci repr&eacute;senterait un renversement r&eacute;volutionnaire des id&eacute;es pass&eacute;es de l'&eacute;thique et du syst&egrave;me l&eacute;gal, et cr&eacute;erait un syst&egrave;me de contr&ocirc;le sans pr&eacute;c&eacute;dent. Les probl&egrave;mes sp&eacute;cifiques de ces syst&egrave;mes ne sont aucunement des accidents ; ils r&eacute;sultent du principe de base. C'est ce but que nous devons rejeter.

source: This essay is published in <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>
fr: Cet essai est publié dans le livre <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections (or suggestions) to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Fabien Illide<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
