Repository: gitGNU/gnu_www-fr
Catalog: philosophy/can-you-trust.*.po
Languages: fr

source: Can You Trust Your Computer? - GNU Project - Free Software Foundation (FSF)
fr: Pouvez-vous faire confiance &agrave; votre ordinateur ? - GNU Project - Free Software Foundation (FSF)

source: Can You Trust Your Computer?
fr: Pouvez-vous faire confiance &agrave; votre ordinateur ?

source: by <a href="http://www.stallman.org/">Richard Stallman</a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: Who should your computer take its orders from? Most people think their computers should obey them, not obey someone else. With a plan they call &ldquo;trusted computing&rdquo;, large media corporations (including the movie companies and record companies), together with computer companies such as Microsoft and Intel, are planning to make your computer obey them instead of you. (Microsoft's version of this scheme is called &ldquo;Palladium&rdquo;.) Proprietary programs have included malicious features before, but this plan would make it universal.
fr: De qui votre ordinateur devrait-il recevoir ses ordres&nbsp;? La plupart des personnes pensent que leurs ordinateurs devraient leur ob&eacute;ir, et ne pas ob&eacute;ir &agrave; quelqu'un d'autre. Avec un plan qu'elles appellent «&nbsp;Trusted Computing&nbsp;» («&nbsp;L'informatique de confiance&nbsp;»), de grandes soci&eacute;t&eacute;s de m&eacute;dias (y compris du cin&eacute;ma et de l'industrie du disque), ainsi que des soci&eacute;t&eacute;s d'informatique telles que Microsoft et Intel, projettent de faire en sorte que votre ordinateur leur ob&eacute;isse au lieu de vous ob&eacute;ir. Les programmes propri&eacute;taires ont d&eacute;j&agrave; inclus des dispositifs malveillants auparavant, mais ce plan rendrait cette pratique universelle.

source: Proprietary software means, fundamentally, that you don't control what it does; you can't study the source code, or change it. It's not surprising that clever businessmen find ways to use their control to put you at a disadvantage. Microsoft has done this several times: one version of Windows was designed to report to Microsoft all the software on your hard disk; a recent &ldquo;security&rdquo; upgrade in Windows Media Player required users to agree to new restrictions. But Microsoft is not alone: the KaZaa music-sharing software is designed so that KaZaa's business partner can rent out the use of your computer to their clients. These malicious features are often secret, but even once you know about them it is hard to remove them, since you don't have the source code.
fr: Par d&eacute;finition, vous ne contr&ocirc;lez pas ce que fait un logiciel propri&eacute;taire&nbsp;; vous ne pouvez ni &eacute;tudier son code source ni le modifier. Il n'est pas &eacute;tonnant que les hommes d'affaires intelligents trouvent des moyens pour exercer un contr&ocirc;le sur vos actions et ainsi en tirer avantage &agrave; vos d&eacute;pens. Microsoft l'a d&eacute;j&agrave; fait plusieurs fois&nbsp;: une version de Windows a &eacute;t&eacute; con&ccedil;ue pour renseigner Microsoft sur tous les logiciels install&eacute;s sur votre disque dur&nbsp;; une mise &agrave; jour de «&nbsp;s&eacute;curit&eacute;&nbsp;» r&eacute;cente du lecteur de multim&eacute;dias de Windows (Windows Media Player) a impos&eacute; l'accord des utilisateurs sur de nouvelles restrictions. Mais Microsoft n'est pas seul dans ce cas&nbsp;: le logiciel de partage de musique «&nbsp;KaZaa&nbsp;» est con&ccedil;u de sorte que les associ&eacute;s de la compagnie KaZaa puisse louer l'utilisation de votre ordinateur &agrave; leurs clients. Ces dispositifs malveillants sont souvent secrets, mais m&ecirc;me une fois que vous en avez connaissance, il est difficile de les enlever, puisque vous ne disposez pas du code source de l'application.

source: In the past, these were isolated incidents. &ldquo;Trusted computing&rdquo; would make it pervasive. &ldquo;Treacherous computing&rdquo; is a more appropriate name, because the plan is designed to make sure your computer will systematically disobey you. In fact, it is designed to stop your computer from functioning as a general-purpose computer. Every operation may require explicit permission.
fr: Dans le pass&eacute;, il s'agissait d'incidents isol&eacute;s. «&nbsp;L'informatique de confiance&nbsp;» les rendrait dominants. «&nbsp;L'informatique d&eacute;loyale&nbsp;» «&nbsp;Treacherous Computing&nbsp;») est un nom plus appropri&eacute;, parce que le projet est con&ccedil;u pour s'assurer que votre ordinateur vous &eacute;sob&eacute;ira syst&eacute;matiquement. En fait, il est con&ccedil;u pour que votre ordinateur s'arr&ecirc;te de fonctionner comme ordinateur polyvalent. Chaque op&eacute;ration pourra exiger une permission explicite.

source: The technical idea underlying treacherous computing is that the computer includes a digital encryption and signature device, and the keys are kept secret from you. Proprietary programs will use this device to control which other programs you can run, which documents or data you can access, and what programs you can pass them to. These programs will continually download new authorization rules through the Internet, and impose those rules automatically on your work. If you don't allow your computer to obtain the new rules periodically from the Internet, some capabilities will automatically cease to function.
fr: L'id&eacute;e technique fondamentale de «&nbsp;l'informatique d&eacute;loyale&nbsp;» est que l'ordinateur inclut un dispositif num&eacute;rique de chiffrage et de signature, et les clefs sont maintenues secr&egrave;tes (la version Microsoft de ce syst&egrave;me s'appelle «&nbsp;Palladium&nbsp;»). Les logiciels propri&eacute;taires utiliseront ce dispositif afin de contr&ocirc;ler le lancement de tel ou tel programme, &agrave; quels documents ou donn&eacute;es vous pourrez acc&eacute;der, et avec quels programmes vous pourrez lire ou modifier ces documents ou donn&eacute;es. Ces logiciels t&eacute;l&eacute;chargeront r&eacute;guli&egrave;rement de nouvelles r&egrave;gles d'autorisation par Internet, et vous les imposeront. Si vous ne laissez pas votre ordinateur r&eacute;cup&eacute;rer p&eacute;riodiquement ces nouvelles r&egrave;gles depuis Internet, certaines options cesseront de fonctionner.

source: Of course, Hollywood and the record companies plan to use treacherous computing for &ldquo;DRM&rdquo; (Digital Restrictions Management), so that downloaded videos and music can be played only on one specified computer. Sharing will be entirely impossible, at least using the authorized files that you would get from those companies. You, the public, ought to have both the freedom and the ability to share these things. (I expect that someone will find a way to produce unencrypted versions, and to upload and share them, so DRM will not entirely succeed, but that is no excuse for the system.)
fr: Naturellement, Hollywood et l'industrie du disque projettent d'employer l'informatique d&eacute;loyale pour le «&nbsp;DRM&nbsp;» (Digital Restriction Management - gestion de restrictions num&eacute;riques), de sorte que des vid&eacute;os ou de la musique t&eacute;l&eacute;charg&eacute;es ne puissent &ecirc;tre jou&eacute;es que sur un ordinateur donn&eacute;. Le partage des fichiers sera totalement impossible, du moins en utilisant les fichiers que vous obtiendriez aupr&egrave;s de ces soci&eacute;t&eacute;s et que serez autoris&eacute;s &agrave; lire. Vous, le public, devez avoir la libert&eacute; et la possibilit&eacute; de partager ces informations (je m'attends &agrave; ce que quelqu'un trouve une mani&egrave;re de produire des versions non cod&eacute;es, de t&eacute;l&eacute;charger et de partager celles-ci, ainsi le DRM ne s'appliquera pas enti&egrave;rement, mais ce n'est pas une excuse pour laisser ce syst&egrave;me s'implanter).

source: Making sharing impossible is bad enough, but it gets worse. There are plans to use the same facility for email and documents&mdash;resulting in email that disappears in two weeks, or documents that can only be read on the computers in one company.
fr: Rendre impossible le partage des fichiers vid&eacute;os et musicaux est une mauvaise chose, mais &ccedil;a pourrait &ecirc;tre pire. Il existe des projets pour g&eacute;n&eacute;raliser ce dispositif aux messages &eacute;lectroniques et aux documents - ayant pour r&eacute;sultat un email qui dispara&icirc;trait au bout de deux semaines, ou des documents qui pourront seulement &ecirc;tre lus sur les ordinateurs d'une soci&eacute;t&eacute; mais pas sur ceux d'une autre.

source: Imagine if you get an email from your boss telling you to do something that you think is risky; a month later, when it backfires, you can't use the email to show that the decision was not yours. &ldquo;Getting it in writing&rdquo; doesn't protect you when the order is written in disappearing ink.
fr: Imaginez que vous recevez un courrier &eacute;lectronique de votre patron vous indiquant de faire quelque chose que vous pensez risqu&eacute;&nbsp;; un mois plus tard, lorsque la situation s'envenime, vous ne pouvez plus utiliser ce message pour prouver que la d&eacute;cision n'&eacute;tait pas de vous. «&nbsp;Obtenir l'ordre par &eacute;crit&nbsp;» ne vous prot&egrave;ge pas quand l'ordre est &eacute;crit avec une encre qui dispara&icirc;t.

source: Imagine if you get an email from your boss stating a policy that is illegal or morally outrageous, such as to shred your company's audit documents, or to allow a dangerous threat to your country to move forward unchecked. Today you can send this to a reporter and expose the activity. With treacherous computing, the reporter won't be able to read the document; her computer will refuse to obey her. Treacherous computing becomes a paradise for corruption.
fr: Imaginez que vous obtenez un email de votre patron, vous demandant d'agir ill&eacute;galement ou d'effectuer une action moralement indigne, comme d&eacute;chiqueter les r&eacute;sultats de l'audit de votre compagnie, ou permettre &agrave; une menace dangereuse pour votre pays de se propager. Aujourd'hui vous pouvez envoyer ce message &agrave; un journaliste et lui pr&eacute;senter les faits. Avec «&nbsp;l'informatique d&eacute;loyale&nbsp;», le journaliste ne pourra pas lire le document ; son ordinateur refusera de lui ob&eacute;ir. L'«&nbsp;informatique d&eacute;loyale&nbsp;» devient un paradis pour la corruption.

source: Word processors such as Microsoft Word could use treacherous computing when they save your documents, to make sure no competing word processors can read them. Today we must figure out the secrets of Word format by laborious experiments in order to make free word processors read Word documents. If Word encrypts documents using treacherous computing when saving them, the free software community won't have a chance of developing software to read them&mdash;and if we could, such programs might even be forbidden by the Digital Millennium Copyright Act.
fr: Les logiciels de traitement de texte tels que Word de Microsoft pourraient employer «&nbsp;l'informatique d&eacute;loyale&nbsp;» quand ils enregistrent vos documents, pour s'assurer qu'aucun autre traitement de texte concurrent ne puisse les lire. Aujourd'hui nous devons deviner les secrets du format Word par des exp&eacute;riences laborieuses afin de programmer des traitements de texte libres qui puissent lire les documents au format Word (les .doc). Si Word chiffre les documents en utilisant «&nbsp;l'informatique d&eacute;loyale&nbsp;» quand il les enregistre, la communaut&eacute; du Logiciel Libre n'aura pas la possibilit&eacute; de d&eacute;velopper un programme capable de les lire - et m&ecirc;me si nous le pouvions, de tels programmes seraient interdits par la DMCA (Digital Millenium Copyright Act - Loi de copyright du mill&eacute;naire Num&eacute;rique).

source: Programs that use treacherous computing will continually download new authorization rules through the Internet, and impose those rules automatically on your work. If Microsoft, or the US government, does not like what you said in a document you wrote, they could post new instructions telling all computers to refuse to let anyone read that document. Each computer would obey when it downloads the new instructions. Your writing would be subject to 1984-style retroactive erasure. You might be unable to read it yourself.
fr: Les programmes qui utilisent «&nbsp;l'informatique d&eacute;loyale&nbsp;» t&eacute;l&eacute;chargeront r&eacute;guli&egrave;rement de nouvelles r&egrave;gles par Internet, et imposeront ces r&egrave;gles automatiquement &agrave; votre travail. Si Microsoft ou le gouvernement des &Eacute;tats-Unis, n'aime pas ce que vous &eacute;noncez dans un document &eacute;crit, ils seraient en mesure d'ajouter de nouvelles instructions indiquant &agrave; tous les ordinateurs de refuser de lire ce document. Chaque ordinateur ob&eacute;irait, sit&ocirc;t qu'il aurait t&eacute;l&eacute;charg&eacute; les nouvelles instructions. Vos &eacute;crits seraient sujets &agrave; l'effacement r&eacute;troactif «&nbsp;fa&ccedil;on 1984&nbsp;»&nbsp;; au final, vous ne pourriez m&ecirc;me plus les relire.

source: You might think you can find out what nasty things a treacherous computing application does, study how painful they are, and decide whether to accept them. It would be short-sighted and foolish to accept, but the point is that the deal you think you are making won't stand still. Once you come to depend on using the program, you are hooked and they know it; then they can change the deal. Some applications will automatically download upgrades that will do something different&mdash;and they won't give you a choice about whether to upgrade.
fr: Vous pourriez penser que vous serez capable de d&eacute;couvrir quelles mauvaises choses fait une application de «&nbsp;l'informatique d&eacute;loyale&nbsp;», que vous saurez &eacute;tudier de quelles fa&ccedil;ons elles sont n&eacute;fastes, et d&eacute;cider de les accepter ou non. Il faudrait &ecirc;tre myope et idiot pour accepter, et il se trouve que la bonne affaire que vous pensez faire ne tiendra pas toujours. &Agrave; partir du moment o&ugrave; vous devenez d&eacute;pendant de l'utilisation d'un programme, vous &ecirc;tes accroch&eacute;s et ils le savent&nbsp;; ils peuvent alors se permettre de changer la donne. Quelques applications r&eacute;cup&eacute;reront automatiquement les mises &agrave; jour qui fonctionneront alors de fa&ccedil;on diff&eacute;rente - et elles ne vous permettront pas de choisir de mettre &agrave; jour ou non.

source: Today you can avoid being restricted by proprietary software by not using it. If you run GNU/Linux or another free operating system, and if you avoid installing proprietary applications on it, then you are in charge of what your computer does. If a free program has a malicious feature, other developers in the community will take it out, and you can use the corrected version. You can also run free application programs and tools on non-free operating systems; this falls short of fully giving you freedom, but many users do it.
fr: Aujourd'hui vous pouvez &eacute;viter de voir vos libert&eacute;s restreintes par le logiciel propri&eacute;taire en ne l'utilisant pas. Si vous exploitez GNU/Linux ou un autre syst&egrave;me d'exploitation libre, et si vous &eacute;vitez d'y installer des applications propri&eacute;taires, alors vous &ecirc;tes responsable et pouvez d&eacute;cider de ce que fait votre ordinateur. Si un Logiciel Libre contient un dispositif malveillant, des d&eacute;veloppeurs de la communaut&eacute; l'enl&egrave;veront, et vous pourrez utiliser la version corrig&eacute;e. Vous pouvez &eacute;galement utiliser des programmes et des applications libres sur les syst&egrave;mes d'exploitation non-libres&nbsp;; ceci ne vous procure pas une enti&egrave;re libert&eacute;, mais beaucoup d'utilisateurs le font.

source: Treacherous computing puts the existence of free operating systems and free applications at risk, because you may not be able to run them at all. Some versions of treacherous computing would require the operating system to be specifically authorized by a particular company. Free operating systems could not be installed. Some versions of treacherous computing would require every program to be specifically authorized by the operating system developer. You could not run free applications on such a system. If you did figure out how, and told someone, that could be a crime.
fr: L'«&nbsp;informatique d&eacute;loyale&nbsp;» met l'existence des syst&egrave;mes d'exploitation libres et des applications libres en danger, parce que vous ne pourrez pas du tout les utiliser. Quelques versions de «&nbsp;l'informatique d&eacute;loyale&nbsp;» exigeraient que, pour se lancer, le syst&egrave;me d'exploitation b&eacute;n&eacute;ficie d'une autorisation sp&eacute;cifique, d&eacute;livr&eacute;e par une soci&eacute;t&eacute;. Des syst&egrave;mes d'exploitation libres ne pourront pas &ecirc;tre install&eacute;s. Quelques versions de l'«&nbsp;informatique d&eacute;loyale&nbsp;» exigeraient que, pour s'ex&eacute;cuter, chaque programme b&eacute;n&eacute;ficie d'une autorisation d&eacute;livr&eacute;e sp&eacute;cifiquement par le programmeur du syst&egrave;me d'exploitation. Vous ne pourriez pas utiliser d'applications libres sur un tel syst&egrave;me. Si vous trouviez une fa&ccedil;on pour le faire, et le disiez &agrave; quelqu'un, cela pourrait &ecirc;tre consid&eacute;r&eacute; comme un crime.

source: There are proposals already for US laws that would require all computers to support treacherous computing, and to prohibit connecting old computers to the Internet. The CBDTPA (we call it the Consume But Don't Try Programming Act) is one of them. But even if they don't legally force you to switch to treacherous computing, the pressure to accept it may be enormous. Today people often use Word format for communication, although this causes several sorts of problems (see <a href="/philosophy/no-word-attachments.html">&ldquo;We Can Put an End to Word Attachments&rdquo;</a>). If only a treacherous computing machine can read the latest Word documents, many people will switch to it, if they view the situation only in terms of individual action (take it or leave it). To oppose treacherous computing, we must join together and confront the situation as a collective choice.
fr: Il y a d&eacute;j&agrave; des propositions de lois aux &Eacute;tats-Unis pour exiger de tous les ordinateurs qu'ils utilisent «&nbsp;l'informatique d&eacute;loyale&nbsp;», et pour interdire de relier de vieux ordinateurs &agrave; Internet. La CBDTPA (nous l'appelons le «&nbsp;Consume But Do Not Try Programming Act&nbsp;» - Consommons mais n'essayons pas de programmer) est l'une d'elles. Mais m&ecirc;me s'ils ne vous forcent pas &agrave; passer &agrave; «&nbsp;l'informatique de confiance&nbsp;» par des lois, les pressions pour l'accepter peuvent &ecirc;tre &eacute;normes. Aujourd'hui les gens utilisent souvent le format de Word pour s'&eacute;changer des documents, bien que cela cause plusieurs probl&egrave;mes (voir la page <a href="http://www.gnu.org/philosophy/no-word-attachments.fr.html">Finissons-en avec les attachements de Word !</a>). Si seulement une machine de «&nbsp;l'informatique d&eacute;loyale&nbsp;» pouvait lire les documents cr&eacute;&eacute;s avec la derni&egrave;re version de Word, beaucoup de personnes l'utiliserait, d'un point de vue individuel (Prends-le ou laisse-le - take it or leave it). Pour s'opposer &agrave; l'«&nbsp;informatique d&eacute;loyale&nbsp;», nous devons nous regrouper et refuser la situation comme un choix collectif.

source: For further information about treacherous computing, see <a href="http://www.cl.cam.ac.uk/users/rja14/tcpa-faq.html">http://www.cl.cam.ac.uk/users/rja14/tcpa-faq.html</a>.
fr: Pour de plus amples informations au sujet de l'«&nbsp;informatique d&eacute;loyale&nbsp;», voir la page <a href="http://www.cl.cam.ac.uk/users/rja14/tcpa-faq.html">&lt;http://www.cl.cam.ac.uk/users/rja14/tcpa-faq.html&gt;</a>.

source: To block treacherous computing will require large numbers of citizens to organize. We need your help! The <a href="http://www.eff.org">Electronic Frontier Foundation</a> and <a href="http://www.publicknowledge.org">Public Knowledge</a> are campaigning against treacherous computing, and so is the FSF-sponsored Digital Speech Project. Please visit these Web sites so you can sign up to support their work.
fr: Bloquer «&nbsp;l'informatique d&eacute;loyale&nbsp;» exigera d'un grand nombre de citoyens de s'organiser. Nous avons besoin de votre aide ! L'<a href="http://www.eff.org">Electronic Frontier Foundation</a> et la <a href="http://www.publicknowledge.org">Public Knowledge</a> font campagne contre «&nbsp;l'informatique d&eacute;loyale&nbsp;», ainsi que le projet <a href="http://www.digitalspeech.org">Digital Speech</a> commandit&eacute; par la FSF. Veuillez visiter ces sites et ainsi vous pourrez vous inscrire et appuyer leur travail.

source: You can also help by writing to the public affairs offices of Intel, IBM, HP/Compaq, or anyone you have bought a computer from, explaining that you don't want to be pressured to buy &ldquo;trusted&rdquo; computing systems so you don't want them to produce any. This can bring consumer power to bear. If you do this on your own, please send copies of your letters to the organizations above.
fr: Vous pouvez &eacute;galement aider en &eacute;crivant aux si&egrave;ges sociaux d'Intel, IBM, HP/Compaq, ou &agrave; tout autre constructeur &agrave; qui vous avez achet&eacute; un ordinateur, expliquant que vous ne voulez pas subir de pression pour acheter les syst&egrave;mes informatiques «&nbsp;de confiance&nbsp;» et que vous ne voulez pas qu'ils en produisent. Vous contribuerez ainsi &agrave; augmenter la pression des consommateurs sur les constructeurs. Si vous le faites de votre propre chef, envoyez s'il vous pla&icirc;t les copies de vos lettres aux organismes ci-dessus.

source: The GNU Project distributes the GNU Privacy Guard, a program that implements public-key encryption and digital signatures, which you can use to send secure and private email. It is useful to explore how GPG differs from treacherous computing, and see what makes one helpful and the other so dangerous.
fr: Le projet de GNU distribue le GNU Privacy Guard ([44]GPG), un programme qui permet le chiffrage par clefs publiques et signatures num&eacute;riques, que vous pouvez utiliser pour envoyer des emails s&eacute;curis&eacute;s et priv&eacute;s. Il est utile d'&eacute;tudier comment GPG diff&egrave;re de l'«&nbsp;informatique d&eacute;loyale&nbsp;», et de voir ce qui rend l'un utile et l'autre si dangereux.
