Repository: gitGNU/gnu_www-fr
Catalog: philosophy/categories.*.po
Languages: fr

source: Categories of Free and Non-Free Software - GNU Project - Free Software Foundation (FSF)
fr: Cat&eacute;gories de logiciels libres et non libres - GNU Project - Free Software Foundation (FSF)

source: Categories of Free and Non-Free Software
fr: Cat&eacute;gories de logiciels libres et non libres

source: Also note <a href="/philosophy/words-to-avoid.html">Confusing Words which You Might Want to Avoid</a>.
fr: Lisez aussi <a href="/philosophy/words-to-avoid.fr.html">Termes pr&ecirc;tant &agrave; confusion, que vous devriez &eacute;viter</a>.

source: [diagram of a the different categories of software]
fr: [Diagramme des diff&eacute;rentes cat&eacute;gories de logiciels]

source: This diagram by Chao-Kuei explains the different categories of software. It's available as an <a href="/philosophy/category.fig">XFig file</a>, as a <a href="/philosophy/category.jpg">JPEG picture</a> and as a 1.5 magnified <a href="/philosophy/category.png">PNG image</a>, under the terms of any of the GNU GPL v2 or later, the GNU FDL v1.2 or later, or the Creative Commons Attribution-Share Alike v2.0 or later.
fr: Ce diagramme de Chao-Kuei explique les différentes catégories de logiciels. Il est disponible (en français) sous forme de <a href="/philosophy/category.fr.fig">fichier XFig</a>, d'<a href="/philosophy/category.fr.jpg">image JPEG</a> et une <a href="/philosophy/category.fr.png">image PNG</a> grossie 1,5 fois, sous les termes de la GNU GPL v2 ou ultérieure, de la GNU FDL v1.2 ou supérieure ou de la Creative Commons Attribution-Share Alike v2.0 ou ultérieure.

source: <strong>Free software</strong>
fr: <strong>Logiciel libre</strong>

source: Free software is software that comes with permission for anyone to use, copy, and distribute, either verbatim or with modifications, either gratis or for a fee. In particular, this means that source code must be available. &ldquo;If it's not source, it's not software.&rdquo; This is a simplified definition; see also the <a href="/philosophy/free-sw.html">full definition</a>.
fr: Un logiciel libre est un logiciel qui est fourni avec l'autorisation pour quiconque de l'utiliser, de le copier, et de le distribuer, soit sous une forme conforme &agrave; l'original, soit avec des modifications, ou encore gratuitement ou contre un certain montant. Ceci signifie en particulier que son code source doit &ecirc;tre disponible. «&nbsp;S'il n'y a pas de sources, ce n'est pas du logiciel.&nbsp;» Ceci est une d&eacute;finition simplifi&eacute;e; voir aussi la <a href="/philosophy/free-sw.fr.html">d&eacute;finition compl&egrave;te</a>.

source: If a program is free, then it can potentially be included in a free operating system such as GNU, or free versions of the <a href="/gnu/linux-and-gnu.html">GNU/Linux system</a>.
fr: Du moment qu'il est libre, tout programme peut, potentiellement, faire partie d'un syst&egrave;me d'exploitation libre tel que GNU, ou les <a href="/gnu/linux-and-gnu.fr.html">syst&egrave;mes GNU/Linux</a>.

source: There are many different ways to make a program free&mdash;many questions of detail, which could be decided in more than one way and still make the program free. Some of the possible variations are described below. For information on specific free software licenses, see the <a href="/licenses/license-list.html">license list</a> page.
fr: Il existe de nombreuses fa&ccedil;ons de rendre un logiciel libre &mdash; beaucoup de d&eacute;tails peuvent &ecirc;tre d&eacute;finis de diff&eacute;rentes fa&ccedil;ons, tout en gardant au logiciel son caract&egrave;re libre. Certaines de ces variations sont d&eacute;crites ci-apr&egrave;s. Pour des informations sur des licences de logiciels libres sp&eacute;cifiques, consultez la page <a href="/licenses/license-list.fr.html">liste des licences</a>.

source: Free software is a matter of freedom, not price. But proprietary software companies sometimes use the term &ldquo;free software&rdquo; to refer to price. Sometimes they mean that you can obtain a binary copy at no charge; sometimes they mean that a copy is included on a computer that you are buying. This has nothing to do with what we mean by free software in the GNU project.
fr: Un logiciel est libre du point de vue de la libert&eacute;, et non du prix. Mais les soci&eacute;t&eacute;s &eacute;ditrices de logiciels propri&eacute;taires utilisent parfois le terme «&nbsp;logiciel libre&nbsp;» pour parler de logiciels gratuits. Ce qui veut parfois dire que vous pouvez en obtenir une copie binaire gratuitement, ou qu'une copie de ce logiciel est comprise dans le prix d'achat de votre ordinateur. Ceci n'a rien &agrave; voir avec le terme de logiciel libre, tel que nous le d&eacute;finissons dans le projet GNU.

source: Because of this potential confusion, when a software company says its product is free software, always check the actual distribution terms to see whether users really have all the freedoms that free software implies. Sometimes it really is free software; sometimes it isn't.
fr: &Agrave; cause de cette confusion potentielle il serait souhaitable, chaque fois qu'une soci&eacute;t&eacute; informatique annonce que son produit est un logiciel libre, de v&eacute;rifier les conditions de distribution, afin de s'assurer que les usagers disposent de toutes les libert&eacute;s associ&eacute;es au logiciel libre. Parfois il s'agit, effectivement, d'un logiciel libre, parfois non.

source: Many languages have two separate words for &ldquo;free&rdquo; as in freedom and &ldquo;free&rdquo; as in zero price. For example, French has &ldquo;libre&rdquo; and &ldquo;gratuit&rdquo;. Not so English; there is a word &ldquo;gratis&rdquo; that refers unambiguously to price, but no common adjective that refers unambiguously to freedom. So if you are speaking another language, we suggest you translate &ldquo;free&rdquo; into your language to make it clearer. See our list of <a href= "/philosophy/fs-translations.html">translations of the term &ldquo;free software&rdquo;</a> into various other languages.
fr: Beaucoup de langues ont deux mots s&eacute;par&eacute;s pour «&nbsp;libre&nbsp;» pour libert&eacute; et «&nbsp;libre&nbsp;» pour gratuit&eacute;. Par exemple, le fran&ccedil;ais a «&nbsp;libre&nbsp;» et «&nbsp;gratuit&nbsp;». Pas l'anglais; il y a le mot «&nbsp;gratis&nbsp;» qui se r&eacute;f&egrave;re sans ambigu&iuml;t&eacute; au prix, mais pas d'adjectif commun se r&eacute;f&eacute;rant sans &eacute;quivoque &agrave; la libert&eacute;. Aussi, si vous parlez une autre langue, nous vous sugg&eacute;rons de traduire «&nbsp;free&nbsp;» dans votre propre langue pour le rendre plus clair. Consultez notre liste de <a href="/philosophy/fs-translations.fr.html"> traductions du terme «&nbsp;free software&nbsp;»</a> dans diverses langues.

source: Free software is often <a href="/software/reliability.html">more reliable</a> than non-free software.
fr: Le logiciel libre est souvent <a href="/software/reliability.fr.html">plus fiable</a> que le logiciel non-libre.

source: <strong>Open Source software</strong>
fr: <strong>Logiciel Open Source</strong>

source: The term &ldquo;open source&rdquo; software is used by some people to mean more or less the same category as free software. It is not exactly the same class of software: they accept some licenses that we consider too restrictive, and there are free software licenses they have not accepted. However, the differences in extension of the category are small: nearly all free software is open source, and nearly all open source software is free.
fr: Le terme logiciel «&nbsp;open source&nbsp;» (litt&eacute;ralement &agrave; source ouvert) est utilis&eacute; par certaines personnes pour qualifier plus ou moins la m&ecirc;me cat&eacute;gorie que le logiciel libre. Ce n'est pas exactement la m&ecirc;me cat&eacute;gorie de logiciel&nbsp;: ils acceptent certaines licences que nous consid&eacute;rons trop restrictives et il y a des licences de logiciel libre qu'ils n'ont pas accept&eacute;es. Toutefois, les diff&eacute;rences entre les deux cat&eacute;gories sont minimes&nbsp;: pratiquement tous les logiciels libres sont «&nbsp;open source&nbsp;» et presque tous les logiciels «&nbsp;open source&nbsp;» sont libres.

source: We prefer the term &ldquo;<a href= "/philosophy/open-source-misses-the-point.html">free software</a>&rdquo; because it refers to freedom&mdash;something that the term &ldquo;open source&ldquo; does not do.
fr: Nous pr&eacute;f&eacute;rons le terme «&nbsp;<a href="/philosophy/open-source-misses-the-point.fr.html">logiciel libre</a>&nbsp;»; car il se r&eacute;f&egrave;re &agrave; la libert&eacute; -- ce que ne fait pas le terme «&nbsp;open source&nbsp;».

source: <strong>Public domain software</strong>
fr: <strong>Logiciel du domaine public</strong>

source: Public domain software is software that is not copyrighted. If the source code is in the public domain, that is a special case of <a href="#Non-CopyleftedFreeSoftware">non-copylefted free software</a>, which means that some copies or modified versions may not be free at all.
fr: Logiciel du domaine public veut dire logiciel non soumis aux droits d'auteurs. Si le code source est dans le domaine public, c'est un cas particulier de <a href="#Non-CopyleftedFreeSoftware">logiciel libre«&nbsp; non-copyleft&eacute;&nbsp;»</a>, ce qui veut dire que certaines copies, ou certaines versions modifi&eacute;es, peuvent ne pas &ecirc;tre du tout libres.

source: In some cases, an executable program can be in the public domain but the source code is not available. This is not free software, because free software requires accessibility of source code. Meanwhile, most free software is not in the public domain; it is copyrighted, and the copyright holders have legally given permission for everyone to use it in freedom, using a free software license.
fr: Dans certains cas, un programme ex&eacute;cutable peut &ecirc;tre dans le domaine public sans que le code source ne soit disponible. Il ne s'agit pas de logiciel libre, puisque le logiciel libre n&eacute;cessite l'acc&egrave;s au code source.

source: Sometimes people use the term &ldquo;public domain&rdquo; in a loose fashion to mean <a href="#FreeSoftware">&ldquo;free&rdquo;</a> or &ldquo;available gratis.&rdquo; However, &ldquo;public domain&rdquo; is a legal term and means, precisely, &ldquo;not copyrighted&rdquo;. For clarity, we recommend using &ldquo;public domain&rdquo; for that meaning only, and using other terms to convey the other meanings.
fr: Parfois, on utilise le terme «&nbsp;domaine public&nbsp;» d'une fa&ccedil;on peu pr&eacute;cise pour dire <a href="#FreeSoftware">«&nbsp;libre&nbsp;»</a> ou «&nbsp;disponible gratuitement&nbsp;». Toutefois, «&nbsp;domaine public&nbsp;» est un terme l&eacute;gal qui signifie pr&eacute;cis&eacute;ment que le logiciel n'est pas «&nbsp;soumis au copyright&nbsp;». Afin d'&ecirc;tre plus pr&eacute;cis, nous conseillons d'utiliser le terme «&nbsp;domaine public&nbsp;» dans ce cas uniquement, et d'utiliser d'autres termes dans les autres cas.

source: Under the Berne Convention, which most countries have signed, anything written down is automatically copyrighted. This includes programs. Therefore, if you want a program you have written to be in the public domain, you must take some legal steps to disclaim the copyright on it; otherwise, the program is copyrighted.
fr: Selon la convention de Berne, que la plupart des pays ont sign&eacute;, tout ce qui est &eacute;crit est automatiquement sous copyright. Cela comprend les programmes. Par cons&eacute;quent, si vous voulez que le programme que vous avez &eacute;crit soit dans le domaine public, vous devez faire des d&eacute;marches juridiques pour enlever son copyright&nbsp;; sinon le programme demeure sous copyright.

source: <strong>Copylefted software</strong>
fr: <strong>Logiciel <em>copyleft&eacute;</em> (sous <em>gauche d'auteur</em>)</strong>

source: Copylefted software is free software whose distribution terms ensure that all copies of all versions are free software. This means, for instance, that copyleft licenses generally disallow others to add additional requirements to the software (though a limited set of safe added requirements can be allowed) and require making source code available. Some copyleft licenses, such as GPL version 3, block other means of turning software proprietary.
fr: Le logiciel sous copyleft (litt&eacute;ralement, gauche d'auteur) est un logiciel libre, dont les conditions de distribution assurent que toutes les copies de toutes les versions sont des logiciels libres. Cela signifie par exemple, que les licences de copyleft ne permettent pas &agrave; d'autres d'ajouter des conditions suppl&eacute;mentaires au logiciel (bien qu'un ensemble limit&eacute; de conditions s&ucirc;res compl&eacute;mentaires puissent &ecirc;tre ajout&eacute;es) et n&eacute;cessitent que le code source soit disponible. Certaines licences de copyleft, comme la GPL version 3, bloquent d'autres moyens de rendre le logiciel propri&eacute;taire.

source: In the GNU Project, we copyleft almost all the software we write, because our goal is to give <em>every</em> user the freedoms implied by the term &ldquo;free software.&rdquo; See <a href= "/copyleft/copyleft.html">Copylefted</a> for more explanation of how copyleft works and why we use it.
fr: Dans le projet GNU, presque tous les logiciels que nous cr&eacute;ons sont soumis au <em>copyleft</em>, car notre but est de donner <em>&agrave; chaque</em> utilisateur les libert&eacute;s garanties par le terme «&nbsp;logiciel libre&nbsp;». Voir <a href="/copyleft/copyleft.fr.html">Qu'est-ce que le copyleft</a> pour plus d'explications sur le fonctionnement du copyleft et savoir pourquoi nous l'utilisons.

source: Copyleft is a general concept; to actually copyleft a program, you need to use a specific set of distribution terms. There are many possible ways to write copyleft distribution terms, so in principle there can be many copyleft free software licenses. However, in actual practice nearly all copylefted software uses the <a href="/copyleft/gpl.html">GNU General Public License</a>. Two different copyleft licenses are usually &ldquo;incompatible&rdquo;, which means it is illegal to merge the code using one license with the code using the other license; therefore, it is good for the community if people use a single copyleft license.
fr: Le copyleft est un concept g&eacute;n&eacute;ral; pour l'appliquer &agrave; un programme, vous avez besoin d'un ensemble de termes relatifs &agrave; sa distribution. Il y a de nombreuses fa&ccedil;ons d'&eacute;crire ces conditions de distribution, donc en th&eacute;orie de nombreuses licences de logiciels libres sous copyleft peuvent exister. N&eacute;anmoins, dans la pratique actuelle quasiment tous les logiciels sous copyleft utilisent la <a href="/copyleft/gpl.html">Licence Publique G&eacute;n&eacute;rale GNU</a>. Deux licences diff&eacute;rentes avec copyleft sont g&eacute;n&eacute;ralement «&nbsp;incompatible&nbsp;», ce qui signifie qu'il est ill&eacute;gal de m&eacute;langer du code utilisant une de ces licences avec du code utilisant l'autre &agrave; partir de l&agrave;, il est bon pour la communaut&eacute; de n'utiliser qu'une seule licence avec copyleft.

source: <strong>Non-copylefted free software</strong>
fr: <strong>Logiciel libre <em>non-copyleft&eacute;</em></strong>

source: Non-copylefted free software comes from the author with permission to redistribute and modify, and also to add additional restrictions to it.
fr: Le logiciel libre non-copyleft&eacute; est diffus&eacute; par son auteur avec la permission de le redistribuer et de le modifier, mais aussi d'y ajouter d'autres restrictions.

source: If a program is free but not copylefted, then some copies or modified versions may not be free at all. A software company can compile the program, with or without modifications, and distribute the executable file as a <a href= "#ProprietarySoftware">proprietary</a> software product.
fr: Si un programme est libre, mais non-copyleft&eacute;, alors certaines copies ou versions modifi&eacute;es peuvent ne plus &ecirc;tre libres du tout. Une soci&eacute;t&eacute; informatique peut compiler ce programme, avec ou sans modifications, et distribuer le fichier ex&eacute;cutable sous forme de produit logiciel <a href="#ProprietarySoftware">propri&eacute;taire</a>.

source: The <a href="http://www.x.org">X Window System</a> illustrates this. The X Consortium releases X11 with distribution terms that make it non-copylefted free software. If you wish, you can get a copy which has those distribution terms and is free. However, there are non-free versions as well, and there are popular workstations and PC graphics boards for which non-free versions are the only ones that work. If you are using this hardware, X11 is not free software for you. <a href="/philosophy/x.html">The developers of X11 even made X11 non-free for a while.</a>
fr: Le <a href="http://www.x.org">Syst&egrave;me X Window</a> illustre bien ce cas. Le Consortium X distribue X11 avec des conditions de distribution qui en font un logiciel libre non-copyleft&eacute;. Si vous le souhaitez, vous pouvez en obtenir une copie qui poss&egrave;de de tels termes de distribution et qui est libre. Toutefois, il existe aussi des versions non-libres, et il y a des stations de travail ainsi que des cartes graphiques pour PC pour lesquelles les versions non-libres sont les seules qui fonctionnent. Si vous utilisez ce mat&eacute;riel-l&agrave;, pour vous, X11 n'est pas un logiciel libre. <a href="/philosophy/x.fr.html">Les d&eacute;veloppeurs d'X11 ont m&ecirc;me rendu X11 non-libre pour un bon moment.</a>

source: <strong>GPL-covered software</strong>
fr: <strong>Logiciel couvert par la GPL</strong>

source: The <a href="/copyleft/gpl.html">GNU GPL (General Public License)</a> is one specific set of distribution terms for copylefting a program. The GNU Project uses it as the distribution terms for most GNU software.
fr: La <a href="/copyleft/gpl.html">GNU GPL (Licence Publique G&eacute;n&eacute;rale GNU)</a> est un ensemble sp&eacute;cifique de conditions de distribution pour <em>copylefter</em> un programme. Le projet GNU l'utilise comme conditions de distribution de la plupart des logiciels GNU.

source: <strong>The GNU system</strong>
fr: <strong>Le syst&egrave;me GNU</strong>

source: The <a href="/gnu/gnu-history.html">GNU system</a> is the Unix-like operating system, which is entirely free software, that we in the GNU Project have developed since 1984.
fr: Le <a href="/gnu/gnu-history.fr.html">syst&egrave;me GNU</a> est un syst&egrave;me d'exploitation libre complet fa&ccedil;on Unix, qui est enti&egrave;rement libre, et que nous avons d&eacute;velopp&eacute; au sein du projet GNU depuis 1984.

source: A Unix-like operating system consists of many programs. The GNU system includes all the GNU software, as well as many other packages such as the X Window System and TeX which are not GNU software.
fr: Un syst&egrave;me d'exploitation comparable &agrave; Unix contient de nombreux programmes. Le syst&egrave;me GNU comprend tous les logiciels GNU, ainsi que bien d'autres paquetages tels que le X Window System et TeX, qui ne sont pas des logiciels GNU.

source: The first test release of the complete GNU system was in 1996. This includes the GNU Hurd, our kernel, developed since 1990. In 2001 the GNU system (including the GNU Hurd) began working fairly reliably, but the Hurd still lacks some important features, so it is not widely used. Meanwhile, the <a href= "/gnu/linux-and-gnu.html">GNU/Linux system</a>, an offshoot of the GNU system which uses Linux as the kernel instead of the GNU Hurd, has been a great success since the 90s.
fr: Nous d&eacute;veloppons et accumulons des composants pour le syst&egrave;me GNU depuis 1984; la premi&egrave;re mise &agrave; disposition en test d'un «&nbsp;syst&egrave;me GNU complet&nbsp;» remonte &agrave; 1996. Ceci inclut GNU Hurd, notre noyau, d&eacute;velopp&eacute; depuis 1990. En 2001, le syst&egrave;me GNU (y compris Hurd) a commenc&eacute; &agrave; fonctionner de fa&ccedil;on relativement fiable, mais il manque d'importantes fonctionnalit&eacute;s &agrave; Hurd, c'est pourquoi il n'est pas largement utilis&eacute;. Dans le m&ecirc;me temps, le <a href="/gnu/linux-and-gnu.fr.html">syst&egrave;me GNU/Linux</a>, une ramification du syst&egrave;me GNU utilisant Linux comme noyau plut&ocirc;t que GNU Hurd, est devenu un grand succ&egrave;s dans les ann&eacute;es 90.

source: Since the purpose of GNU is to be free, every single component in the GNU system has to be free software. They don't all have to be copylefted, however; any kind of free software is legally suitable to include if it helps meet technical goals. And it isn't necessary for all the components to be GNU software, individually. GNU can and does include non-copylefted free software such as the X Window System that were developed by other projects.
fr: Puisque le but du GNU est d'&ecirc;tre libre, chacun de ses moindres composants doit &ecirc;tre un logiciel libre. Tous ne doivent cependant pas &ecirc;tre copyleft&eacute;s; n'importe quel type de logiciel libre pourra y figurer l&eacute;galement, s'il permet d'atteindre les objectifs techniques. Et il n'est pas n&eacute;cessaire que tous les composants soient des logiciels GNU, individuellement. GNU peut et utilise des logiciels libres non-copyleft&eacute;s, comme le syst&egrave;me X Window, qui sont d&eacute;velopp&eacute;s par d'autres projets.

source: <strong>GNU programs</strong>
fr: <strong>Programmes GNU</strong>

source: &ldquo;GNU programs&rdquo; is equivalent to <a href="#GNUsoftware">GNU software.</a> A program Foo is a GNU program if it is GNU software. We also sometimes say it is a &ldquo;GNU package&rdquo;.
fr: Les «&nbsp;programmes GNU&nbsp;» sont &eacute;quivalents aux <a href="#GNUsoftware">Logiciels GNU</a>. Un programme Toto est un programme GNU s'il est un logiciel GNU. Nous l'appelons parfois aussi «&nbsp;paquet GNU&nbsp;».

source: <strong>GNU software</strong>
fr: <strong>Logiciel GNU</strong>

source: <a href="/software/software.html">GNU software</a> is software that is released under the auspices of the <a href= "/gnu/gnu-history.html">GNU Project</a>. If a program is GNU software, we also say that it is a GNU program or a GNU package. The README or manual of a GNU package should say it is one; also, the <a href="/directory">Free Software Directory</a> indentifies all GNU packages.
fr: Un <a href="/software/software.fr.html">logiciel GNU</a> est un logiciel diffus&eacute; sous les auspices du <a href="/gnu/gnu-history.fr.html">Projet GNU</a>. Si un programme est un logiciel GNU, nous disons aussi qu'il est un programme GNU ou un paquetage GNU. Le fichier README ou le manuel d'un paquetage GNU devrait le sp&eacute;cifier. Le <a href="/directory"> R&eacute;pertoire des logiciels libres</a> identifie &eacute;galement tous les paquetages GNU.

source: Most GNU software is <a href= "/copyleft/copyleft.html">copylefted</a> , but not all; however, all GNU software must be <a href="/philosophy/free-sw.html">free software</a>.
fr: La plupart des logiciels GNU sont soumis &agrave; un <a href="/copyleft/copyleft.fr.html">copyleft</a>, mais pas tous; cependant, tous les logiciels GNU doivent &ecirc;tre des <a href="/philosophy/free-sw.fr.html">logiciels libres</a>.
