Repository: gitGNU/gnu_www-fr
Catalog: philosophy/categories.*.po
Languages: fr

source: Some GNU software is written by <a href= "/people/people.html">staff</a> of the <a href="/fsf/fsf.html">Free Software Foundation</a>, but most GNU software is contributed by <a href="/people/people.html">volunteers</a>. Some contributed software is copyrighted by the Free Software Foundation; some is copyrighted by the contributors who wrote it.
fr: Certains des logiciels GNU sont r&eacute;alis&eacute;s par le <a href="/people/people.html">personnel</a> de la <a href="/fsf/fsf.fr.html">Free Software Foundation</a>, mais la plus grande partie des logiciels GNU est apport&eacute;e par des <a href="/people/people.html">volontaires</a>. Certaines contributions sont sous copyright de la Free Software Foundation; d'autres appartiennent aux auteurs du logiciel.

source: <strong>Non-free software</strong>
fr: <strong>Logiciel non-libre</strong>

source: Non-free software is any software that is not free. This includes <a href="#semi-freeSoftware">semi-free software</a> and <a href="#ProprietarySoftware">proprietary software</a>.
fr: Les logiciels non-libres sont tous les logiciels qui ne sont pas libres. Ceci inclut les <a href="#semi-freeSoftware">logiciels semi-libres</a> et les <a href="#ProprietarySoftware">logiciels propri&eacute;taires</a>.

source: <strong>Semi-free software</strong>
fr: <strong>Logiciel semi-libre</strong>

source: Semi-free software is software that is not free, but comes with permission for individuals to use, copy, distribute, and modify (including distribution of modified versions) for non-profit purposes. PGP is an example of a semi-free program.
fr: Le logiciel semi-libre est un logiciel qui n'est pas libre, mais qui s'accompagne de la permission pour les personnes physiques de l'utiliser, de le copier, de le distribuer, et de le modifier (y compris pour la distribution des versions modifi&eacute;es) dans un but non lucratif. PGP est un exemple de programme semi-libre.

source: Semi-free software is much better ethically than <a href= "#ProprietarySoftware">proprietary software</a>, but it still poses problems, and we cannot use it in a free operating system.
fr: Un logiciel semi-libre est toujours mieux &eacute;thiquement qu'un <a href="#ProprietarySoftware">logiciel propri&eacute;taire</a>, mais cela pose toujours des probl&egrave;mes, et nous ne pouvons l'utiliser dans un syst&egrave;me d'exploitation libre.

source: The restrictions of copyleft are designed to protect the essential freedoms for all users. For us, the only justification for any substantive restriction on using a program is to prevent other people from adding other restrictions. Semi-free programs have additional restrictions, motivated by purely selfish goals.
fr: Les restrictions du copyleft sont con&ccedil;ues pour prot&eacute;ger les libert&eacute;s fondamentales pour tous les utilisateurs. Pour nous, la seule justification &agrave; la d&eacute;finition d'une restriction substantielle sur l'utilisation d'un programme est d'emp&ecirc;cher l'ajout d'autres restrictions par d'autres personnes. Les programmes semi-libres poss&egrave;dent des restrictions suppl&eacute;mentaires, motiv&eacute;es par des buts purement &eacute;go&iuml;stes.

source: It is impossible to include semi-free software in a free operating system. This is because the distribution terms for the operating system as a whole are the conjunction of the distribution terms for all the programs in it. Adding one semi-free program to the system would make the system <em>as a whole</em> just semi-free. There are two reasons we do not want that to happen:
fr: Il est impossible d'inclure du logiciel semi-libre dans un syst&egrave;me d'exploitation libre. Ceci est d&ucirc; au fait que les conditions de distribution du syst&egrave;me d'exploitation dans son entier sont la somme des conditions de distribution de tous les programmes qui le composent. Y ajouter un seul logiciel semi-libre rendrait le syst&egrave;me <em>tout entier</em> seulement semi-libre. Il y deux raisons pour lesquelles nous ne voulons pas que cela se produise&nbsp;:

source: We believe that free software should be for everyone&mdash;including businesses, not just schools and hobbyists. We want to invite business to use the whole GNU system, and therefore we must not include a semi-free program in it.
fr: Nous pensons que le logiciel libre doit l'&ecirc;tre pour tout le monde &mdash; y compris les entreprises, et pas seulement les &eacute;coles et les amateurs. Nous voulons inviter l'entreprise &agrave; utiliser le syst&egrave;me GNU en entier et, par cons&eacute;quent nous ne devons pas y inclure de logiciel semi-libre.

source: Commercial distribution of free operating systems, including the <a href="/gnu/linux-and-gnu.html">GNU/Linux system</a>, is very important, and users appreciate the convenience of commercial CD-ROM distributions. Including one semi-free program in an operating system would cut off commercial CD-ROM distribution for it.
fr: La distribution commerciale de syst&egrave;mes d'exploitation libres, incluant les <a href="/gnu/linux-and-gnu.fr.html">syst&egrave;mes GNU bas&eacute;s sur Linux</a>, est tr&egrave;s importante, et les utilisateurs appr&eacute;cient la possibilit&eacute; d'acheter des distributions commerciales sur CD-ROM. L'inclusion d'un seul programme semi-libre dans un syst&egrave;me d'exploitation supprimerait la distribution commerciale de CD-ROM pour ce syst&egrave;me.

source: The Free Software Foundation itself is non-commercial, and therefore we would be legally permitted to use a semi-free program &ldquo;internally&rdquo;. But we don't do that, because that would undermine our efforts to obtain a program which we could also include in GNU.
fr: La Free Software Foundation &eacute;tant elle-m&ecirc;me non-commerciale, elle aurait donc le droit d'utiliser l&eacute;galement un programme semi-libre «&nbsp;en interne&nbsp;». Mais nous ne le faisons pas, parce que cela minerait nos efforts pour obtenir un programme que nous pourrions alors inclure dans GNU.

source: If there is a job that needs doing with software, then until we have a free program to do the job, the GNU system has a gap. We have to tell volunteers, &ldquo;We don't have a program yet to do this job in GNU, so we hope you will write one.&rdquo; If we ourselves used a semi-free program to do the job, that would undermine what we say; it would take away the impetus (on us, and on others who might listen to our views) to write a free replacement. So we don't do that.
fr: Si un travail n&eacute;cessite l'utilisation d'un logiciel, alors tant qu'il n'existe pas de programme libre permettant de le r&eacute;aliser, le syst&egrave;me GNU contient une lacune. Nous devons dire aux volontaires, «&nbsp;Nous n'avons pas encore de programme pour faire ce travail dans GNU, et nous esp&eacute;rons donc que vous en &eacute;crirez un&nbsp;». Si nous m&ecirc;mes nous utilisions un programme semi-libre pour faire le travail en question, cela minerait notre discours; et annulerait la n&eacute;cessit&eacute; (pour nous, et pour ceux qui suivraient notre point de vue) de d&eacute;velopper un &eacute;quivalent libre. C'est pourquoi nous ne le faisons pas.

source: <strong>Proprietary software</strong>
fr: <strong>Logiciel propri&eacute;taire</strong>

source: Proprietary software is software that is not free or semi-free. Its use, redistribution or modification is prohibited, or requires you to ask for permission, or is restricted so much that you effectively can't do it freely.
fr: Le logiciel propri&eacute;taire est un logiciel qui n'est ni libre, ni semi-libre. Son utilisation, sa redistribution ou sa modification sont interdites, ou exigent une autorisation sp&eacute;cifique, ou sont tellement restreintes que vous ne pouvez en fait pas le faire librement.

source: The Free Software Foundation follows the rule that we cannot install any proprietary program on our computers except temporarily for the specific purpose of writing a free replacement for that very program. Aside from that, we feel there is no possible excuse for installing a proprietary program.
fr: La Free Software Foundation suit une r&egrave;gle consistant &agrave; ne jamais installer un logiciel propri&eacute;taire sur nos ordinateurs, sauf &agrave; titre temporaire dans le but sp&eacute;cifique d'&eacute;laborer un remplacement libre &agrave; ce m&ecirc;me logiciel. Exception faite de ce cas, nous pensons qu'il n'existe aucune excuse pour l'installation d'un programme propri&eacute;taire.

source: For example, we felt justified in installing Unix on our computer in the 1980s, because we were using it to write a free replacement for Unix. Nowadays, since free operating systems are available, the excuse is no longer applicable; we have eliminated all our non-free operating systems, and any new computer we install must run a completely free operating system.
fr: Par exemple, nous estimons justifi&eacute;e l'installation d'Unix sur nos ordinateurs dans les ann&eacute;es 1980, parce que nous l'utilisions pour &eacute;crire une version libre en remplacement d'Unix. Actuellement, puisque des syst&egrave;mes d'exploitation libres sont disponibles, l'excuse n'est plus valable; nous avons &eacute;limin&eacute; tous nos syst&egrave;mes d'exploitation non-libres, et chaque ordinateur que nous installons doit fonctionner avec un syst&egrave;me d'exploitation compl&egrave;tement libre.

source: We don't insist that users of GNU, or contributors to GNU, have to live by this rule. It is a rule we made for ourselves. But we hope you will decide to follow it too.
fr: Nous n'insistons pas pour que les utilisateurs de GNU, ou ses contributeurs, suivent cette r&egrave;gle. C'est une r&egrave;gle que nous nous imposons nous-m&ecirc;mes. Mais nous esp&eacute;rons que vous d&eacute;ciderez de la suivre &eacute;galement.

source: The term &ldquo;freeware&rdquo; has no clear accepted definition, but it is commonly used for packages which permit redistribution but not modification (and their source code is not available). These packages are <em>not</em> free software, so please don't use &ldquo;freeware&rdquo; to refer to free software.
fr: Le terme «&nbsp;freeware&nbsp;» n'a pas de d&eacute;finition claire commun&eacute;ment accept&eacute;e, mais elle est utilis&eacute;e couramment pour des paquetages qui autorisent la redistribution mais pas la modification (et dont le code source n'est pas disponible). Ces paquetages ne sont <em>pas</em> des logiciels libres, donc n'utilisez pas, s'il vous pla&icirc;t, «&nbsp;freeware&nbsp;» pour parler de logiciel libre.

source: <strong>Shareware</strong>
fr: <strong>Shareware (partagiciel)</strong>

source: Shareware is software which comes with permission for people to redistribute copies, but says that anyone who continues to use a copy is <em>required</em> to pay a license fee.
fr: Le partagiciel est un logiciel qui s'accompagne de la permission de redistribuer des copies, mais qui mentionne que toute personne qui continue &agrave; en utiliser une copie est <em>oblig&eacute;e</em> de payer des royalties.

source: Shareware is not free software, or even semi-free. There are two reasons it is not:
fr: Les sharewares ne sont pas des logiciels libres ou m&ecirc;me semi-libres. Pour deux raisons&nbsp;:

source: For most shareware, source code is not available; thus, you cannot modify the program at all.
fr: Pour les sharewares, le code source n'est pratiquement jamais fourni; et donc vous ne pouvez pas du tout modifier le programme.

source: Shareware does not come with permission to make a copy and install it without paying a license fee, not even for individuals engaging in nonprofit activity. (In practice, people often disregard the distribution terms and do this anyway, but the terms don't permit it.)
fr: Avec le shareware, il ne vous est pas permis d'effectuer une copie et de l'installer sans vous acquitter du paiement d'un droit de licence, m&ecirc;me pour des individus impliqu&eacute;s dans des activit&eacute;s non lucratives. (En pratique, ces termes de distribution sont en g&eacute;n&eacute;ral peu appr&eacute;ci&eacute;s, et les gens le font quand m&ecirc;me, m&ecirc;me si ce n'est pas permis).

source: <strong>Private software</strong>
fr: <strong>Logiciel priv&eacute;</strong>

source: Private or custom software is software developed for one user (typically an organization or company). That user keeps it and uses it, and does not release it to the public either as source code or as binaries.
fr: Les logiciels priv&eacute;s sont d&eacute;velopp&eacute;s pour un utilisateur (typiquement pour une organisation ou une soci&eacute;t&eacute;). Cet utilisateur le garde et ne publie ni les fichiers sources ni les fichiers binaires.

source: A private program is free software in a trivial sense if its unique user has full rights to it. However, in a deeper sense, it does not really make sense to pose the question of whether such a program is free software or not.
fr: Un programme priv&eacute; est dans un certain sens un logiciel libre si son seul utilisateur a tous les droits dessus. Cependant, en y r&eacute;fl&eacute;chissant un peu, cela n'a pas vraiment de sens de se poser la question de savoir si un tel programme est un logiciel libre ou non.

source: In general we do not believe it is wrong to develop a program and not release it. There are occasions when a program is so useful that withholding it from release is treating humanity badly. However, most programs are not that marvelous, and withholding them is not particularly harmful. Thus, there is no conflict between the development of private or custom software and the principles of the free software movement.
fr: En g&eacute;n&eacute;ral, nous ne pensons pas qu'il soit mauvais de d&eacute;velopper un programme et de ne pas le publier. Il y a des fois o&ugrave; un programme est si utile que le garder pour soi est &eacute;go&iuml;ste. Toutefois, la plupart des programmes ne sont pas si merveilleux que &ccedil;a, et les garder pour soi n'est pas particuli&egrave;rement dommageable. Donc, le d&eacute;veloppement de logiciel pour un usage priv&eacute;, qui repr&eacute;sente une grande part de l'emploi dans la programmation, ne viole pas les principes du mouvement du logiciel libre.

source: Nearly all employment for programmers is in development of custom software; therefore most programming jobs are, or could be, done in a way compatible with the free software movement.
fr: Pratiquement tous les emplois de programmeurs se situent dans le d&eacute;veloppement de logiciels priv&eacute;s; par cons&eacute;quent la plupart des emplois de programmeurs sont, ou pourraient &ecirc;tre faits d'une mani&egrave;re compatible avec le mouvement du logiciel libre.

source: <strong>Commercial Software</strong>
fr: <strong>Logiciel commercial</strong>

source: Commercial software is software being developed by a business which aims to make money from the use of the software. &ldquo;Commercial&rdquo; and &ldquo;proprietary&rdquo; are not the same thing! Most commercial software is <a href="#ProprietarySoftware">proprietary</a>, but there is commercial free software, and there is non-commercial non-free software.
fr: Le logiciel commercial est un logiciel d&eacute;velopp&eacute; par une entreprise dont le but est de gagner de l'argent sur l'utilisation du logiciel. «&nbsp;Commercial&nbsp;» et «&nbsp;propri&eacute;taire&nbsp;» ne sont pas synonymes&nbsp;! La plupart des logiciels commerciaux sont <a href="#ProprietarySoftware">propri&eacute;taires</a>, mais il y a des logiciels libres commerciaux, et il y a des logiciels non-commerciaux non-libres.

source: For example, GNU Ada is always distributed under the terms of the GNU GPL, and every copy is free software; but its developers sell support contracts. When their salesmen speak to prospective customers, sometimes the customers say, &ldquo;We would feel safer with a commercial compiler.&rdquo; The salesmen reply, &ldquo;GNU Ada <em>is</em> a commercial compiler; it happens to be free software.&rdquo;
fr: Par exemple, GNU Ada est toujours distribu&eacute; sous les termes de la GPL GNU, et chaque copie est un logiciel libre; mais ses d&eacute;veloppeurs vendent des contrats de support. Quand leurs commerciaux parlent &agrave; de futurs clients, quelquefois ceux-ci disent, «&nbsp;Nous nous sentirions plus en s&eacute;curit&eacute; avec un compilateur commercial.&nbsp;». Le repr&eacute;sentant r&eacute;pond, «&nbsp;GNU Ada <em>est</em> un compilateur commercial; il est &eacute;galement un logiciel libre&nbsp;».

source: For the GNU Project, the emphasis is in the other order: the important thing is that GNU Ada is free software; whether it is commercial is not a crucial question. However, the additional development of GNU Ada that results from its being commercial is definitely beneficial.
fr: Pour le Projet GNU, l'accent est mis sur l'autre composante&nbsp;: la chose importante est que GNU Ada est un logiciel libre; que ce soit un logiciel commercial n'est pas un point crucial. Cependant, le d&eacute;veloppement suppl&eacute;mentaire de GNU Ada qui r&eacute;sulte de ce commerce est certainement b&eacute;n&eacute;fique.

source: Please help spread the awareness that commercial free software is possible. You can do this by making an effort not to say &ldquo;commercial&rdquo; when you mean &ldquo;proprietary.&rdquo;
fr: Aidez-nous s'il vous pla&icirc;t &agrave; faire prendre conscience que le logiciel libre commercial est possible. Vous pouvez y contribuer en faisant un effort pour ne pas dire «&nbsp;commercial&nbsp;» lorsque vous voulez dire «&nbsp;propri&eacute;taire&nbsp;».

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Katixa Rybalka et Olivier Berger<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
