Repository: gitGNU/gnu_www-fr
Catalog: philosophy/censoring-emacs.*.po
Languages: fr

source: Censoring My Software, by Richard Stallman
fr: Je censure mes logiciels, par Richard Stallman

source: Censoring My Software
fr: Je censure mes logiciels

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a> <br /> [From Datamation, March 1 1996]
fr: par <a href="http://www.stallman.org"><strong>Richard Stallman</strong> </a><br /> [De Datamation, 1 mars 1996]

source: Last summer, a few clever legislators proposed a bill to &ldquo;prohibit pornography&rdquo; on the Internet. Last fall, the right-wing Christians made this cause their own. Last week, President Clinton signed the bill. This week, I'm censoring GNU Emacs.
fr: L'&eacute;t&eacute; dernier, quelques l&eacute;gislateurs inspir&eacute;s ont propos&eacute; un projet de loi pour «&nbsp;interdire la pornographie&nbsp;» sur l'Internet. Le printemps dernier, les chr&eacute;tiens de droite se sont appropri&eacute; cette cause. La semaine derni&egrave;re, le Pr&eacute;sident Clinton a ratifi&eacute; le projet de loi. Cette semaine, je censure Emacs.

source: No, GNU Emacs does not contain pornography. It's a software package, an award-winning extensible and programmable text editor. But the law that was passed applies to far more than pornography. It prohibits &ldquo;indecent&rdquo; speech, which can include anything from famous poems, to masterpieces hanging in the Louvre, to advice about safe sex &hellip; to software.
fr: Non, GNU Emacs ne contient pas de pornographie. C'est un logiciel, un &eacute;diteur de texte prim&eacute; et programmable. Mais la loi pass&eacute;e s'applique &agrave; bien plus que la pornographie. Elle interdit tout discours «&nbsp;ind&eacute;cent&nbsp;», ce qui peut tout inclure, des po&egrave;mes c&eacute;l&egrave;bres &agrave; des tableaux de ma&icirc;tres expos&eacute;s au Louvre, des conseils sur le sexe sans risque &hellip; aux logiciels.

source: Naturally, there was a lot of opposition to this bill. Not only from people who use the Internet and people who appreciate erotica, but from everyone who cares about freedom of the press.
fr: Naturellement, il y a eu beaucoup d'oppositions &agrave; cette loi. Non seulement de la part de personnes qui utilisent l'Internet et de personnes qui appr&eacute;cient l'&eacute;rotisme, mais aussi de tous ceux qui se soucient de la libert&eacute; de la presse.

source: But every time we tried to tell the public what was at stake, the forces of censorship responded with a lie: They told the public that the issue was simply pornography. By embedding this lie as a presupposition in their other statements about the issue, they succeeded in misinforming the public. So now I am censoring my software.
fr: Mais &agrave; chaque fois que nous avons essay&eacute; de faire savoir au public ce qui &eacute;tait en jeu, les forces de la censure ont r&eacute;pondu par un mensonge: elles ont dit au public que l'enjeu &eacute;tait simplement la pornographie. En d&eacute;guisant ce mensonge en postulat dans leurs autres d&eacute;clarations sur leprobl&egrave;me, ils ont r&eacute;ussi &agrave; d&eacute;sinformer le public. Alors je censure mes logiciels.

source: You see, Emacs contains a version of the famous &ldquo;doctor program,&rdquo; a.k.a. Eliza, originally developed by Professor Weizenbaum at <abbr title="Massachusetts Institute of Technology">MIT</abbr>. This is the program that imitates a Rogerian psychotherapist. The user talks to the program, and the program responds&mdash;by playing back the user's own statements, and by recognizing a long list of particular words.
fr: Voyez-vous, Emacs contient une version du c&eacute;l&egrave;bre «&nbsp;programme docteur&nbsp;», &eacute;galement connu sous le nom d'Eliza et initialement d&eacute;velopp&eacute; par le professeur Weizenbaum au MIT. Il s'agit du programme qui imite un psychoth&eacute;rapeute rogerien. L'utilisateur parle au programme etle programme r&eacute;pond, en r&eacute;p&eacute;tant les propres phrases de l'utilisateur et en reconnaissant une longue liste de mots particuliers.

source: The Emacs doctor program was set up to recognize many common curse words and respond with an appropriately cute message such as, &ldquo;Would you please watch your tongue?&rdquo; or &ldquo;Let's not be vulgar.&rdquo; In order to do this, it had to have a list of curse words. That means the source code for the program was indecent.
fr: Le programme docteur d'Emacs a &eacute;t&eacute; con&ccedil;u pour reconna&icirc;tre beaucoup de grossi&egrave;ret&eacute;s et pour r&eacute;pondre avec un message bien mignon comme «&nbsp;Pourriez-vous je vous prie, tenir votre langue?&nbsp;», ou «&nbsp;ne soyez pas vulgaire&nbsp;». Pour ce faire, il doit avoir une liste degrossi&egrave;ret&eacute;. Ce qui implique que le code source de ce programme &eacute;tait ind&eacute;cent.

source: So this week I removed that feature. The new version of the doctor doesn't recognize the indecent words; if you curse at it, it replays the curse back to you&mdash;for lack of knowing better. (When the new version starts up, it announces that it has been censored for your protection.)
fr: Alors cette semaine j'ai supprim&eacute; cette fonctionnalit&eacute;. La nouvelle version du docteur ne reconna&icirc;t pas les mots ind&eacute;cents; si vous l'insultez, il vous renvoie l'insulte faute d'en savoir plus (quand la nouvelle version d&eacute;marre, elle annonce qu'elle a &eacute;t&eacute; censur&eacute;e pour votre protection).

source: Now that Americans face the threat of two years in prison for indecent network postings, it would be helpful if they could access precise rules for avoiding imprisonment via the Internet. However, this is impossible. The rules would have to mention the forbidden words, so posting them on the Internet would violate those same rules.
fr: Maintenant que les Am&eacute;ricains sont sous la menace de deux ans de prison pour toute publication &eacute;lectronique ind&eacute;cente, il serait utile qu'ils puissent acc&eacute;der par l'Internet &agrave; des r&egrave;gles pr&eacute;cises pour &eacute;viter l'emprisonnement. C'est cependant impossible. Ces r&egrave;gles auraient &agrave;mentionner des mots interdits, alors les poster sur l'Internet violerait ces m&ecirc;mes r&egrave;gles.

source: Of course, I'm making an assumption about just what &ldquo;indecent&rdquo; means. I have to do this, because nobody knows for sure. The most obvious possible meaning is the meaning it has for television, so I'm using that as a tentative assumption. However, there is a good chance that our courts will reject that interpretation of the law as unconstitutional.
fr: Bien s&ucirc;r, je suis en train de faire une supposition simplement sur ce que signifie l'«&nbsp;ind&eacute;cence&nbsp;». Je dois le faire car personne ne le sait de mani&egrave;re certaine. La signification possible la plus &eacute;vidente est la signification qu'elle a pour la t&eacute;l&eacute;vision, alors j'utilise celle-ci comme tentativede supposition. Cependant, il y a une grande chance que nos tribunaux consid&egrave;rent cette interpr&eacute;tation de la loi comme anti-constitutionnelle.

source: We can hope that the courts will recognize the Internet as a medium of publication like books and magazines. If they do, they will entirely reject any law prohibiting &ldquo;indecent&rdquo; publications on the Internet.
fr: Nous pouvons esp&eacute;rer que les tribunaux reconna&icirc;tront l'Internet comme un moyen de publication similaire aux livres et aux magazines. S'ils le font, ils rejetteront enti&egrave;rement toute loi interdisant les publications «&nbsp;ind&eacute;centes&nbsp;» sur l'Internet.

source: What really worries me is that the courts might choose a muddled half-measure&mdash;by approving an interpretation of &ldquo;indecent&rdquo; that permits the doctor program or a statement of the decency rules, but prohibits some of the books that any child can browse through in the public library. Over the years, as the Internet replaces the public library, some of our freedom of speech will be lost.
fr: Ce qui me chagrine vraiment, c'est que les tribunaux pourraient choisir une demi-mesure confuse, en approuvant une interpr&eacute;tation de l'«&nbsp;ind&eacute;cence&nbsp;» qui autoriserait le programme docteur ou une publication sur les r&egrave;gles de d&eacute;cence, mais qui interdirait certains des livres que n'importe quel enfant peutparcourir dans une biblioth&egrave;que publique. &Agrave; travers les ans, comme l'Internet remplace la biblioth&egrave;que publique, certaines de nos libert&eacute;s d'expression seront perdues.

source: Just a few weeks ago, another country imposed censorship on the Internet. That was China. We don't think well of China in this country&mdash;its government doesn't respect basic freedoms. But how well does our government respect them? And do you care enough to preserve them here?
fr: Il y a juste quelques ann&eacute;es, un autre pays a impos&eacute; une censure sur l'Internet. C'&eacute;tait la Chine. Nous ne pensons pas du bien de la Chine dans notre pays, son gouvernement ne respecte pas les libert&eacute;s de base. Mais &agrave; quel point notre gouvernement les respecte-t-il&nbsp;? Et vous, vous souciez-vous de les pr&eacute;server chez vous&nbsp;?

source: [This paragraph is obsolete:]
fr: [Ce paragraphe est obsolète&nbsp;:]

source: If you care, stay in touch with the Voters Telecommunications Watch. Look in their Web site http://www.vtw.org/ for background information and political action recommendations. Censorship won in February, but we can beat it in November.
fr: Si vous vous en souciez, restez en contact avec le Voters Telecommunications Watch. Allez faire un tour sur leur site web <a href="http://www.vtw.org/">http://www.vtw.org/</a> pour une information de fond et des recommandations d'actions politiques. La censure a gagn&eacute; en f&eacute;vrier, mais nous pouvons la battre en novembre.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections (or suggestions) to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 1996 Richard Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 1996 Richard Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Benjamin Drieu. <br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
