Repository: gitGNU/gnu_www-fr
Catalog: philosophy/computing-progress.*.po
Languages: fr

source: Computing &ldquo;progress&rdquo;: good and bad - GNU Project - Free Software Foundation (FSF)
fr: Le &laquo;&nbsp;progr&egrave;s&nbsp;&raquo; informatique&nbsp;: du bon et du mauvais - GNU Project - Free Software Foundation (FSF)

source: Computing &ldquo;progress&rdquo;: good and bad
fr: Le &laquo;&nbsp;progr&egrave;s&nbsp;&raquo; informatique&nbsp;: du bon et du mauvais

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: <i> The BBC invited me to write an article for their column series, The Tech Lab, and this is what I sent them. (It refers to a couple of other articles published in that series.) But the BBC was unwilling to publish it with a copying permission notice, so I have published it here.</i>
fr: <i>La <acronym title="British Broadcasting Corporation">BBC</acronym> m'a invit&eacute; &agrave; &eacute;crire un article pour sa rubrique, &laquo;&nbsp;The Tech Lab&nbsp;&raquo;, et voici ce que je leur ai envoy&eacute;. (Cela se r&eacute;f&egrave;re &agrave; deux autres articles publi&eacute;s dans cette rubrique). Mais la BBC n'a pas souhait&eacute; le publier avec une notice autorisant sa copie, je l'ai donc publi&eacute; ici.</i>

source: Bradley Horowitz of Yahoo proposed here that every object in our world should have a unique number, so that your cell phone can record everything you do &mdash; even which cans you pick up while in the supermarket.
fr: Bradley Horowitz de Yahoo a propos&eacute; ici que chaque objet de notre monde ait un num&eacute;ro unique, de sorte que votre t&eacute;l&eacute;phone portable puisse enregistrer tout ce que vous faites &mdash; et m&ecirc;me les canettes que vous avez prises au supermarch&eacute;.

source: If the phone is like today's phones, it will use proprietary software: software controlled by the companies that developed it, not by its users. Those companies will ensure that your phone makes the information it collects about you available to the phone company's data base (let's call it Big Brother) and probably to other companies.
fr: Si le t&eacute;l&eacute;phone est comme ceux d'aujourd'hui, il utilisera du logiciel propri&eacute;taire&nbsp;: du logiciel contr&ocirc;l&eacute; par les soci&eacute;t&eacute;s qui l'ont d&eacute;velopp&eacute; et non par ses utilisateurs. Ces soci&eacute;t&eacute;s s'assureront que votre t&eacute;l&eacute;phone rendra disponibles les informations qu'il collecte sur vous pour la base de donn&eacute;es de la soci&eacute;t&eacute; de t&eacute;l&eacute;phone (appelons-la &laquo;&nbsp;Big Brother&nbsp;&raquo;) et probablement pour d'autres soci&eacute;t&eacute;s.

source: In the UK of the future, as New Labour would have it, those companies will surely turn this information over to the police. If your phone reports you bought a wooden stick and a piece of poster board, the phone company's system will deduce that you may be planning a protest, and report you automatically to the police so they can accuse you of &ldquo;terrorism&rdquo;.
fr: Dans le Royaume-Uni du futur, comme le verrait le &laquo;&nbsp;New Labour&nbsp;&raquo;, ces soci&eacute;t&eacute;s donneront s&ucirc;rement ces informations &agrave; la police. Si votre t&eacute;l&eacute;phone rapporte que vous avez achet&eacute; un manche en bois et un panneau en contre-plaqu&eacute;, la soci&eacute;t&eacute; de t&eacute;l&eacute;phone en d&eacute;duira que vous projetez de manifester, et le signalera automatiquement &agrave; la police pour qu'ils vous puissent vous accuser de&laquo;&nbsp;terrorisme&nbsp;&raquo;.

source: In the UK, it is literally an offence to be suspect. (More precisely, to possess any object in circumstances that create a &ldquo;reasonable suspicion&rdquo; that you might use them in certain criminal ways.) Your phone will give the police plenty of opportunities to suspect you, so they can charge you with having been suspected by them. Similar things will happen in China, where Yahoo already gave the government all the information it needed to imprison a dissident, and asked for our understanding on the excuse that it was &ldquo;just following orders&rdquo;.
fr: Au Royaume-Uni, c'est litt&eacute;ralement un d&eacute;lit d'&ecirc;tre suspect. (Plus pr&eacute;cis&eacute;ment, de poss&eacute;der tout objet dans des circonstances qui cr&eacute;ent une &laquo;&nbsp;suspicion raisonnable&nbsp;&raquo; que vous pourriez l'utiliser de mani&egrave;re criminelle). Votre t&eacute;l&eacute;phone donnera &agrave; la police plein d'opportunit&eacute;s de vous suspecter, de sorte qu'ils pourront vous accuser d'avoir &eacute;t&eacute; suspect &agrave; leur yeux. Des choses similaires arriveront en Chine o&ugrave; Yahoo a d&eacute;j&agrave; donn&eacute; au gouvernement toutes les informations dont il avait besoin pour emprisonner un dissident, et a demand&eacute; notre compr&eacute;hension avec l'excuse qu'il ne faisait que &laquo;&nbsp;suivre les ordres&nbsp;&raquo;.

source: Horowitz would like cell phones to tag information automatically based on knowing when you participate in an event or meeting. That means the phone company will also know precisely who you meet. That information will also be interesting to governments, such as those of the UK and China, that cut corners on human rights.
fr: Horowitz aimerait que les t&eacute;l&eacute;phones portables marquent automatiquement les informations concernant votre participation &agrave; un &eacute;v&eacute;nement ou une r&eacute;union. Cela signifie que la soci&eacute;t&eacute; de t&eacute;l&eacute;phone saura aussi pr&eacute;cis&eacute;ment qui vous avez rencontr&eacute;. Ces informations seront aussi int&eacute;ressantes pour les gouvernements, comme ceux du Royaume-Uni et de la Chine, qui bafouent les droits de l'homme.

source: I do not much like Horowitz's vision of total surveillance. Rather, I envision a world in which our computers never collect, or release any information about us except when we want them to.
fr: Je n'aime pas beaucoup la vision d'Horowitz de surveillance totale. J'imagine plut&ocirc;t un monde dans lequel nos ordinateurs ne collecteraient ou ne publieraient jamais des informations sur nous sauf quand nous voulons qu'ils le fassent.

source: Non-free software does other nasty things besides spying. It often implements digital handcuffs &mdash; features designed to restrict the users (also called DRM, for Digital Restrictions Management). These features control how you can access, copy or move the files in your own computer.
fr: Les logiciels non-libres font d'autres choses d&eacute;sagr&eacute;ables en plus d'espionner. Ils mettent souvent en &oelig;uvre des menottes num&eacute;riques &mdash; des fonctionnalit&eacute;s con&ccedil;ues pour restreindre les utilisateurs (&eacute;galement appel&eacute;es DRM, pour Digital Restrictions Management (gestion des restrictions num&eacute;riques)). Ces fonctionnalit&eacute;s contr&ocirc;lent la fa&ccedil;on dont vous acc&eacute;dez, copiez ou d&eacute;placez les fichiers dans votre propre ordinateur.

source: DRM is a common practice: Microsoft does it, Apple does it, Google does it, even the BBC's iPlayer does it. Many countries, taking the side of these companies against the public, have made it illegal to tell others how to escape from the digital handcuffs. As a result, competition does nothing to check the practice: no matter how many proprietary alternatives you might have to choose from, they all handcuff you just the same. If the computer knows where you are located, it can make DRM even worse: there are companies that would like to restrict what you can access based on your present location.
fr: Les DRM sont une pratique courante&nbsp;: Microsoft le fait, Apple le fait, Google le fait et m&ecirc;me le iPlayer de la BBC le fait. Beaucoup de pays, prenant le partide ces soci&eacute;t&eacute;s contre le public, ont rendu ill&eacute;gal de dire &agrave; d'autres comment &eacute;chapper &agrave; ces menottes num&eacute;riques. Par cons&eacute;quent, la concurrence ne fait rien pour r&eacute;primer cette pratique&nbsp;: peu importe le nombre d'alternatives propri&eacute;taires parmi lesquelles vous pourriez choisir, elles vous menottent toutes de la m&ecirc;me fa&ccedil;on. Si l'ordinateur sait o&ugrave; vous vous trouvez, il peut rendre les DRM encore pires&nbsp;: il y a des soci&eacute;t&eacute;s qui aimeraient restreindre ce &agrave; quoi vous pouvez acc&eacute;der en fonction de votre localisation.

source: My vision of the world is different. I would like to see a world in which all the software in our computers &mdash; in our desktop PCs, our laptops, our handhelds, our phones &mdash; is under our control and respects our freedom. In other words, a world where all software is <a href="/philosophy/free-sw.html"><em>free software</em></a>.
fr: Ma vision du monde est diff&eacute;rente. J'aimerais voir un monde dans lequel tous les logiciels dans nos ordinateurs &mdash; nos ordinateurs de bureaux, nos portables, nos organiseurs, nos t&eacute;l&eacute;phones &mdash; sont sous notre contr&ocirc;le et respectent notre libert&eacute;. En d'autres mots, un monde o&ugrave; tous les logiciels sont des <a href="/philosophy/free-sw.fr.html"><em>logiciels libres</em></a>.

source: Free software, freedom-respecting software, means that every user of the program is free to get the program's source code and change the program to do what she wants, and also free to give away or sell copies, either exact or modified. This means the users are in control. With the users in control of the software, nobody has power to impose nasty features on others.
fr: Les logiciels libres, les logiciels qui respectent la libert&eacute;, impliquent que chaque utilisateur du programme est libre d'obtenir le code source du programme et de changer le programme pour faire ce qu'il veut et aussi qu'il est libre de donner ou vendre des copies, identiques ou modifi&eacute;es. Cela signifie que les utilisateurs ont le contr&ocirc;le. Avec les utilisateurs aux commandes des logiciels, personne n'a le pouvoir d'imposer des fonctionnalit&eacute;s d&eacute;sagr&eacute;ables aux autres.

source: Even if you don't exercise this control yourself, you are part of a society where others do. If you are not a programmer, other users of the program are. They will probably find and remove any nasty features, such as spying or restricting you, and publish safe versions. You will have only to elect to use them &mdash; and since all other users will prefer them, that will usually happen with no effort on your part.
fr: M&ecirc;me si vous n'exercez pas ce contr&ocirc;le vous-m&ecirc;me, vous faites partie d'une soci&eacute;t&eacute; o&ugrave; d'autres le font. Si vous n'&ecirc;tes pas un programmeur, d'autres utilisateurs du programme le sont. Ils trouveront et supprimeront probablement toute fonctionnalit&eacute; d&eacute;sagr&eacute;able, comme vous espionner et vous restreindre, et publieront des versions s&ucirc;res. Vous aurez seulement &agrave; choisir de les utiliser &mdash; et puisque tous les autres utilisateurs les pr&eacute;f&eacute;reront, cela se produira g&eacute;n&eacute;ralement sans effort de votre part.

source: Charles Stross envisioned computers that permanently record everything that we see and hear. Those records could be very useful, as long as Big Brother doesn't see and hear all of them. Today's cell phones are already capable of listening to their users without informing them, at the request of the police, the phone company, or anyone that knows the requisite commands. As long as phones use non-free software, controlled by its developers and not by the users, we must expect this to get worse. Only free software enables computer-using citizens to resist totalitarian surveillance.
fr: Charles Stross a imagin&eacute; des ordinateurs qui enregistrent en permanence tout ce que vous voyez et entendez. Ces enregistrements pourraient &ecirc;tre tr&egrave;s utiles, tant que Big Brother ne les voit pas et ne les entend pas tous. Les t&eacute;l&eacute;phones portables d'aujourd'hui sont d&eacute;j&agrave; capables d'&eacute;couter leurs propri&eacute;taires sans les en informer, &agrave; la demande de la police, de la soci&eacute;t&eacute; de t&eacute;l&eacute;phone ou de quiconque conna&icirc;t les commandes requises. Tant que les t&eacute;l&eacute;phones utilisent des logiciels non-libres contr&ocirc;l&eacute;s par leurs d&eacute;veloppeurs et non leurs utilisateurs, nous devons nous attendre &agrave; ce que cela empire. Seuls les logiciels libres permettent aux citoyens utilisant des ordinateurs de r&eacute;sister &agrave; la surveillance totalitaire.

source: Dave Winer's article suggested that Mr Gates should send a copy of Windows Vista to Alpha Centauri. I understand the feeling, but sending just one won't solve our problem here on Earth. Windows is designed to spy on users and restrict them. We should collect all the copies of Windows, and MacOS and iPlayer for the same reason, and send them to Alpha Centauri at the slowest possible speed. Or just erase them.
fr: L'article de Dave Winer sugg&eacute;rait que M. Gates envoie une copie de Windows Vista sur Alpha Centauri. Je comprends l'id&eacute;e, mais n'envoyer qu'une seule copie ne r&eacute;soudra pas notre probl&egrave;me ici sur Terre. Windows est con&ccedil;u pour espionner les utilisateurs et les restreindre. Nous devrions collecter toutes les copies de Windows, de MacOS et de iPlayer pour la m&ecirc;me raison et les envoyer vers Alpha Centauri &agrave; la vitesse la plus lente possible. Ou simplement les effacer.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
