Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-and-globalization.*.po
Languages: fr

source: <b>STALLMAN</b>: Absolutely not. I hope it won't, you see, because the publishers exploit the authors terribly. When you ask the publishers' representatives about this, they say, &ldquo;Well, yes, if an author or if a band doesn't want to go through us, they shouldn't be legally required to go through us.&rdquo; But, in fact, they're doing their utmost to set it up so that will not be feasible. For instance, they're proposing restricted copying media formats and in order to publish in these formats, you'll have to go through the big publishers because they won't tell anyone else how to do it. So they're hoping for a world where the players will play these formats, and in order to get anything that you can play on those players, it'll have to come through the publishers. So, in fact, while there's no law against an author or a musician publishing directly, it won't be feasible. There's also the lure of maybe hitting it rich. They say, &ldquo;We'll publicize you and maybe you'll hit it as rich as the Beatles.&rdquo; Take your pick of some very successful group and, of course, only a tiny fraction of musicians are going to have that happen. But they may be drawn by that into signing contracts that will lock them down forever.
fr: <b>STALLMAN</b>&nbsp;: Absolument. Je pense qu'il ne le faudra pas, voyez-vous, car les &eacute;diteurs exploitent les auteurs d'une mani&egrave;re &eacute;hont&eacute;e. Quand on interroge les repr&eacute;sentants des &eacute;diteurs &agrave; ce sujet, ils r&eacute;pondent: &laquo;&nbsp;Bien s&ucirc;r, si un auteur ou si un groupe ne souhaite pas passer par nous, il ne faut pas les y obliger l&eacute;galement.&nbsp;&raquo; Mais en r&eacute;alit&eacute;, ils font tout ce qui est en leur pouvoir pour rendre cela impossible. Ils proposent par exemple des formats de m&eacute;dias restreignant la copie &mdash; pour publier dans ces formats, il faut passer par les majors car elles refusent de dire aux autres comment proc&eacute;der. Les &eacute;diteurs r&ecirc;vent donc d'un monde o&ugrave; tous les lecteurs liront ces formats, et o&ugrave; il faudra passer par les &eacute;diteurs pour pouvoir faire jouer son &oelig;uvre sur ces lecteurs. En fait, bien qu'aucune loi n'interdise &agrave; un &eacute;crivain ou &agrave; un musicien de publier &agrave; compte d'auteur, cela ne sera pas possible. N'oublions pas non plus le miroir aux alouettes. Les &eacute;diteurs disent mieilleusement: &laquo;&nbsp;Nous ferons votre promotion et peut-&ecirc;tre deviendrez-vous aussi riches et c&eacute;l&egrave;bres que les Beatles&nbsp;&raquo;. Choisissez n'importe quel groupe &agrave; succ&egrave;s, et bien s&ucirc;r, seule une fraction tr&egrave;s restreinte des musiciens atteindra un tel niveau de c&eacute;l&eacute;brit&eacute;. Mais ils peuvent &ecirc;tre incit&eacute;s &agrave; signer des contrats qui les pi&eacute;geront &agrave; vie.

source: Publishers tend to be very bad at respecting their contracts with authors. For instance, book contracts typically have said that if a book goes out of print, the rights revert to the author, and publishers have generally not been very good about living up to that clause. They often have to be forced. Well, what they're starting to do now is use electronic publication as an excuse to say that it's never going out of print; so they never have to give the rights back. Their idea is, when the author has no clout, get him to sign up and from then on, he has no power; it's only the publisher that has the power.
fr: Les &eacute;diteurs respectent fort peu leurs propres contrats avec les auteurs. Par exemple, les contrats d'&eacute;dition signalent g&eacute;n&eacute;ralement que si un livre est &eacute;puis&eacute;, les droits futurs repassent &agrave; l'auteur &mdash; et les &eacute;diteurs n'ont presque jamais scrupuleusement respect&eacute; cette clause. Souvent, ils y ont &eacute;t&eacute; oblig&eacute;s. Et que font-ils maintenant&nbsp;? Ils commencent &agrave; invoquer la publication sur des formats &eacute;lectroniques pour arguer que le livre n'est jamais &eacute;puis&eacute;&nbsp;; ainsi ils ne doivent jamais abandonner les droits &agrave; l'auteur. Leur id&eacute;e est d'inciter les auteurs m&eacute;connus &agrave; signer, suite &agrave; quoi ils n'ont plus aucun pouvoir&nbsp;; seul leur &eacute;diteur en a.

source: <b>QUESTION</b>: Would it be good to have free licenses for various kinds of works that protect for every user the freedom to copy them in whatever is the appropriate way for that kind of work?
fr: <b>QUESTION</b>&nbsp;: Serait-il bon de disposer de licences libres pour divers types de travaux, pour prot&eacute;ger la libert&eacute; de tout utilisateur de copier ces &oelig;uvres de toute mani&egrave;re appropri&eacute;e &agrave; leur cat&eacute;gorie&nbsp;?

source: <b>STALLMAN</b>: Well, people are working on this. But for non-functional works, one thing doesn't substitute for another. Let's look at a functional kind of work, say, a word processor. Well, if somebody makes a free word processor, you can use that; you don't need the non-free word processors. But I wouldn't say that one free song substitutes for all the non-free songs or that a one free novel substitutes for all the non-free novels. For those kinds of works, it's different. So what I think we simply have to do is to recognize that these laws do not deserve to be respected. It's not wrong to share with your neighbor, and if anyone tries to tell you that you cannot share with your neighbor, you should not listen to him.
fr: <b>STALLMAN</b>&nbsp;: Des gens y travaillent. Mais les &oelig;uvres non fonctionnelles ne sont pas interchangeables. Prenons par exemple une &oelig;uvre fonctionnelle, tel qu'un traitement de textes. Bien. Si quelqu'un r&eacute;alise un traitement de textes libre, on peut l'utiliser; on n'a plus besoin alors de traitement de textes non libres. Mais je n'irai pas jusqu'&agrave; dire qu'une chanson libre remplace toutes les chansons non libres, ou qu'un roman libre remplace tous les romans non libres. Ces cat&eacute;gories d'&oelig;uvres sont diff&eacute;rentes. C'est pourquoi je pense qu'il nous faut reconna&icirc;tre que ces lois ne m&eacute;ritent pas d'&ecirc;tre respect&eacute;es. Ce n'est pas mal de partager avec son voisin, et si quelqu'un essaie de vous dire qu'il ne faut pas partager avec son voisin, ne l'&eacute;coutez pas.

source: <b>QUESTION</b>: With regard to the functional works, how do you, in your own thinking, balance out the need for abolishing the copyright with the need for economic incentives in order to have these functional works developed?
fr: <b>QUESTION</b>&nbsp;: Concernant les &oelig;uvres fonctionnelles, comment, dans votre pens&eacute;e, &eacute;quilibrez-vous le besoin d'abolir le copyright et le besoin d'une incitation &eacute;conomique au d&eacute;veloppement de ces &oelig;uvres fonctionnelles&nbsp;?

source: <b>STALLMAN</b>: Well, what we see is, first of all, that this economic incentive is a lot less necessary than people have been supposing. Look at the free software movement where we have over 100,000 part-time volunteers developing free software. We also see that there are other ways to raise money for this which are not based on stopping the public from copying and modifying these works. That's the interesting lesson of the free software movement. Aside from the fact that it gives you a way you can use a computer and keep your freedom to share and cooperate with other people, it also shows us that this negative assumption that people would never do these things unless they are given special powers to force people to pay them is simply wrong. A lot of people will do these things. Then if you look at, say, the writing of monographs which serve as textbooks in many fields of science except for the ones that are very basic, the authors are not making money out of that. We now have a free encyclopedia project which is, in fact, a commercial-free encyclopedia project, and it's making progress. We had a project for a GNU encyclopedia but we merged it into the commercial project when they adopted our license. In January, they switched to the GNU-free documentation license for all the articles in their encyclopedia. So we said, &ldquo;Well, let's join forces with them and urge people to contribute to them.&rdquo; It's called &ldquo;NUPEDIA,&rdquo; and you can find a link to it, if you look at http://www.gnu.org/encyclopedia. So here we've extended the community development of a free base of useful knowledge from software to encyclopedia. I'm pretty confident now that in all these areas of functional work, we don't need that economic incentive to the point where we have to mess up the use of these works.
fr: <b>STALLMAN</b>&nbsp;: Nous pouvons commencer par remarquer que cette incitation &eacute;conomique est bien moins n&eacute;cessaire que tout ce qu'on a suppos&eacute;. Prenez le mouvement du logiciel libre: nous comptons plus de cent mille volontaires qui d&eacute;veloppent du logiciel libre sur leur temps libre. On peut &eacute;galement observer qu'il existe d'autres mani&egrave;res de gagner de l'argent, sans pour cela reposer sur l'interdiction de copier et de modifier ces &oelig;uvres.C'est la le&ccedil;on int&eacute;ressante du mouvement du logiciel libre. Non content de fournir une mani&egrave;re d'utiliser un ordinateur tout en conservant la libert&eacute; de partager et de coop&eacute;rer avec autrui, il nous montre aussi que cette hypoth&egrave;se n&eacute;gative &mdash; selon laquelle nul ne ferait jamaisde telles choses &agrave; moins de disposer de pouvoirs sp&eacute;ciaux pour obliger leurs futurs utilisateurs &agrave; les r&eacute;mun&eacute;rer &mdash; est fausse. Nombreux sont ceux qui feront de telles choses. Consid&eacute;rons, disons, la r&eacute;daction de monographies, qui servent de manuels dans de nombreux domainesscientifiques except&eacute;s les plus &eacute;l&eacute;mentaires.&nbsp; Leurs auteurs ne gagnent pas d'argent gr&acirc;ce &agrave; cette activit&eacute;. Nous disposonsd&eacute;sormais d'un projet d'encyclop&eacute;die libre qui est en r&eacute;alit&eacute; un projet d'encyclop&eacute;die libre et commerciale, et ce projet progresse. Nous avions un projet pour une encyclop&eacute;die GNU mais nous l'avons fusionn&eacute; avec ce projet commercial quand ses membres ont adopt&eacute; notre licence. Enjanvier, ils ont adopt&eacute; la licence de documentation libre de GNU pour tous les articles de leur encyclop&eacute;die. Nous avons alors d&eacute;cid&eacute; de joindre nos forces et d'exhorter &agrave; contribuer &agrave; leur projet. Ce projet s'appelle &laquo;&nbsp;GNUPEDIA&nbsp;&raquo;, et vous trouverez des liens qui vous y m&eacute;neront si vous vous rendez &agrave; l'URL http://www.gnu.org/encyclopedia. Nous avons donc &eacute;tendu la communaut&eacute; de d&eacute;veloppement d'une base libre de connaissances utiles, du logiciel &agrave; l'encyclop&eacute;die. Je suis confiant et je pense que dans tous ces domaines de travaux fonctionnels, nul n'est besoin d'une incitation &eacute;conomique si forte qu'elle limite et contraint l'utilisation de ces travaux.

source: <b>THORBURN</b>: Well, what about the other two categories.
fr: <b>THORBURN</b>&nbsp;: Et concernant les deux autres cat&eacute;gories&nbsp;?

source: <b>STALLMAN</b>: For the other two classes of work, I don't know. I don't know whether people will write some day novels without worrying about whether they make money from it. In a post-scarcity society, I guess they would. Maybe what we need to do in order to reach the post-scarcity society is to get rid of the corporate control over the economy and the laws. So, in effect, it's a chicken-or-the-egg problem, you know. Which do we do first? How do we get the world where people don't have to desperately get money except by removing the control by business? And how can we remove the control by business except &mdash; Anyway, I don't know, but that's why I'm trying to propose first a compromise copyright system and, second, the voluntary payment supported by a compromise copyright system as a way to provide a revenue stream to the people who write those works.
fr: <b>STALLMAN</b>&nbsp;: Quant aux deux autres cat&eacute;gories d'&oelig;uvres, je ne sais pas. Je ne sais pas si un jour on &eacute;crira des romans sans se soucier de l'argent qu'ils peuvent rapporter. Dans une soci&eacute;t&eacute; ne souffrant plus de disette ni de raret&eacute;, je pense que cela serait le cas. Peut-&ecirc;tre quepour atteindre cet &eacute;tat de soci&eacute;t&eacute;, il nous faut nous d&eacute;barrasser du contr&ocirc;le qu'exercent les grandes entreprises sur notre &eacute;conomie et sur nos lois. Cela revient en quelque sorte au probl&egrave;me de la poule et de l'&oelig;uf&nbsp;: par quoi commencer&nbsp;? Comment obtenir un monde o&ugrave; l'argent n'est plus un besoin vital sans &ocirc;ter le contr&ocirc;le des entreprises&nbsp;? Et comment &eacute;liminer ce dernier sans&hellip; &mdash; Quoi qu'il en soit, je ne sais pas, et c'est pourquoi j'essaie d'abord de proposer un syst&egrave;me de copyright qui est un compromis, et qu'ensuite j'imagine comment un syst&egrave;me de r&eacute;mun&eacute;ration volontaire reposant sur un tel syst&egrave;me pourrait fournir une source de revenus aux auteurs de ces &oelig;uvres.

source: <b>QUESTION</b>: How would you really expect to implement this compromise copyright system under the chokehold of corporate interests on American politicians due to their campaign-finance system?
fr: <b>QUESTION</b>&nbsp;: Comment esp&eacute;rez-vous, dans la r&eacute;alit&eacute;, mettre en &oelig;uvre un tel syst&egrave;me dans un monde &eacute;touff&eacute; par l'influence que les entreprises exercent sur les hommes politiques am&eacute;ricains &agrave; cause du syst&egrave;me de financement de leur campagne &eacute;lectorale&nbsp;?

source: <b>STALLMAN</b>: It beats me. I wish I knew. It's a terribly hard problem. If I knew how to solve that problem, I would solve it and nothing in the world could make me prouder.
fr: <b>STALLMAN</b>&nbsp;: Je suis &agrave; court. J'aimerais savoir. C'est un probl&egrave;me terriblement difficile. Si je savais comment le r&eacute;soudre, je m'y attacherais, et rien au monde ne pourrait me rendre plus fier.

source: <b>QUESTION</b>:. How do you fight the corporate control? Because when you look at these sums of money going into corporate lobbying in the court case, it is tremendous. I think the DECS case that you're talking about is costing something like a million-and-a-half dollars on the defense side. Lord knows what it's costing on the corporate side. Do you have any idea how to deal with these huge sums of money?
fr: <b>QUESTION</b>&nbsp;: Comment combattez-vous le contr&ocirc;le des entreprises&nbsp;? Quand on calcule les sommes d'argent inject&eacute;es par les entreprises dans leur lobbying et leurs actions en justice, cela donne le vertige. Je pense que le proc&egrave;s DECSS que vous mentionnez co&ucirc;te &agrave; la d&eacute;fense un million et demi de dollars. Dieu sait ce qu'il co&ucirc;te du c&ocirc;t&eacute; des entreprises et de l'accusation. Avez-vous une id&eacute;e sur la mani&egrave;re de traiter des sommes d'argent aussi gigantesques&nbsp;?

source: <b>STALLMAN</b>: I have a suggestion. If I were to suggest totally boycotting movies, I think people would ignore that suggestion. They might consider it too radical. So I would like to make a slightly different suggestion which comes to almost the same thing in the end, and that is, don't go to a movie unless you have some substantial reason to think it's good. Now this will lead in practice to almost the same result as a total boycott of Hollywood movies. In extension, it's almost the same but, in intention, it's very different. Now I've noticed that many people go to movies for reasons that have nothing to do with whether they think the movies are good. So if you change that, if you only go to a movie when you have some substantial reason to think it's good, you'll take away a lot of their money.
fr: <b>STALLMAN</b>&nbsp;: J'ai une suggestion. Si je sugg&eacute;rais un boycott complet des films, je pense que ne serais pas &eacute;cout&eacute;. Les gens trouveraient la mesure trop radicale. Je souhaite donc faire une suggestion l&eacute;g&egrave;rement diff&eacute;rente, qui revient presque au m&ecirc;me finalement, et quiest de ne pas aller au cin&eacute;ma &agrave; moins d'avoir une bonne raison de penser que le film est bon. Dans la pratique, cela aura presque le m&ecirc;me r&eacute;sultat qu'un boycott inconditionnel des films de Hollywood. Dans la pratique, c'est presque la m&ecirc;me chose, mais en intention, c'est tr&egrave;s diff&eacute;rent. J'ai remarqu&eacute; que de nombreuses personnes vont au cin&eacute;ma pour des raisons qui n'ont rien &agrave; voir avec le fait qu'elles pensentque le film sera bon. Si on change cela, et si on ne va plus au cin&eacute;ma que lorsqu'on a une raison s&eacute;rieuse de penser que le film sera bon, on &ocirc;tera aux majors une grande part de leurs revenus.

source: <b>THORBURN</b>: One way to understand all of this discourse today, I think, is to recognize that whenever radical, potentially transforming technologies appear in society, there's a struggle over who controls them. We today are repeating what has happened in the past. So from this angle, there may not be a reason for despair, or even pessimism, about what may occur in the longer run. But, in the shorter term, struggles over the control of text and images, over all forms of information are likely to be painful and extensive. For example, as a teacher of media, my access to images has been restricted in recent years in a way that had never been in place before. If I write an essay in which I want to use still images, even from films, they are much harder to get permission to use, and the prices charged to use those still images are much higher &mdash; even when I make arguments about intellectual inquiry and the the legal category of &ldquo;fair use.&rdquo; So I think, in this moment of extended transformation, the longer-term prospects may, in fact, not be as disturbing as what's happening in the shorter term. But in any case, we need to understand the whole of our contemporary experience as a renewed version of a struggle over the control of technological resources that is a recurring principle of Western society.
fr: <b>THORBURN</b>&nbsp;: Une fa&ccedil;on de comprendre ce discours aujourd'hui, je pense, est de se rendre compte qu'&agrave; chaque apparition d'innovations techniques &agrave; m&ecirc;me de transformer fortement la soci&eacute;t&eacute;, on assiste &agrave; une lutte pour leur contr&ocirc;le. La situation actuelle ne fait quer&eacute;p&eacute;ter des &eacute;v&eacute;nements semblables et pass&eacute;s. Si l'on adopte ce point de vue, nul n'est besoin de se laisser envahir par le d&eacute;sespoir ou m&ecirc;me le pessimisme, quant &agrave; la situation qui sera atteinte &agrave; long terme. Mais &agrave; court terme, les luttes pour le contr&ocirc;le du texte, des images, et de toutes les formes d'information seront probablement douloureuses et intenses. En tant que professeur de m&eacute;dias, j'ai vu par exemple, ces derni&egrave;res ann&eacute;es, mon acc&egrave;s aux images restreint d'une mani&egrave;re sans pr&eacute;c&eacute;dent dans mon exp&eacute;rience. Si je souhaite illustrer un essai de photographies &mdash; m&ecirc;me si elles sont extraites de films, il est devenu bien plus difficile d'obtenir les autorisations, et les prix ont consid&eacute;rablement augment&eacute;. Et c'est en vain que j'invoque des arguments de recherche et que je mentionne le droit de &laquo;&nbsp;l'usage loyal&nbsp;&raquo;. Je pense donc, en ces temps de transformations acc&eacute;l&eacute;r&eacute;es, qu'il ne faut pas tant craindre les perspectives &agrave; long terme que ce qui va se produire &agrave; court terme. Dans tous les cas, il nous faut comprendre les &eacute;v&eacute;nements actuels comme un &eacute;pisode suppl&eacute;mentaire de la lutte pour le contr&ocirc;le des ressources technologiques, principe r&eacute;current dans la soci&eacute;t&eacute; occidentale.

source: It's also essential to understand that the history of older technologies is itself a complicated matter. The impact of the printing press in Spain, for example, is radically different from its impact in England or in France.
fr: Il est &eacute;galement essentiel de comprendre que l'histoire des anciennes technologies est elle-m&ecirc;me fort complexe. L'imprimerie a eu par exemple un impact radicalement diff&eacute;rent en Espagne, en Angleterre et en France.

source: <b>QUESTION</b>: One of the things that bothers me when I hear discussions of copyright is that often they start off with, &ldquo;We want a 180-degree change. We want to do away with any sorts of control.&rdquo; It seems to me that part of what lay under the three categories that were suggested is an acknowledgement that there is some wisdom to copyright. Some of the critics of the way copyright is going now believe that, in fact, it ought to be backed up and function much more like patent and trademarks in terms of its duration. I wonder if our speaker would comment on that as a strategy.
fr: <b>QUESTION</b>&nbsp;: Ce qui m'ennuie souvent, quand j'entends des d&eacute;bats portant sur le copyright, c'est qu'ils commencent souvent par &laquo;&nbsp;Nous voulons un demi-tour complet, et nous d&eacute;barrasser de tout type de contr&ocirc;le.&nbsp;&raquo; Il me semble que les trois cat&eacute;gories pr&eacute;sent&eacute;es sugg&egrave;rent en partie que le copyright rel&egrave;ve d'une certaine sagesse. Certains critiques du syst&egrave;me actuel du copyright croient, en fait, qu'il devrait &ecirc;tre limit&eacute; et fonctionner plus &agrave; la mani&egrave;re des brevets et des marques d&eacute;pos&eacute;es, notamment en termes de dur&eacute;e. Je me demande ce que pense notre intervenant de cette strat&eacute;gie.
