Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-and-globalization.*.po
Languages: fr

source: Copyright and Globalization in the Age of Computer Networks - GNU Project - Free Software Foundation (FSF)
fr: Droit d'auteur et mondialisation &agrave; l'&acirc;ge des r&eacute;seaux informatiques - GNU Project - Free Software Foundation (FSF)

source: Copyright and Globalization in the Age of Computer Networks
fr: Droit d'auteur et mondialisation &agrave; l'&acirc;ge des r&eacute;seaux informatiques

source: <i>The following is an edited transcript from a speech given at <abbr title="Massachusetts Institute of Technology">MIT</abbr> in the Communications Form on Thursday, April 19, 2001 from 5:00pm - 7:00pm</i>
fr: <i>Ce qui suit est la transcription d'un discours donn&eacute; au <abbr title="Massachusetts Institute of Technology">MIT</abbr> lors du Forum des Communications, le jeudi 19 avril 2001, 17h00 - 19h00</i>

source: <b>DAVID THORBURN, moderator</b>: Our speaker today, Richard Stallman, is a legendary figure in the computing world, and my experience in trying to find a respondent to share the podium with him was instructive. One distinguished <abbr>MIT</abbr> professor told me that Stallman needs to be understood as a charismatic figure in a biblical parable &mdash; a kind of Old Testament anecdote-lesson. &ldquo;Imagine,&rdquo; he said, &ldquo;a Moses or a Jeremiah &mdash; better a Jeremiah.&rdquo; And I said, &ldquo;Well, that's very admirable.&rdquo;
fr: <b>DAVID THORBURN, animateur</b>&nbsp;:Notre intervenant d'aujourd'hui, Richard Stallman, est une figure l&eacute;gendaire dans le monde de l'informatique. Ce fut pour moi une exp&eacute;rience instructive de tenter de trouver un interlocuteur qui lui donne la r&eacute;plique. Un professeur &eacute;minent du MIT m'a confi&eacute; qu'il faut consid&eacute;rer Stallman comme une figure charismatique de parabole biblique &mdash; &laquo;&nbsp;Imaginez&nbsp;&raquo;, m'a-t-il dit, &laquo;&nbsp;un Mo&iuml;se ou un J&eacute;r&eacute;mie. Un J&eacute;r&eacute;mie, plut&ocirc;t.&nbsp;&raquo;. Ce &agrave; quoi j'ai r&eacute;torqu&eacute;&nbsp;: &laquo;&nbsp;Et bien, voil&agrave; qui est admirable&nbsp;&raquo;.

source: That sounds wonderful. It confirms my sense of the kind of contribution he has made to the world. Then why are you reluctant to share the podium with him?&rdquo; His answer: &ldquo;Like Jeremiah or Moses, he would simply overwhelm me. I won't appear on the same panel him, but if you asked me to name five people alive in the world who have truly helped us all, Richard Stallman would be one of them.&rdquo;
fr: Voil&agrave; qui est merveilleux, et qui confirme mon impression de l'importance de sa contribution au monde. Pourquoi, dans ce cas, avoir une telle r&eacute;ticence &agrave; partager la tribune avec lui&nbsp;?&nbsp;&raquo; R&eacute;ponse&nbsp;: &laquo;&nbsp;Tel J&eacute;r&eacute;mie ou Mo&iuml;se, il me submergerait, tout simplement. Je refuse de d&eacute;battre avec lui, mais s'il me fallait nommer cinq personnes vivantes dont les actes ont v&eacute;ritablement b&eacute;n&eacute;fici&eacute; &agrave; l'humanit&eacute;, Richard Stallman serait l'une d'elles&nbsp;&raquo;.

source: <b>RICHARD STALLMAN</b>: I should [begin by explaining why I have refused to allow this Forum to be web cast], in case it wasn't clear fully what the issue is: The software they use for web broadcasting requires the user to download certain software in order to receive the broadcast. That software is not free software. It's available at zero price but only as an executable, which is a mysterious bunch of numbers.
fr: <b>RICHARD STALLMAN</b>&nbsp;: Il me faut commencer par expliquer pourquoi j'ai refus&eacute; d'autoriser que ce d&eacute;bat soit diffus&eacute; en direct sur le web, au cas o&ugrave; le probl&egrave;me n'est pas apparu clairement:&nbsp;:le logiciel utilis&eacute; pour la diffusion sur le web oblige l'utilisateur &agrave; t&eacute;l&eacute;charger un autre logiciel pour recevoir l'&eacute;mission. Ce logiciel n'est pas libre. Il est disponible gratuitement mais uniquement sous forme ex&eacute;cutable, c'est-&agrave;-dire sous la forme d'une suite de nombres cabalistiques.

source: What it does is secret. You can't study it; you can't change it; and you certainly can't publish it in your own modified version. And those are among the freedoms that are essential in the definition of &ldquo;free software.&rdquo;
fr: Ce qu'il fait est secret. On ne peut ni l'&eacute;tudier, ni le modifier, et certainement pas en publier de version modifi&eacute;e. Et ce sont l&agrave; des libert&eacute;s essentielles dans la d&eacute;finition du &laquo;&nbsp;logiciel libre&nbsp;&raquo;.

source: So if I am to be an honest advocate for free software, I can hardly go around giving speeches, then put pressure on people to use non-free software. I'd be undermining my own cause. And if I don't show that I take my principles seriously, I can't expect anybody else to take them seriously.
fr: C'est pourquoi, si je souhaite me comporter en pros&eacute;lyte honn&ecirc;te du logiciel libre, je ne peux pas d'un c&ocirc;t&eacute; donner des conf&eacute;rences, et de l'autre inciter les gens &agrave; utiliser des logiciels qui ne sont pas libres. Cela saperait ma propre cause. Si je ne prends pas mes principes au s&eacute;rieux, commentm'attendre &agrave; ce que d'autres le fassent&nbsp;?

source: However, this speech is not about free software. After I'd been working on the free software movement for several years and people started using some of the pieces of the GNU operating system, I began getting invited to give speeches [at which] &hellip; people started asking me: &ldquo;Well, how do the ideas about freedom for software users generalize to other kinds of things?&rdquo;
fr: Cependant, je ne suis pas venu parler de logiciel libre. Apr&egrave;s avoir travaill&eacute; plusieurs ann&eacute;es pour le mouvement du logiciel libre et avec les premiers utilisateurs du syst&egrave;me d'exploitation GNU, j'ai commenc&eacute; &agrave; recevoir des invitations pour donner des discours, discours o&ugrave; on me posait des questions telles que:&nbsp;: &laquo;&nbsp;Les id&eacute;es de libert&eacute; pour les utilisateurs de logiciels se g&eacute;n&eacute;ralisent-elles &agrave; d'autres domaines et comment&nbsp;?&nbsp;&raquo;

source: And, of course, people asked silly questions like, &ldquo;Well, should hardware be free?&rdquo; &ldquo;Should this microphone be free?&rdquo;
fr: Et bien s&ucirc;r, on me posait de sottes questions comme &laquo;&nbsp;Le mat&eacute;riel informatique devrait-il &ecirc;tre libre&nbsp;?&nbsp;&raquo; &laquo;&nbsp;Ce microphone devrait-il &ecirc;tre libre&nbsp;?&nbsp;&raquo;

source: Well, what does that mean? Should you be free to copy it and change it? Well, as for changing it, if you buy the microphone, nobody is going to stop you from changing it. And as for copying it, nobody has a microphone copier. Outside of &ldquo;Star Trek,&rdquo; those things don't exist. Maybe some day there'll be nanotechnological analyzers and assemblers, and it really will be possible to copy a physical object, and then these issues of whether you're free to do that will start being really important. We'll see agribusiness companies trying to stop people from copying food, and that will become a major political issue, if that technological capability will ever exist. I don't know if it will; it's just speculation at this point.
fr: Qu'est-ce que cela peut bien vouloir dire&nbsp;? Devrait-on avoir la libert&eacute; de le copier et de le modifier&nbsp;? En ce qui concerne les modifications, personne ne peut s'opposer &agrave; ce que vous modifiiez un microphone que vous auriez achet&eacute;. Quant &agrave; la copie, personne ne dispose d'un duplicateur de microphone &mdash; de telles choses n'existent que dans les histoires de science-fiction. Un jour, nous disposerons peut-&ecirc;tre de nanotechniques d'analyse et d'assemblage, et il sera peut-&ecirc;tre possible de copier pour de vrai un objet physique. Alors, les libert&eacute;s attach&eacute;es aux objets prendront une v&eacute;ritable importance. Nous verrons des fabricants de produits agricoles tenter d'interdire de dupliquer la nourriture, et il s'agira d'un d&eacute;bat politique de premi&egrave;re importance &mdash; si de telles nanotechniques voient jamais le jour. J'ignore si ce sera le cas : il ne s'agit pour le moment que de pure sp&eacute;culation.

source: But for other kinds of information, you can raise the issue because any kind of information that can be stored on a computer, conceivably, can be copied and modified. So the ethical issues of free software, the issues of a user's right to copy and modify software, are the same as such questions for other kinds of published information. Now I'm not talking about private information, say, personal information, which is never meant to be available to the public at all. I'm talking about the rights you should have if you get copies of published things where there's no attempt to keep them secret.
fr: Mais cette question se pose pour d'autres types d'informations&nbsp;: toute information stockable sur ordinateur peut &ecirc;tre copi&eacute;e et modifi&eacute;e. Par cons&eacute;quent, les probl&eacute;matiques &eacute;thiques du logiciel libre, les droits qu'a l'utilisateur de copier et de modifier le logiciel, sont transposables &agrave; d'autres types d'informations. Soyons clairs:&nbsp;: je ne parle pas des informations priv&eacute;es, telles que les informations personnelles, qu'il n'est jamais question de rendre publiques. Je traite des droits qu'il faudrait donner &agrave; quiconque re&ccedil;oit des copies de donn&eacute;es publi&eacute;es, sans intention ni tentative de les garder secr&egrave;tes.

source: In order to explain my ideas on the subject, I'd like to review the history of the distribution of information and of copyright. In the ancient world, books were written by hand with a pen, and anybody who knew how to read and write could copy a book about as efficiently as anybody else. Now somebody who did it all day would probably learn to be somewhat better at it, but there was not a tremendous difference. And because the copies were made one at a time, there was no great economy of scale. Making ten copies took ten times as long as making one copy. There was also nothing forcing centralization; a book could be copied anywhere.
fr: Pour exposer mes id&eacute;es sur la question, je vais passer en revue l'histoire de la distribution de l'information et du copyright. Jadis, les livres &eacute;taient &eacute;crits &agrave; la main &agrave; l'aide d'une plume, et tout lettr&eacute; pouvait recopier un livre presque aussi efficacement que quiconque. Bien s&ucirc;r, celui qui exer&ccedil;ait cette activit&eacute; toute la journ&eacute;e y acqu&eacute;rait probablement des comp&eacute;tences particuli&egrave;res, mais la diff&eacute;rence n'&eacute;tait pas &eacute;norme. Les copies &eacute;tant ex&eacute;cut&eacute;es &agrave; la pi&egrave;ce, l'industrialisation du proc&eacute;d&eacute; n'apportait rien. La r&eacute;alisation de dix copies exigeait dix fois plus d'efforts que la r&eacute;alisation d'une seule copie. Rien non plus n'incitait &agrave; la centralisation:&nbsp;:on pouvait copier un livre n'importe o&ugrave;.

source: Now because of this technology, because it didn't force copies to be identical, there wasn't in the ancient world the same total divide between copying a book and writing a book. There are things in between that made sense. They did understand the idea of an author. They knew, say, that this play was written by Sophocles but in between writing a book and copying a book, there were other useful things you could do. For instance, you could copy a part of a book, then write some new words, copy some more and write some new words and on and on. This was called &ldquo;writing a commentary&rdquo; &mdash; that was a common thing to do &mdash; and these commentaries were appreciated.
fr: Cette technique n'impliquant pas la similitude des copies, on ne distinguait pas avec une telle insistance que de nos jours, les processus de cr&eacute;ation originale et de copie. Il existait des interm&eacute;diaires parfaitement raisonnables. On savait ce qu'&eacute;tait un auteur, on savait, par exemple, que telle pi&egrave;ce avait &eacute;t&eacute; &eacute;crite par Sophocle, mais on pouvait imaginer, entre la r&eacute;daction et la copie, d'autres op&eacute;rations utiles. On pouvait par exemple recopier une partie d'un livre, ajouter de nouveaux passages, recopier une autre partie, ajouter d'autres passages, etc. On appelait cela &laquo;&nbsp;&eacute;crire un commentaire&nbsp;&raquo; &mdash; c'&eacute;tait fr&eacute;quent &mdash; et ces commentaires &eacute;taient pris&eacute;s.

source: You could also copy a passage out of one book, then write some other words, and copy a passage from another book and write some more and so on, and this was making a compendium. Compendia were also very useful. There are works that are lost but parts of them survived when they were quoted into other books that got to be more popular than the original. Maybe they copied the most interesting parts, and so people made a lot of copies of these, but they didn't bother copying the original because it wasn't interesting enough.
fr: On pouvait aussi copier un passage d'un livre, &eacute;crire d'autres mots, copier un passage d'un autre livre, &eacute;crire d'autres mots, etc. &mdash; on appelait cela &eacute;crire un recueil. Les recueils &eacute;taient fort utiles &eacute;galement. Certaines &oelig;uvres sont perdues et ne survivent que par le truchement de fragments repris dans d'autres livres qui ont eu plus de succ&egrave;s que l'original. Peut-&ecirc;tre seules les parties les plus int&eacute;ressantes &eacute;taient-elles reprises, et ces s&eacute;lections &eacute;taient abondamment recopi&eacute;es, alors que personne ne prenait la peine de recopier les textes originaux, jug&eacute;s trop peu int&eacute;ressants.

source: Now as far as I can tell, there was no such thing as copyright in the ancient world. Anyone who wanted to copy a book could copy the book. Later on, the printing press was developed and books started to be copied on the printing press. Now the printing press was not just a quantitative improvement in the ease of copying. It affected different kinds of copying unevenly because it introduced an inherent economy of scale. It was a lot of work to set the type and much less work to make many identical copies of the page. So the result was that copying books tended to become a centralized, mass-production activity. Copies of any given book would probably be made in only a few places.
fr: Autant que je sache, rien ne ressemblait alors au copyright. Quiconque souhaitait copier un livre, le pouvait. Plus tard, avec l'invention de l'imprimerie, des livres ont commenc&eacute; &agrave; &ecirc;tre imprim&eacute;s. L'imprimerie ne repr&eacute;sentait pas uniquement un progr&egrave;s quantitatif dans la facilit&eacute; de copier. Elle affectait de fa&ccedil;on diff&eacute;rente divers types de copies en introduisant une &eacute;conomie d'&eacute;chelle intrins&egrave;que.&nbsp; C'&eacute;tait un travail long et fastidieux que de pr&eacute;parer les planches de caract&egrave;res amovibles, compar&eacute;e &agrave; quoi l'op&eacute;ration d'imprimer la m&ecirc;me page plusieurs fois &eacute;tait n&eacute;gligeable. Il en r&eacute;sulta une centralisation et une production en s&eacute;rie des livres; ce n'est vraisemblablement qu'en quelques endroits qu'un livre donn&eacute; pouvait &ecirc;tre copi&eacute;.

source: It also meant that ordinary readers couldn't copy books efficiently. Only if you had a printing press could you do that. So it was an industrial activity.
fr: Il en r&eacute;sulta &eacute;galement que les lecteurs ordinaires ne pouvaient plus copier efficacement des livres. Cette activit&eacute; &eacute;tait r&eacute;serv&eacute;e &agrave; ceux qui disposaient d'une presse &agrave; imprimer:&nbsp;:elle &eacute;tait devenue industrielle.

source: Now for the first few centuries of printing, printed books did not totally replace hand-copying. Hand-copied books were still made, sometimes by rich people and sometimes by poor people. The rich people did this to get an especially beautiful copy that would show how rich they were, and poor people did it because maybe they didn't have enough money to buy a printed copy but they had the time to copy a book by hand. As the song says, &ldquo;Time ain't money when all you got is time.&rdquo;
fr: Cette r&eacute;volution s'est op&eacute;r&eacute;e graduellement, et l'imprimerie n'a pas totalement remplac&eacute; la copie manuelle lors des premiers si&egrave;cles de sa mise en service. Des riches comme des pauvres continuaient de recopier ou de faire recopier des livres &agrave; la main. Les riches, pour exhiber leur richesse par le truchement d'exemplaires richement enlumin&eacute;s; les pauvres, par manque d'argent pour acheter un livre imprim&eacute; et parce qu'ils avaient le temps. Comme on dit, &laquo;&nbsp;le temps n'est pas de l'argent si l'on a du temps &agrave; revendre&nbsp;&raquo;.

source: So hand-copying was still done to some extent. I think it was in the 1800s that printing actually got to be cheap enough that even poor people could afford printed books if they were literate.
fr: Les copies manuelles ont donc surv&eacute;cu quelque temps. Je pense que c'est au XIX&egrave;me si&egrave;cle que les tarifs de l'imprimerie devinrent suffisamment accessibles pour que m&ecirc;me les pauvres instruits puissent s'offrir des&nbsp; livres imprim&eacute;s.

source: Now copyright was developed along with the use of the printing press and given the technology of the printing press, it had the effect of an industrial regulation. It didn't restrict what readers could do; it restricted what publishers and authors could do. Copyright in England was initially a form of censorship. You had to get government permission to publish the book. But the idea has changed. By the time of the U.S. Constitution, people came to a different idea of the purpose of copyright, and I think that that idea was accepted in England as well.
fr: Le copyright fut d&eacute;velopp&eacute; avec l'essor de l'imprimerie, qu'il r&eacute;glementa au sens industriel du terme. Il ne limitait pas les droits des lecteurs; il limitait les pouvoirs des &eacute;diteurs et des auteurs. En Angleterre, le copyright fut initialement une forme de censure. Il fallait obtenir la permission du gouvernement pour publier un livre. Mais l'id&eacute;e &eacute;volua. Au moment de la constitution des &Eacute;tats-Unis d'Am&eacute;rique, on avait une autre id&eacute;e du but du copyright, et je pense que cette id&eacute;e fut reprise en Angleterre &eacute;galement.

source: For the U.S. Constitution it was proposed that authors should be entitled to a copyright, a monopoly on copying their books. This proposal was rejected. Instead, a crucially different proposal was adopted which is that, for the sake of promoting progress, Congress could optionally establish a copyright system that would create these monopolies. So the monopolies, according to the U.S. Constitution, do not exist for the sake of those who own them; they exist for the sake of promoting the progress of science. The monopolies are handed out to authors as a way of modifying their behavior to get them to do something that serves the public.
fr: Pour la constitution des &Eacute;tats-Unis d'Am&eacute;rique, on proposa que les auteurs obtinssent un copyright, c'est-&agrave;-dire un monopole sur la copie de leurs livres. Cette proposition fut rejet&eacute;e, et remplac&eacute;e par une proposition crucialement diff&eacute;rente:&nbsp;:dans le but de promouvoir le progr&egrave;s, le Congr&egrave;s pourrait, s'il le souhaitait, &eacute;tablir un syst&egrave;me de copyright qui cr&eacute;erait ces monopoles. Si l'on en croit la constitution des &Eacute;tats-Unis d'Am&eacute;rique, les monopoles n'existent pas pour le bien de ceux qui les d&eacute;tiennent; ils n'existent que dans le but de promouvoir le progr&egrave;s scientifique. On attribue un monopole aux auteurs afin de les inciter &agrave; servir la population par leur &oelig;uvre.

source: So the goal is more written and published books which other people can then read. And this is believed to contribute to increased literary activity, increased writing about science and other fields, and society then learns through this. That's the purpose to be served. The creation of private monopolies was a means to an end only, and the end is a public end.
fr: Le but recherch&eacute; &eacute;tait donc une augmentation du nombre de livres &eacute;crits et publi&eacute;s, mis &agrave; la disposition du public. On pensait que cela inciterait les productions litt&eacute;raire, scientifique et d'autres domaines encore, et par voie de cons&eacute;quence, l'instruction et l'&eacute;ducation de la soci&eacute;t&eacute;. Voil&agrave; le but &agrave; servir. La cr&eacute;ation de monopoles priv&eacute;s n'&eacute;tait qu'un moyen pour servir une fin, et cette fin &eacute;tait le bien public.

source: Now copyright in the age of the printing press was fairly painless because it was an industrial regulation. It restricted only the activities of publishers and authors. Well, in some strict sense, the poor people who copied books by hand may have been infringing copyright, too. But nobody ever tried to enforce copyright against them because it was understood as an industrial regulation.
fr: &Agrave; l'&acirc;ge de l'imprimerie, le copyright &eacute;tait peu douloureux, puisque c'&eacute;tait un r&egrave;glement industriel. Il ne limitait que les activit&eacute;s des &eacute;diteurs et des auteurs. Stricto sensu, les pauvres qui copiaient des livres &agrave; la main violaient probablement des copyrights. Mais personne ne les a jamais poursuivis, puisqu'on consid&eacute;rait le copyright comme un r&egrave;glement industriel.

source: Copyright in the age of the printing press was also easy to enforce because it had to be enforced only where there was a publisher, and publishers, by their nature, make themselves known. If you're trying to sell books, you've got to tell people where to come to buy them. You don't have to go into everybody's house to enforce copyright.
fr: &Agrave; l'&acirc;ge de l'imprimerie, le copyright &eacute;tait facile &agrave; faire appliquer car il ne s'exer&ccedil;ait que chez les &eacute;diteurs &mdash; et par nature, un &eacute;diteur cherche &agrave; se faire conna&icirc;tre. Si l'on cherche &agrave; vendre des livres, il faut dire aux gens o&ugrave; venir les acheter. Il n'&eacute;tait pas n&eacute;cessaire d'aller faire respecter le copyright dans toutes les chaumi&egrave;res.

source: And, finally, copyright may have been a beneficial system in that context. Copyright in the U.S. is considered by legal scholars as a trade, a bargain between the public and authors. The public trades away some of its natural rights to make copies, and in exchange gets the benefit of more books' being written and published.
fr: Enfin, le copyright fut peut-&ecirc;tre b&eacute;n&eacute;fique dans un tel contexte. Aux &Eacute;tats-Unis d'Am&eacute;rique, les sp&eacute;cialistes en droit consid&egrave;rent le copyright comme un &eacute;change, un accord entre le public et les auteurs. Le public abandonne certains de ses droits naturels &agrave; la r&eacute;alisation de copies, et re&ccedil;oit en &eacute;change le b&eacute;n&eacute;fice d'un plus grand nombre de livres cr&eacute;&eacute;s et produits.
