Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-and-globalization.*.po
Languages: fr

source: Assuming that humanity doesn't wipe itself out, the work we do today to produce the free educational infrastructure, the free learning resource for the world, that will be useful for as long as humanity exists. If it takes 20 years to get it done, so what? So don't think in terms of the size of the whole job. Think in terms of the piece that you're going to do. That will show people it can be done, and so others will do other pieces.
fr: Si on suppose que l'humanit&eacute; ne se d&eacute;truit pas, le travail r&eacute;alis&eacute; aujourd'hui dans le but de produire une infrastructure &eacute;ducative libre et des ressources scolaires libres pour tous, subsistera aussi longtemps que l'humanit&eacute; vivra. Si cela doit prendre 20 ans, et alors&nbsp;? Ne pensez donc pas en termes de taille de l'ensemble de la t&acirc;che. Pensez en termes du morceau que vous allez accomplir. Cela montrera l'exemple &agrave; suivre, et d'autres s'occuperont des autres morceaux.

source: This speech is published in <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>.
fr: Cette conférence est publiée dans <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Logiciel libre, société libre&nbsp;: les essais choisis de Richard M. Stallman</cite></a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: S&eacute;bastien Blondeel<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
