Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-and-globalization.*.po
Languages: fr

source: Now, is this an advantageous trade? Well, when the general public can't make copies because they can only be efficiently made on printing presses &mdash; and most people don't own printing presses &mdash; the result is that the general public is trading away a freedom it is unable to exercise, a freedom that is of no practical value. So if you have something that is a byproduct of your life and it's useless and you have the opportunity to exchange it for something else of any value, you're gaining. So that's why copyright may have been an advantageous trade for the public in that time.
fr: Est-ce un accord avantageux&nbsp;? Si tout un chacun ne peut r&eacute;aliser de copies efficacement faute de disposer d'une presse &agrave; imprimer &mdash; et rares &eacute;taient les possesseurs de tels engins &mdash; il advient que le grand public abandonne une libert&eacute; qu'il ne peut exercer, une libert&eacute; impraticable. Si l'on a l'occasion d'&eacute;changer une potentialit&eacute; inutile contre quelque chose de valeur, on r&eacute;alise un march&eacute; gagnant. C'est pourquoi le copyright fut probablement un &eacute;change avantageux pour la soci&eacute;t&eacute; &agrave; cette &eacute;poque.

source: But the context is changing, and that has to change our ethical evaluation of copyright. Now the basic principles of ethics are not changed by advances in technology; they're too fundamental to be touched by such contingencies. But our decision about any specific question is a matter of the consequences of the alternatives available, and the consequences of a given choice may change when the context changes. That is what is happening in the area of copyright law because the age of the printing press is coming to an end, giving way gradually to the age of the computer networks.
fr: Mais les temps et le contexte changent, et cela remet en question notre &eacute;valuation &eacute;thique du copyright. Les principes &eacute;thiques ne changent en rien avec les progr&egrave;s techniques; ils sont trop fondamentaux pour &ecirc;tre influenc&eacute;s par de telles contingences. Mais toute d&eacute;cision concernant un probl&egrave;me donn&eacute; d&eacute;pend des cons&eacute;quences des choix disponibles, et les cons&eacute;quences d'un choix donn&eacute; d&eacute;pendent ducontexte. C'est ce qui se produit dans le domaine du droit du copyright, car l'&acirc;ge de l'imprimerie prend fin et c&egrave;de peu &agrave; peu la place &agrave; l'&acirc;ge des r&eacute;seaux informatiques.

source: Computer networks and digital information technology are bringing us back to a world more like the ancient world where anyone who can read and use the information can also copy it and can make copies about as easily as anyone else could make them. They are perfect copies and they're just as good as the copies anyone else could make. So the centralization and economy of scale introduced by the printing press and similar technologies is going away.
fr: Les r&eacute;seaux informatiques et les techniques num&eacute;riques de traitement de l'information nous ram&egrave;nent dans une situation semblable aux temps anciens, o&ugrave; quiconque pouvant lire et utiliser l'information pouvait &eacute;galement la copier, et ce, aussi facilement que n'importe qui. Ce sont des copies parfaites, aussi bonnes que les copies qu'un autre r&eacute;aliserait. La centralisation et les &eacute;conomies d'&eacute;chelle introduites par l'imprimerie et les techniques apparent&eacute;es ne s'appliquent donc plus.

source: And this changing context changes the way copyright law works. You see, copyright law no longer acts as an industrial regulation; it is now a Draconian restriction on a general public. It used to be a restriction on publishers for the sake of authors. Now, for practical purposes, it's a restriction on a public for the sake of publishers. Copyright used to be fairly painless and uncontroversial. It didn't restrict the general public. Now that's not true. If you have a computer, the publishers consider restricting you to be their highest priority. Copyright was easy to enforce because it was a restriction only on publishers who were easy to find and what they published was easy to see. Now the copyright is a restriction on each and everyone of you. To enforce it requires surveillance &mdash; an intrusion &mdash; and harsh punishments, and we are seeing these being enacted into law in the U.S. and other countries.
fr: Cette &eacute;volution du contexte modifie la mani&egrave;re dont le droit du copyright fonctionne. Il ne fonctionne plus comme un r&egrave;glement industriel, mais comme une restriction draconienne &agrave; l'encontre du public. C'&eacute;tait une restriction impos&eacute;e aux &eacute;diteurs pour le bien des auteurs. C'est devenu, dans la pratique, une restriction impos&eacute;e au public pour le bien des &eacute;diteurs. Le copyright n'&eacute;tait pas douloureux et ne soulevait pas de controverses, puisqu'il ne restreignait pas le public. Aujourd'hui, ce n'est plus le cas. La priorit&eacute; num&eacute;ro un des &eacute;diteurs est de confiner tout possesseur d'ordinateur. Le copyright &eacute;tait facile &agrave; faire appliquer en tant que restriction impos&eacute;e aux &eacute;diteurs, car ils avaient pignon sur rue. C'est maintenant devenu une restriction portant sur tout un chacun. Son application implique surveillance, intrusions, et ch&acirc;timents s&eacute;v&egrave;res, moyens dont nous voyons la mise en lois et en &oelig;uvre aux &Eacute;tats-Unis d'Am&eacute;rique et dans d'autres pays.

source: And copyright used to be, arguably, an advantageous trade for the public to make because the public was trading away freedoms it couldn't exercise. Well, now it can exercise these freedoms. What do you do if you have been producing a byproduct which was of no use to you and you were in the habit of trading it away and then, all of a sudden, you discover a use for it? You can actually consume it, use it. What do you do? You don't trade at all; you keep some. And that's what the public would naturally want to do. That's what the public does whenever it's given a chance to voice its preference; it keeps some of this freedom and exercises it. Napster is a big example of that, the public deciding to exercise the freedom to copy instead of giving it up. So the natural thing for us to do to make copyright law fit today's circumstances is to reduce the amount of copyright power that copyright owners get, to reduce the amount of restriction that they place on the public and to increase the freedom that the public retains.
fr: On pouvait d&eacute;fendre la th&egrave;se que le copyright &eacute;tait un march&eacute; avantageux pour le public, qui abandonnait des libert&eacute;s qu'il ne pouvait exercer. Il peut d&eacute;sormais les exercer. Que faire si l'on d&eacute;couvre soudainement une utilit&eacute; &agrave; une potentialit&eacute; jusque l&agrave; troqu&eacute;e faute de lui trouver un int&eacute;r&ecirc;t&nbsp;? On peut d&eacute;sormais la consommer, l'utiliser. Que faire&nbsp;? On n'y renonce plus, on en garde des parties. C'est l'impulsion naturelle. C'est pourquoi, &agrave; chaque occasion o&ugrave; il peut exprimer sa pr&eacute;f&eacute;rence, c'est ce que le public fait:&nbsp;:il conserve une portion de cette libert&eacute;, et l'exerce. Napster en est un exemple frappant:&nbsp;:le public d&eacute;cide d'exercer sa libert&eacute; de copier au lieu de l'abandonner. La tendance naturelle, pour faire correspondre le droit du copyright aux circonstances actuelles, est de r&eacute;duire le pouvoir des d&eacute;tenteurs de copyright, r&eacute;duire les restrictions qu'ils imposent au public, et augmenter les libert&eacute;s que le public conserve.

source: But this is not what the publishers want to do. What they want to do is exactly the opposite. They wish to increase copyright powers to the point where they can remain firmly in control of all use of information. This has led to laws that have given an unprecedented increase in the powers of copyright. Freedoms that the public used to have in the age of the printing press are being taken away.
fr: Voil&agrave; qui d&eacute;pla&icirc;t aux &eacute;diteurs. Ils recherchent exactement l'inverse. Ils veulent d&eacute;velopper le pouvoir du copyright jusqu'&agrave; contr&ocirc;ler fermement toute utilisation de l'information. Ces pressions ont fait voter des lois attribuant aux pouvoirs associ&eacute;s au copyright des extensions sans pr&eacute;c&eacute;dent. Certaines des libert&eacute;s accord&eacute;es au public &agrave; l'&acirc;ge de l'imprimerie lui sont d&eacute;sormais retir&eacute;es.

source: For instance, let's look at e-books. There's a tremendous amount of hype about e-books; you can hardly avoid it. I took a flight in Brazil and in the in-flight magazine, there was an article saying that maybe it would take 10 or 20 years before we all switched to e-books. Clearly, this kind of campaign comes from somebody paying for it. Now why are they doing that? I think I know. The reason is that e-books are the opportunity to take away some of the residual freedoms that readers of printed books have always had and still have &mdash; the freedom, for instance, to lend a book to your friend or borrow it from the public library or sell a copy to a used bookstore or buy a copy anonymously, without putting a record in the database of who bought that particular book. And maybe even the right to read it twice.
fr: Examinons par exemple le cas des livres &eacute;lectroniques. C'est un th&egrave;me tellement &agrave; la mode qu'il est difficile d'y &eacute;chapper. J'ai pris l'avion pour le Br&eacute;sil et le magazine de bord contenait un article annon&ccedil;ant que d'ici 10 ou 20 ans, nous passerions tous aux livres &eacute;lectroniques. Voil&agrave;clairement une campagne financ&eacute;e par quelqu'un. Dans quel but&nbsp;? Je crois que j'ai devin&eacute;. Les livres &eacute;lectroniques sont l'occasion de retirer aux lecteurs des livres imprim&eacute;s certaines des libert&eacute;s qu'ils ont r&eacute;ussi &agrave; conserver &mdash; telles que la libert&eacute; de pr&ecirc;ter un livre &agrave; un ami, de l'emprunter dans une biblioth&egrave;que publique, d'en vendre un exemplaire &agrave; un magasin de livres d'occasion, d'en acheter un exemplaire de mani&egrave;re anonyme, sans laisser de trace dans une quelconque base de donn&eacute;es. Et, qui sait, le droit de le lire deux fois.

source: These are freedoms that the publishers would like to take away, but they can't do this for printed books because that would be too obvious a power-grab and would raise an outcry. So they have found an indirect strategy: First, they obtain the legislation to take away these freedoms for e-books when there are no e-books; so there's no controversy. There are no pre-existing users of e-books who are accustomed to their freedoms and will defend them. That they obtained with the Digital Millennium Copyright Act in 1998. Then they introduce e-books and gradually get everybody to switch from printed books to e-books and eventually the result is, readers have lost these freedoms without ever having an instant when those freedoms were being taken away and when they might have fought back to retain them.
fr: Voil&agrave; des libert&eacute;s que les &eacute;diteurs souhaiteraient nous retirer, mais qui dans le cas des livres imprim&eacute;s provoquerait une lev&eacute;e de boucliers car ce serait une prise de pouvoir trop voyante. La strat&eacute;gie indirecte qu'ils ont trouv&eacute;e est donc la suivante:&nbsp;:tout d'abord, on obtient de la loi qu'elle retire ces libert&eacute;s aux livres &eacute;lectroniques &agrave; une &eacute;poque o&ugrave; ils n'existent pas encore, ne provoquant ainsi aucune controverse. Iln'existe pas d'ant&eacute;riorit&eacute;, d'utilisateurs de livres &eacute;lectroniques habitu&eacute;s &agrave; ces libert&eacute;s et pr&ecirc;ts &agrave; les d&eacute;fendre. Cette premi&egrave;re &eacute;tape fut atteinte avec le &laquo;&nbsp;Digital Millennium Copyright Act&nbsp;&raquo; en 1998. Ensuite, on introduit les livres&eacute;lectroniques et peu &agrave; peu on incite tout le monde &agrave; passer des livres imprim&eacute;s aux livres &eacute;lectroniques. Finalement, le r&eacute;sultat est que les lecteurs ont perdu ces libert&eacute;s sans qu'&agrave; aucun moment, ils ne s'en soient vu priver et aient donc eu l'occasion de se battre pour les conserver.

source: We see at the same time efforts to take away people's freedom in using other kinds of published works. For instance, movies that are on DVDs are published in an encrypted format that used to be secret &mdash; it was meant to be secret &mdash; and the only way the movie companies would tell you the format, so that you could make a DVD player, was if you signed a contract to build certain restrictions into the player, with the result that the public would be stopped even from fully exercising their legal rights. Then a few clever programmers in Europe figured out the format of DVDs and they wrote a free software package that would read a DVD. This made it possible to use free software on top of the GNU+Linux operating system to watch the DVD that you had bought, which is a perfectly legitimate thing to do. You ought to be able to do that with free software.
fr: Pendant ce temps, on observe des remises en question des libert&eacute;s de disposer d'autres types d'&oelig;uvres. Les films sur DVD, par exemple, sont publi&eacute;s dans un format chiffr&eacute; et secret &mdash; telle &eacute;tait initialement son intention en tout cas &mdash; et la seule mani&egrave;re d'obtenir des majors du cin&eacute;ma la description du format, afin d'&ecirc;tre capable de construire un lecteur de DVD, est de signer un contrat s'engageant &agrave; brider le lecteur. Ainsi, il est devenu impossible au public d'exercer les droits qui lui sont garantis par la loi. C'est alors que des programmeurs europ&eacute;ens astucieux ont devin&eacute; le format des DVD et publi&eacute; un logiciel libre capable de lire les DVD. Cela a permis aux utilisateurs du syst&egrave;me GNU/Linux ayant acquis des DVD de regarder les films qu'ils avaient achet&eacute;s &mdash; exigence parfaitement l&eacute;gitime au demeurant. On devrait pouvoir le faire avec des logiciels libres.

source: But the movie companies objected and they went to court. You see, the movie companies used to make a lot of films where there was a mad scientist and somebody was saying, &ldquo;But, Doctor, there are some things Man was not meant to know.&rdquo; They must have watched their own films too much because they came to believe that the format of DVDs is something that Man was not meant to know. And they obtained a ruling for total censorship of the software for playing DVDs. Even making a link to a site where this information is legally available outside the U.S. has been prohibited. An appeal has been made against this ruling. I signed a friend-of-the-court brief in that appeal, I'm proud to say, although I'm playing a fairly small role in that particular battle.
fr: Mais les majors n'&eacute;taient pas de cet avis et elles ont port&eacute; l'affaire en justice. Voyez-vous, elles ont produit de nombreux films o&ugrave; un savant fou se voyait objecter &laquo;&nbsp;Mais Docteur, il y a des choses que l'Homme ne doit pas savoir&nbsp;&raquo;. Il faut croire qu'elles ont trop regard&eacute; leurs propres films, car elles en sont venues &agrave; croire qu'il &eacute;tait mauvais pour l'Homme de conna&icirc;tre le format des DVD. Elles ont ainsi obtenu, par d&eacute;cision de justice, la censure compl&egrave;te de tout logiciel capable de lire les DVD. Il est m&ecirc;me interdit d&eacute;sormais de tirer un lien vers un site qui propose cette information en toute l&eacute;galit&eacute;, hors des &Eacute;tats-Unis d'Am&eacute;rique. Il a &eacute;t&eacute; fait appel de cette d&eacute;cision, et je suis fier d'annoncer, bien que mon r&ocirc;le reste mineur dans cette bataille, que j'ai sign&eacute; un rapport technique sur le sujet.

source: The U.S. government intervened directly on the other side. This is not surprising when you consider why the Digital Millennium Copyright Act was passed in the first place. The reason is the campaign finance system that we have in the U.S., which is essentially legalized bribery where the candidates are bought by business before they even get elected. And, of course, they know who their master is &mdash; they know whom they're working for &mdash; and they pass the laws to give business more power.
fr: Le gouvernement des &Eacute;tats-Unis d'Am&eacute;rique a pris ouvertement part pour la partie adverse. Cela n'est pas surprenant quand on se rappelle la v&eacute;ritable raison de la mise en place du &laquo;&nbsp;Digital Millennium Copyright Act&nbsp;&raquo;&nbsp;:le syst&egrave;me de financement des campagnes &eacute;lectorales, qui n'est rien d'autre qu'une corruption l&eacute;galis&eacute;e, o&ugrave; les grandes entreprises ach&egrave;tent les candidats avant m&ecirc;me leur &eacute;lection. Les &eacute;lus ne connaissant que trop bien leurs ma&icirc;tres &mdash; ils savent qui ils doivent vraiment servir &mdash; ils font passer les lois qui renforcent le pouvoir des grandes entreprises.

source: What will happen with that particular battle, we don't know. But meanwhile Australia has passed a similar law and Europe is almost finished adopting one; so the plan is to leave no place on earth where this information can be made available to people. But the U.S. remains the world leader in trying to stop the public from distributing information that's been published.
fr: Nous ne savons pas ce qu'il adviendra de cette bataille en particulier. L'Australie a depuis vot&eacute; une loi semblable, et l'Europe est sur le point de le faire; l'intention est clairement de n'oublier aucun pays o&ugrave; cette information pourrait &ecirc;tre mise &agrave; disposition du public. Mais ce sont les &Eacute;tats-Unis d'Am&eacute;rique qui demeurent champion du monde des entraves au grand public &agrave; distribuer les informations pr&eacute;alablement publi&eacute;es.

source: The U.S. though is not the first country to make a priority of this. The Soviet Union treated it as very important. There this unauthorized copying and re-distribution was known as Samizdat and to stamp it out, they developed a series of methods: First, guards watching every piece of copying equipment to check what people were copying to prevent forbidden copying. Second, harsh punishments for anyone caught doing forbidden copying. You could be sent to Siberia. Third, soliciting informers, asking everyone to rat on their neighbors and co-workers to the information police. Fourth, collective responsibility &mdash; You! You're going to watch that group! If I catch any of them doing forbidden copying, you are going to prison. So watch them hard. And, fifth, propaganda, starting in childhood to convince everyone that only a horrible enemy of the people would ever do this forbidden copying.
fr: Cependant, ce n'est pas le premier pays &agrave; faire de ce combat sa priorit&eacute;. L'Union Sovi&eacute;tique y attachait &eacute;galement une grande importance. Les copies et distributions non autoris&eacute;es y portaient le nom de samizdat et les Soviets avaient mis au point un certain nombre de m&eacute;thodes pour les contrer. D'abord, des gardes surveillaient tous les copieurs et v&eacute;rifiaient les documents que les gens copiaient, afin d'interdire toute copie illicite. Deuxi&egrave;mement, de dursch&acirc;timents &eacute;taient r&eacute;serv&eacute;s aux contrevenants:&nbsp;:on pouvait &ecirc;tre envoy&eacute; en Sib&eacute;rie. Troisi&egrave;mement, l'incitation &agrave; la d&eacute;nonciation encourageait chacun &agrave; moucharder voisins ou coll&egrave;gues aupr&egrave;s de la police de l'information. Quatri&egrave;mement, laresponsabilit&eacute; collective:&nbsp;:&laquo;&nbsp;Toi! Tu surveilles ce groupe&nbsp;! Si je prends l'un d'entre eux &agrave; r&eacute;aliser des copies interdites, tu vas en prison. Alors surveille-les bien&nbsp;&raquo;. Et cinqui&egrave;mement, la propagande qui, d&egrave;s l'enfance, visait &agrave; convaincre tout le monde que seul un ignoble ennemi du peuple serait capable de se livrer &agrave; de telles activit&eacute;s.

source: The U.S. is using all of these measures now. First, guards watching copying equipment. Well, in copy stores, they have human guards to check what you copy. But human guards to watch what you copy in your computer would be too expensive; human labor is too expensive. So they have robot guards. That's the purpose of the Digital Millennium Copyright Act. This software goes in your computer; it's the only way you can access certain data and it stops you from copying.
fr: Chacune de ces mesures est en place aux &Eacute;tats-Unis d'Am&eacute;rique en ce moment. D'abord, des gardes qui surveillent les copieurs. Dans les bo&icirc;tes &agrave; copies, des gardes v&eacute;rifient ce que vous copiez. Mais le co&ucirc;t de gardes pour v&eacute;rifier ce que vous copiez avec votre ordinateur serait prohibitif; le travail humain co&ucirc;te trop cher. Alors, on utilise des robots. C'est le but du &laquo;&nbsp;Digital Millennium Copyright Act&nbsp;&raquo;. Ce logiciel infiltre l'ordinateur:&nbsp;:c'est le seul portail qui vous permet d'acc&eacute;der &agrave; certaines informations, et c'est lui qui vous emp&ecirc;che de r&eacute;aliser des copies.

source: There's a plan now to introduce this software into every hard disk, so that there could be files on your hard disk that you can't even access except by getting permission from some network server to access the file. And to bypass this software or even tell other people how to bypass it is a crime.
fr: Il est pr&eacute;vu d'inclure ce logiciel sur tous les disques durs, de sorte que certains fichiers de votre propre disque ne vous soient accessibles qu'apr&egrave;s l'accord d'un serveur r&eacute;seau. Il serait ill&eacute;gal de contourner cette protection, ainsi que d'expliquer &agrave; d'autres comment la contourner.

source: Second, harsh punishments. A few years ago, if you made copies of something and handed them out to your friends just to be helpful, this was not a crime; it had never been a crime in the U.S. Then they made it a felony, so you could be put in prisons for years for sharing with your neighbor.
fr: Deuxi&egrave;mement, les durs ch&acirc;timents. Voici quelques ann&eacute;es, il n'&eacute;tait pas ill&eacute;gal de copier des informations et de les donner &agrave; vos amis; cela n'avait jamais &eacute;t&eacute; ill&eacute;gal aux &Eacute;tats-Unis d'Am&eacute;rique. C'est depuis devenu un d&eacute;lit, de telle sorte qu'il est maintenant possible de passer des ann&eacute;es en prison pour avoir partag&eacute; avec autrui.

source: Third, informers. Well, you may have seen the ads on TV, the ads in the Boston subways asking people to rat on their co-workers to the information police, which officially is called the Software Publishers Association.
fr: Troisi&egrave;mement, les informateurs. Vous avez peut-&ecirc;tre vu les publicit&eacute;s &agrave; la t&eacute;l&eacute;vision ou dans le m&eacute;tro de Boston:&nbsp;:on incite d&eacute;sormais &agrave; balancer les coll&egrave;gues &agrave; la police de l'information, qui s'appelle officiellement &laquo;&nbsp;Software Publishers Association&nbsp;&raquo;.
