Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-versus-community.*.po
Languages: fr

source: Functional works include: computer software; recipes; textbooks; dictionaries and other reference works; anything that you use to get jobs done. For functional works I believe that people need very broad freedom, including the freedom to publish modified versions. So everything I am going to say tomorrow about computer software applies to other kinds of functional works in the same way. So, this criterion of free&hellip; because it necessary to have the freedom to publish a modified version this means we have to almost completely get rid of copyright but the free software movement is showing that the progress that society wants that is supposedly the justification for society having copyright can happen in other ways. We don't have to give up these important freedoms to have progress. Now the publishers are always asking us to presuppose that their there is no way to get progress without giving up our crucial freedoms and the most important thing I think about the free software movement is to show them that their pre-supposition is unjustified.
fr: Les travaux fonctionnels incluent&nbsp;: les logiciels d'ordinateur&nbsp;; les recettes&nbsp;; les manuels&nbsp;; les dictionnaires et autres travaux de r&eacute;f&eacute;rence&nbsp;; tout ce que vous utilisez pour que le travail soit fait. Pour les travaux fonctionnels, je pense que les gens ont besoin d'une libert&eacute; tr&egrave;s large, y compris la libert&eacute; de publier des versions modifi&eacute;es. Aussi tout ce que je dirais demain &agrave; propos des logiciels d'ordinateur s'applique de fa&ccedil;on identique aux autres genres de travaux fontionnels. Ainsi, ce crit&egrave;re de libre...&nbsp; parce qu'il est n&eacute;cessaire d'avoir la libert&eacute; de publier une version modifi&eacute;e. Cela signifie que nous devons nous d&eacute;barrasser presque totalement du copyright. Mais le mouvement du logiciel libre est en train de prouver que le progr&egrave;s que la soci&eacute;t&eacute; veut, la soi-disant justification du copyright, peut arriver d'une autre mani&egrave;re. Nous n'avons pas &agrave; renoncer &agrave; ces importantes libert&eacute;s pour avoir le progr&egrave;s. Aujourd'hui, les &eacute;diteurs nous demandent toujours de pr&eacute;supposer qu'il n'y a aucune possibilit&eacute; de progr&egrave;s sans renoncer &agrave; ces libert&eacute;s fondamentales. Et la chose la plus importante, je pense, pour le mouvement du logiciel libre est de prouver que leur pr&eacute;suppositions sont injustifi&eacute;es.

source: I can't say I'm sure that in all of these areas we can't produce progress without copyright restrictions stopping people, but what we've shown is that we've got a chance: it's not a ridiculous idea. It shouldn't be dismissed. The public should not suppose that the only way to get progress is to have copyright but even for these kinds of works there can be some kinds of compromise copyright systems that are consistent with giving people the freedom to publish modified versions. Look, for example, at the GNU free documentation license, which is used to make a book free. It allows anyone to make and sell copies of a modified version, but it requires giving credit in certain ways to the original authors and publishers in a way that can give them a commercial advantage and thus I believe make it possible to have commercial publishing of free textbooks, and if this works people are just beginning to try it commercially. The Free Software Foundation has been selling lots of copies of various free books for almost fifteen years now and it's been successful for us. At this point though, commercial publishers are just beginning to try this particular approach, but I think that even for functional works where the freedom to publish modified works is essential, some kind of compromise copyright system can be worked out, which permits everyone that freedom.
fr: Je ne peux pas dire que je suis sûr que dans tous ces domaines on ne peut pas apporter de progrès sans restriction de copyright pour bloquer les gens, mais ce que nous avons prouvé c'est que nous avons une chance&nbsp;: ce n'est pas une idée ridicule. Elle ne devrait pas être écartée. Le public ne devrait pas supposer que la seule façon d'obtenir le progrès est d'avoir du copyright. Mais même pour ce genre de travaux il peut y avoir quelques types de compromis avec le système de copyright, compatibles avec le fait de donner aux gens la liberté de publier des versions modifiées. Regardez par exemple, la documentation libre de la licence GNU utilisée pour fabriquer un livre libre. Elle permet à n'importe qui de faire et de vendre des copies d'une version modifiée, mais elle exige de donner du crédit d'une certaine manière aux auteurs et éditeurs d'origine d'une façon qui leur donne un avantage commercial, et ainsi je crois rendre possible la publication commerciale des manuels libres. Et ça fonctionne, les gens commencent tout juste à l'essayer commercialement. La Free Software Foundation a vendu un bon nombre de copies de divers livres libres pendant presque quinze ans maintenant, et cela a été un succès pour nous. En ce moment, cependant, les éditeurs commerciaux commencent tout juste à essayer cette approche particulière, mais je crois que même pour ces travaux fonctionnels où la liberté de publier des travaux modifiés est essentielle, un certain genre de compromis avec le système de copyright peut être trouvé, qui permet à chacun cette liberté.

source: For other kinds of works, the ethical questions apply differently, because the works are used differently. The second category of works is works that express someone's positions or views or experiences. For example, essays, offers to do business with people, statements of one's legal position, memoirs, anything that says, whose point is to say what you think or you want or what you like. Book reviews and restaurant reviews are also in this category: it's expressing a personal opinion or position. Now for these kinds of works, making a modified version is not a useful thing to do. So I see no reason why people should need to have the freedom to publish modified versions of these works. Verbatim copying is the only thing that people need to have the freedom to do and because of this we can consider the idea that the freedom to distribute copies should only apply in some situations, for example if it were limited to non-commercial distribution that would be OK I think. Ordinary citizen's lives would no longer be restricted but publishers would still be covered by copyright for these things.
fr: Pour d'autres genres de travaux, les questions d'&eacute;thique s'appliquent diff&eacute;remment, parce que les travaux sont utilis&eacute;s diff&eacute;remment. La seconde cat&eacute;gorie de travaux est celle des travaux qui expriment la position de quelqu'un ou ses points de vue ou ses exp&eacute;riences. Par exemple, essais, propositions d'affaires, d&eacute;clarations de sa situation l&eacute;gale, m&eacute;moires, tout ce qui est dit, dont la question est de dire ce que vous pensez ou ce que vous aimez. Les revues litt&eacute;raires, les revues h&ocirc;teli&egrave;res sont aussi dans cette cat&eacute;gorie&nbsp;: ils expriment une opinion personnelle, un point de vue. Maintenant pour ce genre de travaux, faire une version modifi&eacute;e n'est pas une chose utile. Aussi, je ne vois pas de raison &agrave; ce que les gens aient la libert&eacute; de publier des versions modifi&eacute;es de ces travaux. La copie int&eacute;grale est la seule chose que les gens ont besoin d'avoir la libert&eacute; de faire et pour cette raison nous pouvons consid&eacute;rer l'id&eacute;e que la libert&eacute; de distribuer des copies ne devrait s'appliquer que dans certaines situations, par exemple si c'&eacute;tait limit&eacute; &agrave; la distribution non-commerciale ce serait pas mal, je pense. La vie des citoyens ordinaires ne serait plus restreinte, mais les &eacute;diteurs voudraient &ecirc;tre encore couvert par le copyright pour &ccedil;a.

source: <em>[drinks water]</em>
fr: <em>[il boit de l'eau]</em>

source: Now, I used to think that maybe it would be good enough to allow people to privately redistribute copies occasionally. I used to think that maybe it would be OK if all public redistribution were still restricted by copyright for these works but the experience with Napster has convinced me that that's not so. And the reason is that it shows that lots and lots of people both want to publicly redistribute&mdash;publicly but not commercially redistribute&mdash;and it's very useful. And if it's so useful, then it's wrong to stop people from doing it. But it would still be acceptable I think, to restrict commercial redistribution of this work, because that would just be an industrial regulation and it wouldn't block the useful activities that people should be doing with these works.
fr: Maintenant, je pensais que peut-&ecirc;tre il serait suffisant de permettre aux gens de redistribuer en priv&eacute; des copies &agrave; l'occasion. Je pensais que peut-&ecirc;tre &ccedil;a serait pas mal si toutes les redistributions publiques &eacute;taient encore limit&eacute;es par copyright pour ce genre de travaux, mais l'exp&eacute;rience avec Napster m'a convaincu que non. Et la raison est que cela montre que beaucoup, beaucoup de gens veulent redistribuer de fa&ccedil;on publique &mdash; redistribuer publiquement mais pas commercialement &mdash; et c'est tr&egrave;s utile. Et si c'est si utile, c'est une erreur d'arr&ecirc;ter les gens de le faire. Mais cela serait encore acceptable je pense, de limiter la redistribution commerciale de ces travaux, parce que cela serait juste une r&eacute;gulation industrielle et &ccedil;a ne bloquerait pas les activit&eacute;s utiles que les gens devraient faire avec ces travaux.

source: Oh, also, scientific papers. Or scholarly papers in general fall into this category because publishing modified versions of them is not a good thing to do: it's falsifying the record so they should only be distributed verbatim, so scientific papers should be freely redistributable by anyone because we should be encouraging their redistribution, and I hope you will never agree to publish a scientific paper in a way that restricts verbatim redistribution on the net. Tell the journal that you won't do that.
fr: Ah, aussi, les documents scientifiques, ou les documents &eacute;rudits en g&eacute;n&eacute;ral tombent dans cette cat&eacute;gorie parce que la publication de leurs versions modifi&eacute;es n'est pas une bonne chose &agrave; faire&nbsp;: cela fausse le registre; elles devraient donc &ecirc;tre distribu&eacute;es uniquement dans leur int&eacute;gralit&eacute;. Ainsi les documents scientifiques devraient &ecirc;tre redistributable librement par n'importe qui parce que nous devrions encourager leur redistribution, et j'esp&egrave;re que vous n'accepterez jamais de publier un document scientifique d'une fa&ccedil;on qui limiterait sa redistribution int&eacute;grale sur le net. Dites au journal que vous ne ferez pas cela.

source: Because scientific journals have become an obstacle to the dissemination of scientific results. They used to be a necessary mechanism. Now they are nothing but an obstruction, and those journals that restrict access and restrict redistribution <em>[emphasis]</em> must be abolished. They are the enemies of the dissemination of knowledge; they are the enemies of science, and this practice must come to an end.
fr: Parce que les journaux scientifiques sont devenus un obstacle &agrave; la diffusion des r&eacute;sultats scientifiques. Ils &eacute;taient un m&eacute;canisme n&eacute;cessaire. Maintenant ils ne sont rien d'autre qu'une obstruction. Et ces journaux qui limitent l'acc&egrave;s et limitent la redistribution <em>[insistance]</em> doivent &ecirc;tre supprim&eacute;s. Ils sont les ennemis de la diffusion de la connaissance; ils sont les ennemis de la science, et cette pratique doit cesser.

source: Now there is a third category of works, which is aesthetic works, whose main use is to be appreciated; novels, plays, poems, drawings in many cases, typically and most music. Typically it's made to be appreciated. Now, they're not functional people don't have the need to modify and improve them, the way people have the need to do that with functional works. So it's a difficult question: is it vital for people to have the freedom to publish modified versions of an aesthetic work. On the one hand you have authors with a lot of ego attachment saying
fr: Il y a maintenant une troisi&egrave;me cat&eacute;gorie de travaux, qui est celle des travaux esth&eacute;tiques, dont l'utilisation principale est d'&ecirc;tre appr&eacute;ci&eacute;e: romans, jeux, po&eacute;sies, graphismes dans beaucoup de cas, et musiques pour la plupart. C'est typiquement fait pour &ecirc;tre appr&eacute;ci&eacute;. Maintenant, ils ne sont pas fonctionnels; les gens n'ont pas la n&eacute;cessit&eacute; de les modifier et de les am&eacute;liorer, comme c'est n&eacute;cessaire avec les travaux fonctionnels. Aussi c'est une question difficile&nbsp;: il est essentiel pour les gens d'avoir la libert&eacute; de publier des versions modifi&eacute;es d'un travail esth&eacute;tique. D'une part vous avez des auteurs qui font preuve de pas mal d'&eacute;gotisme.

source: <em>[English accent, dramatic gesture]</em>
fr: <em>[accent anglais, gestuelle dramatique]</em>

source: &ldquo;Oh this is my creation.&rdquo;
fr: &laquo;&nbsp;Oh, c'est ma cr&eacute;ation.&nbsp;&raquo;

source: <em>[Back to Boston]</em>
fr: <em>[retour &agrave; Boston]</em>

source: &ldquo;How dare anyone change a line of this?&rdquo; On the other hand you have the folk process which shows that a series of people sequentially modifying the work or maybe even in parallel and then comparing versions can produce something tremendously rich, and not only beautiful songs and short poems, but even long epics have been produced in this way, and there was a time back before the mystique of the artist as creator, semi-divine figure was so powerful when even great writers reworked stories that had been written by others. Some of the plays of Shakespeare involve stories that were taken from other plays written often a few decades before. If today's copyright laws had been in effect they would have called Shakespeare a quote pirate unquote for writing some of his great work and so of course you would have had the other authors saying
fr: &laquo;&nbsp;Qui oserait en changer une ligne&nbsp;?&nbsp;&raquo;. De l'autre c&ocirc;t&eacute;, vous avez le processus folklorique qui prouve qu'une s&eacute;rie de personnes modifiant un travail de fa&ccedil;on s&eacute;quentielle, ou peut-&ecirc;tre m&ecirc;me en parall&egrave;le et en comparant alors les versions, peut produire quelque chose d'extr&ecirc;mement riche. Et non seulement de belles chansons et de courtes po&eacute;sies, mais m&ecirc;me de longues &eacute;pop&eacute;es ont &eacute;t&eacute; produites de cette fa&ccedil;on. Il y e&ucirc;t un temps d&eacute;j&agrave;, avant que la mystique de l'artiste cr&eacute;ateur &mdash; figure semi-divine &mdash; ait tant de pouvoir, o&ugrave; m&ecirc;me de grands &eacute;crivains ont retouch&eacute; des histoires qui avaient &eacute;t&eacute; &eacute;crites par d'autres. Certaines sc&egrave;nes de Shakespeare nouent des intrigues qui ont &eacute;t&eacute; tir&eacute;es de sc&egrave;nes &eacute;crites souvent plusieurs d&eacute;cennies auparavant. Si les lois contemporaines sur le copyright avaient &eacute;t&eacute; effectives, ils auraient appell&eacute; Shakespeare entre guillemets&nbsp;: &laquo;&nbsp;pirate&nbsp;&raquo; pour avoir &eacute;crit ainsi une partie de son immense travail, et &eacute;videmment vous auriez eu les dires des autres auteurs.

source: <em>[English accent]</em>
fr: <em>[accent anglais]</em>

source: &ldquo;How dare he change one line of my creation. He couldn't possibly make it better.&ldquo;
fr: &laquo;&nbsp;Comment ose-t-il changer une ligne de ma cr&eacute;ation. Il est impossible de le faire mieux.&nbsp;&raquo;

source: <em>[faint audience chuckle]</em>
fr: <em>[faible brouhaha de l'assistance]</em>

source: You'll hear people ridiculing this idea in exactly those terms. Well, I am not sure what we should do about publishing modified versions of these aesthetic works. One possibility is to do something like what is done in music, which is anyone's allowed to rearranged and play a piece of music, but they may have to pay for doing so, but they don't have to ask permission to perform it. Perhaps for commercial publication of these works, either modified or unmodified, if they're making money they might have to pay some money, that's one possibility. It's a difficult question what to do about publishing modified versions of these aesthetic works and I don't have an answer that I'm fully satisfied with.
fr: Vous entendrez des personnes ridiculiser l'id&eacute;e exactement dans ces termes. Bien. Je ne suis pas s&ucirc;r de ce que nous pourrions faire &agrave; propos de la publication de versions modifi&eacute;es des travaux esth&eacute;tiques. Une des possibilit&eacute;s est de faire comme ce qui est fait en musique, o&ugrave; n'importe qui peut en r&eacute;arranger et jouer un morceau. Ils peuvent avoir &agrave; payer pour &ccedil;a, mais ils n'ont pas &agrave; demander la permission de l'ex&eacute;cuter. Peut-&ecirc;tre que pour la publication commmerciale de ces travaux, modifi&eacute;s ou non, s'ils font de l'argent avec, ils pourraient devoir payer une certaine somme d'argent. C'est une possibilit&eacute;. C'est une question difficile de savoir quoi faire au sujet de la publication de versions modifi&eacute;es de ces travaux esth&eacute;tiques, et je n'ai pas de r&eacute;ponse dont je suis enti&egrave;rement satisfait.

source: <strong>Audience member 1 (AM1)</strong>, question, inaudible
fr: Un membre de l'audience pose une question (MA1), inaudible.

source: <strong>RMS</strong>: Let me repeat the question because he said it so fast you couldn't possibly have understood it. He said &ldquo;What kind of category should computer games go in?&rdquo; Well, I would say that the game engine is functional and the game scenario is aesthetic.
fr: <strong>RMS</strong>&nbsp;: Laissez-moi r&eacute;p&eacute;ter la question parce qu'il l'a dite tellement vite que vous ne pouviez pas l'avoir comprise. Il a dit &laquo;&nbsp;dans quel genre de cat&eacute;gorie rentrent les jeux d'ordinateur&nbsp;?&nbsp;&raquo; Bien, je dirais que le moteur de jeu est fonctionnel et que le sc&eacute;nario est esth&eacute;tique.

source: <strong>AM1</strong>: Graphics?
fr: <strong>MA1</strong>&nbsp;: Et les graphismes&nbsp;?

source: <strong>RMS</strong>: Those are part of the scenario probably. The specific pictures are part of the scenario; they are aesthetic, whereas the software for displaying the scenes is functional. So I would say that if they combine the aesthetic and the functional into one seamless thing then the software should be treated as functional, but if they're willing to separate the engine and the scenario then it would be legitimate to say, well the engine is functional but the scenario is aesthetic.
fr: <strong>RMS</strong>&nbsp;: Ceux-ci font probablement partie du sc&eacute;nario. Les images sp&eacute;cifiques font partie du sc&eacute;nario; elles sont esth&eacute;tiques, tandis que le logiciel pour visualiser les sc&egrave;nes est fonctionnel. Ainsi je dirais que si elles combinent l'esth&eacute;tique et le fonctionnel en une seule et m&ecirc;me chose continue, alors le logiciel est trait&eacute; comme fonctionnel. Mais si ellessont dispos&eacute;es &agrave; s&eacute;parer la machine et le sc&eacute;nario alors il serait l&eacute;gitime de dire, bien, que la machine est fonctionnelle mais le sc&eacute;nario esth&eacute;tique.

source: Copyright: possible solutions
fr: Copyright&nbsp;: les solutions possibles

source: Now, how long should copyright last? Well, nowadays the tendency in publishing is for books to go out of copyright faster and faster. Today in the US most books that are published are out of print within three years. They've been remaindered and they're gone. So it's clear that there's not real need for copyright to last for say 95 years: it's ridiculous. In fact, it's clear that ten year copyright would be sufficient to keep the activity of publishing going. But it should be ten years from date of publication, but it would make sense to allow an additional period before publication which could even be longer than ten years which as you see, as long as the book has not been published the copyright on it is not restricting the public. It's basically just giving the author to have it published eventually but I think that once the book is published copyright should run for some ten years or so, then that's it.
fr: Maintenant, combien de temps le copyright devrait-il durer&nbsp;? Et bien de nos jours la tendance dans l'&eacute;dition est, en ce qui concerne les livres, de s'&eacute;loigner du copyright de plus en plus vite. Aujourd'hui aux USA la plupart des livres qui sont &eacute;dit&eacute;s sortent du circuit de l'impression en moins de trois ans. Ils ont &eacute;t&eacute; sold&eacute;s et se retirent de la vente. Ainsi il est clair qu'on a r&eacute;ellement besoin que le copyright dure 95 ans par exemple&nbsp;: c'est ridicule. En fait, il est clair qu'un copyright de dix ans serait suffisant pour que l'activit&eacute; de l'&eacute;dition tienne le coup. Mais dix ans &agrave; partir de la date de publication. On comprendrait que puisse &ecirc;tre accord&eacute;e une p&eacute;riode additionnelle avant la publication, ce qui pourrait faire plus long que dix ans&nbsp;; comme vous le voyez aussi longtemps que le livre n'a pas &eacute;t&eacute; &eacute;dit&eacute;, le copyright sur lui ne limite pas le public. C'est juste &agrave; la base pour l'auteur le temps qu'il soit &eacute;dit&eacute;. Mais je pense qu'une fois que le livre est &eacute;dit&eacute;, le copyright devrait fonctionner pendant environ dix ans et c'est tout.

source: Now, I once proposed this in a panel where the other people were all writers. And one of them said: &ldquo;Ten year copyright? Why that's ridiculous! Anything more than five years is intolerable.&rdquo; He was an awardwinning science fiction writer who was complaining about the difficulty of retrouving, of pulling back, this is funny, French words are leaking into my English, of, of regaining the rights from the publisher who'd let his books go out of print for practical purposes but was dragging his heels about obeying the contract, which says that when the book is out of print the rights revert to the author.
fr: Maintenant, j'ai propos&eacute; &ccedil;a une fois dans un d&eacute;bat o&ugrave; les autres personnes &eacute;taient toutes des auteurs. Et l'un d'entre eux a dit&nbsp;: &laquo;&nbsp;dix ans de copyright&nbsp;? Pourquoi c'est ridicule&nbsp;! Quelque chose de plus de cinq ans est intol&eacute;rable.&nbsp;&raquo; C'&eacute;tait un auteur de science-fiction r&eacute;compens&eacute;, qui se plaignait des probl&egrave;mes du &nbsp;retrouving&nbsp;, du retrait &mdash; c'est dr&ocirc;le, des mots de fran&ccedil;ais s'infiltrent dans mon anglais &mdash; de, de regagner les droits de l'&eacute;diteur quand celui-ci a laiss&eacute; les livres sortir du circuit de l'impression pour des raisons pratiques mais qui tra&icirc;ne des pieds pour ob&eacute;ir au contrat, qui stipule que quand le livre est sorti, les droits retournent &agrave; l'auteur.
