Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-versus-community.*.po
Languages: fr

source: Now I believe there a people who are trying to set up such voluntary payment systems. I heard of something called the street performer's protocol. I don't know the details of it. And I believe there is something called GreenWitch.com <em>[transcriber's note: URL uncertain]</em> I believe the people there are trying to set up something more or less like this. I think that what they are hoping to do is collect a bunch of payments that you make to various different people, and eventually charge your credit card once it gets to be big enough so that it's efficient. Whether those kind of systems work smoothly enough in practice that they'll get going is not clear, and whether they will become adopted widely enough for them to become a normal cultural practice is not clear. It may be that in order for these voluntary payments to truly catch on we need to have some kind of&hellip; you need to see the idea everywhere in order to&hellip; &ldquo;Yeah, I outta pay&ldquo; once in a while. We'll see.
fr: Maintenant je crois qu'il y a des gens qui essayent d'installer de genre de syst&egrave;mes volontaires de paiement. J'ai entendu parler de quelque chose appel&eacute; &laquo;&nbsp;le protocole de l'artiste de rue&nbsp;&raquo;. Je n'en connais pas les d&eacute;tails. Et je crois qu'il y a quelque chose appel&eacute; GreenWitch.com <em>[la note du transcripteur&nbsp;: URL incertaine]</em>. Je crois que ces gens essayent d'installer quelque chose de plus ou moins comme &ccedil;a. Je pense que ce qu'il esp&egrave;rent faire, c'est de rassembler un bouquet de paiements que vous effectuez &agrave; diverses personnes, et charger &eacute;ventuellement par la suite votre carte de cr&eacute;dit une fois qu'il est assez important pour &ecirc;tre efficace. Si ce genre de syst&egrave;me fonctionne sans heurt dans la pratique, ce qu'ils vont devenir n'est pas clair; et s'ils sont adopt&eacute;s assez largement, &agrave; ce qu'ils deviennent une pratique culturelle normale n'est pas clair. Il est possible que pour que ces paiements volontaires se propagent vraiment, nous ayons besoin d'un certain genre de&hellip; vous avez besoin de voir l'id&eacute;e partout pour&hellip;&laquo;&nbsp;ouais, j'ai pas &agrave; payer&nbsp;!&nbsp;&raquo; de temps &agrave; autre. On verra.

source: There is evidence ideas like this are not unreasonable. If you look at for example public radio in the US, which is mostly supported by donations from listeners, you have I believe, millions of people donating, I'm not sure how many exactly but there are many public radio stations which are supported by their listeners and they seem to be finding it easier to get donations as time goes on. Ten years ago they would have maybe six weeks of the year when they were spending most of their time asking people &ldquo;Please send some money, don't you think we're important enough&rdquo; and so on 24 hours a day, and now a lot of them have found that they can raise the contributions by sending people mail who sent them donations in the past, and they don't have to spend their airtime drumming up the donations.
fr: Il est &eacute;vident que des id&eacute;es comme celles-l&agrave; ne sont pas d&eacute;raisonnables. Si vous regardez par exemple la radio publique aux USA, qui est la plupart du temps soutenue par les dons de ses auditeurs. Vous avez, je crois, des millions de personnes qui donnent. Je ne sais pas combien exactement mais il y a beaucoup de stations de radio publiques qui sont soutenues par leurs auditeurs. Et il semble qu'elles trouvent plus facile d'obtenir des dons au fil des ans. Il y a dix ans elles auraient eu peut-&ecirc;tre six semaines par an &agrave; passer la majeure partie du temps &agrave; demander aux gens &laquo;&nbsp;d'envoyer svp un peu d'argent, vous ne pensez pas que nous sommes assez importants pour vous&nbsp;&raquo; et ainsi de suite 24 heures sur 24. Et maintenant beaucoup d'entre elles ont constat&eacute; qu'elles peuvent augmenter les contributions en envoyant des mails aux gens qui leur ont envoy&eacute; des dons par le pass&eacute;. Et elles n'ont pas &agrave; d&eacute;penser leur temps d'antenne &agrave; racoler pour les dons.

source: Fundamentally, the stated purpose of copyright: to encourage righting is a worthwhile purpose, but we have to look at ways of ways to achieve it that are not so harsh, and not so constricting of the use of the works whose developments we have encouraged and I believe that digital technology is providing us with solutions to the problem as well as creating a context where we need to solve the problem. So that's the end of this talk, and are there questions?
fr: Fondamentalement, le but d&eacute;clar&eacute; du copyright&nbsp;: encourager le redressement est un but valable, mais nous devons examiner les fa&ccedil;ons d'y parvenir qui ne sont pas si dures, et sans trop restreindre l'utilisation des travaux dont nous avons encourag&eacute; les d&eacute;veloppements. Et je crois que la technologie num&eacute;rique nous fournit des solutions au probl&egrave;me en plus de cr&eacute;er le contexte o&ugrave; nous devons r&eacute;soudre le probl&egrave;me. Aussi c'est la fin de cet entretien; et il a des questions&nbsp;?

source: Questions and discussion
fr: Questions et discussion

source: First of all, what time is the next talk? What time is it now?
fr: Tout d'abord, quand est le prochain entretien&nbsp;? Quelle heure est-il maintenant&nbsp;?

source: <strong>Me</strong>: The time is quarter past three.
fr: <strong>Moi</strong>&nbsp;: Il est trois heures et quart.

source: <strong>RMS</strong>: Oh really? So I'm late already? Well I hope Melanie will permit me to accept a few questions.
fr: <strong>RMS</strong>&nbsp;: Oh vraiment&nbsp;? Donc je suis d&eacute;j&agrave; en retard&nbsp;? Bon, j'esp&egrave;re que M&eacute;lanie me permettra d'accepter quelques questions.

source: <strong>AM6</strong> (Audience member 6): Who will decide in which of your three categories will a work fit?
fr: <strong>MA6</strong>&nbsp;: Qui d&eacute;cidera dans lesquelles de vos trois cat&eacute;gories un travail rentrera&nbsp;?

source: <strong>RMS</strong>: I don't know. I'm sure there are various ways of deciding. You can probably tell a novel when you see one. I suspect judges can tell a novel when they see one too.
fr: <strong>RMS</strong>&nbsp;: Je ne sais pas. Je suis s&ucirc;r qu'il y a diverses mani&egrave;res de d&eacute;cider. Vous pouvez probablement reconna&icirc;tre un roman quand vous en voyez un. Je subodore que les juges peuvent aussi reconna&icirc;tre un roman quand ils en voient un.

source: <strong>AM7</strong>: Any comment on encryption? And the interaction of encryption devices with copyrighted materials?
fr: <strong>MA7</strong>&nbsp;: Des commentaires sur le chiffrement&nbsp;? Et sur l'interaction des dispositifs de chiffrement avec les contenus sous copyright&nbsp;?

source: <strong>RMS</strong>: Well, encryption is being used as a means of controlling the public. The publishers are trying to impose various encryption systems on the public so that they can block the public from copying. Now they call these things technological methods, but really they all rest on laws prohibiting people from by-passing them, and without those laws none of these methods would accomplish its purpose, so they are all based on direct government intervention to stop people from copying and I object to them very strongly, and I will not accept those media. If as a practical matter the means to copy something are not available to me I won't buy it, and I hope you won't buy it either.
fr: <strong>RMS</strong>&nbsp;: Bon, le chiffrement est employ&eacute; en tant que moyen pour contr&ocirc;ler le public. Les &eacute;diteurs essayent d'imposer divers syst&egrave;mes de chiffrement au public afin de l'emp&ecirc;cher de copier. Maintenant ils appellent ces choses des m&eacute;thodes technologiques, mais r&eacute;ellement elles s'appuient toutes sur des lois interdisant aux gens de les contourner. Et sans ces lois aucune de ces m&eacute;thodes n'accomplirait son but. Aussi elles sont toutes sont bas&eacute;es sur l'interposition directe du gouvernement pour que les gens arr&ecirc;tent de copier. Et je m'oppose &agrave; elles tr&egrave;s fortement, et je n'accepterai pas ces m&eacute;dias. Si pour une question pratique les moyens de copier quelque chose ne sont pas &agrave; ma disposition je ne l'ach&egrave;terai pas. Et j'esp&egrave;re que vous ne l'ach&egrave;terez pas non plus.

source: <strong>AM8</strong>: In France we have a law that says that even if the media is protected you have the right to copy again for backup purpose
fr: <strong>MA8</strong>&nbsp;: En France nous avons une loi qui dit que m&ecirc;me si le support est prot&eacute;g&eacute; vous avez le droit de le copier &agrave; nouveau pour le sauvegarder.

source: <strong>RMS</strong>: Yes it used to be that way in the US as well until 2 years ago.
fr: <strong>RMS</strong>&nbsp;: Oui, c'&eacute;tait aussi comme &ccedil;a aux USA jusqu'&agrave; il y a deux ans.

source: <strong>AM8</strong>: Very often you sign an agreement that is illegal in France&hellip; the contract you are supposed to sign with a mouse&hellip;
fr: <strong>MA8</strong>&nbsp;: Tr&egrave;s souvent vous signez un accord qui est ill&eacute;gal en France&hellip; le contrat que vous &ecirc;tes cens&eacute; signer avec une souris&hellip;

source: <strong>RMS</strong>: Well, maybe they're not.
fr: <strong>RMS</strong>&nbsp;: Bien, peut-&ecirc;tre qu'ils ne le sont pas.

source: <strong>AM8</strong>: How can we get it challenged?
fr: <strong>MA8</strong>&nbsp;: Comment pouvons-nous le contester&nbsp;?

source: <strong>RMS</strong>: <em>[rhetorically]</em> Well are you going to challenge them? It costs money, it takes trouble, and not only that, how would you do it? Well, you could either try to go to a court and say, &ldquo;They have no right to ask people to sign this contract because it is an invalid contract&rdquo; but that might be difficult if the distributor is in the US. French law about what is a valid contract couldn't be used to stop them in the US. On the other hand you could also say &ldquo;I signed this contract but it's not valid in France so I am publicly disobeying, and I challenge them to sue me.&rdquo; Now that you might consider doing, and if you're right and the laws are not valid in France then the case would get thrown out. I don't know. Maybe that is a good idea to do, I don't know whether, what its effects politically would be. I know that there was just a couple of years ago a law was passed in Europe to prohibit some kind of private copying of music, and the record companies trotted out some famous very popular musicians to push for this law and they got it, so it's clear that they have a lot of influence here too, and it's possible that they will get more, just pass another law to change this. We have to think about the political strategy for building the constituency to resist such changes and the actions we take should be designed to accomplish that. Now, I'm no expert on how to accomplish that in Europe but that's what people should think about.
fr: <strong>RMS</strong>&nbsp;: <em>[rhéthoriquement]</em> Bien, vous allez les contester&nbsp;? Ca co&ucirc;te de l'argent, il faut se donner du mal, et pas seulement &ccedil;a. Comment le feriez-vous&nbsp;? Bon, vous pourriez toujours aller au tribunal et dire, &laquo;&nbsp;ils n'ont aucun droit de demander &agrave; des personnes de signer ce contrat parce que c'est un contrat invalide&nbsp;&raquo; mais &ccedil;a pourrait &ecirc;tre difficile si le distributeur est aux USA. La loi fran&ccedil;aise au sujet de ce qui est un contrat valide ne pourrait pas &ecirc;tre utilisée pour les arr&ecirc;ter aux USA. D'autre part vous pourriez &eacute;galement dire que &laquo;&nbsp;j'ai sign&eacute;ce contrat mais il n'est pas valide en France, aussi je d&eacute;sob&eacute;is publiquement et je les d&eacute;fie de me poursuivre&nbsp;&raquo;. Maintenant si c'est ce que vous envisagez de faire, si vous avez raison et si les lois ne sont pas valides en France alors le cas serait rejet&eacute;. Je ne sais pas. Peut-&ecirc;tre que c'est une bonne id&eacute;e. Je ne sais pas quels en seraient les effets politiques. Je sais qu'il y a juste deux ans une loi a &eacute;t&eacute; vot&eacute;e en Europe pour interdire un certain genre de copie priv&eacute;e pour la musique, et les compagnies d'enregistrement ont rab&acirc;ch&eacute; &agrave; quelques musiciens c&eacute;l&egrave;bres tr&egrave;s populaires de faire pression sur cette loi, et ils l'ont obtenue. Aussi, il est clair qu'ils ont beaucoup d'influence ici aussi, et il est possible qu'ils en obtiendront plus, voter justement une autre loi pour changer &ccedil;a. Nous devons penser &agrave; une strat&eacute;gie politique pour construire un coll&egrave;ge &eacute;lectoral qui puisse r&eacute;sister &agrave; de tels changements. Et les mesures que nous prenons devraient &ecirc;tre con&ccedil;ues pour accomplir &ccedil;a. Maintenant je ne suis pas un expert sur la fa&ccedil;on de le r&eacute;aliser en Europe, mais c'est &agrave; &ccedil;a que les gens devraient penser.

source: <strong>AM6</strong>: What about protection of private correspondence?
fr: <strong>MA6</strong>&nbsp;: Que dites-vous de la protection de la correspondance priv&eacute;e&nbsp;?

source: <strong>RMS</strong>: Well, if you're not <em>[emphasis]</em> publishing <em>[/emphasis]</em> it that's a completely different issue.
fr: <strong>RMS</strong>&nbsp;: Bien, si vous n'&ecirc;tes pas <em>[emphase]</em> publi&eacute; <em>[/emphase]</em>, c'est une question compl&egrave;tement diff&eacute;rente.

source: <strong>AM6</strong>: No, but if I send an email to somebody, that's automatically under my copyright.
fr: <strong>MA6</strong>&nbsp;: Non, mais si j'envoie un email &agrave; quelqu'un, c'est automatiquement sous mon copyright.

source: <strong>RMS</strong>: <em>[forcefully]</em> That's entirely irrelevant actually.
fr: <strong>RMS</strong>&nbsp;: <em>[&eacute;nergiquement]</em> C'est enti&egrave;rement non pertinent en r&eacute;alit&eacute;.

source: <strong>AM6</strong>: No, I don't accept that. If they're going to publish it in a newspaper. At the moment my redress is my copyright.
fr: <strong>MA6</strong>&nbsp;: Non, je ne l'accepte pas. S'ils vont l'&eacute;diter dans un journal, &agrave; ce moment l&agrave; mon recours est mon copyright.

source: <strong>RMS</strong>: Well, you can't make him keep secret the contents and I'm not sure actually. I mean to me, I think there's some injustice in that. If you for example, send a letter to somebody threatening to sue him and then you tell him you can't tell anybody I did this because my threat is copyrighted, that's pretty obnoxious, and I'm not sure that it would even be upheld.
fr: <strong>RMS</strong>&nbsp;: Bien, vous ne pouvez pas lui faire tenir secret les contenus et je n'en suis pas s&ucirc;r r&eacute;ellement. Je veux dire, je pense qu'il y a de l'injustice &agrave; cela. Si par exemple vous envoyez une lettre &agrave; quelqu'un mena&ccedil;ant de le poursuivre en justice, et alors vous lui dites que vous ne pouvez dire &agrave; personne que c'est moi qui l'ai fait parce que ma menace est garantie par les droits d'auteur, &ccedil;a serait assez d&eacute;sagr&eacute;able. Et je ne suis pas s&ucirc;r que cela serait m&ecirc;me confirm&eacute;.

source: <strong>AM6</strong>: Well, there are circumstances where I want to correspond with someone and keep my (and their) reply, entirely private.
fr: <strong>MA6</strong>&nbsp;: Bon, il y a des circonstances o&ugrave; je veux correspondre avec quelqu'un et garder ma (et leur) r&eacute;ponse, enti&egrave;rement priv&eacute;e.

source: <strong>RMS</strong>: Well if you and they agree to keep it private, then that's a different matter entirely. I'm sorry the two issues can not be linked, and I don't have time to consider that issue today. There's another talk scheduled to start soon. But I think it is a total mistake for copyright to apply to such situations. The ethics of those situations are completely different from the ethics of published works and so they should be treated in an appropriate way, which is completely different.
fr: <strong>RMS</strong>&nbsp;: Bien, si vous et eux acceptez de la maintenir priv&eacute;, alors c'est une question enti&egrave;rement diff&eacute;rente. Je suis d&eacute;sol&eacute; que les deux questions ne puissent pas &ecirc;tre li&eacute;es, et je n'ai pas le temps de consid&eacute;rer cette question aujourd'hui. Il y a un autre entretien programm&eacute; pour commencer bient&ocirc;t. Mais je pense que c'est une erreur totale que le copyright s'applique &agrave; de telles situations. L'&eacute;thique de ces situations est compl&egrave;tement diff&eacute;rente de l'&eacute;thique des travaux publi&eacute;s. Et elles devraient &ecirc;tre trait&eacute;es d'une mani&egrave;re appropri&eacute;e, qui est compl&egrave;tement diff&eacute;rente.

source: <strong>AM6</strong>: That's fair enough, but at the moment the only redress one has is copyright&hellip;
fr: <strong>MA6</strong>&nbsp;: C'est assez loyal, mais pour l'instant le seul recours est le copyright&hellip;

source: <strong>RMS</strong>: <em>[interrupts]</em> No you're wrong. If people have agreed to keep something private then you have other redress. In Europe there are privacy laws, and the other thing is, you don't have a right to force someone to keep secrets for you. At most, you could force him to paraphrase it, because he has a right to tell people what you did.
fr: <strong>RMS</strong>&nbsp;: <em>[il interrompt]</em> Non, vous avez tort. Si les gens sont d'acccord pour garder quelque chose secret alors vous avez un autre recours. En Europe il y a des lois sur la vie priv&eacute;e. Et l'autre chose, est que vous ne pouvez pas avoir le droit de forcer quelqu'un &agrave; garder des secrets pour vous. Tout au plus, vous pourriez le forcer &agrave; paraphraser, parce qu'il a le droit de dire aux gens ce que vous faites.

source: <strong>AM6</strong>: Yes, but I assuming that the two people at either end are both in reasonable agreement.
fr: <strong>MA6</strong>&nbsp;: Oui, mais en supposant que les deux personnes &agrave; chaque extr&eacute;mit&eacute; sont toutes deux d'accord de fa&ccedil;on raisonnable.

source: <strong>RMS</strong>: Well then, don't say that copyright is your only recourse. If he's in agreement he isn't going to give it to a newspaper is he?
fr: <strong>RMS</strong>&nbsp;: Bien et alors, ne d&icirc;tes pas que le copyright est votre seul recours. S'il est d'accord il ne va pas le donner &agrave; un journal, si&nbsp;?

source: <strong>AM6</strong>: No, er, you're sidestepping my question about interception.
fr: <strong>MA6</strong>&nbsp;: Non, heu, vous &eacute;vitez ma question au sujet de l'interception.

source: <strong>RMS</strong>: Oh interception. That's a totally different&hellip; <em>[heatedly]</em> no you didn't ask about interception. This is the first time you mentioned interception&hellip;
fr: <strong>RMS</strong>&nbsp;: Oh, interception. C'est compl&egrave;tement diff&eacute;rent&hellip; <em>[&acirc;prement]</em> non vous n'avez pas demand&eacute; &agrave; propos de l'interception. C'est la premi&egrave;re fois que vous avez mentionn&eacute; l'interception&hellip;

source: <strong>AM6</strong>: No it's the second time.
fr: <strong>MA6</strong>&nbsp;: Non c'est la deuxi&egrave;me fois.

source: <strong>AM9</strong>: <em>[murmurs assent to AM6]</em>
fr: <strong>MA9</strong>&nbsp;: <em>[murmure son assentiment &agrave; MA6]</em>

source: <strong>RMS</strong>: <em>[still heated]</em> Well I didn't hear you before&hellip; it's totally silly&hellip; it's like trying to&hellip; oh how can I compare?&hellip; it's like trying to kill an elephant with a waffle iron I mean they have nothing to do with each other.
fr: <strong>RMS</strong>&nbsp;: <em>[toujours irrit&eacute;]</em> Je ne vous avais pas entendu avant&hellip; c'est totalement idiot&hellip; c'est comme essayer de&hellip; oh &agrave; quoi puis-je comparer&nbsp;?&hellip;c'est comme essayer de tuer un &eacute;l&eacute;phant avec un moule &agrave; gaufres, je veux dire qu'ils n'ont rien &agrave; faire l'un avec l'autre.

source: <em>[uninterpretable silence falls]</em>
fr: <em>[un ininterpr&eacute;table silence tombe]</em>

source: <strong>AM10</strong>: Have you thought about changes <em>[inaudible, in trade secrets?]</em>
fr: <strong>MA10</strong>&nbsp;: Vous avez pens&eacute; aux changements <em>[inaudible, des secrets commerciaux&nbsp;?]</em>

source: <strong>RMS</strong>: Uh yes: Trade secrets has developed in a very ominous and menacing direction. It used to be that trade secrecy meant that you wanted to keep something secret so you didn't tell anybody, and later on it was something that was done within a business telling just a few people something and they would agree to keep it secret. But now, it's turning into something where the public in general is becoming conscripted into keeping secrets for business even if they have never agreed in any way to keep these secrets and that's a pressure. So those who pretend that trade secrecy is just carrying out some natural right of theirs; that's just not true any more. They're getting explicit government help in forcing other people to keep their secrets. And we might want to consider whether non-disclosure agreements should in general be considered legitimate contracts because of the anti-social nature of trade secrecy it shouldn't be considered automatic that just because somebody has promised to keep a secret that that means it's binding.
fr: <strong>RMS</strong>&nbsp;: hmm, oui&nbsp;: les secrets commerciaux se sont d&eacute;velopp&eacute;s dans une direction inqui&eacute;tante et mena&ccedil;ante. Le secret commercial signifiait que vous vouliez maintenir secret quelque chose, donc vous ne l'avez dit &agrave; personne, et plus tard, &ccedil;a s'est fait dans les affaires de dire juste &agrave; quelques personnes quelque chose et ils devaient accepter de le maintenir secret. Mais maintenant, &ccedil;a prend une tournure o&ugrave; le public en g&eacute;n&eacute;ral devient enr&ocirc;l&eacute; dans le fait de garder des secrets d'affaires, m&ecirc;me s'ils n'ont jamais convenu de quelque fa&ccedil;on que ce soit de garder ces secrets. Et c'est une pression. Ainsi &agrave; ceux qui feignent de croire que le secret commercial est juste un transposition sur l'ext&eacute;rieur de certains de leurs droits, ce n'est justement pas vrai. Ils obtiennent l'aide explicite du gouvernement en vigueur en for&ccedil;ant les autres personnes &agrave; garder leurs secrets. Et nous pourrions nous demander si les accords de non-divulgation devraient d'une fa&ccedil;on g&eacute;n&eacute;rale &ecirc;tre consid&eacute;r&eacute;s comme des contrats l&eacute;gitimes &agrave; cause de la nature antisociale du secret commercial. Il ne devrait pas &ecirc;tre consid&eacute;r&eacute; comme automatique, juste parce que quelqu'un a promis de garder un secret, que c'est obligatoire.
