Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-and-globalization.*.po
Languages: fr

source: <b>STALLMAN</b>: I agree that shortening the time span of copyright is a good idea. There is absolutely no need in terms of encouraging publication for a possibility of copyrights' lasting as much as 150 years, which, in some cases, it can under present law. Now the companies were saying that a 75-year copyright on a work made for hire was not long enough to make possible the production of their works. I'd like to challenge those companies to present projected balance sheets for 75 years from now to back up that contention. What they really wanted was just to be able to extend the copyrights on the old works, so that they can continue restricting the use of them. But how you can encourage greater production of works in the 1920s by extending copyright today escapes me, unless they have a time machine somewhere. Of course, in one of their movies, they had a time machine. So maybe that's what affected their thinking.
fr: <b>STALLMAN</b>&nbsp;: Je suis d'accord que raccourcir la dur&eacute;e du copyright est une bonne id&eacute;e. Il n'y absolument aucun besoin, pour encourager la publication, que le copyright dure jusqu'&agrave; 150 ans &mdash; ce qui est parfois le cas avec les lois actuelles. Certaines entreprises nous ont expliqu&eacute; qu'une p&eacute;riode de 75 ans de copyright ne suffisent pas &agrave; rendre possible la production d'une &oelig;uvre. Je les mets au d&eacute;fi de me pr&eacute;senter des livres de compte et des projections sur les 75 prochaines ann&eacute;es pour prouver cette assertion. Ce qu'elles recherchaient, en r&eacute;alit&eacute;, c'&eacute;tait &agrave; &eacute;tendre la dur&eacute;e du copyright portant sur les &oelig;uvres anciennes, afin de pouvoir continuer &agrave; en restreindre l'utilisation. Mais la mani&egrave;re dont on peut encourager la production d'&oelig;uvres dans les ann&eacute;es 1920 en &eacute;tendant la dur&eacute;e du copyright de nos jours m'&eacute;chappe et me d&eacute;passe totalement, &agrave; moins que ces entreprises ne disposent d'une machine &agrave; remonter dans le temps. Ah oui, en effet, elles ont une telle machine dans l'un de leurs films. C'est ce qui a d&ucirc; d&eacute;traquer leur raisonnement.

source: <b>QUESTION</b>: Have you given thought to extending the concept of &ldquo;fair use,&rdquo; and are there any nuances there that you might care to lay out for us?
fr: <b>QUESTION</b>&nbsp;: Avez-vous r&eacute;fl&eacute;chi &agrave; l'extension du concept de &laquo;&nbsp;l'usage loyal&nbsp;&raquo;, et avez-vous abouti &agrave; des conclusions et &agrave; des nuances que vous accepteriez de partager avec nous&nbsp;?

source: <b>STALLMAN</b>: Well, the idea of giving everyone permission for non-commercial verbatim copying of two kinds of works, certainly, may be thought of as extending what fair use is. It's bigger than what's fair use currently. If your idea is that the public trades away certain freedoms to get more progress, then you can draw the line at various, different places. Which freedoms does the public trade away and which freedoms does the public keep?
fr: <b>STALLMAN</b>&nbsp;: L'id&eacute;e d'autoriser toute copie exacte des &oelig;uvres appartenant &agrave; deux des trois cat&eacute;gories que j'ai d&eacute;finies peut &ecirc;tre consid&eacute;r&eacute;e comme une extension de l'usage loyal. C'est plus fort que l'usage loyal tel qu'il existe actuellement. Si vous pensez que le public abandonne certaines libert&eacute;s en &eacute;change d'un peu plus de progr&egrave;s, alors vous pouvez tracer la limite en plusieurs endroits diff&eacute;rents. Quelles libert&eacute;s abandonner, et quelles libert&eacute;s conserver&nbsp;?

source: <b>QUESTION</b>: To extend the conversation for just a moment, in certain entertainment fields, we have the concept of a public presentation. So, for example, copyright does not prevent us from singing Christmas carols seasonally but it prevents the public performance. And I'm wondering if it might be useful to think about instead of expanding fair use to unlimited, non-commercial, verbatim copying, to something less than that but more than the present concept of fair use.
fr: <b>QUESTION</b>&nbsp;: Pour &eacute;tendre un peu le champ de la conversation, je voudrais mentionner le concept de repr&eacute;sentation publique, dont on dispose dans certains domaines. Par exemple, les lois sur le copyright ne nous interdisent pas de chanter des chants de No&euml;l lorsque c'est la saison, mais elles interdisent toute repr&eacute;sentation publique. Et je me demande s'il ne pourrait pas &ecirc;tre utile, au lieu d'&eacute;tendre l'usage loyal sans limitation &agrave; toute copie exacte faite dans un contexte non commercial, de r&eacute;fl&eacute;chir &agrave; une solution interm&eacute;diaire entre cela et la situation actuelle.

source: <b>STALLMAN</b>: I used to think that that might be enough, and then Napster convinced me otherwise because Napster is used by its users for non-commercial, verbatim re-distribution. The Napster server, itself, is a commercial activity but the people who are actually putting things up are doing so non-commercially, and they could have done so on their websites just as easily. The tremendous excitement about, interest in, and use of Napster shows that that's very useful. So I'm convinced now that people should have the right to publicly non-commercially, re-distributed, verbatim copies of everything.
fr: <b>STALLMAN</b>&nbsp;: Je pensais que cela suffirait, mais Napster m'a convaincu du contraire, parce que Napster est utilis&eacute; dans le contexte d'une redistribution de copies verbatim de mani&egrave;re non commerciale. Le serveur de Napster, en lui-m&ecirc;me, est une activit&eacute; commerciale, mais les gens qui y d&eacute;posent des morceaux le font de mani&egrave;re non lucrative, et ils auraient tout aussi bien pu d&eacute;poser ces morceaux sur leur propre site web. L'incroyable excitation et l'int&eacute;r&ecirc;t suscit&eacute;s par Napster ont montr&eacute; la grande utilit&eacute; de ce mode de distribution. C'est pourquoi je suis d&eacute;sormais convaincu que les gens devraient avoir le droit de redistribuer publiquement et non commercialement des copies exactes de tout.

source: <b>QUESTION</b>: One analogy that was recently suggested to me for the whole Napster question was the analogy of the public library. I suppose some of you who have heard the Napster arguments have heard this analogy. I'm wondering if you would comment on it. The defenders of people who say Napster should continue and there shouldn't be restrictions on it sometimes say something like this: &ldquo;When folks go into the public library and borrow a book, they're not paying for it, and it can be borrowed dozens of times, hundreds of time, without any additional payment. Why is Napster any different?&rdquo;
fr: <b>QUESTION</b>&nbsp;: On m'a r&eacute;cemment sugg&eacute;r&eacute;, pour Napster, l'analogie de la biblioth&egrave;que publique. Je pense que ceux d'entre vous qui ont &eacute;cout&eacute; les arguments pr&eacute;sent&eacute;s par Napster ont entendu cette analogie. Je me demandais si vous souhaiteriez la commenter. Les d&eacute;fenseurs de ceux qui pensent que Napster devrait continuer et qu'il ne faut pas restreindre ce service disent parfois&nbsp;: &laquo;&nbsp;Quand on se rend dansune biblioth&egrave;que publique et qu'on emprunte un livre, on ne paie rien, et le m&ecirc;me livre peut &ecirc;tre emprunt&eacute; des dizaines voire des centaines de fois, sans argent &agrave; la clef. En quoi Napster est-il diff&eacute;rent&nbsp;?&nbsp;&raquo;.

source: <b>STALLMAN</b>: Well, it's not exactly the same. But it should be pointed out that the publishers want to transform public libraries into pay-per-use, retail outlets. So they're against public libraries.
fr: <b>STALLMAN</b>&nbsp;: Ce n'est pas exactement la m&ecirc;me chose. Mais il faut signaler que les &eacute;diteurs veulent transformer les biblioth&egrave;ques publiques en points de vente o&ugrave; on paie &agrave; chaque utilisation. Ils sont donc &eacute;galement oppos&eacute;s aux biblioth&egrave;ques publiques.

source: <b>QUESTION</b>: Can these ideas about copyright suggest any ideas for certain issues about patent law such as making cheap, generic drugs for use in Africa?
fr: <b>QUESTION</b>&nbsp;: Ces r&eacute;flexions sur le copyright peuvent-elles sugg&eacute;rer des id&eacute;es sur les probl&egrave;mes pos&eacute;s par les lois sur les brevets, notamment sur la possibilit&eacute; de fabriquer des m&eacute;dicaments g&eacute;n&eacute;riques et bon march&eacute; pour l'Afrique&nbsp;?

source: <b>STALLMAN</b>: No, there's absolutely no similarity. The issues of patents are totally different from the issues of copyrights. The idea that they have something to do with each other is one of the unfortunate consequences of using the term &ldquo;intellectual property&rdquo; and encouraging people to try to lump these issues together because, as you've heard, I've been talking about issues in which the price of a copy is not the crucial thing. But what's the crucial issue about making AIDS drugs for Africa? It's the price, nothing but the price.
fr: <b>STALLMAN</b>&nbsp;: Non, cela n'a rien &agrave; voir. Les probl&egrave;mes pos&eacute;s par les brevets sont compl&egrave;tement diff&eacute;rents des probl&egrave;mes pos&eacute;s par les copyrights. L'id&eacute;e qu'ils ont quelque chose de commun est l'une des cons&eacute;quences malheureuses de l'utilisation du terme de &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; et d'encourager les gens &agrave; confondre toutes ces questions. Comme vous l'avez entendu, j'ai parl&eacute; de probl&egrave;mes o&ugrave; le prix d'une copie n'est pas crucial. Et quel est le point crucial dans la production de m&eacute;dicaments anti-SIDA pour l'Afrique&nbsp;? C'est le prix, et rien d'autre.

source: Now the issue I've been talking about arises because digital information technology gives every user the ability to make copies. Well, there's nothing giving us all the ability to make copies of medicines. I don't have the ability to copy some medicine that I've got. In fact, nobody does; that's not how they're made. Those medicines can only be made in expensive factories and they are made in expensive centralized factories, whether they're generic drugs or imported from the U.S. Either way, they're going to be made in a small number of factories, and the issues are simply how much do they cost and are they available at a price that people in Africa can afford.
fr: Les probl&egrave;mes que j'ai &eacute;voqu&eacute;s se posent parce que les technologies num&eacute;riques donnent &agrave; chacun la possibilit&eacute; de r&eacute;aliser des copies. Rien ne nous donne &agrave; tous la possibilit&eacute; de copier des m&eacute;dicaments. Je n'ai pas la facult&eacute; de copier un m&eacute;dicament en ma possession. En fait, personne n'a cette facult&eacute;&nbsp;: ce n'est pas ainsi qu'on fabrique les m&eacute;dicaments. Les m&eacute;dicaments ne peuvent &ecirc;tre fabriqu&eacute;s que dans des usines on&eacute;reuses et centralis&eacute;es, qu'ils soient g&eacute;n&eacute;riques ou import&eacute;s des &Eacute;tats-Unis. Dans tous les cas, ils seront produits dans un petit nombre d'usines, et les probl&egrave;mes pos&eacute;s concernent simplement leur prix et s'ils sont ou non disponibles &agrave; un prix que les Africains peuvent payer.

source: So that's a tremendously important issue, but it's a totally different issue. There's just one area where an issue arises with patents that is actually similar to these issues of freedom to copy, and that is in the area of agriculture. Because there are certain patented things that can be copies, more or less &mdash; namely, living things. They copy themselves when they reproduce. It's not necessarily exact copying; they re-shuffle the genes. But the fact is, farmers for millennia have been making use of this capacity of the living things they grow to copy themselves. Farming is, basically, copying the things that you grew and you keep copying them every year. When plant and animal varieties get patented, when genes are patented and used in them, the result is that farmers are being prohibited from doing this.
fr: C'est donc un probl&egrave;me extr&ecirc;mement important, mais compl&egrave;tement diff&eacute;rent. Seul un domaine des brevets pose les m&ecirc;mes probl&egrave;mes de libert&eacute; de copie, et c'est l'agriculture. En effet, certaines choses brevet&eacute;es peuvent &ecirc;tre &mdash; plus ou moins &mdash; copi&eacute;es&nbsp;: le vivant. Le vivant se recopie quand il se reproduit. Il ne s'agit pas n&eacute;cessairement d'une copie exacte&nbsp;: les g&ecirc;nes sont m&eacute;lang&eacute;s. Mais le fait est que depuis des mill&eacute;naires, les agriculteurs ont exploit&eacute; cette propri&eacute;t&eacute; qu'ont les plantes qu'ils font pousser (ou les animaux qu'ils &eacute;l&egrave;vent) de se recopier. L'agriculture, en un sens, revient &agrave; recopier ce qu'on fait pousser (ou &eacute;l&egrave;ve), et &agrave; le recopier d'ann&eacute;e en ann&eacute;e. Quand des vari&eacute;t&eacute;s de plantes et d'animaux sont brevet&eacute;es, quand elles utilisent des g&ecirc;nes brevet&eacute;s, on interdit de fait aux agriculteurs d'exploiter cette propri&eacute;t&eacute; de la nature.

source: There is a farmer in Canada who had a patented variety growing on his field and he said, &ldquo;I didn't do that deliberately. The pollen blew, and the wind in those genes got into my stock of plants.&rdquo; And he was told that that doesn't matter; he has to destroy them anyway. It was an extreme example of how much government can side with a monopolist.
fr: Une vari&eacute;t&eacute; ainsi brevet&eacute;e poussait sur le champ d'un agriculteur canadien. Ce dernier disait &laquo;&nbsp;Ce n'est pas d&eacute;lib&eacute;r&eacute; de ma part. Le vent a souffl&eacute;, et les g&egrave;nes de ces pollens se sont retrouv&eacute;s dans mes plantes.&nbsp;&raquo; On lui a r&eacute;pondu que cela n'avait pasd'importance&nbsp;; il lui a quand m&ecirc;me fallu d&eacute;truire sa r&eacute;colte. Ce fut un exemple extr&ecirc;me de coalition entre un gouvernement et un monopole.

source: So I believe that, following the same principles that I apply to copying things on your computer, farmers should have an unquestioned right to save their seeds and breed their livestock. Maybe you could have patents covering seed companies, but they shouldn't cover farmers.
fr: Je pense donc, par application des m&ecirc;mes principes que j'ai appliqu&eacute;s aux copies sur ordinateur, les agriculteurs devraient avoir un droit inali&eacute;nable de replanter leurs graines et d'&eacute;lever leurs troupeaux. On peut imaginer des brevets concernant les producteurs de graines, mais ils ne devraient pas s'appliquer aux agriculteurs.

source: <b>QUESTION</b>: There's more to making a model successful than just the licensing. Can you speak to that?
fr: <b>QUESTION</b>&nbsp;: Les licences ne suffisent pas &agrave; rendre un mod&egrave;le viable. Pouvez-vous d&eacute;velopper ce point&nbsp;?

source: <b>STALLMAN</b>: Absolutely. Well, you know, I don't know the answers. But part of what I believe is crucial for developing free, functional information is idealism. People have to recognize that it's important for this information to be free, that when the information is free, you can make full use of it. When it's restricted, you can't. You have to recognize that the non-free information is an attempt to divide them and keep them helpless and keep them down. Then they can get the idea, &ldquo;Let's work together to produce the information we want to use, so that it's not under the control of some powerful person who can dictate to us what we can do.&rdquo;
fr: <b>STALLMAN</b>&nbsp;: Absolument. Voyez-vous, je ne connais pas les r&eacute;ponses. Mais je pense que l'id&eacute;alisme est une partie cruciale du d&eacute;veloppement d'informations libres et fonctionnelles. Il faut que les gens pensent qu'il est important que cette information soit libre, que seule une information libre peut &ecirc;tre pleinement exploit&eacute;e. Qu'une information dont l'utilisation est restreinte ne peut &ecirc;tre pleinement exploit&eacute;e. Il faut que les gens pensent que les informations non libres sont une tentative de les diviser et de les maintenir dans un &eacute;tat de d&eacute;pendance, la t&ecirc;te sous l'eau. Alors seulement peuvent-ils avoir l'id&eacute;e de se donner la main pour produire les informations qu'ils veulent utiliser, sans qu'elles soient sous le contr&ocirc;le d'un puissant qui leur dicterait leur conduite.

source: This tremendously boosts it. But I don't know how much it will work in various different areas, but I think that in the area of education, when you're looking for textbooks, I think I see a way it can be done. There are a lot of teachers in the world, teachers who are not at prestigious universities &mdash; maybe they're in high-school; maybe they're in college &mdash; where they don't write and publish a lot of things and there's not a tremendous demand for them. But a lot of them are smart. A lot of them know their subjects well and they could write textbooks about lots of subjects and share them with the world and receive a tremendous amount of appreciation from the people who will have learned from them.
fr: Voil&agrave; un &eacute;l&eacute;ment qui acc&eacute;l&egrave;re prodigieusement les choses. Je ne sais pas combien cela fonctionnera dans divers domaines, mais je pense pouvoir imaginer une mani&egrave;re de mener cela &agrave; bien dans le domaine de l'&eacute;ducation &mdash; et des manuels. Nombreux sont les professeurs de par le monde qui ne travaillent pas dans des universit&eacute;s prestigieuses &mdash; mais au lyc&eacute;e, ou dans des universit&eacute;s de seconde zone &mdash; et qui n'&eacute;crivent et ne publient pas, faute de demande. Mais ils sont souvent tr&egrave;s intelligents et instruits. Nombreux sont ceux qui connaissent bien leur mati&egrave;re et qui pourraient &eacute;crire des manuels portant sur de nombreux sujets, les partager avec le monde, et recevoir &eacute;norm&eacute;ment de commentaires, de remerciements et d'encouragements de la part de ceux qui en auront b&eacute;n&eacute;fici&eacute;.

source: <b>QUESTION</b>: That's what I proposed. But the funny thing is, I do know the history of education. That's what I do &mdash; educational, electronic media projects. I couldn't find an example. Do you know of one?
fr: <b>QUESTION</b>&nbsp;: C'est ce &agrave; quoi je pensais. Je connais l'histoire de l'&eacute;ducation&nbsp;; c'est mon m&eacute;tier: je m'occupe de projets &eacute;ducatifs et &eacute;lectroniques. Mais ce qui est &eacute;trange, c'est que je ne connais aucun exemple de cela. En connaissez-vous&nbsp;?

source: <b>STALLMAN</b>: No, I don't. I started proposing this free encyclopedia and learning resource a couple of years ago, and I thought it would probably take a decade to get things rolling. Now we already have an encyclopedia that is rolling. So things are going faster than I hoped. I think what's needed is for a few people to start writing some free textbooks. Write one about whatever is your favorite subject or write a fraction of one. Write a few chapters of one and challenge other people to write the rest.
fr: <b>STALLMAN</b>&nbsp;: Non. J'ai commenc&eacute; &agrave; proposer cette id&eacute;e d'encyclop&eacute;die et de ressources &eacute;ducatives libres voici quelques ann&eacute;es, et je pensais alors que cela prendrait une d&eacute;cennie avant de s'&eacute;branler. Nous avons d&eacute;j&agrave; une encyclop&eacute;die en bonne voie de r&eacute;alisation. Les choses avancent plus vite que ce que j'imaginais. Je pense qu'on a besoin de quelques professeurs qui se mettraient &agrave; &eacute;crire quelques manuels libres. &Eacute;crivez un manuel sur votre mati&egrave;re pr&eacute;f&eacute;r&eacute;e &mdash; n'en &eacute;crivez m&ecirc;me qu'une portion. &Eacute;crivez quelques chapitres et incitez d'autres personnes &agrave; &eacute;crire les chapitres restants.

source: <b>QUESTION</b>: Actually what I was looking for is something even more than that. What's important in your kind of structure is somebody that creates an infrastructure to which everybody else can contribute. There isn't a K through 12 infrastructure out there in any place for a contribution for materials.
fr: <b>QUESTION</b>&nbsp;: Je voyais plus loin encore. Ce qui est important, dans votre id&eacute;e de structure, c'est que quelqu'un cr&eacute;e une infrastructure &agrave; laquelle tout le monde peut ensuite contribuer. Je ne connais aucune infrastructure cibl&eacute;e sur l'enfance, de niveau maternelle et primaire, o&ugrave; on puisse contribuer de la mani&egrave;re que vous proposez.

source: I can get information from lots of places but it's not released under free licenses, so I can't use it to make a free textbook.
fr: Je peux obtenir les informations dont j'ai besoin de nombreux endroits diff&eacute;rents, mais ces informations n'&eacute;tant pas publi&eacute;es sous des licences libres, je ne peux en faire usage dans un manuel libre.

source: <b>STALLMAN</b>: Actually, copyright doesn't cover the facts. It only covers the way it's written. So you can learn a field from anywhere and then write a textbook, and you can make that textbook free, if you want.
fr: <b>STALLMAN</b>&nbsp;: En fait, le copyright ne couvre pas les faits, mais la mani&egrave;re dont ils sont r&eacute;dig&eacute;s. On peut donc apprendre un domaine &agrave; partir de la source qu'on veut et ensuite &eacute;crire un manuel, qu'on peut publier sous une licence libre si tel est notre d&eacute;sir.

source: <b>QUESTION</b>: But I can't write by myself all the textbooks that a student needs going through school.
fr: <b>QUESTION</b>&nbsp;: Mais je ne peux r&eacute;diger seul tous les manuels dont un &eacute;tudiant aura besoin &agrave; l'&eacute;cole.

source: <b>STALLMAN</b>: Well, it's true. And I didn't write a whole, free operating system, either. I wrote some pieces and invited other people to join me by writing other pieces. So I set an example. I said, &ldquo;I'm going in this direction. Join me and we'll get there.&rdquo; And enough people joined in that we got there. So if you think in terms of, how am I going to get this whole gigantic job done, it can be daunting. So the point is, don't look at it that way. Think in terms of taking a step and realizing that after you've taken a step, other people will take more steps and, together, it will get the job done eventually.
fr: <b>STALLMAN</b>&nbsp;: C'est vrai. Et je n'ai pas, moi non plus, &eacute;crit un syst&egrave;me d'exploitation libre complet. J'en ai &eacute;crit quelques morceaux, et j'ai invit&eacute; d'autres personnes &agrave; me rejoindre et &agrave; &eacute;crire les morceaux manquants. J'ai donc montr&eacute; l'exemple. J'ai dit &laquo;&nbsp;Je suis cette voie-l&agrave;. Suivez-moi et nous y arriverons ensemble&nbsp;&raquo;. Et on m'a suivi en nombre suffisant, de telle sorte que nous avons atteint ce but d&eacute;sormais. Si vous prenez le probl&egrave;me en vous demandant comment vous allez vous y prendre pour abattre cette quantit&eacute; gigantesque de travail, il y a de quoi &ecirc;tre d&eacute;courag&eacute;. Ne regardez donc pas les choses ainsi&nbsp;! Pensez plut&ocirc;t que vous allez faire un pas et qu'apr&egrave;s ce pas, d'autres vous rejoindront et feront quelques pas et qu'ensemble, vous arriverez enfin au but que vous vous &ecirc;tes fix&eacute;.
