Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-and-globalization.*.po
Languages: fr

source: And fourth, collective responsibility. In the U.S., this has been done by conscripting Internet service providers, making them legally responsible for everything their customers post. The only way they can avoid always being held responsible is if they have an invariable procedure to disconnect or remove the information within two weeks after a complaint. Just a few days ago, I heard that a clever protest site criticizing City Bank for some of its nasty policies was disconnected in this way. Nowadays, you don't even get your day in court; your site just gets unplugged.
fr: Quatri&egrave;mement, la responsabilit&eacute; collective. Aux &Eacute;tats-Unis d'Am&eacute;rique, ce but fut atteint en contraignant les fournisseurs d'acc&egrave;s &agrave; l'Internet et en les rendant responsables de tout ce que leurs clients publient. La seule mani&egrave;re pour eux de ne pas &ecirc;tre tenus responsables est d'appliquer une proc&eacute;dure sans recours consistant &agrave; d&eacute;connecter ou d&eacute;truire l'information qui fait l'objet d'un contentieux dans les deux semaines qui suivent la plainte. J'ai entendu qu'il y a quelques jours, un site de protestation intelligent mettant en cause la &laquo;&nbsp;City Bank&nbsp;&raquo; fut ainsid&eacute;connect&eacute;. De nos jours, la pr&eacute;somption d'innocence a v&eacute;cu:&nbsp;:on n'a plus le droit de pr&eacute;senter sa d&eacute;fense, et on se fait tout simplement supprimer le site web.

source: And, finally, propaganda, starting in childhood. That's what the word &ldquo;pirate&rdquo; is used for. If you'll think back a few years, the term &ldquo;pirate&rdquo; was formerly applied to publishers that didn't pay the author. But now it's been turned completely around. It's now applied to members of the public who escape from the control of the publisher. It's being used to convince people that only a nasty enemy of the people would ever do this forbidden copying. It says that &ldquo;sharing with your neighbor is the moral equivalent of attacking a ship.&rdquo; I hope that you don't agree with that and if you don't, I hope you will refuse to use the word in that way.
fr: Enfin, la propagande, d&egrave;s l'enfance. C'est le but du mot &laquo;&nbsp;pirate&nbsp;&raquo;. Si vous vous souvenez, ce terme &eacute;tait formellement r&eacute;serv&eacute;, voici quelques ann&eacute;es, aux &eacute;diteurs qui ne payaient pas l'auteur. Son sens a depuis compl&egrave;tement chang&eacute; et ce mot d&eacute;signe les membres du public qui &eacute;chappent au contr&ocirc;le de l'&eacute;diteur. On l'utilise pour convaincre les gens que seul un m&eacute;chant ennemidu peuple peut se livrer &agrave; des activit&eacute;s de copie interdite. Il sous-entend que partager avec son voisin est &eacute;thiquement &eacute;quivalent &agrave; lancer un abordage. J'esp&egrave;re que vous refusez cet amalgame et si tel est le cas, j'esp&egrave;re que vous refuserez d'utiliser ce mot dans ce sens.

source: So the publishers are purchasing laws to give themselves more power. In addition, they're also extending the length of time the copyright lasts. The U.S. Constitution says that copyright must last for a limited time, but the publishers want copyright to last forever. However, getting a constitutional amendment would be rather difficult, so they found an easier way that achieves the same result. Every 20 years they retroactively extend copyright by 20 years. So the result is, at any given time, copyright nominally lasts for a certain period and any given copyright will nominally expire some day. But that expiration will never be reached because every copyright will be extended by 20 years every 20 years; thus no work will ever go into the public domain again. This has been called &ldquo;perpetual copyright on the installment plan.&rdquo;
fr: Ainsi, les &eacute;diteurs ach&egrave;tent des lois pour &eacute;tendre et conforter leur pouvoir. De plus, ils allongent la dur&eacute;e du copyright. La constitution des &Eacute;tats-Unis d'Am&eacute;rique pr&eacute;voit que l'exercice du copyright doit &ecirc;tre limit&eacute; dans le temps, mais les &eacute;diteurs souhaitent tout le contraire. Comme il serait toutefois difficile de faire amender la Constitution, ils ont trouv&eacute; une mani&egrave;re d&eacute;tourn&eacute;e d'obtenir le m&ecirc;me r&eacute;sultat plus facilement. Tous les 20 ans, ils allongent de 20 ans la dur&eacute;e l&eacute;gale du copyright, avec effet r&eacute;troactif. C'est ainsi qu'&agrave; tout instant, la dur&eacute;e l&eacute;gale du copyright est finie, et tout copyright donn&eacute; prendra th&eacute;oriquement fin &agrave; un moment. Mais cette expiration ne sera jamais atteinte dans la pratique, puisque les copyrights sont allong&eacute;s de 20 ans tous les 20 ans; plus aucune &oelig;uvre n'entrera donc jamais dans le domaine public. C'est le principe du &laquo;&nbsp;copyright perp&eacute;tuel&nbsp;&raquo;.

source: The law in 1998 that extended copyright by 20 years is known as the &ldquo;Mickey Mouse Copyright Extension Act&rdquo; because one of the main sponsors of this law was Disney. Disney realized that the copyright on Mickey Mouse was going to expire, and they don't want that to ever happen because they make a lot of money from that copyright.
fr: La loi qui en 1998 a &eacute;tendu de 20 ans la dur&eacute;e du copyright est connue sous le nom de &laquo;&nbsp;Mickey Mouse Copyright Extension Act&nbsp;&raquo; (loi d'extension de copyright &laquo;&nbsp;Mickey&nbsp;&raquo;), puisque l'un de ses plus virulents d&eacute;fenseurs &eacute;tait Disney. Les gens de Disney se sont rendus compte que le copyright portant sur Mickey allait expirer, &eacute;v&eacute;nement qu'ils ne souhaitent absolument pas, ce copyright &eacute;tant tr&egrave;s lucratif.

source: Now the original title of this talk was supposed to be &ldquo;Copyright and Globalization.&rdquo; If you look at globalization, what you see is that it's carried out by a number of policies which are done in the name of economic efficiency or so-called free-trade treaties, which really are designed to give business power over laws and policies. They're not really about free trade. They're about a transfer of power: removing the power to decide laws from the citizens of any country who might conceivably consider their own interests and giving that power to businesses who will not consider the interests of those citizens.
fr: J'&eacute;tais cens&eacute; vous parler de &laquo;&nbsp;copyright et mondialisation&nbsp;&raquo;. Si on &eacute;tudie la mondialisation, on observe la mise en place d'un certain nombre de politiques au nom de l'efficacit&eacute; &eacute;conomique ou de pr&eacute;tendus trait&eacute;s de libre &eacute;change &mdash; trait&eacute;s dont lev&eacute;ritable but est d'augmenter le pouvoir des grandes entreprises au d&eacute;triment des lois et des politiques. Ce ne sont pas vraiment des trait&eacute;s de libre &eacute;change. Ce sont des trait&eacute;s qui mettent en place un transfert de pouvoir : ils retirent aux citoyens le pouvoir de d&eacute;cision &mdash; d&eacute;cisions portant sur leurs propres int&eacute;r&ecirc;ts ou ceux de leur pays &mdash; pour l'attribuer &agrave; des entreprises qui ne prendront pas en compte les int&eacute;r&ecirc;ts de ces citoyens.

source: Democracy is the problem in their view, and these treaties are designed to put an end to the problem. For instance, <abbr title="North American Free Trade Agreement">NAFTA</abbr> actually contains provisions, I believe, allowing companies to sue another government to get rid of a law that they believe is interfering with their profits in the other country. So foreign companies have more power than citizens of the country.
fr: Pour ces entreprises, la d&eacute;mocratie est un probl&egrave;me, et ces trait&eacute;s visent &agrave; le r&eacute;soudre. Par exemple, l'AL&Eacute;NA pr&eacute;voit des cas autorisant des entreprises &agrave; attaquer en justice un gouvernement &eacute;tranger pour annuler une loi qu'elles estiment interf&eacute;rer avec leurs profits dans ce pays &eacute;tranger. C'est ainsi que les entreprises &eacute;trang&egrave;res ont plus de pouvoir que les citoyens du pays.

source: There are attempts being made to extend this beyond <abbr>NAFTA</abbr>. For instance, this is one of the goals of the so-called free trade area of the Americas, to extend this principle to all the countries in South America and the Caribbean as well, and the multilateral agreement on investment was intended to spread it to the whole world.
fr: On observe des tentatives d'&eacute;tendre ce syst&egrave;me au-del&agrave; des limites pr&eacute;vues par l'AL&Eacute;NA. C'est par exemple l'un des buts de la pr&eacute;tendue zone de libre &eacute;change des Am&eacute;riques que d'&eacute;tendre ce principe &agrave; tous les pays d'Am&eacute;rique du Sud et des Cara&iuml;bes, et les accords multilat&eacute;raux sur les investissements avaient pour but d'&eacute;tendre ce principe au monde entier.

source: One thing we've seen in the '90s is that these treaties begin to impose copyright throughout the world, and in more powerful and restrictive ways. These treaties are not free-trade treaties. They're actually corporate-controlled trade treaties being used to give corporations control over world trade, in order to eliminate free trade.
fr: Les trait&eacute;s sign&eacute;s dans les ann&eacute;es 1990 ont commenc&eacute; &agrave; imposer le copyright au monde entier, d'une mani&egrave;re plus forte et plus restrictive qu'auparavant. Ce ne sont pas des trait&eacute;s de libre &eacute;change. Ce sont des trait&eacute;s de commerce contr&ocirc;l&eacute;s par les entreprises et dont le but est d'attribuer aux entreprises le contr&ocirc;le du commerce mondial, afin d'&eacute;liminer tout libre &eacute;change.

source: When the U.S. was a developing country in the 1800s, the U.S. did not recognize foreign copyrights. This was a decision made carefully, and it was an intelligent decision. It was acknowledged that for the U.S. to recognize foreign copyrights would just be disadvantageous, that it would suck money out and wouldn't do much good.
fr: Au XIX&egrave;me si&egrave;cle, les &Eacute;tats-Unis d'Am&eacute;rique, alors un tout jeune pays, ne reconnaissaient pas les copyrights &eacute;trangers. Ce fut une d&eacute;cision prise apr&egrave;s m&ucirc;re r&eacute;flexion, et c'&eacute;tait une bonne d&eacute;cision. Les d&eacute;bats ont conclu que la reconnaissance par les &Eacute;tats-Unis d'Am&eacute;rique des copyrights &eacute;trangers ne serait pas avantageuse, et qu'elle aurait pour effet de vider les caisses sans rien apporter en &eacute;change.

source: The same logic would apply today to developing countries but the U.S. has sufficient power to force them to go against their interests. Actually, it's a mistake to speak of the interests of countries in this context. In fact, I'm sure that most of you have heard about the fallacy of trying to judge the public interest by adding up everybody's wealth. If working Americans lost $1 billion and Bill Gates gained $2 billion, would Americans generally be better off? Would this be good for America? Or if you look only at the total, it looks like it's good. However, this example really shows that the total is the wrong way to judge because Bill Gates really doesn't need another $2 billion, but the loss of the $1 billion by other people who don't have as much to start with might be painful. Well, in a discussion about any of these trade treaties, when you hear people talk about the interests of this country or that country, what they're doing, within each country, is adding up everybody's income. The rich people and the poor people are being added up. So it's actually an excuse to apply that same fallacy to get you to ignore the effect on the distribution of wealth within the country and whether the treaty is going to make that more uneven, as it has done in the U.S.
fr: On pourrait de nos jours appliquer ce raisonnement aux pays en voie de d&eacute;veloppement, s'ils n'&eacute;taient pas contraints par la puissance de ces m&ecirc;mes &Eacute;tats-Unis d'Am&eacute;rique d'aller contre leurs int&eacute;r&ecirc;ts. Dans un tel contexte, c'est en fait une erreur de parler d'int&eacute;r&ecirc;ts des pays. Je suis s&ucirc;r que vous avez pour la plupart entendu parler du raisonnement vici&eacute; qui tente de mesurer l'int&eacute;r&ecirc;t public en ajoutant toutes les richesses individuelles. Si les Am&eacute;ricains actifs perdaient un milliard de dollars et que Bill Gates gagnait deux milliards de dollars, cela profiterait-il &agrave; la population des&Eacute;tats-Unis d'Am&eacute;rique, de mani&egrave;re g&eacute;n&eacute;rale&nbsp;? Cela profiterait-il aux &Eacute;tats-Unis d'Am&eacute;rique&nbsp;? Si l'on ne prend que le total en compte, cela semble une bonne affaire. Cet exemple montre cependant que le seul examen du total ne suffit pas &agrave; porter un jugement parce que Bill Gates n'a pas vraiment besoin de deux milliards de dollars suppl&eacute;mentaires, alors que la perte d'un milliard de dollars serait douloureuse pour une population qui ne jouit pas d'un patrimoine comparable. Et bien, dans toute discussion sur ces trait&eacute;s de commerce, quand on entend parler des int&eacute;r&ecirc;ts de tel outel pays, c'est le m&ecirc;me calcul qui est fait&nbsp;: en r&eacute;alit&eacute; c'est du total des revenus particuliers au sein de chaque pays qu'il est question. On regroupe les riches et les pauvres dans le m&ecirc;me calcul. Il s'agit donc d'un pr&eacute;texte pour appliquer ce m&ecirc;me raisonnement vici&eacute; afin de vous faire oublier la distribution des richesses au sein du pays et d'&eacute;viter que vous vous demandiez si le trait&eacute; creusera les foss&eacute;s et rendra cette distribution encore plusin&eacute;gale &mdash; comme ce fut le cas aux &Eacute;tats-Unis d'Am&eacute;rique.

source: So it's really not the U.S. interest that is being served by enforcing copyright around the world. It's the interests of certain business owners, many of whom are in the U.S. and some of whom are in other countries. It doesn't, in any sense, serve the public interest.
fr: Ce n'est pas l'int&eacute;r&ecirc;t des &Eacute;tats-Unis d'Am&eacute;rique qu'on sert en faisant respecter le copyright partout dans le monde. C'est l'int&eacute;r&ecirc;t de certains propri&eacute;taires et patrons, dont beaucoup se trouvent aux &Eacute;tats-Unis d'Am&eacute;rique. En aucun cas, cela ne sert l'int&eacute;r&ecirc;t public.

source: But what would make sense to do? If we believe in the goal of copyright stated, for instance in the U.S. Constitution, the goal of promoting progress, what would be intelligent policies to use in the age of the computer network? Clearly, instead of increasing copyright powers, we have to pull them back so as to give the general public a certain domain of freedom where they can make use of the benefits of digital technology, make use of their computer networks. But how far should that go? That's an interesting question because I don't think we should necessarily abolish copyright totally. The idea of trading some freedoms for more progress might still be an advantageous trade at a certain level, even if traditional copyright gives up too much freedom. But in order to think about this intelligently, the first thing we have to recognize is, there's no reason to make it totally uniform. There's no reason to insist on making the same deal for all kinds of work.
fr: Que faudrait-il faire, dans ce cas&nbsp;? Si l'on croit &agrave; la justification et au but du copyright tel que pr&eacute;cis&eacute;s dans la constitution des &Eacute;tats-Unis d'Am&eacute;rique &mdash; la &laquo;&nbsp;promotion du progr&egrave;s&nbsp;&raquo; &mdash;, quelles seraient les politiques intelligentes &agrave; mettre en place &agrave; l'&acirc;ge des r&eacute;seaux informatiques&nbsp;? Clairement, au lieu d'augmenter les pouvoirs de copyright, il nous faut les limiter ou les diminuer, afin d'offrir au grand public un domaine de libert&eacute; o&ugrave; les gens puissent faire usage des b&eacute;n&eacute;fices des techniques num&eacute;riques et des r&eacute;seaux informatiques. Jusqu'o&ugrave; aller&nbsp;? C'est une question int&eacute;ressante, car je ne crois pas qu'il faille abolir compl&egrave;tement le copyright. L'id&eacute;e detroquer certaines libert&eacute;s en &eacute;change de progr&egrave;s peut encore &ecirc;tre avantageuse &agrave; certains niveaux, m&ecirc;me si l'exercice traditionnel du copyright abandonne trop de libert&eacute;s. Si l'on veut r&eacute;fl&eacute;chir intelligemment &agrave; cette question, il nous faut commencer par reconna&icirc;tre qu'il n'y a aucune raison de vouloir tout uniformiser. Il n'y a aucune raison de vouloir aboutir aux m&ecirc;mes accords et aux m&ecirc;mes compromis pour tous les types d'&oelig;uvres.

source: In fact, that already isn't the case because there are a lot of exceptions for music. Music is treated very differently under copyright law. But the arbitrary insistence on uniformity is used by the publishers in a certain clever way. They pick some peculiar special case and they make an argument that, in that special case, it would be advantageous to have this much copyright. And then they say that for uniformity's sake, there has to be this much copyright for everything. So, of course, they pick the special case where they can make the strongest argument, even if it's a rather rare special case and not really very important overall.
fr: En r&eacute;alit&eacute;, ce n'est d&eacute;j&agrave; pas le cas, car de nombreuses exceptions couvrent le domaine des &oelig;uvres musicales. Les lois de copyright traitent la musique tr&egrave;s diff&eacute;remment. Mais c'est intelligemment que les &eacute;diteurs insistent &mdash; arbitrairement &mdash; sur l'uniformisation&nbsp;: ils choisissent un cas pr&eacute;cis et arguent que dans ce cas particulier, il serait avantageux d'appliquer telle disposition en mati&egrave;re de copyright. Ils expliquent ensuite que par souci d'uniformit&eacute;, il faut que tout soit r&eacute;gul&eacute; par les m&ecirc;mes dispositions de copyright. Bien s&ucirc;r, ils choisissent le cas de figure qui leur est le plus favorable, m&ecirc;me s'il est rare et pas vraiment tr&egrave;s important dans la pratique.

source: But maybe we should have that much copyright for that particular special case. We don't have to pay the same price for everything we buy. A thousand dollars for a new car might be a very good deal. A thousand dollars for a container of milk is a horrible deal. You wouldn't pay the special price for everything you buy in other areas of life. Why do it here?
fr: Peut-&ecirc;tre bien que ces dispositions sont les meilleures dans ce cas particulier. Il n'est nul besoin de payer le m&ecirc;me prix pour tous les achats que l'on r&eacute;alise&nbsp;: mille dollars pour une voiture neuve serait sans doute une excellente affaire, alors que le m&ecirc;me prix pour une brique de lait serait une affaireex&eacute;crable. On n'accepte pas de payer le m&ecirc;me prix pour tout ce que l'on ach&egrave;te par ailleurs &mdash; pourquoi devrait-on l'accepter ici&nbsp;?

source: So we need to look at different kinds of works, and I'd like to propose a way of doing this.
fr: Il nous faut donc distinguer diff&eacute;rents types de travaux, et je souhaite vous faire une proposition de classification.

source: This includes recipes, computer programs, manuals and textbooks, reference works like dictionaries and encyclopedias. For all these functional works, I believe that the issues are basically the same as they are for software and the same conclusions apply. People should have the freedom even to publish a modified version because it's very useful to modify functional works. People's needs are not all the same. If I wrote this work to do the job I think needs doing, your idea as a job you want to do may be somewhat different. So you want to modify this work to do what's good for you. At that point, there may be other people who have similar needs to yours, and your modified version might be good for them. Everybody who cooks knows this and has known this for hundreds of years. It's normal to make copies of recipes and hand them out to other people, and it's also normal to change a recipe. If you change the recipe and cook it for your friends and they like eating it, they might ask you, &ldquo;Could I have the recipe?&rdquo; Then maybe you'll write down your version and give them copies. That is exactly the same thing that we much later started doing in the free-software community.
fr: Concernant les recettes, les programmes d'ordinateurs, les manuels et livres de cours, et les &oelig;uvres de r&eacute;f&eacute;rence telles que les dictionnaires et les encyclop&eacute;dies&nbsp;: pour tous ces travaux fonctionnels, je crois que les probl&egrave;mes qui se posent sont les m&ecirc;mes que dans le cas du logiciel, et que par cons&eacute;quent les m&ecirc;mes conclusions s'appliquent. Les gens devraient m&ecirc;me avoir la libert&eacute; d'en publier une version modifi&eacute;e, car il est tr&egrave;s utile de modifier les &oelig;uvres fonctionnelles. Tout le monde n'a pas les m&ecirc;mes besoins&nbsp;: si j'ai &eacute;crit tel texte pour r&eacute;pondre &agrave; une n&eacute;cessit&eacute; ou &agrave; un souhait personnel, il ne r&eacute;pondra pas forc&eacute;ment &agrave; vos besoins, l&eacute;g&egrave;rement diff&eacute;rents. Vous pourrez donc souhaiter modifier mon travail pour vous le rendre plus ad&eacute;quat. D'autres pourront alors b&eacute;n&eacute;ficier de votre versionmodifi&eacute;e, car leurs habitudes seront similaires aux v&ocirc;tres. Cela fait des si&egrave;cles que tous les cuisiniers savent cela. Il est normal de donner ses recettes &agrave; d'autres, et il est normal d'adapter une recette. Si vous changez une recette et que les amis &agrave; qui vous servez le fruit de votre labeur aiment le r&eacute;sultat, ils vous demanderont probablement la recette. Alors peut-&ecirc;tre leur donnerez-vous des copies de votre version. C'est exactement ce que nous f&icirc;mes, bien plus tard, dans la communaut&eacute; du logiciel libre.

source: <a name="opinions"></a> So that's one class of work. The second class of work is works whose purpose is to say what certain people think. Talking about those people is their purpose. This includes, say, memoirs, essays of opinion, scientific papers, offers to buy and sell, catalogues of goods for sale. The whole point of those works is that they tell you what somebody thinks or what somebody saw or what somebody believes. To modify them is to misrepresent the authors; so modifying these works is not a socially useful activity. And so verbatim copying is the only thing that people really need to be allowed to do.
fr: <a name="opinions"></a> Voil&agrave; pour la premi&egrave;re cat&eacute;gorie de travaux. La deuxi&egrave;me cat&eacute;gorie concerne les &oelig;uvres visant &agrave;rendre compte de la pens&eacute;e et des id&eacute;es de certains&nbsp;: le but de ces &oelig;uvres est de parler de leurs auteurs. Cette cat&eacute;gorie embrasse, entre autres, les m&eacute;moires, les essais d'opinion, les articles scientifiques, les petites annonces, les catalogues de biens &agrave; vendre. Toutes ces &oelig;uvres ont pour but de communiquer ce qu'une personne pense, a vu, ou croit. Les modifier serait trahir les auteurs; c'est pourquoi modifier ces &oelig;uvres n'est pas une activit&eacute; utile socialement. Par cons&eacute;quent, seule la copie exacte, ou verbatim, de ces &oelig;uvres doit &ecirc;tre autoris&eacute;e.
