Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-versus-community.*.po
Languages: fr

source: Copyright versus Community in the Age of Computer Networks - GNU Project - Free Software Foundation (FSF)
fr: Copyright contre Communaut&eacute; &agrave; l'&acirc;ge des r&eacute;seaux informatiques - GNU Project - Free Software Foundation (FSF)

source: Copyright versus Community in the Age of Computer Networks
fr: Copyright contre Communaut&eacute; &agrave; l'&acirc;ge des r&eacute;seaux informatiques

source: This is a transcription from an audio recording, prepared by Douglas Carnall, July 2000.
fr: Ceci est la retranscription d'un enregistrement audio r&eacute;alis&eacute; par Douglas Carnall, en juillet 2000.

source: <em> Mr Stallman arrives a few minutes after the appointed hour of commencement of his talk to address a hushed and respectful audience. He speaks with great precision and almost no hesitation in a pronounced Boston accent.</em>
fr: <em>M. Stallman arrive quelques minutes apr&egrave;s l'heure pr&eacute;vue du d&eacute;but de sa conf&eacute;rence pour s'adresser &agrave; une assistance silencieuse et respectueuse. Il parle avec une grande pr&eacute;cision et presque sans h&eacute;sitation avec un accent prononc&eacute; de Boston.</em>

source: <strong>RMS</strong>: This is made for someone who wears a strangler.
fr: <strong>RMS&nbsp;</strong>: Ceci est fait pour quelqu'un qui porte un strangler.

source: <em>[indicates clip-on microphone for lecture theatre amplification system]</em>
fr: <em>[il indique le micro &agrave; agrafe du syst&egrave;me d'amplification de la salle de conf&eacute;rence]</em>

source: I don't wear stranglers, so there is no place for it to go.
fr: Je ne porte pas de strangler, alors il n'y a pas de place pour le mettre

source: <em>[clips it to his T-shirt]</em>
fr: <em>[Il l'accroche &agrave; son T-shirt]</em>

source: <strong>Me</strong>: Are you OK with the recording?
fr: <strong>Moi</strong>&nbsp;: C'est bon pour le micro&nbsp;?

source: <strong>RMS</strong>: Yes! <em>[testy]</em> How many people have to ask me?
fr: <strong>RMS</strong>&nbsp;: Oui&nbsp;! <em>[irrit&eacute;]</em> Combien de personnes sont sens&eacute;es me demander&nbsp;?

source: Well, I'm supposed to speak today
fr: Bon, je suppose que je dois parler aujourd'hui.

source: <em>[long pause]</em>
fr: <em>[longue pause]</em>

source: about copyright versus community. This is too loud.
fr: &agrave; propos du copyright contre la Communaut&eacute;. C'est trop fort.

source: <em>[indicates clip-on microphone]</em>
fr: <em>[il indique le micro &agrave; agrafe]</em>

source: What can I do?
fr: Que puis-je faire&nbsp;?

source: Let's see&hellip; there's no volume control&hellip;
fr: Regardez&hellip; il n'y a pas de contr&ocirc;le de volume&hellip;

source: <em>[finds volume control on radio microphone box]</em>
fr: <em>[il trouve la commande du volume sur la bo&icirc;te radio du micro]</em>

source: this seems better
fr: ça para&icirc;t mieux

source: OK. Copyright versus community in the age of computer networks. The principles of ethics can't change. They are the same for all situations, but to apply them to any question or situation you have to look at the facts of the situation to compare alternatives, you have to see what their consequences are, a change in technology never changes the principles of ethics, but a change in technology can alter the consequences of the same choices, so it can make a difference for the outcome of the question, and that has happened in the area of copyright law. We have a situation where changes in technology have affected the ethical factors that weigh on decisions about copyright law and change the right policy for society.
fr: OK. Copyright contre Communaut&eacute; &agrave; l'&acirc;ge des r&eacute;seaux informatiques. Les principes de l'&eacute;thique ne peuvent pas changer. Ils restent les m&ecirc;mes dans toutes les situations. Mais pour qu'ils s'appliquent quelle que soit la question ou situation, vous devez regarder les faits pour comparer les alternatives, et voir quelles en seront les cons&eacute;quences. Un changement de technologie ne change jamais les principes de l'&eacute;thique, mais peut modifier ses cons&eacute;quences sur les m&ecirc;mes choix, qui peuvent avoir des r&eacute;sultats diff&eacute;rents, comme cela s'est produit dans le domaine des lois sur le copyright. Nous sommes dans une situation o&ugrave; les changements de technologie ont affect&eacute; les facteurs &eacute;thiques qui p&egrave;sent sur les d&eacute;cisions &agrave; propos des lois sur le copyright et changent de politique appropri&eacute;e pour la soci&eacute;t&eacute;.

source: Laws that in the past may have been a good idea, now are harmful because they are in a different context. But to explain this, I should go back to the beginning to the ancient world where books were made by writing them out by hand. That was the only way to do it, and anybody who could read could also write a copy of a book. To be sure a slave who spent all day writing copies could probably do it somewhat better than someone who didn't ordinarily do that but it didn't make a tremendous difference. Essentially, anyone who could read, could copy books, about as well as they could be copied in any fashion.
fr: Ces lois qui &eacute;taient par le pass&eacute; une bonne id&eacute;e, sont maintenantnocives parce qu'elles ont chang&eacute; de contexte. Pour l'expliquer, ilfaudrait remonter au d&eacute;but du monde antique o&ugrave; les livres &eacute;taient des&oelig;uvres &eacute;crites &agrave; la main. Quand c'&eacute;tait la seule mani&egrave;re de le faire.Quiconque qui pouvait lire les livres, pouvait &eacute;galement en &eacute;crire une copie. Il est certain qu'un esclave qui passait sa journ&eacute;e &agrave; &eacute;crire des copies &eacute;tait th&eacute;oriquement capable de le faire mieux que quelqu'un qui n'en avait pas l'habitude, mais &ccedil;a ne faisait pas une &eacute;norme diff&eacute;rence. Principalement, celui qui pouvait lire les livres pouvait aussi les copier, et &agrave; peu pr&egrave;s de n'importe quelle mani&egrave;re.

source: In the ancient world, there wasn't the sharp distinction between authorship and copying that there tends to be today.
fr: Dans l'Antiquit&eacute;, il n'y avait pas d'aussi nette distinction entre paternit&eacute; et copie, comme c'est la tendance aujourd'hui.

source: There was a continuum. On the one hand you might have somebody, say, writing a play. Then you might have, on the other extreme, just somebody making copies of books, but in between you might have say, somebody, who say, copies part of a book, but writes some words of his own, or writing a commentary, and this was very common, and definitely respected. Other people would copy some bits from one book, and then some bits from another book, and write something of their own words, and then copy from another book, quoting passages of various lengths from many different works, and then writing some other works to talk about them more, or relate them. And there are many ancient works&mdash;now lost&mdash;in which part of them survived in these quotations in other books that became more popular than the book that the original quote <em>[came from]</em>.
fr: Il y avait un continuum. D'un c&ocirc;t&eacute; vous pouviez avoir quelqu'un qui pense, puis &eacute;crit la sc&egrave;ne. Comme vous pouviez avoir &agrave; l'autre extr&ecirc;me, quelqu'un qui faisait des copies d'un livre. Mais entre les deux, vous pouviez avoir quelqu'un qui pense, puis copie des passages d'un livre, en &eacute;crivant quelques mots par lui-m&ecirc;me, ou un commentaire, et c'&eacute;tait tr&egrave;s courant et certainement respect&eacute;. D'autres personnes pouvaient copier certaines parties d'un livre, citer des passages de longueurs vari&eacute;es de plusieurs travaux diff&eacute;rents, et de l&agrave; construire d'autres travaux pour en parler davantage, ou s'en r&eacute;f&eacute;rer. Et il y a beaucoup d'anciens travaux &mdash; aujourd'hui perdus &mdash; dont des parties ont surv&eacute;cu &agrave; travers ces citations dans d'autres livres, devenus plus populaires que le livre dont la citation originale provenait.

source: There was a spectrum between writing an original work, and copying. There were many books that were partly copied, but mixed with original writing. I don't believe there was any idea of copyright in the ancient world and it would have been rather difficult to enforce one, because books could be copied by anyone who could read anywhere, anyone who could get some writing materials, and a feather to write with. So, that was a rather clear simple situation.
fr: Il y avait tout un spectre entre l'&eacute;criture d'un travail original, et sa copie. Beaucoup de livres &eacute;taient partiellement copi&eacute;s sur d'autres, m&eacute;lang&eacute;s &agrave; l'&eacute;criture originale. Je ne crois pas qu'il y ait eu une quelconque notion de copyright dans l'antiquit&eacute;. Et il aurait &eacute;t&eacute; plut&ocirc;t difficile d'en imposer une, parce que les livres pouvaient &ecirc;tre copi&eacute;s par qui pouvait les lire n'importe o&ugrave;, et qui pouvait obtenir quelque support d'&eacute;criture, et une plume pour &eacute;crire avec. Ainsi, c'&eacute;tait une situation simple, plut&ocirc;t claire.

source: Later on, printing was developed and printing changed the situation greatly. It provided a much more efficient way to make copies of books, provided that they were all identical. And it required specialised, fairly expensive equipment that an ordinary reader would not have. So in effect it created a situation in which copies could only feasibly be made by specialised businesses, of which the number was not that large. There might have been hundreds of printing presses in a country and hundreds of thousands, or maybe even millions of actually people who could read. So the decrease in the number of places in which copies could be made was tremendous.
fr: Plus tard, l'impression fut d&eacute;velopp&eacute;e et a consid&eacute;rablement chang&eacute; la situation. Elle a fourni une mani&egrave;re beaucoup plus efficace de faire des copies de livres, pourvu qu'elle soient toutes identiques. Et elle a exig&eacute; un &eacute;quipement sp&eacute;cialis&eacute; assez cher, qu'un lecteur ordinaire ne pouvait pas avoir. Elle a donc cr&eacute;&eacute; une situation dans laquelle les copies ne pouvait &ecirc;tre r&eacute;ellement faisables que par des entreprises sp&eacute;cialis&eacute;es, dont le nombre n'&eacute;tait pas &eacute;lev&eacute;. Il aurait pu y avoir des centaines d'impressions par pays et des centaines de milliers, ou peut-&ecirc;tre m&ecirc;me vraisemblablement des millions de personnes qui auraient pu les lire. Ainsi la diminution du nombre d'endroits dans lesquels les copies pouvaient &ecirc;tre faites &eacute;tait consid&eacute;rable.

source: Now the idea of copyright developed along with the printing press. I think that there may be&hellip; I think I remember reading that Venice, which was a major centre of printing in the 1500s also had a kind of copyright but I can't find that: I couldn't find that reference again. But the system of copyright fitted in naturally with the printing press because it became rare for ordinary readers to make copies. It still happen. People who were very poor or very rich had handmade copies of books. The very rich people did this to show off their wealth: they had beautiful illuminated wealth to show that they could afford this. And poor people still sometimes copied books by hand because they couldn't afford printed copies. As the song goes &ldquo;Time ain't money when all you got is time.&rdquo; So some poor people copied books with a pen. But for the most part the books were all made on printing presses by publishers and copyright as a system fitted in very well with the technical system. For one thing it was painless for readers, because the readers weren't going to make copies anyway, except for the very rich ones who could presumably legitimise it, or the very poor ones who were making just individual copies and no one was going to go after them with lawyers. And the system was fairly easy to enforce again because there were only a small number of places where it had to be enforced: only the printing presses, and because of this it didn't require, it didn't involve, a struggle against the public. You didn't find just about everybody trying to copy books and being threatened with arrest for doing it.
fr: Maintenant, l'id&eacute;e de copyright s'est d&eacute;velopp&eacute;e avec la presse. Je pense qu'il peut y avoir&hellip; Je pense que je me rappelle avoir lu que Venise, qui &eacute;tait un centre important de l'impression au XVI&egrave;me si&egrave;cle, a &eacute;galement connu un genre de copyright mais je ne peux pas vous dire&nbsp;: Je ne pourrais pas retrouver cette r&eacute;f&eacute;rence. Mais le syst&egrave;me de copyright s'est naturellement accord&eacute; avec la presse parce qu'il est devenu rare pour un lecteur ordinaire de faire des copies. C'est toujours le cas. Seuls les gens tr&egrave;s pauvres ou tr&egrave;s riches d&eacute;tenaient des copies manuscrites de livres. Les gens tr&egrave;s riches le faisaient pour &eacute;taler leur richesse&nbsp;: il fallait avoir une &eacute;blouissante fortune pour se le permettre. Et les pauvres gens en &eacute;taient encore parfois &agrave; recopier les livres &agrave; la main parce qu'ils ne pouvaient pas se permettre les copies imprim&eacute;es. Comme le dit la chanson &laquo;le temps n'est pas de l'argent quand c'est tout ce que vous avez&raquo;. Aussi quelques pauvres gens ont copi&eacute; des livres avec un stylo. Mais pour la plupart, les livres &eacute;taient fabriqu&eacute;s &agrave; la presse par des &eacute;diteurs et le copyright en tant que syst&egrave;me s'est naturellement accord&eacute; avec la technologie. D'un certain c&ocirc;t&eacute; ce fut indolore pour les lecteurs, parce qu'ils ne faisaient de toute fa&ccedil;on plus de copie, except&eacute; pour les gens tr&egrave;s riches qui pouvait r&eacute;ellement l&eacute;gitimer un tel acte, ou les tr&egrave;s pauvres qui n'en faisaient qu'un exemplaire unique et que personne n'aurait poursuivi avec des avocats. Et le syst&egrave;me fut vraiment facile &agrave; imposer toujours parce qu'il n'y avait qu'un tr&egrave;s petit nombre de lieux o&ugrave; c'&eacute;tait possible&nbsp;: seulement les presses, et parce que cela ne n&eacute;cessitait pas, cela n'impliquait pas de lutte contre le public. Vous ne pouviez pas trouver ne serait-ce qu'une seule personne essayant de copier des livres, et menac&eacute;e d'&ecirc;tre arr&ecirc;t&eacute;e pour &ccedil;a.

source: And in fact, in addition to not restricting the reader's directly, it didn't cause much of a problem for readers, because it might have added a small fraction to the price of books but it didn't double the price, so that small extra addition to the price was a very small burden for the readers. The actions restricted by copyright were actions that you couldn't do, as an ordinary reader, and therefore, it didn't cause a problem. And because of this there was no need for harsh punishments to convince readers to tolerate it and to obey.
fr: Et en fait, en plus de ne pas limiter le lecteur directement, il n'a pas vraiment caus&eacute; d'ennuis, &eacute;tant donn&eacute; qu'il a du &ecirc;tre ajout&eacute; une petite fraction du prix du livre qui n'a certes pas co&ucirc;t&eacute; le double, de sorte que la petite addition suppl&eacute;mentaire au prix n'&eacute;tait qu'un tout petit fardeau pour les lecteurs. Les actions limit&eacute;es par copyright &eacute;taient des actions que vous ne pouviez pas faire, en tant que lecteur ordinaire, et donc, cela n'a pas pos&eacute; de probl&egrave;me. Et pour cette raison, on avait pas besoin de punir s&eacute;v&egrave;rement les lecteurs pour les convaincre de le tol&eacute;rer et d'y ob&eacute;ir.

source: So copyright effectively was an industrial regulation. It restricted publishers and writers but it didn't restrict the general public. It was somewhat like charging a fee for going on a boat ride across the Atlantic. You know, it's easy to collect the fee when people are getting on a boat for weeks or months.
fr: Bien, le copyright &eacute;tait donc un r&egrave;glement industriel. Il restreignait les &eacute;diteurs et les auteurs mais ne limitait pas le grand public. C'&eacute;tait comme faire payer un droit d'entr&eacute;e pour une travers&eacute;e en bateau de l'Oc&eacute;an atlantique. Vous savez, il est facile de percevoir des honoraires quand les gens prennent le bateau pour des semaines, voire des mois.

source: Well, as time went on, printing got more efficient. Eventually even poor people didn't have to bother copying books by hand and the idea sort of got forgotten. I think it's in the 1800s that essentially printing got cheap enough so that essentially everyone could afford printed books, so to some extent the idea of poor people copying books by hand was lost from memory. I heard about this about ten years ago when I started talking about the subject to people.
fr: Avec le temps, l'impression est devenue plus efficace. Par la suite, les pauvres gens n'ont plus &eacute;t&eacute; oblig&eacute;s de copier les livres &agrave; la main et ce genre d'id&eacute;e est tomb&eacute;e dans l'oubli. Je pense que c'est au XIX&egrave;me si&egrave;cle que l'impression est devenue suffisamment bon march&eacute; pour que la plupart ait les moyens d'acheter des livres, aussi l'id&eacute;e des pauvres de copier les livres &agrave; la main a &eacute;t&eacute; a &eacute;t&eacute; oubli&eacute;e Je n'en ai entendu parler qu'il y a dix ans environ quand j'ai commenc&eacute; &agrave; interroger les gens &agrave; ce sujet.

source: So originally in England copyright was partly intended as a measure of censorship. People who wanted to publish books were required to get approval from the government but the idea began to change and it a different idea was expressed explicitly in the US constitution. When the US constitution was written there was a proposal that authors should be entitled to a monopoly on copying their books. This idea was rejected. Instead, a different idea of the philosophy of copyright was put into the constitution. The idea that a copyright system could be&hellip; well, the idea is that people have the natural right to copy things but copyright as an artificial restriction on copying can be authorised for the sake of promoting progress.
fr: En Angleterre, &agrave; l'origine, le copyright a &eacute;t&eacute; en partie pr&eacute;vu comme une mesure de censure. Les gens qui voulaient publier des livres devaient obtenir l'autorisation du gouvernement, mais les id&eacute;es ont commenc&eacute; &agrave; changer et c'est une toute autre id&eacute;e qui a &eacute;t&eacute; explicitement exprim&eacute;e dans la constitution des &Eacute;tats-Unis. Quand la Constitution am&eacute;ricaine a &eacute;t&eacute; &eacute;crite, il a &eacute;t&eacute; propos&eacute; que les auteurs devaient avoir le monopole sur la copie de leurs livres. Cette id&eacute;e a &eacute;t&eacute; rejet&eacute;e. &Agrave; la place, une id&eacute;e diff&eacute;rente de celle de la philosophie du copyright a &eacute;t&eacute; mise dans la Constitution. L'id&eacute;e que le syst&egrave;me du copyright pouvait &ecirc;tre... bon, l'id&eacute;e &eacute;tait que les gens avaient un droit naturel &agrave; copier les choses, mais le copyright en tant que frein artificiel &agrave; la copie pouvait &ecirc;tre autoris&eacute; dans l'intention de favoriser le progr&egrave;s.

source: So the system of copyright would have been the same more or less either way, but this was a statement about the purpose which is said to justify copyright. It is explicitly justified as a means to promote progress, not as an entitlement for copyright owners. So the system is meant to modify the behaviour of copyright owners so as to benefit the public. The benefit consists of more books being written and published and this is intended to contribute to the progress of civilisation, to spreading ideas, and as a means to this end&hellip; in other words as a means to this end copyright exists. So this also thought of as a bargain between the public and authors; that the public gives up its natural right to make copies of anything in exchange for the progress that is brought about indirectly, by encouraging more people to write.
fr: Donc le syst&egrave;me de copyright allait &ecirc;tre le m&ecirc;me d'une fa&ccedil;on ou d'une autre, mais il y avait une d&eacute;claration en rapport avec ledit but pour justifier du copyright. Il est explicitement justifi&eacute; comme un moyen de favoriser le progr&egrave;s, pas comme un droit pour les propri&eacute;taires. Ainsi le syst&egrave;me est cens&eacute; modifier le comportement des propri&eacute;taires de copyrights pour en faire b&eacute;n&eacute;ficier le public. L'avantage consiste &agrave; &eacute;crire et &eacute;diter plus de livres et ceci dans l'intention de contribuer au progr&egrave;s de la civilisation, &agrave; la propagation des id&eacute;es, et en tant que moyen &agrave; cet effet&hellip; en d'autres termes c'est en tant que moyen &agrave; cet effet que le copyright existe. Donc, c'est aussi en pensant &agrave; un march&eacute; entre le public et les auteurs&nbsp;; tel que le public renonce &agrave; son droit naturel de faire des copies de n'importe quoi en &eacute;change du progr&egrave;s qui est apport&eacute; indirectement, en encourageant plus de personnes &agrave; &eacute;crire.

source: Now it may seem like an obscure question to ask &ldquo;What's the purpose of copyright?&rdquo; But the purpose of any activity is the most important thing for deciding when an activity needs to be changed and how. If you forget about the purpose you are sure to get things wrong, so ever since that decision was made, the authors and especially the publishers most recently have been trying to misrepresent it and sweep it under the rug. There has been a campaign for decades to try to spread the idea that was rejected in the US constitution. The idea that copyright exists as an entitlement for copyright owners. And you can that expressed in almost everything they say about it starting and ending with the word &ldquo;pirate&rdquo; which is used to give the impression that making an unauthorised copy is the moral equivalent of attacking a ship and kidnapping or killing the people on board.
fr: Maintenant il peut sembler obscur de demander &laquo;&nbsp;quel est le but du copyright&nbsp;?&nbsp;&raquo;. Mais conna&icirc;tre le but d'une activit&eacute; est une chose essentielle pour d&eacute;cider si cette activit&eacute; a besoin d'&ecirc;tre chang&eacute;e, et comment. Si vous oubliez l'objectif, vous &ecirc;tes s&ucirc;r de vous tromper, or depuis que cette d&eacute;cision a &eacute;t&eacute; prise, les auteurs et plus particuli&egrave;rement les &eacute;diteurs ont jusqu'&agrave; r&eacute;cemment essay&eacute; de la d&eacute;naturer et de la balayer sous le tapis. Il y a eu des d&eacute;cennies de campagne pour tenter de r&eacute;pandre l'id&eacute;e qui a &eacute;t&eacute; rejet&eacute;e dans la constitution des &Eacute;tats-Unis d'Am&eacute;rique. L'id&eacute;e que le copyright existe en tant que droit pour les propri&eacute;taires de copyrights. Et vous pouvez la retrouver dans presque tout ce qu'il disent &agrave; ce sujet commen&ccedil;ant et se terminant par le mot &laquo;pirate&raquo;, qui est utilis&eacute; pour donner l'impression que faire une copie non autoris&eacute;e est l'&eacute;quivalent moral d'une attaque de bateau, et du kidnapping et du meurtre des personnes &agrave; bord.
