Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-versus-community.*.po
Languages: fr

source: The publishers treat authors terribly you have to realise. They're always demanding more power in the name of the authors and they will bring along a few very famous very successful writers who have so much clout that they can get contracts that treat them very well to testify saying that the power is really for their sake. Meanwhile most writers who are not famous and are not rich and have no particular clout are being treated horribly by the publishing industry, and it's even worse in music. I recommend all of you to read Courtney Love's article: it's in Salon magazine right?
fr: Les &eacute;diteurs traitent les auteurs d'une fa&ccedil;on terrible il faut le savoir. Ils exigent toujours plus de pouvoir au nom des auteurs et ils apporteront un petit nombre d'auteurs &agrave; gros succ&egrave;s, tr&egrave;s connus, qui ont tellement le bras long qu'ils peuvent obtenir des contrats qui les traitent tr&egrave;s bien pour confirmer les dires comme quoi le pouvoir est vraiment dans leur int&eacute;r&ecirc;t. En attendant la plupart des auteurs qui ne sont pas c&eacute;l&egrave;bres, ne sont pas riches et n'ont pas de relations particuli&egrave;res, sont trait&eacute;s de fa&ccedil;on horrible par l'industrie de l'&eacute;dition, et c'est encore pire dans la musique. Je recommande &agrave; tous de lire l'article de Courtney Love's&nbsp;: il est dans Salon magazine, c'est &ccedil;a&nbsp;?

source: <strong>AM2</strong> (Audience member 2) Yes
fr: <strong>MA2</strong>&nbsp;: (Membre de l'audience 2) Oui

source: <strong>RMS</strong>: She started out by calling the record companies quote pirates unquotes because of the way they treat the musicians. In any case we can shorten copyright more or less. We could try various lengths, we could see, we could find out empirically what length of copyright is needed to keep publication vigourous. I would say that since almost books are out of print by ten years, clearly ten years should be long enough. But it doesn't have to be the same for every kind of work. For example, maybe some aspects of copyright for movies should last for longer, like the rights to sell all the paraphernalia with the pictures and characters on them. You know, that's so crassly commercial it hardly matters if that is limited to one company in most cases. Maybe the copyright on the movies themselves, maybe that's legitimate for that to last twenty years. Meanwhile for software, I suspect that a three year copyright would be enough. you see if each version of the programme remains copyrighted for three years after its release well, unless the company is in real bad trouble they should have a new version before those three years are up and there will be a lot of people who will want to use the newer version, so if older versions are all becoming free software automatically, the company would still have a business with the newer version. Now this is a compromise as I see it, because it is a system in which not all software is free, but it might be an acceptable compromise, after all, if we had to wait three years in some cases for programs to become free&hellip; well, that's no disaster. To be using three years old software is not a disaster.
fr: <strong>RMS</strong>&nbsp;: Au d&eacute;part, elle a appell&eacute; les soci&eacute;t&eacute;s d'enregistrement entre guillemets &laquo;&nbsp;pirates&nbsp;&raquo; pour la fa&ccedil;on dont ils traitaient les musiciens. Dans tous les cas, nous pouvons raccourcir le copyright plus ou moins. Nous pourrions essayer diverses longueurs, nous pourrions voir, nous pourrions d&eacute;couvrir empiriquement quelle dur&eacute;e de copyright est n&eacute;cessaire pour maintenir la publication vigoureuse. Je dirais que, puisque les livres sont quasi hors de circuit au bout de dix ans, clairement dix ans devraient &ecirc;tre assez longs. Mais ce ne doit pas &ecirc;tre pareil pour tous les genres de travail. Par exemple, peut-&ecirc;tre que certains aspects du copyright sur les films pourraient durer plus longtemps, comme les droits de vendre tout l'attirail d'images et de personnages aff&eacute;rents. Vous savez, c'est tellement grossi&egrave;rement commercial qu'il importe peu que ce cela soit limit&eacute; &agrave; une seule soci&eacute;t&eacute; souvent. Peut-&ecirc;tre que le copyright sur les films eux-m&ecirc;mes est l&eacute;gitim&eacute; pour que &ccedil;a dure vingt ans. En attendant pour le logiciel, je pense qu'un copyright de trois ans serait suffisant. Vous voyez, si chaque version de programme conserve un copyright de trois ans apr&egrave;s sa sortie, &agrave; moins que la compagnie ne soit en tr&egrave;s mauvaise posture, ils devraient avoir une nouvelle version avant que les trois ans soient achev&eacute;s. Et il y aura beaucoup de gens d&eacute;sireux de l'utiliser. Aussi si les anciennes versions devenaient automatiquement libres, ils continueraient quand m&ecirc;me de faire des affaires sur la nouvelle. Maintenant c'est un compromis comme je les vois , parce que c'est un syst&egrave;me o&ugrave; tous les logiciels ne sont pas libres. Mais ce serait un compromis acceptable apr&egrave;s tout, si nous devions attendre trois ans en g&eacute;n&eacute;ral pour que les logiciels deviennent libres&hellip; bien, il n'y a pas de d&eacute;sastre. Que l'on utilise des logiciels vieux de trois ans n'est pas un d&eacute;sastre.

source: <strong>AM3</strong>: Don't you think this is a system that would favour feature creep?
fr: <strong>MA3</strong>&nbsp;: Ne pensez-vous pas que c'est un syst&egrave;me qui encouragerait la d&eacute;gradation des fonctions&nbsp;?

source: <strong>RMS</strong>: <em>[airily]</em> Ah that's OK. That's a minor side issue, compared with these issues of freedom encouraging, every system encourages some artificial distortions in what people, and our present system certainly encourages various kinds of artificial distortions in activity that is covered by copyright so if a changed system also encourages a few of these secondary distortions it's not a big deal I would say.
fr: <strong>RMS</strong>&nbsp;: <em>[d&eacute;sinvolte]</em> Ah, c'est exact. C'est un effet secondaire mineur, compar&eacute; aux questions de libert&eacute; qu'il soul&egrave;ve. Chaque syst&egrave;me entra&icirc;ne quelques d&eacute;viations artificielles chez certaines personnes, et notre syst&egrave;me actuel encourage certainement diverses sortes de d&eacute;viations artificielles dans l'activit&eacute; couverte par le copyright. Ainsi, si un syst&egrave;me parce qu'il change, encourage en m&ecirc;me temps quelques d&eacute;formations secondaires, ce n'est pas une grosse affaire je dirais.

source: <strong>AM4</strong>: The problem with this change in the copyright laws for three would be that you wouldn't get the sources.
fr: <strong>MA4</strong>&nbsp;: Le probl&egrave;me avec ce changement des lois sur le copyright pour trois ans, c'est que vous n'obtiendriez pas les sources.

source: <strong>RMS</strong>: Right. There would have also to be a condition, a law that to sell copies of the software to the public the source code must be deposited somewhere so that three years later it can be released. So it could be deposited say, with the library of congress in the US, and I think other countries have similar institutions where copies of published books get placed, and they could also received the source code and after three years, publish it. And of course, if the source code didn't correspond to the executable that would be fraud, and in fact if it really corresponds then they ought to be able to check that very easily when the work is published initially so you're publishing the source code and somebody there says alright &ldquo;dot slash configure dot slash make&rdquo; and sees if produces the same executables and uh.
fr: <strong>RMS</strong>&nbsp;: Exact. Il y aurait l&agrave; aussi une condition. Une loi qui dirait que pour pouvoir vendre des copies de logiciel au public, le code source doit &ecirc;tre d&eacute;pos&eacute; quelque part de sorte que trois ans plus tard il puisse &ecirc;tre lib&eacute;r&eacute;. Ainsi il pourrait &ecirc;tre d&eacute;pos&eacute; &agrave; la biblioth&egrave;que du Congr&egrave;s aux USA; et je pense que d'autres pays ont des &eacute;tablissements semblables o&ugrave; les copies des livres publi&eacute;s prennent place. Et ils pourraient &eacute;galement accueillir le code source et apr&egrave;s trois ans, le publier. Et naturellement, si le code source ne correspondait pas &agrave; l'ex&eacute;cutable il y aurait fraude. En fait si cela correspond vraiment, on devrait pouvoir tr&egrave;s facilement le v&eacute;rifier quand le travail est publi&eacute; au d&eacute;part. Ainsi vous &eacute;ditez le code source et quelqu'un dit que c'est bon &laquo;&nbsp;dot slash configure dot slash make&nbsp;&raquo; et voit si cela produit les m&ecirc;mes executables et hue.

source: So you're right, just eliminating copyright would not make software free.
fr: Aussi vous avez raison, &eacute;liminer le copyright ne rendrait pas le logiciel &laquo;&nbsp;free&nbsp;&raquo;.

source: <strong>AM5</strong>: Um libre
fr: <strong>MA5</strong>&nbsp;: Heu&hellip;libre

source: <strong>RMS</strong>: Right. That's the only sense I use the term. It wouldn't do that because the source code might not be available or they might try to use contracts to restrict the users instead. So making software free is not as simple as ending copyright on software: it's a more complex situation than that. In fact, if copyright were simply abolished from software then we would no longer be able to use copyleft to protect the free status of a program but meanwhile the software privateers could use other methods&mdash;contracts or withholding the source to make software proprietary. So what would mean is, if we release a free program some greedy bastard could make a modified version and publish just the binaries and make people sign non-disclosure agreements for them. We would no longer have a way to stop them. So if we wanted to change the law that all software that was published had to be free we would have to do it in some more complex way, not just by turning copyright for software.
fr: <strong>RMS</strong>&nbsp;: Exact. C'est dans ce seul sens que j'emploie le terme. &Ccedil;a ne le ferait pas, parce que le code source ne pourrait pas &ecirc;tre disponible, ou &agrave; la place ils pourraient tenter d'user de contrats pour restreindre les utilisateurs. Ainsi, rendre le logiciel libre n'est pas aussi simple que de mettre fin au copyright sur le logiciel&nbsp;: c'est une situation plus complexe que &ccedil;a. En fait, si le copyright sur le logiciel &eacute;tait simplement supprim&eacute;, nous ne pourrions plus utiliser le copyleft pour prot&eacute;ger le statut libre d'un programme. En m&ecirc;me temps, les adeptes du logiciel propri&eacute;taire pourraient utiliser d'autres m&eacute;thodes &mdash; des contrats ou des dissimulations sur la source pour rendre le logiciel propri&eacute;taire. Ainsi &ccedil;a pourrait signifier qu'&agrave; la sortie d'un programme libre quelque b&acirc;tard avide pourrait en faire une version modifi&eacute;e et n'en publier que les binaires, et inciter des personnes &agrave; signer des accords de non-divulgation sur eux. Nous pourrions ne plus avoir les moyens de les arr&ecirc;ter. Aussi, si nous voulions changer la loi pour que tout logiciel publi&eacute; devienne libre, nous devrions le faire de fa&ccedil;on encore plus complexe. Pas simplement en changeant le copyright sur le logiciel.

source: So, overall I would recommend we look at the various kinds of works and the various different kinds of uses and then look for a new place to draw the line: one that gives the public the most important freedoms for making use of each new kind of work while when possible retaining some kind of fairly painless kind of copyright for general public that is still of benefit to authors. In this way we can adapt the copyright system to the circumstances where we find it we find ourselves and have a system that doesn't require putting people in prison for years because they shared with their friends, but still does in various ways encourage people to write more. We can also I believe look for other ways of encouraging writing other ways of facilitating authors making money. For example, suppose that verbatim redistribution of a work is permitted and suppose that the work comes with something, so that when you are playing with it or reading it, there is a box on the side that says &ldquo;click here to send one dollar to the authors or the musicians or whatever&rdquo; I think that in the wealthier parts of the world a lot of people will send it because people often really love the authors and musicians that made the things that they like to read and listen to. And the interesting thing is that the royalty that they get now is such a small fraction that if you pay twenty dollars for something they're probably not getting more than one anyway.
fr: Ainsi, globalement je recommande &agrave; ce que nous examinions les diverses sortes de travaux et les diverses sortes de vari&eacute;t&eacute;s d'utilisation, et chercher l&agrave; un nouvel endroit pour tracer les limites&nbsp;: celles qui donneraient au public les libert&eacute;s les plus importantes pour trouver une utilisation &agrave; chaque nouveau genre de travail, en maintenant si possible pendant ce temps une sorte de copyright d'un genre indolore pour le grand public qui soit toujours un avantage pour les auteurs. De cette fa&ccedil;on, nous pouvons adapter le syst&egrave;me de copyright aux circonstances dans lesquelles nous le trouvons en nous trouvant nous-m&ecirc;me. Et avoir un syst&egrave;me qui n'exige pas de mettre des gens en prison pour des ann&eacute;es parce qu'ils auront partag&eacute; avec leurs amis, mais encourageant toujours de diverses mani&egrave;res les auteurs &agrave; &eacute;crire plus. Nous pouvons &eacute;galement je crois, chercher d'autres fa&ccedil;ons d'encourager l'&eacute;criture, d'autres fa&ccedil;ons d'encourager les auteurs &agrave; gagner de l'argent. Par exemple, supposez que la reproduction int&eacute;grale d'un travail soit autoris&eacute;e et supposez que ce travail va avec quelquechose, du genre lorsque vous &ecirc;tes en train de jouer avec, ou de le lire, il y a une bo&icirc;te sur le c&ocirc;t&eacute; qui dit: &laquo;&nbsp;cliquez ici pour envoyer 1 dollar &agrave; l'auteur ou au musicien ou tout ce que vous voudrez&nbsp;&raquo;. Je pense que dans les parties les plus riches du monde beaucoup de gens l'enverraient parce que souvent les gens adorent les auteurs ou les musiciens qui ont cr&eacute;&eacute; ce qu'ils ont aim&eacute; lire ou &eacute;couter. Et la chose int&eacute;ressante est que la redevance qu'ils auront obtenue est maintenant une si petite fraction, que si vous payez vingt dollars ils n'en obtiendront pas plus d'un de toute fa&ccedil;on.

source: So this will be a far more efficient system. And the interesting thing will be that when people redistribute these copies they will be helping the author. Essentially advertising them, spreading around these reasons to send them a dollar. Now right now the biggest reason why more people don't just send some money to the authors is that it's a pain in the neck to do it. What are you going to do? Write a cheque? Then who are you going to mail the cheque to? You'd have to dig up their address, which might not be easy. But with a convenient internet payment system which makes it efficient to pay someone one dollar, then we could put this into all the copies, and then I think you'd find the mechanism starting to work well. It may take five of ten years for the ideas to spread around, because it's a cultural thing, you know, at first people might find it a little surprising but once it gets normal people would become accustomed to sending the money, and it wouldn't be a lot of money compared to what it costs to buy books today.
fr: Ce sera un syst&egrave;me bien plus efficace ainsi. Et ce qui sera int&eacute;ressant c'est que quand les gens redistribueront ces copies, ils aident l'auteur. En faisant essentiellement de la publicit&eacute; pour eux, en diffusant autour d'eux des raisons de leur envoyer un dollar. Maintenant, en ce moment, la plus grande raison pour laquelle pas plus de personne n'envoie de l'argent directement aux auteurs, c'est que c'est un emmerdement de le faire. Qu'allez-vous faire&nbsp;? Envoyer un ch&egrave;que&nbsp;? Alors &agrave; qui allez-vous exp&eacute;dier le ch&egrave;que&nbsp;? Vous auriez &agrave; d&eacute;nicher leur adresse, ce qui pourrait ne pas &ecirc;tre facile. Mais avec un syst&egrave;me commode de paiement sur Internet qui le rend efficace pour payer un dollar &agrave; quelqu'un, que nous pourrions mettre dans toutes les copies, alors je pense que vous auriez l&agrave; un m&eacute;canisme qui commence &agrave; bien marcher. Il peut prendre cinq &agrave; dix ans pour que l'id&eacute;e soit propag&eacute;e partout, parceque c'est une chose culturelle, vous savez. Au d&eacute;part, les gens pourraient la trouver surprenante mais un jour &ccedil;a devient naturel. Les gens s'habitueraient &agrave; envoyer de l'argent, et &ccedil;a ne repr&eacute;senterait pas beaucoup d'argent compar&eacute; &agrave; ce que cela co&ucirc;te d'acheter des livres aujourd'hui.

source: <em>[drinks]</em>
fr: <em>[il boit]</em>

source: So I think that in this way, for the works of expression, and maybe aesthetic works, maybe this could a successful method. But it won't work for the functional works, and the reason for that is that as one person after another makes a modified version and publishes it, who should the boxes point to, and how much money should they send, and you know, it's easy to do this when the work was published just once, by a certain author, or certain group of authors, and they can just agree together what they're going to do and click on the box, if no-one is publishing modified versions then every copy will contain the same box with the same URL directing money to the same people but when you have different version which have been worked on by different people there's no simple automatic way of working out who ought to get what fraction of what users donate for this version or that version. It's philosophically hard to decide how important each contribution is, and all the obvious ways of trying to measure it are <em>[emphasis]</em> obviously <em>[/emphasis]</em> wrong in some cases, they're obviously closing their eyes to some important part of the facts so I think that this kind of solution is probably not feasible when everybody is free to publish modified versions. But for those kinds of works where it is not crucial to have the freedom to publish modified versions then this solution can be applied very simply once we have the convenient internet payment system to base it on.
fr: Aussi je pense que de cette fa&ccedil;on, pour les travaux d'expression, et peut-&ecirc;tre les travaux esth&eacute;tiques, ce pourrait &ecirc;tre une m&eacute;thode r&eacute;ussie. Mais cela ne fonctionnera pas pour les travaux fonctionnels. Et la raison pour &ccedil;a, c'est que, si une personne apr&egrave;s une autre fait une version modifi&eacute;e et la publie, sur qui les bo&icirc;tes se dirigeraient-elles? Et combien d'argent devraient-elle envoyer&nbsp;? Et vous savez, il est facile de faire &ccedil;a quand le travail a &eacute;t&eacute; publi&eacute; simplement par le pass&eacute;, par un certain auteur, ou un certain groupe d'auteurs, et ils peuvent juste convenir ensemble de ce qu'ils vont faire et cliquer sur la bo&icirc;te. Si personne ne publie de versions modifi&eacute;es alors chaque copie contiendra la m&ecirc;me bo&icirc;te avec le m&ecirc;me URL dirigeant l'argent vers les m&ecirc;mes personnes. Mais quand vous avezdiff&eacute;rentes versions qui ont &eacute;t&eacute; travaill&eacute;es par diff&eacute;rentes personnes, il n'y a pas de simple fa&ccedil;on automatique de calculer qui, doit obtenir quelle fraction, de ce que quel utilisateur donne, pour cette version ou celle-l&agrave;. Il est philosophiquement difficile de d&eacute;cider de l'importance de chaque contribution, et de toutes les mani&egrave;res &eacute;videntes d'essayer de la mesurer certaines sont <em>[emphase ]</em> &eacute;videmment <em>[/emphase ]</em> mauvaises dans certains cas, en fermant &eacute;videmment les yeux &agrave; une partie importante des faits, aussi je pense que ce genre de solution n'est probablement pas faisable quand tout le monde est libre de publier des versions modifi&eacute;es. Mais pour le genre de travaux o&ugrave; il n'est pas crucial d'avoir la libert&eacute; de publier des versions modifi&eacute;es, alors cette solution peut &ecirc;tre appliqu&eacute; tr&egrave;s simplement, une fois que nous avons le syst&egrave;me pratique de paiement sur Internet pour la baser dessus.

source: With regard to the aesthetic works. If there is a system where those who commercially redistribute or maybe even those who are publishing a modified version might have to negotiate the sharing of the payments with the original developers and then this kind of scheme could be extended to those works too even if modified versions are permitted there could be some standard formula which could be in some cases renegotiated, so I think in some cases probably possible even with a system of permitting in some way publishing modified versions of the aesthetic works it may be possible still to have this kind of voluntary payment system.
fr: En ce qui concerne les travaux esth&eacute;tiques. S'il y a un syst&egrave;me o&ugrave; ceux qui redistribuent commercialement - ou peut-&ecirc;tre m&ecirc;me ceux qui publient une version modifi&eacute;e - peuvent avoir &agrave; n&eacute;gocier le partage des paiements avec le producteur de la version originale, alors ce genre d'arrangement pourrait &ecirc;tre prolong&eacute; aussi &agrave; ces travaux; m&ecirc;me si des versions modifi&eacute;es sont autoris&eacute;es, il pourrait y avoir une certaine formule standard qui pourrait &ecirc;tre ren&eacute;goci&eacute;e dans certains cas. Ainsi je pense que dans certains cas, probablement possibles m&ecirc;me avec un syst&egrave;me qui permet de publier des versions modifi&eacute;es des travaux esth&eacute;tiques, il serait possible d'avoir ce genre de syst&egrave;me volontaire de paiement.
