Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-versus-community.*.po
Languages: fr

source: Maybe in some cases it should be and in some cases it should not be. If there's a clear public benefit from knowing then maybe that should invalidate the contract, or maybe it should be valid when it is signed with customers or maybe between a business and a, maybe when a business supplies secrets to its suppliers that should be legitimate, but to its customers, no.
fr: Peut-&ecirc;tre que dans certains cas, &ccedil;a devrait, et dans d'autres non. S'il y a un avantage public clair de savoir alors peut-&ecirc;tre que &ccedil;a devrait invalider le contrat. Ou peut-&ecirc;tre devrait-il &ecirc;tre valide quand il est sign&eacute; avec des clients. Ou peut-&ecirc;tre entre une soci&eacute;t&eacute; et un <em>[&hellip;]</em>. Peut-&ecirc;tre que &ccedil;a devrait &ecirc;tre l&eacute;gitime quand une soci&eacute;t&eacute; fournit des secrets &agrave; ses fournisseurs. Mais &agrave; ses clients, non.

source: There are various possibilities one can think of, but at the very start anybody who hasn't voluntarily agreed to keep the secrets should not be bound by trade secrecy. That's the way it was until not long ago. Maybe it still is that way in Europe, I'm not sure.
fr: Il y a diverses possibilit&eacute;s auxquelles chacun peut penser, mais tout au d&eacute;but quiconque n'a pas accept&eacute; volontairement de garder les secrets ne devrait pas &ecirc;tre li&eacute; par le secret commercial. C'&eacute;tait comme &ccedil;a il n'y a pas si longtemps encore. Peut-&ecirc;tre que c'est toujours comme &ccedil;a en Europe, je ne suis pas s&ucirc;r.

source: <strong>AM11</strong>: Is is OK for a company to ask say its&hellip;
fr: <strong>MA11</strong>&nbsp;: Est-ce qu'une entreprise peut le demander &agrave; ses&hellip;

source: <strong>RMS</strong>: employees?
fr: <strong>RMS</strong>&nbsp;: employ&eacute;s&nbsp;?

source: <strong>AM11</strong>: No no
fr: <strong>MA11</strong>&nbsp;: Non non

source: <strong>RMS</strong>: suppliers?
fr: <strong>RMS</strong>&nbsp;: fournisseurs&nbsp;?

source: <strong>AM11</strong>: yes, suppliers. What if the customer is another supplier?
fr: <strong>MA11</strong>&nbsp;: oui, fournisseurs. Et si le client est un autre fournisseur&nbsp;?

source: <em>[gap as minidisk changed]</em>
fr: <em>[espace pendant que le minidisque est chang&eacute;]</em>

source: <strong>RMS</strong>: Let's start by not encouraging it.
fr: <strong>RMS</strong>&nbsp;: Commen&ccedil;ons par ne pas l'encourager.

source: <strong>AM12</strong>: I have a question regarding your opinion on the scientific work on journals and textbooks. In my profession at least one official journal and textbook are available on-line, but they retain copyright, but there is free access to the resources provided they have internet access.
fr: <strong>MA12</strong>&nbsp;: J'ai une question concernant votre avis sur le travail scientifique des journaux et des manuels. Dans ma profession au moins un Journal officiel et un manuel sont disponibles en ligne. Ils maintiennent le copyright, mais il y a un libre acc&egrave;s aux ressources pourvu qu'on ait l'acc&egrave;s &agrave; Internet.

source: <strong>RMS</strong>: Well, that's good. But there are many journals where it is not like that. For example, the ACM journals you can't access unless you are a subscriber: they're blocked. So I think journals should all start opening up access on the web.
fr: <strong>RMS</strong>&nbsp;: Ok, c'est bon. Mais il y a beaucoup de journaux o&ugrave; ce n'est pas comme &ccedil;a. Par exemple, les journaux d'ACM auxquels vous ne pouvez pas acc&eacute;der &agrave; part si vous &ecirc;tes abonn&eacute;&nbsp;: ils sont bloqu&eacute;s. Aussi je pense que les journaux devraient tout commencer &agrave; en ouvrir l'acc&egrave;s sur le Web.

source: <strong>AM12</strong>: So what impact does that have on the significance of copyright on the public when you basically don't interfere with providing free access on the web.
fr: <strong>MA12</strong>&nbsp;: Aussi, quel impact cela a t-il sur le sens du copyright sur le public, quand fondamentalement vous n'intervenez pas en proposant un libre acc&egrave;s sur le net&nbsp;?

source: <strong>RMS</strong>: Well, first of all, I disagree. Mirror sites are essential, so the journal should only provide open access but they should also give everyone the freedom to set up mirror sites with verbatim copies of these papers. If not then there is a danger that they will get lost. Various kinds of calamities could cause them to be lost, you know, natural disasters, political disasters, technical disasters, bureaucratic disasters, fiscal disasters&hellip; All sorts of things could cause that one site to disappear. So really what the scholarly community should logically be doing is carefully arranging to have a wide network of mirror sites making sure that every paper is available on every continent, from places near the ocean to places that are far inland and you know this is exactly the kind of thing that major libraries will feel is their mission if only they were not being stopped.
fr: <strong>RMS</strong>&nbsp;: Bien, tout d'abord je suis en d&eacute;saccord. Les sites miroir sont essentiels. Ainsi, le journal devrait non seulement offrir un acc&egrave;s libre mais devrait &eacute;galement donner &agrave; chacun la libert&eacute; d'installer des sites en miroir avec les copies int&eacute;grales de ces articles. Sinon, il y a un danger qu'ils soient perdus. Divers genres de calamit&eacute;s pourraient causer leur perte, vous savez, des d&eacute;sastres naturels, d&eacute;sastres politiques, d&eacute;sastres techniques, d&eacute;sastres bureaucratiques, d&eacute;sastres fiscaux&hellip; Toutes sortes de choses qui pourraient provoquer leur dispararition du site. C'est tellement vrai, que ce que la communaut&eacute; savante devrait logiquement faire, c'est se charger soigneusement d'avoir un large r&eacute;seau de sites en miroir en s'assurant que chaque papier est disponible sur chaque continent; depuis le bord de l'oc&eacute;an jusqu'&agrave; l'int&eacute;rieur des terres. Et vous savez que c'est exactement le genre de chose que les biblioth&egrave;ques principales sentiront que c'est dans leur mission de faire, si seulement elles n'&eacute;taient pas arr&ecirc;t&eacute;es.

source: So what should be done, is that these journals should go one step further. In addition to saying everybody can access the site they should be saying, everyone can set up a mirror site. Even if they said, you have to do the whole publication of this journal, together with our advertisements, now that would still at least do the job of making the availability redundant so that it's not in danger, and other institutions would set up mirror sites, and I predict that you would find ten years down the road, a very well organised unofficial system of co-ordinating the mirroring to make sure that nothing was getting left out. At this point the amount that it costs to set up the mirror site for years of a journal is so little that it doesn't require any special funding; nobody has to work very hard: just let librarians do it. Anyway, oh there was some other thing that this raised and I can't remember what it is. Oh well, I'll just have to let it go.
fr: Aussi, ce qui devrait &ecirc;tre fait, c'est que ces journaux devraient faire un pas de plus en avant. En plus de dire &laquo;&nbsp;tout le monde peut acc&eacute;der au site&nbsp;&raquo;, ils devraient dire &laquo;&nbsp;chacun peut installer un site miroir&nbsp;&raquo;. M&ecirc;me s'ils disaient &laquo;&nbsp;vous devez faire la publication enti&egrave;re de ce journal, en m&ecirc;me temps que nos annonces&nbsp;&raquo;, n&eacute;anmoins &ccedil;a ne ferait que rendre la disponibilit&eacute; superflue, au lieu de la mettre en danger. Et d'autres &eacute;tablissements installeraient des sites en miroir. Et je pr&eacute;vois que vous trouveriez dans un peu plus de dix ans, un syst&egrave;me officieux tr&egrave;s bien organis&eacute; de coordinateurs pour s'assurer que rien ne serait oubli&eacute;. En ce moment, ce que cela co&ucirc;te d'installer pour des ann&eacute;es un site en miroir d'un journal est si faible qu'il n'exige pas de financement sp&eacute;cial; personne n'a &agrave; travailler tr&egrave;s dur&nbsp;: il y a juste &agrave; laisser les biblioth&eacute;caires le faire. Quoi qu'il en soit, oh, il y avait autre chose que &ccedil;a a soulev&eacute;&hellip; et je ne me souviens pas ce que c'&eacute;tait. Oh ,bon, j'ai oubli&eacute;.

source: <strong>AM13</strong>: The financing problem for the aesthetical works&hellip; do you think the dynamics could be&hellip; <em>[inaudible]</em> although I understand the problems of&hellip; I mean who's contributing? and who will be rewarded? Does the spirit of free software <em>[inaudible]</em>
fr: <strong>MA13</strong>&nbsp;: Le probl&egrave;me de financement pour les travaux esth&eacute;tiques&hellip; pensez-vous que la dynamique pourrait &ecirc;tre&hellip; <em>[inaudible]</em> bien que je comprenne les probl&egrave;mes de&hellip; Je veux dire qui contribue&nbsp;? Et qui sera r&eacute;compens&eacute;&nbsp;? Est-ce que l'esprit du logiciel libre <em>[inaudible]</em>

source: <strong>RMS</strong>: I don't know. It's certainly suggesting the idea to people. We'll see. I don't the answers, I don't know how we're going to get there, I'm trying to think about where we should get to. I know know how we can get there. The publishers are so powerful, and can get governments to do their bidding. How we're going to build up the kind of world where the public refuses to tolerate this any more I don't know. I think the first thing we have to do is to clearly reject the term pirate and the views that go with it. Every time we hear that we have to speak out and say this is propaganda, it's not wrong for people to share these published works with each other, it's sharing with you friend, it's good. And sharing with your friend is more important than how much money these companies get. The society shouldn't be shaped for the sake of these companies. We have to keep on&hellip; because you see the idea that they've spread&mdash;that anything that reduces their income is immoral and therefore people must be restricted in any way it takes to guarantee for them to be paid for everything&hellip; that is the fundamental thing that we have to start attacking directly. People have mostly tried tactics of concentrating on secondary issues, you know, to when people, you know when the publishers demand increased power usually people saying it will cause some secondary kind of harm and arguing based on that but you rarely find anybody (except me) saying that the whole point of the change is wrong, that it's wrong to restrict it in that way, that it's legitimate for people to want to change copies and that they should be allowed to. We have to have more of this. We have to start cutting the root of their dominion not just hacking away at a few leaves.
fr: <strong>RMS</strong>&nbsp;: Je ne sais pas. L'id&eacute;e vient certainement &agrave; l'esprit des gens. Nous verrons. Je n'ai pas les r&eacute;ponses. Je ne sais pas comment nous allons les avoir. J'essaye de penser &agrave; peu pr&egrave;s o&ugrave; nous pourrions les obtenir. Je ne sais pas comment nous pourrions y arriver. Les &eacute;diteurs sont si puissants&hellip; ils peuvent obtenir des gouvernements qu'ils ex&eacute;cutent leurs ordres. Comment allons-nous construire ce genre de monde o&ugrave; le public refuse de tol&eacute;rer &ccedil;a plus longtemps, je ne sais pas. Je pense que la premi&egrave;re chose que nous devons faire est de rejeter clairement le mot pirate et les images qui vont avec. Tous les jours on nous dit d'oser prendre la parole, et dire que c'est de la propagande, qu'il n'est pas mauvais pour les gens de partager ces travaux publi&eacute;s avec les autres, que c'est partager avec votre ami, et que c'est bien. Et que partager avec votre ami, c'est plus important que l'argent que ces compagnies gagnent. Que la soci&eacute;t&eacute; ne devrait pas &ecirc;tre fa&ccedil;onn&eacute;e sur leurs int&eacute;r&ecirc;ts. Nous devons continuer&hellip; parce que vous voyez, l'id&eacute;e qu'elles ont r&eacute;pandu &mdash; que tout ce qui r&eacute;duit leur revenu est immoral et donc que les gens doivent &ecirc;tre limit&eacute;s quelqu'en soit le moyen pour garantir qu'ils seront pay&eacute;s pour tout&hellip; c'est la chose fondamentale que nous devons commencer &agrave; attaquer directement. Les gens ont la plupart du temps essay&eacute; la tactique de la concentration sur les questions secondaires, vous savez&hellip; Quand les &eacute;diteurs exigent plus de pouvoir, les gens habituellement disent que cela causera un certain type de mal secondaire, et basent leurs arguments la-dessus. Mais vous trouvez rarement quelqu'un (except&eacute; moi) qui dit que le point entier du changement est erron&eacute;, que c'est une erreur de le limiter de cette fa&ccedil;on, qu'il est l&eacute;gitime pour les gens de vouloir changer les copies et que &ccedil;a devrait leur &ecirc;tre permis. Nous devrions en avoir plus. Nous devons commencer &agrave; couper la racine de leur domination et pas simplement entailler loin quelques feuilles.

source: <strong>AM14</strong>: <em>[inaudible]</em> this is important is to concentrate on the donations system for music.
fr: <strong>MA14</strong>&nbsp;: <em>[inaudible]</em> ce qui est important, c'est de se concentrer sur le syst&egrave;me de donation pour la musique.

source: <strong>RMS</strong>: Yes. Unfortunately though there are patents covering the technique that seems most likely to be usable.
fr: <strong>RMS</strong>&nbsp;: Oui. Bien que malheureusement, il y ait des brevets couvrant la technique qui semblent &ecirc;tre tr&egrave;s probablement utilisables.

source: <em>[laughs, cries of &ldquo;no&rdquo; from audience]</em>
fr: <em>[rires, on crie &laquo;non&raquo; dans l'audience]</em>

source: <strong>RMS</strong>: So it may take ten years before we can do it.
fr: <strong>RMS</strong>&nbsp;: Cela peut mettre dix ans avant que &ccedil;a puisse se faire.

source: <strong>AM15</strong>: We only take French laws
fr: <strong>MA15</strong>&nbsp;: On prendra seulement les lois fran&ccedil;aises.

source: <strong>RMS</strong>: I don't know. I think I'd better hand the floor over to Melanie whose talk was supposed to start at 3. and uh so
fr: <strong>RMS</strong>&nbsp;: Je ne sais pas. Je pense que je devrais rendre la parole &agrave; M&eacute;lanie dont l'entretien devait commencer &agrave; trois heures. Et hue&nbsp;! donc.

source: RMS stands in silence. There is a pause before the outbreak of applause. RMS turns to applaud the stuffed fabric gnu he placed on the overhead projector at the beginning of the talk.
fr: RMS reste silencieux. Il y a une pause avant le d&eacute;clenchement des applaudissements. RMS se tourne pour applaudir le Gnu bourr&eacute; de tissu qu'il a plac&eacute; sur le r&eacute;tro-projecteur au d&eacute;but de l'entretien.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections (or suggestions) to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Miluz.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
