Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-and-globalization.*.po
Languages: fr

source: The next question is: Should people have the right to do commercial verbatim copying? Or is non-commercial enough? You see, these are two different activities we can distinguish, so that we can consider the questions separately &mdash; the right to do non-commercial verbatim copying and the right to do commercial verbatim copying. Well, it might be a good compromise policy to have copyright cover commercial verbatim copying but allow everyone the right to do non-commercial verbatim copying. This way, the copyright on the commercial verbatim copying, as well as on all modified versions &mdash; only the author could approve a modified version &mdash; would still provide the same revenue stream that it provides now to fund the writing of these works, to whatever extent it does.
fr: Il est alors l&eacute;gitime de se demander s'il faut autoriser une activit&eacute; commerciale autour de telles copies verbatim, ou si la diffusion &agrave; but non lucratif suffit. On peut donc distinguer deux activit&eacute;s diff&eacute;rentes, afin de les &eacute;tudier s&eacute;par&eacute;ment pour chercher des r&eacute;ponses &agrave; ces questions &mdash; le droit de faire des copies verbatim dans un but non lucratif, et le droit de faire des copies verbatim dans un contexte commercial. C'est un bon compromis que d'appliquer le copyright aux copies verbatim dans un contexte commercial, et d'autoriser sans autre contrainte les copies exactes ex&eacute;cut&eacute;es etdiffus&eacute;es dans un but non lucratif. De cette mani&egrave;re, les copyright sur les copies verbatim, ainsi que sur toutes les versions modifi&eacute;es &mdash; seul l'auteur pourrait approuver une version modifi&eacute;e &mdash; fournirait une source de revenus de la m&ecirc;me mani&egrave;re qu'il finance actuellement la cr&eacute;ation de ces &oelig;uvres, et dans les m&ecirc;mes limites.

source: By allowing the non-commercial verbatim copying, it means the copyright no longer has to intrude into everybody's home. It becomes an industrial regulation again, easy to enforce and painless, no longer requiring draconian punishments and informers for the sake of its enforcement. So we get most of the benefit &mdash; and avoid most of the horror &mdash; of the current system.
fr: Autoriser les copies exactes &agrave; but non lucratif signifie que le copyright ne doit plus s'immiscer dans la vie priv&eacute;e de chacun. Il redevient un r&egrave;glement industriel, d'application facile et indolore, ne n&eacute;cessitant plus de ch&acirc;timents draconiens ni d'informateurs, sous le seul pr&eacute;texte de le faire respecter. On obtient alors la majeure partie des b&eacute;n&eacute;fices &mdash; et on &eacute;vite la pire des horreurs &mdash; du syst&egrave;me actuel.

source: The third category of works is aesthetic or entertaining works, where the most important thing is just the sensation of looking at the work. Now for these works, the issue of modification is a very difficult one because on the one hand, there is the idea that these works reflect the vision of an artist and to change them is to mess up that vision. On the other hand, you have the fact that there is the folk process, where a sequence of people modifying a work can sometimes produce a result that is extremely rich. Even when you have artists' producing the works, borrowing from previous works is often very useful. Some of Shakespeare's plays used a story that was taken from some other play. If today's copyright laws had been in effect back then, those plays would have been illegal. So it's a hard question what we should do about publishing modified versions of an aesthetic or an artistic work, and we might have to look for further subdivisions of the category in order to solve this problem. For example, maybe computer game scenarios should be treated one way; maybe everybody should be free to publish modified versions of them. But perhaps a novel should be treated differently; perhaps for that, commercial publication should require an arrangement with the original author.
fr: La troisi&egrave;me cat&eacute;gorie renferme les travaux esth&eacute;tiques ou de loisirs, o&ugrave; le plus important est la sensation ressentie en regardant l'&oelig;uvre. La question de la modification est ici tr&egrave;s difficile&nbsp;: d'un c&ocirc;t&eacute; on trouve l'id&eacute;e que ces &oelig;uvres refl&egrave;tent la vision d'un artiste, et que toute modification viole et brise cette vision. D'autre part, il ne faut pas oublier les processus populaires, o&ugrave; des modifications apport&eacute;es en cha&icirc;ne par de nombreuses personnes produisent parfois un r&eacute;sultat extr&ecirc;mement riche. M&ecirc;me si ce sont des artistes qui cr&eacute;ent, les emprunts &agrave; des travaux pr&eacute;c&eacute;dents sont parfois fort utiles. Certaines pi&egrave;ces de Shakespeare se sont inspir&eacute;es d'&oelig;uvres ant&eacute;rieures. Si les lois de copyright aujourd'hui en vigueur avaient alors &eacute;t&eacute; appliqu&eacute;es, de telles pi&egrave;ces auraient &eacute;t&eacute; ill&eacute;gales. C'est donc une question difficile que de d&eacute;cider comment r&eacute;guler la publication de versions modifi&eacute;es d'&oelig;uvres esth&eacute;tiques ou artistiques, et il nous faudra peut-&ecirc;tre subdiviser cette troisi&egrave;me cat&eacute;gorie pour r&eacute;soudre ce probl&egrave;me. Par exemple, on peut imaginer de traiter les sc&eacute;narios de jeux vid&eacute;o d'une mani&egrave;re&nbsp;; peut-&ecirc;tre est-il souhaitable que quiconque puisse en publier des versions modifi&eacute;es. Mais peut-&ecirc;tre qu'un roman doit &ecirc;tre trait&eacute; diff&eacute;remment&nbsp;; peut-&ecirc;tre que toute publication commerciale devrait faire l'objet d'un accord avec l'auteur.

source: Now if commercial publication of these aesthetic works is covered by copyright, that will give most of the revenue stream that exists today to support the authors and musicians, to the limited extent that the present system supports them, because it does a very bad job. So that might be a reasonable compromise, just as in the case of the works which represent certain people.
fr: Si la publication commerciale de ces &oelig;uvres esth&eacute;tiques est couverte par le copyright, la plus grande part des revenus actuellement per&ccedil;us servira encore &agrave; financer les auteurs et les musiciens, dans la mesure restreinte o&ugrave; le pr&eacute;sent syst&egrave;me les soutient, car il est tr&egrave;s mauvais de ce pointde vue. Cela pourrait donc &ecirc;tre un compromis raisonnable, de la m&ecirc;me mani&egrave;re que celui que nous avons imagin&eacute; pour les &oelig;uvres de la deuxi&egrave;me cat&eacute;gorie, les &oelig;uvres qui repr&eacute;sentent certaines personnes.

source: If we look ahead to the time when the age of the computer networks will have fully begun, when we're past this transitional stage, we can envision another way for the authors to get money for their work. Imagine that we have a digital cash system that enables you to get money for your work. Imagine that we have a digital cash system that enables you to send somebody else money through the Internet; this can be done in various ways using encryption, for instance. And imagine that verbatim copying of all these aesthetic works is permitted. But they're written in such a way that when you are playing one or reading one or watching one, a box appears on the side of your screen that says, &ldquo;Click here to send a dollar to the author,&rdquo; or the musician or whatever. And it just sits there; it doesn't get in your way; it's on the side. It doesn't interfere with you, but it's there, reminding you that it's a good thing to support the writers and the musicians.
fr: Si nous nous projetons dans le futur, &agrave; l'&acirc;ge o&ugrave; les r&eacute;seaux auront v&eacute;ritablement d&eacute;ploy&eacute; leurs ailes, et o&ugrave; nous aurons d&eacute;pass&eacute; l'&eacute;tat transitoire actuel, on peut imaginer une autre mani&egrave;re de r&eacute;mun&eacute;rer les auteurs pour leurs travaux. Imaginez un syst&egrave;me de micro-paiements num&eacute;riques qui vous permette d'&ecirc;tre r&eacute;mun&eacute;r&eacute; pour votre travail. Imaginez un syst&egrave;me de micro-paiements num&eacute;riques qui permette d'envoyer de l'argent par l'Internet&nbsp;: il existe plusieurs mani&egrave;res d'obtenir un tel r&eacute;sultat en utilisant, par exemple, des proc&eacute;d&eacute;s cryptographiques de chiffrement. Imaginez encore que les copies exactes de toutes ces &oelig;uvres esth&eacute;tiques soient autoris&eacute;es, mais que ces &oelig;uvres soit &eacute;crites de telle mani&egrave;re que toute repr&eacute;sentation ou lecture ferait appara&icirc;tre sur le c&ocirc;t&eacute; de l'&eacute;cran une bo&icirc;te de dialogue disant &laquo;&nbsp;Cliquez ici pour envoyer un dollar &agrave; l'auteur&nbsp;&raquo;, ou au musicien, ou au titre que la personne concern&eacute;e se sera choisi.&nbsp; Cette bo&icirc;te se trouverait l&agrave;, sur le c&ocirc;t&eacute;, sans interf&eacute;rer ni d&eacute;ranger, mais elle vous rappellerait que c'est une bonne id&eacute;e d'encourager et de financer les auteurs et les musiciens.

source: So if you love the work that you're reading or listening to, eventually you're going to say, &ldquo;Why shouldn't I give these people a dollar? It's only a dollar. What's that? I won't even miss it.&rdquo; And people will start sending a dollar. The good thing about this is that it makes copying the ally of the authors and musicians. When somebody e-mails a friend a copy, that friend might send a dollar, too. If you really love it, you might send a dollar more than once and that dollar is more than they're going to get today if you buy the book or buy the CD because they get a tiny fraction of the sale. The same publishers that are demanding total power over the public in the name of the authors and musicians are giving those authors and musicians the shaft all the time.
fr: Si vous aimez l'&oelig;uvre que vous lisez ou &eacute;coutez, alors vous vous direz t&ocirc;t ou tard &laquo;&nbsp;Et pourquoi n'enverrais-je pas un dollar aux auteurs&nbsp;? Un dollar, qu'est-ce pour moi&nbsp;? Je ne verrai pas la diff&eacute;rence&nbsp;&raquo;. Et les gens commenceront &agrave; envoyer des dollars. Le point positif est que cela fait des copies l'alli&eacute; des auteurs et des musiciens&nbsp;: toute copie envoy&eacute;e par courrier &eacute;lectronique &agrave; un ami pourra inciter cet ami, lui aussi, &agrave; envoyer un dollar aux auteurs. Si vous aimez vraiment l'&oelig;uvre, vous pourrez envoyer plusieurs dollars &mdash; et ce dollar repr&eacute;sente plus que ce que les auteurs per&ccedil;oivent de nos jours si on ach&egrave;te un livre ou un CD, car seule une infime portion du prix de vente leur parvient. Ces m&ecirc;mes &eacute;diteurs, qui exigent un pouvoir et un contr&ocirc;le total sur le public au nom des auteurs et des musiciens, paient ces derniers au lance-pierres.

source: I recommend you read Courtney Love's article in &ldquo;Salon&rdquo; magazine, an article about pirates that plan to use musicians' work without paying them. These pirates are the record companies that pay musicians 4% of the sales figures, on the average. Of course, the very successful musicians have more clout. They get more than 4% of their large sales figures, which means that the great run of musicians who have a record contract get less than 4% of their small sales figures.
fr: Je vous recommande l'article de Courtney Love, publi&eacute; dans le magazine &laquo;&nbsp;Salon&nbsp;&raquo;, et traitant des pirates qui envisagent d'utiliser le travail des musiciens sans r&eacute;mun&eacute;rer ces derniers. Ces pirates sont les majors du disque, qui reversent en moyenne 4% des ventes aux musiciens. Bien s&ucirc;r, les musiciens &agrave; succ&egrave;s touchent davantage. Ils re&ccedil;oivent plus de 4% du faramineux chiffre d'affaires qu'ils suscitent &mdash; ce qui signifie que la grande majorit&eacute; des musiciens sous contrat avec les majors du disque per&ccedil;oivent moins de 4% de leurs ventes.

source: Here's the way it works: The record company spends money on publicity and they consider this expenditure as an advance to the musicians, although the musicians never see it. So nominally when you buy a CD, a certain fraction of that money is going to the musicians, but really it isn't. Really, it's going to pay back the publicity expenses, and only if the musicians are very successful do they ever see any of that money.
fr: Voici comment le syst&egrave;me fonctionne&nbsp;: la major investit dans une campagne publicitaire et consid&egrave;re ces frais comme une avance aux musiciens, alors m&ecirc;me que les musiciens n'en per&ccedil;oivent rien. Ainsi, ce n'est qu'en th&eacute;orie qu'une certaine fraction du prix de vente de tout CD revient aux musiciens. Enr&eacute;alit&eacute;, cette fraction rembourse les frais de la campagne publicitaire, et seuls les musiciens qui vendent beaucoup de disques commencent &agrave; toucher des royalties au-del&agrave; d'un certain seuil de ventes.

source: The musicians, of course, sign their record contracts because they hope they're going to be one of those few who strike it rich. So essentially a rolling lottery is being offered to the musicians to tempt them. Although they're good at music, they may not be good at careful, logical reasoning to see through this trap. So they sign and then probably all they get is publicity. Well, why don't we give them publicity in a different way, not through a system that's based on restricting the public and a system of the industrial complex that saddles us with lousy music that's easy to sell. Instead, why not make the listener's natural impulse to share the music they love the ally of the musicians? If we have this box that appears in the player as a way to send a dollar to the musicians, then the computer networks could be the mechanism for giving the musicians this publicity, the same publicity which is all they get from record contracts now.
fr: Bien s&ucirc;r, les musiciens ne signent de tels contrats que dans l'espoir de faire partie des rares chanceux qui auront du succ&egrave;s. C'est en quelque sorte une loterie qu'on leur propose, une tentation. M&ecirc;me s'ils sont bons musicalement, ils peuvent &ecirc;tre moins bons en perspicacit&eacute; et en logique, et ne pas remarquer ce pi&egrave;ge. C'est ainsi qu'ils en viennent &agrave; signer &mdash; et &agrave; n'en retirer qu'une campagne publicitaire. Bien, mais pourquoi ne pas leur offrir un autre type de campagne publicitaire, sans passer par un syst&egrave;me restrictif et contraignant, un syst&egrave;me industriel qui nous bassine de soupe facile &agrave; vendre. Pourquoi les musiciens ne s'allieraient-ils pas plut&ocirc;t la tendance naturelle des auditeurs &agrave; partager les morceaux qu'ils aiment&nbsp;? Avec l'apparition d'une bo&icirc;te de dialogue incitant &agrave; envoyer un dollar aux musiciens, les r&eacute;seaux informatiques deviendraient leur vecteur de publicit&eacute; &mdash; publicit&eacute; qui pour l'instant est le seul b&eacute;n&eacute;fice qu'ils retirent de leurs contrats avec les majors du disque.

source: We have to recognize that the existing copyright system does a lousy job of supporting musicians, just as lousy as world trade does of raising living standards in the Philippines and China. You have these enterprise zones where everyone works in a sweatshop and all of the products are made in sweatshops. I knew that globalization was a very inefficient way of raising living standards of people overseas. Say, an American is getting paid $20 an hour to make something and you give that job to a Mexican who is getting paid maybe six dollars a day, what has happened here is that you've taken a large amount of money away from an American worker, given a tiny fraction, like a few percents, to a Mexican worker and given back the rest to the company. So if your goal is to raise the living standards of Mexican workers, this is a lousy way to do it.
fr: Il nous faut reconna&icirc;tre que le syst&egrave;me actuel du copyright ne finance les musiciens que de mani&egrave;re ex&eacute;crable &mdash; aussi ex&eacute;crable que la mani&egrave;re dont le commerce international &eacute;l&egrave;ve le niveau de vie aux Philippines ou en Chine. Voyez ces zones franches o&ugrave; tout le monde travaille dans des ateliers de confection, et o&ugrave; tout y est produit. La mondialisation est un moyen tr&egrave;s inefficace d'am&eacute;liorer le niveau de vie des populations des pays pauvres. Soit un Am&eacute;ricain pay&eacute; 20 dollars de l'heure pour un travail; si on donne ce travail &agrave; un Mexicain qui l'effectue, disons, pour 6 dollars par jour, le r&eacute;sultat est qu'on a pris beaucoup d'argent au travailleur am&eacute;ricain, pour n'en reverser qu'une infime portion (quelques pourcents) au travailleur mexicain &mdash; l'essentiel du b&eacute;n&eacute;fice est pour l'entreprise. Si votre but est d'&eacute;lever le niveau de vie au Mexique, voil&agrave; une bienmauvaise mani&egrave;re de proc&eacute;der.

source: It's interesting to see how the same phenomenon is going on in the copyright industry, the same general idea. In the name of these workers who certainly deserve something, you propose measures that give them a tiny bit and really mainly prop up the power of corporations to control our lives.
fr: Il est int&eacute;ressant d'observer le m&ecirc;me ph&eacute;nom&egrave;ne et la m&ecirc;me id&eacute;e g&eacute;n&eacute;rale dans l'industrie du copyright. Au nom de ces travailleurs qui m&eacute;ritent sans aucun doute de recevoir quelque chose, on propose des mesures qui ne leur reversent qu'une infime portion des b&eacute;n&eacute;fices et qui ont pour effet principal d'&eacute;tayer le pouvoir qu'exercent les grandes soci&eacute;t&eacute;s sur nos vies.

source: If you're trying to replace a very good system, you have to work very hard to come up with a better alternative. If you know that the present system is lousy, it's not so hard to find a better alternative; the standard of comparison today is very low. We must always remember that when we consider issues of copyright policy.
fr: Quand on essaie de remplacer un tr&egrave;s bon syst&egrave;me, il faut travailler dur pour proposer une solution meilleure encore. Quand on sait que le syst&egrave;me actuel est bancal, il n'est pas si difficile que cela de trouver une meilleure solution; de nos jours, la barre n'est pas plac&eacute;e tr&egrave;s haut. Il faut toujours garder cela en t&ecirc;te quand on r&eacute;fl&eacute;chit aux politiques &agrave; appliquer en mati&egrave;re de copyright.

source: So I think I've said most of what I want to say. I'd like to mention that tomorrow is Phone-In Sick Day in Canada. Tomorrow is the beginning of a summit to finish negotiating the free trade area of the Americas to try to extend corporate power throughout additional countries, and a big protest is being planned for Quebec. We've seen extreme methods being used to smash this protest. A lot of Americans are being blocked from entering Canada through the border that they're supposed to be allowed to enter through at any time. On the flimsiest of excuses, a wall has been built around the center of Quebec to be used as a fortress to keep protesters out. We've seen a large number of different dirty tricks used against public protest against these treaties. So whatever democracy remains to us after government powers have been taken away from democratically elected governors and given to businesses and to unelected international bodies, whatever is left after that may not survive the suppression of public protest against it.
fr: Je pense avoir dit tout ce que j'avais &agrave; dire. J'aimerais mentionner que demain (le 20 avril 2001) est, au Canada, le jour de l'op&eacute;ration &laquo;&nbsp;appeler son employeur en pr&eacute;tendant &ecirc;tre malade&nbsp;&raquo;. C'est en effet le d&eacute;but d'un sommet qui doit finaliser les n&eacute;gociations de la zone de libre&eacute;change aux Am&eacute;riques pour tenter d'&eacute;tendre le pouvoir des grandes entreprises &agrave; d'autres pays encore, et une grande manifestation de protestation est pr&eacute;vue au Qu&eacute;bec. On a pu observer des m&eacute;thodes extr&ecirc;mes pour &eacute;craser cette protestation&nbsp;: de nombreuxAm&eacute;ricains sont bloqu&eacute;s &agrave; la fronti&egrave;re alors qu'ils sont cens&eacute;s pouvoir &agrave; tout instant entrer librement au Canada. On a construit, sur un pr&eacute;texte compl&egrave;tement bidon, un mur-forteresse autour du centre-ville de Qu&eacute;bec pour en exclure les protestataires. On a utilis&eacute; de nombreuses autres sales m&eacute;thodes pour contrer la contestation publique de ces trait&eacute;s. S'il nous restait une once de d&eacute;mocratie apr&egrave;s le transfert de pouvoirs, &ocirc;t&eacute;s &agrave; des gouverneurs d&eacute;mocratiquement &eacute;lus, et attribu&eacute;s &agrave; des entreprises et &agrave; des multinationales nullement &eacute;lues, peut-&ecirc;tre bien que maintenant qu'on supprime et opprime les manifestations de protestation, cette infime portion de d&eacute;mocratie qui nous restait ne survivra pas.

source: I've dedicated 17 years of my life to working on free software and allied issues. I didn't do this because I think it's the most important political issue in the world. I did it because it was the area where I saw I had to use my skills to do a lot of good. But what's happened is that the general issues of politics have evolved, and the biggest political issue in the world today is resisting the tendency to give business power over the public and governments. I see free software and the allied questions for other kinds of information that I've been discussing today as one part of that major issue. So I've indirectly found myself working on that issue. I hope I contribute something to the effort.
fr: J'ai consacr&eacute; 17 ans de ma vie au logiciel libre et &agrave; des causes proches. Je ne l'ai pas fait parce que je pensais que c'&eacute;tait la cause politique la plus importante, mais parce que c'&eacute;tait le domaine o&ugrave; je voyais que je pouvais utiliser mon talent pour faire beaucoup de bien. Mais les causes politiques ont&eacute;volu&eacute;, et de nos jours la cause politique majeure est de r&eacute;sister &agrave; la tendance de donner le pouvoir aux entreprises, au d&eacute;triment des peuples et des gouvernements. Je vois le logiciel libre et les questions apparent&eacute;es concernant d'autres types d'informations, dont j'ai parl&eacute; aujourd'hui,comme un volet de cette cause fondamentale. C'est donc indirectement que j'ai travaill&eacute; pour cette cause. J'esp&egrave;re que ma contribution &agrave; cet effort n'est pas vaine.

source: <b>RESPONSE</b>:
fr: <b>R&Eacute;PONSE </b>&nbsp;:
