Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-and-globalization.*.po
Languages: fr

source: <b>THORBURN</b>: We'll turn to the audience for questions and comments in a moment. But let me offer a brief general response. It seems to me that the strongest and most important practical guidance that Stallman offers us has two key elements. One is the recognition that old assumptions about copyright, old usages of copyright are inappropriate; they are challenged or undermined by the advent of the computer and computer networks. That may be obvious, but it is essential.
fr: <b>THORBURN</b>&nbsp;: Nous allons accepter les questions et les commentaires du public dans un instant. Je souhaite d'abord apporter une br&egrave;ve r&eacute;ponse g&eacute;n&eacute;rale. Il me semble que les r&eacute;flexions de Stallman comportent deux &eacute;l&eacute;ments clefs, particuli&egrave;rement forts etimportants. Le premier est de reconna&icirc;tre que les anciennes hypoth&egrave;ses et les vieux usages en mati&egrave;re de copyright ne sont plus appropri&eacute;s, et sont remis en cause ou sap&eacute;s par l'av&egrave;nement de l'ordinateur et des r&eacute;seaux informatiques. C'est peut-&ecirc;tre &eacute;vident, mais c'est essentiel.

source: Second is the recognition that the digital era requires us to reconsider how we distinguish and weigh forms of intellectual and creative labor. Stallman is surely right that certain kinds of intellectual enterprises justify more copyright protection than others. Trying to identify systematically these different kinds or levels of copyright protection seems to me a valuable way to engage with the problems for intellectual work posed by the advent of the computer.
fr: Le deuxi&egrave;me est de comprendre que l'&egrave;re num&eacute;rique nous force &agrave; r&eacute;fl&eacute;chir &agrave; la mani&egrave;re dont on distingue et dont on &eacute;value les diff&eacute;rentes formes de travaux intellectuels et cr&eacute;atifs. Stallman a certainement raison de signaler que certaines entreprises intellectuelles justifient plus que d'autres une protection accrue par le copyright. Tenter d'identifier de mani&egrave;re syst&eacute;matique ces diff&eacute;rents types ou niveaux de protection par le copyright me semble une mani&egrave;re valable de traiter les probl&egrave;mes pos&eacute;s aux travaux intellectuels par la venue de l'ordinateur.

source: But I think I detect another theme that lies beneath what Stallman has been saying and that isn't really directly about computers at all, but more broadly about questions of democratic authority and the power that government and corporations increasingly exercise over our lives. This populist and anti-corporate side to Stallman's discourse is nourishing but also reductive, potentially simplifying. And it is also perhaps overly idealistic. For example, how would a novelist or a poet or a songwriter or a musician or the author of an academic textbook survive in this brave new world where people are encouraged but not required to pay authors. In other words, it seems to me, the gap between existing practice and the visionary possibilities Stallman speculates about is still immensely wide.
fr: Mais je pense d&eacute;tecter un th&egrave;me suppl&eacute;mentaire, sous-jacent dans le discours de Stallman, un th&egrave;me pas vraiment li&eacute; aux ordinateurs, mais plus largement aux questions d'autorit&eacute; d&eacute;mocratique et au pouvoir que les gouvernements et les grandes entreprises exercent de fa&ccedil;on croissante sur nos vies. Ce c&ocirc;t&eacute; populiste et anti-mondialisation du discours de Stallman est stimulant mais aussi r&eacute;ducteur, voire simpliste. Et il est peut-&ecirc;tre par trop id&eacute;aliste. Par exemple, comment un romancier, un po&egrave;te, un parolier, un musicien, ou l'auteur d'un manuel universitaire survivraient-ils dans ce meilleur des mondes, o&ugrave; l'on encourage les gens &agrave; r&eacute;mun&eacute;rer les auteurs, sans les y obliger.&nbsp; En d'autres mots, il me semble que le foss&eacute; s&eacute;parant ce qui se pratique actuellement et les possibilit&eacute;s visionnaires sur lesquelles Stallman sp&eacute;cule est toujours immense.

source: So I'll conclude by asking if Stallman would like to expand a bit on certain aspects of his talk and, specifically, whether he has further thoughts about the way in which what we'll call &ldquo;traditional creators&rdquo; would be protected under his copyright system.
fr: Je conclurai donc en demandant &agrave; Stallman de d&eacute;velopper certains aspects de son discours, et en particulier s'il a des id&eacute;es suppl&eacute;mentaires sur la mani&egrave;re dont ceux que nous appellerons &laquo;&nbsp;les cr&eacute;ateurs traditionnels&nbsp;&raquo; seraient prot&eacute;g&eacute;s dans le syst&egrave;me de copyright qu'il propose.

source: <b>STALLMAN</b>: First of all, I have to point out that we shouldn't use the term &ldquo;protection&rdquo; to describe what copyright does. Copyright restricts people. The term &ldquo;protection&rdquo; is a propaganda term of the copyright-owning businesses. The term &ldquo;protection&ldquo; means stopping something from being somehow destroyed. Well, I don't think a song is destroyed if there are more copies of it being played more. I don't think that a novel is destroyed if more people are reading copies of it, either. So I won't use that word. I think it leads people to identify with the wrong party.
fr: <b>STALLMAN</b>&nbsp;: Tout d'abord, je dois pr&eacute;ciser un point&nbsp;: il ne faut pas utiliser le terme &laquo;&nbsp;protection&nbsp;&raquo; quand on se r&eacute;f&egrave;re &agrave; l'action du copyright. Le copyright restreint les gens. Le mot &laquo;&nbsp;protection&nbsp;&raquo; est un terme de propagande utilis&eacute; par les entreprises propri&eacute;taires de copyrights. &laquo;&nbsp;Protection&nbsp;&raquo; signifie emp&ecirc;cher une forme de destruction de quelque chose. Je ne pense pas qu'une chanson soit d&eacute;truite si un plus grand nombre de copies de cette chanson sont diffus&eacute;es plus souvent, aupr&egrave;s d'un plus grand nombre d'auditeurs. Je ne pense pas non plus qu'un roman soit d&eacute;truit si un plus grand nombre de lecteurs en lisent des copies. Aussi n'utiliserai-je pas ce mot. Je pense qu'il incite &agrave; s'identifier avec le mauvais bord.

source: Also, it's a very bad idea to think about intellectual property for two reasons: First, it prejudges the most fundamental question in the area which is: How should these things be treated and should they be treated as a kind of property? To use the term &ldquo;intellectual property&rdquo; to describe the area is to presuppose the answer is &ldquo;yes,&rdquo; that that's the way to treat things, not some other way.
fr: De plus, c'est une tr&egrave;s mauvaise id&eacute;e de r&eacute;fl&eacute;chir &agrave; la propri&eacute;t&eacute; intellectuelle, et ce, pour deux raisons&nbsp;: d'abord, cela pr&eacute;suppose une r&eacute;ponse &agrave; la question la plus fondamentale de ce domaine, c'est-&agrave;-dire&nbsp;: &laquo;&nbsp;Comment ces choses doivent-elles &ecirc;tre trait&eacute;es, doivent-elles &ecirc;tre trait&eacute;es en tant qu'une forme de propri&eacute;t&eacute;&nbsp;?&nbsp;&raquo;. Utiliser le terme&laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; pour d&eacute;crire ce domaine revient &agrave; pr&eacute;supposer qu'on r&eacute;pond affirmativement &agrave; cette question, que c'est la bonne mani&egrave;re d'envisager les choses, et qu'aucune autre n'est acceptable.

source: Second, it encourages over-generalization. Intellectual property is a catch-all for several different legal systems with independent origins such as, copyrights, patents, trademarks, trade secrets and some other things as well. They are almost completely different; they have nothing in common. But people who hear the term &ldquo;intellectual property&rdquo; are led to a false picture where they imagine that there's a general principle of intellectual property that was applied to specific areas, so they assume that these various areas of the law are similar. This leads not only to confused thinking about what is right to do, it leads people to fail to understand what the law actually says because they suppose that the copyright law and patent law and trademark law are similar, when, in fact, they are totally different.
fr: Ensuite, cela incite &agrave; g&eacute;n&eacute;raliser abusivement. &laquo;&nbsp;Propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; est un terme g&eacute;n&eacute;rique pour plusieurs syst&egrave;mes juridiques diff&eacute;rents, d'origines ind&eacute;pendantes, tels que le copyright, les brevets, les marques d&eacute;pos&eacute;es, les secrets industriels, et d'autres choses encore. Ce sont l&agrave; des domaines presque totalement diff&eacute;rents&nbsp;: ils n'ont rien en commun. Mais ceux qui entendent le terme &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; sont incit&eacute;s &agrave; penser incorrectement, et ils imaginent que c'est un principe g&eacute;n&eacute;rique de la propri&eacute;t&eacute; intellectuelle qu'on applique &agrave; des cas particuliers, aussi supposent-ils queces divers domaines juridiques sont similaires. Cela a pour cons&eacute;quences, non seulement de rendre plus confuses les r&eacute;flexions sur les bonnes mani&egrave;res de proc&eacute;der, mais aussi d'emp&ecirc;cher de bien comprendre la loi car on suppose que les lois portant sur les copyrights, sur les brevets et sur lesmarques d&eacute;pos&eacute;es sont semblables quand en r&eacute;alit&eacute; elles diff&egrave;rent totalement.

source: So if you want to encourage careful thinking and clear understanding of what the law says, avoid the term &ldquo;intellectual property.&rdquo; Talk about copyrights. Or talk about patents. Or talk about trademarks or whichever subject you want to talk about. But don't talk about intellectual property. Opinion about intellectual property almost has to be a foolish one. I don't have an opinion about intellectual property. I have opinions about copyrights and patents and trademarks, and they're different. I came to them through different thought processes because those systems of law are totally different.
fr: C'est pourquoi, si vous souhaitez encourager une r&eacute;flexion prudente et une compr&eacute;hension claire de la loi, il vous faut &eacute;viter le terme &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;. Parlez de copyrights, parlez de brevets, parlez de marques d&eacute;pos&eacute;es ou parlez de quoi que ce soit d'autre dont vous voulez parler. Mais ne parlez pas de &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;. Toute opinion portant sur la &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; est presque forc&eacute;ment erron&eacute;e. Je n'ai aucune opinion sur la &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;. J'ai des opinions sur les copyrights, sur les brevets, et sur les marques d&eacute;pos&eacute;es, mais ce sont des opinions diff&eacute;rentes. Je me suis forg&eacute; ces opinions &agrave; travers des cheminements de pens&eacute;e diff&eacute;rents, car ce sont des syst&egrave;mes juridiques compl&egrave;tement diff&eacute;rents.

source: Anyway, I made that digression, but it's terribly important.
fr: Je me suis permis cette digression parce que je pense que c'est quelque chose d'extr&ecirc;mement important.

source: So let me now get to the point. Of course, we can't see now how well it would work, whether it would work to ask people to pay money voluntarily to the authors and musicians they love. One thing that's obvious is that how well such a system would work is proportional to the number of people who are participating in the network, and that number, we know, is going to increase by an order of magnitude over a number of years. If we tried it today, it might fail, and that wouldn't prove anything because with ten times as money people participating, it might work.
fr: Je vais maintenant r&eacute;pondre &agrave; votre question. Bien s&ucirc;r, nous ne voyons pas bien, actuellement, de quelle mani&egrave;re cela fonctionnerait, si m&ecirc;me cela pourrait fonctionner, de demander aux gens de r&eacute;tribuer volontairement les auteurs et les musiciens qu'ils appr&eacute;cient. Il est &eacute;vident toutefois que ce syst&egrave;me fonctionnera d'autant mieux que de nombreuses personnes feront partie du r&eacute;seau &mdash; et vous savez que ce nombre d&eacute;cuplera d'ici quelques ann&eacute;es. Si nous essayions ce syst&egrave;me aujourd'hui, il &eacute;chouerait peut-&ecirc;tre, et cela ne prouverait rien, car il pourrait fort bien fonctionner avec dix fois plus de participants.

source: The other thing is, we do not have this digital cash payment system; so we can't really try it today. You could try to do something a little bit like it. There are services you can sign up for where you can pay money to someone &mdash; things like Pay Pal. But before you can pay anyone through Pay Pal, you have to go through a lot of rigmarole and give them personal information about you, and they collect records of whom you pay. Can you trust them not to misuse that?
fr: D'autre part, nous ne disposons pas encore de ce syst&egrave;me de micro-paiement num&eacute;rique; aussi ne pouvons-nous pas vraiment mettre cela en pratique de nos jours. Tout au plus pouvons-nous essayer des sch&eacute;mas semblables. On peut s'inscrire &agrave; des services o&ugrave; on peut envoyer de l'argent &agrave; quelqu'un &mdash; des services tels que &laquo;&nbsp;Pay Pal&nbsp;&raquo;. Mais avant d'&ecirc;tre capable d'envoyer de l'argent &agrave; quelqu'un &agrave; travers &laquo;&nbsp;Pay Pal&nbsp;&raquo;, il faut se farcir tout un galimatias, communiquer des informations personnelles, et le service conserve des traces des paiements effectu&eacute;s. Comment &ecirc;tre s&ucirc;r qu'ils n'abuseront pas de ces informations&nbsp;?

source: So the dollar might not discourage you, but the trouble it takes to pay might discourage you. The whole idea of this is that it should be as easy as falling off a log to pay when you get the urge, so that there's nothing to discourage you except the actual amount of money. And if that's small enough, why should it discourage you. We know, though, that fans can really love musicians, and we know that encouraging fans to copy and re-distribute the music has been done by some bands that were, and are, quite successful like the &ldquo;Grateful Dead.&rdquo; They didn't have any trouble making a living from their music because they encouraged fans to tape it and copy the tapes. They didn't even lose their record sales.
fr: M&ecirc;me si l'envoi du dollar ne vous d&eacute;courage pas, la complexit&eacute; de la proc&eacute;dure le fera peut-&ecirc;tre. L'id&eacute;e g&eacute;n&eacute;rale est qu'il doit &ecirc;tre simple comme bonjour de payer quand on en ressent l'envie, de telle sorte que seul le montant transmis pourrait d&eacute;courager un &eacute;ventuel m&eacute;c&egrave;ne, et rien d'autre. Et si ce montant est suffisamment modeste, en quoi vous d&eacute;couragerait-il&nbsp;? Nous savons par ailleurs les proportions que l'adulation des idoles peut atteindre et nous savons que certains groupes ont encourag&eacute; leurs fans &agrave; copier et rediffuser leur musique &mdash; groupes qui furent, ou sont encore, fort populaires, comme &laquo;&nbsp;Grateful Dead&nbsp;&raquo;. Ces groupes n'ont eu aucun probl&egrave;me &agrave; vivre de leur musique sous pr&eacute;texte d'encourager leurs fans &agrave; en faire des enregistrements ni &agrave; &eacute;changer ces enregistrements. Ils n'ont m&ecirc;me rien perdu en termes de ventes.

source: We are gradually moving from the age of the printing press to the age of the computer network, but it's not happening in a day. People are still buying lots of records, and that will probably continue for many years &mdash; maybe forever. As long as that continues, simply having copyrights that still apply to commercial sales of records ought to do about as good a job of supporting musicians as it does today. Of course, that's not very good, but, at least, it won't get any worse.
fr: Peu &agrave; peu, nous quittons l'&acirc;ge de l'imprimerie et entrons dans l'&acirc;ge des r&eacute;seaux informatiques, mais ce changement est graduel. Nombreux sont ceux qui continuent &agrave; acheter des disques, et cela continuera probablement de nombreuses ann&eacute;es encore, voire toujours.&nbsp; Tant que cela continuera, disposer de copyrights qui s'appliqueront sur les ventes de disques financera les musiciens &agrave; peu pr&egrave;s aussi bien que de nos jours. Bien s&ucirc;r, cela n'est pas tr&egrave;s efficace &mdash; mais au moins, cela ne pourra pas empirer.

source: <b>DISCUSSION</b>:
fr: <b>DISCUSSION</b>&nbsp;:

source: <b>QUESTION</b>: [A comment and and question about free downloading and about Stephen King's attempt to market one of his novels serially over the web.]
fr: <b>QUESTION</b>&nbsp;: [Un commentaire et une question sur le t&eacute;l&eacute;chargement, en mentionnant la tentative de Stephen King de vendre l'un de ses romans &eacute;pisode apr&egrave;s &eacute;pisode, sur le web.]

source: <b>STALLMAN</b>: Yes, it's interesting to know what he did and what happened. When I first heard about that, I was elated. I thought, maybe he was taking a step towards a world that is not based on trying to maintain an iron grip on the public. Then I saw that he had actually written to ask people to pay. To explain what he did, he was publishing a novel as a serial, by installments, and he said, &ldquo;If I get enough money, I'll release more.&rdquo; But the request he wrote was hardly a request. It brow-beat the reader. It said, &ldquo;If you don't pay, then you're evil. And if there are too many of you who are evil, then I'm just going to stop writing this.&rdquo;
fr: <b>STALLMAN</b>&nbsp;: Oui, c'est int&eacute;ressant de savoir ce qu'il a fait et ce qui s'est pass&eacute;. Quand j'ai entendu parler de ce projet, j'ai &eacute;t&eacute; enthousiaste. Je pensais que peut-&ecirc;tre Stephen King faisait quelques pas en direction d'un monde qui ne reposait pas sur le contr&ocirc;le du public dans une poigne de fer. Ensuite j'ai vu qu'il avait en fait &eacute;crit pour demander aux gens de payer. Il publiait en r&eacute;alit&eacute; un roman par &eacute;pisodes, en disant&nbsp;: &laquo;&nbsp;Si je re&ccedil;ois assez d'argent, je publierai l'&eacute;pisode suivant&nbsp;&raquo;. Mais c'&eacute;tait moins une requ&ecirc;te qu'une intimidation. Il disaiten substance: &laquo;&nbsp;Si vous ne payez pas, vous &ecirc;tes mauvais. Et si vous &ecirc;tes trop nombreux &agrave; &ecirc;tre mauvais, alors je cesserai d'&eacute;crire ce roman, tout simplement&nbsp;&raquo;.

source: Well, clearly, that's not the way to make the public feel like sending you money. You've got to make them love you, not fear you.
fr: Ce n'est clairement pas la bonne mani&egrave;re d'inciter le public &agrave; vous envoyer de l'argent &mdash; il faut faire en sorte d'&ecirc;tre aim&eacute;, et non craint.

source: <b>SPEAKER</b>: The details were that he required a certain percentage &mdash; I don't know the exact percentage, around 90% sounds correct &mdash; of people to send a certain amount of money, which, I believe, was a dollar or two dollars, or somewhere in that order of magnitude. You had to type in your name and your e-mail address and some other information to get to download it and if that percentage of people was not reached after the first chapter, he said that he would not release another chapter. It was very antagonistic to the public downloading it.
fr: <b>LE M&Ecirc;ME</b>&nbsp;: Pour entrer dans les d&eacute;tails, il fallait qu'un certain pourcentage &mdash; j'ai oubli&eacute; le pourcentage exact, environ 90%&nbsp; &mdash; de personnes envoient une certaine somme d'argent &mdash; disons, un ou deux dollars, ou une somme de cet ordre. Il fallait taper son nom et son adresse &eacute;lectronique pour t&eacute;l&eacute;charger l'&eacute;pisode et si le pourcentage souhait&eacute; n'&eacute;tait pas atteint apr&egrave;s le premier chapitre, l'auteur disait qu'il ne publierait pas le chapitre suivant. C'&eacute;tait tr&egrave;s contraignant et agressif vis-&agrave;-vis de ceux qui t&eacute;l&eacute;chargeaient les chapitres.

source: <b>QUESTION</b>: Isn't the scheme where there's no copyright but people are asked to make voluntary donations open to abuse by people plagiarizing?
fr: <b>QUESTION</b>&nbsp;: Un monde sans copyright, o&ugrave; on incite &agrave; faire des donations volontaires, n'est-il pas propice aux abus et aux plagiats&nbsp;?

source: <b>STALLMAN</b>: No. That's not what I proposed. Remember, I'm proposing that there should be copyright covering commercial distribution and permitting only verbatim re-distribution non-commercially. So anyone who modified it to put in a pointer to his website, instead of a pointer to the real author's website, would still be infringing the copyright and could be sued exactly as he could be sued today.
fr: <b>STALLMAN</b>&nbsp;: Non. Ce n'est pas ce que j'ai propos&eacute;. Souvenez-vous, je propose que le copyright couvre les distributions commerciales, et que seules les copies exactes puissent &ecirc;tre diffus&eacute;es de mani&egrave;re non lucrative. Ainsi, quiconque modifierait l'&oelig;uvre pour y inclure un pointeur vers son propre siteweb &mdash; au lieu d'un pointeur vers le site web de l'auteur original &mdash; violerait le copyright&nbsp; et pourrait &ecirc;tre poursuivi pour cela, exactement comme c'est le cas aujourd'hui.

source: <b>QUESTION</b>: I see. So you're still imagining a world in which there is copyright?
fr: <b>QUESTION</b>&nbsp;: Je vois. Dans le monde que vous imaginez, le copyright existe donc toujours&nbsp;?

source: <b>STALLMAN</b>: Yes. As I've said, for those kinds of works. I'm not saying that everything should be permitted. I'm proposing to reduce copyright powers, not abolish them.
fr: <b>STALLMAN</b>&nbsp;: Oui. Comme je l'ai expliqu&eacute;, pour cette cat&eacute;gorie d'&oelig;uvres. Je ne dit pas que tout devrait &ecirc;tre permis. Je propose de r&eacute;duire les pouvoirs conf&eacute;r&eacute;s aux copyrights, et non pas de les abolir.

source: <b>THORBURN</b>: I guess one question that occurred to me while you were speaking, Richard, and, again, now when you're responding here to this question is why you don't consider the ways in which the computer, itself, eliminates the middle men completely &mdash; in the way that Stephen King refused to do &mdash; and might establish a personal relationship.
fr: <b>THORBURN</b>&nbsp;: Une question &agrave; laquelle j'ai pens&eacute; pendant que vous parliez, Richard, et qui me revient alors que vous r&eacute;pondez &agrave; cette question, est de savoir pourquoi vous n'&eacute;tudiez pas la mani&egrave;re dont l'ordinateur, en tant que tel, &eacute;limine compl&egrave;tement les interm&eacute;diaires &mdash; de la mani&egrave;re que Stephen King a refus&eacute; de suivre &mdash; et peut &eacute;tablir une relation personnelle.

source: <b>STALLMAN</b>: Well, they can and, in fact, this voluntary donation is one.
fr: <b>STALLMAN</b>&nbsp;: C'est le cas, en fait, et cette donation volontaire en est une.

source: <b>THORBURN</b>: You think of that as not involving going through a publisher at all?
fr: <b>THORBURN</b>&nbsp;: Vous pensez que cela ne doit pas impliquer de passer par un &eacute;diteur&nbsp;?
