Repository: gitGNU/gnu_www-fr
Catalog: philosophy/copyright-versus-community.*.po
Languages: fr

source: So if you look at the statements being made by publishers you find lots of implicit assumptions of this sort which you have to drag into the open and then start questioning.
fr: Aussi, si vous regardez les d&eacute;clarations qui sont faites par les &eacute;diteurs vous trouverez un bon nombre de postulats de ce genre que vous devez mettre en lumi&egrave;re et commencer &agrave; interroger.

source: Recent events and problems
fr: R&eacute;cents &eacute;v&eacute;nements et probl&egrave;mes

source: <em>[brightens]</em>
fr: <em>[il s'&eacute;claire]</em>

source: Anyway, as long as the age of the printing press continued, copyright was painless, easy to enforce, and probably a good idea. But the age of the printing press began changing a few decades ago when things like Xerox machines and tape recorders started to be available, and more recently as computer networks have come into use the situation has changed drastically. We are now in a situation technologically more like the ancient world, where anybody who could read something could also make a copy of it that was essentially as good as the best copies anyone could make.
fr: Quoi qu'il en soit, aussi longtemps que l'&acirc;ge de la presse a dur&eacute;, le copyright &eacute;tait indolore, facile &agrave; imposer, et probablement une bonne id&eacute;e. Mais l'&acirc;ge de la presse a commenc&eacute; &agrave; changer il y a quelques d&eacute;cennies quand des choses comme les photocopieurs et les magn&eacute;toscopes sont devenues disponibles, et plus r&eacute;cemment quand les r&eacute;seaux informatiques sont devenus op&eacute;rationnels, la situation a chang&eacute; de mani&egrave;re drastique. Nous sommes aujourd'hui dans une situation technologique plus proche de l'antiquit&eacute;, o&ugrave; quiconque pouvait lire quelque chose pouvait aussi en faire une copie, qui &eacute;tait aussi bonne que les meilleures copies de n'importe qui d'autre.

source: <em>[murmuring in the audience]</em>
fr: <em>[murmures dans l'assistance]</em>

source: A situation now where once again, ordinary readers can make copies themselves. It doesn't have to be done through centralised mass production, as in the printing press. Now this change in technology changes the situation in which copyright law operates. The idea of the bargain was that the public trades away its natural right to make copies, and in exchange gets a benefit. Well, a bargain could be a good one or a bad one. It depends on the worth of what you are giving up. And the worth of what you are getting. In the age of the printing press the public traded away a freedom that it was unable to use.
fr: Une situation maintenant o&ugrave;, &agrave; nouveau, les lecteurs ordinaires peuvent faire des copies eux-m&ecirc;me. Il n'est plus n&eacute;cessaire de passer par une production de masse centralis&eacute;e comme dans la presse. Ce changement de technologie change la situation dans laquelle la loi sur le copyright s'exerce. L'id&eacute;e du march&eacute; &eacute;tait que le public n&eacute;gociait son droit de faire des copies, contre un avantage. Bon, une affaire peut &ecirc;tre bonne ou mauvaise. Cela d&eacute;pend de la valeur de ce &agrave; quoi on renonce. Et de la valeur de ce que vous obtenez. &Agrave; l'&acirc;ge de la presse, le public a &eacute;chang&eacute; une libert&eacute; dont il ne pouvait pas user.

source: It's like finding a way of selling shit: what have you got to lose? You've got it on hand anyway, if you get something for it, it can hardly be a bad deal.
fr: C'est comme trouver un moyen de vendre de la merde&nbsp;: qu'avez-vous &agrave; perdre&nbsp;? Vous l'avez &agrave; disposition de toute mani&egrave;re. Si vous trouvez le moyen de la n&eacute;gocier, cela ne peut pas &ecirc;tre une mauvaise affaire.

source: <em>[faint laughter]</em>
fr: <em>[rires ti&egrave;des]</em>

source: It's like accepting money for promising not to travel to another star. You're not going to do it anyway
fr: C'est comme accepter de l'argent en retour de votre promesse de ne pas voyager vers autre &eacute;toile. Vous n'allez pas le faire de toute fa&ccedil;on.

source: <em>[hearty laughter]</em>
fr: <em>[rires copieux]</em>

source: at least not in our lifetime so you might as well, if someone's going to pay you to promise not to travel to another star, you might as well take the deal. But if I presented you with a starship, then you might not think that deal was such a good deal any more. When the thing you used to sell because it was useless, you discover a use for it, then you have to reconsider the desirability of those old deals that used to be advantageous. Typically in a such a situation you decide that &ldquo;I'm not going to sell all of this any more; I'm going to keep some of it and use it.&rdquo; So if you were giving up a freedom that you couldn't exercise and now you can exercise it, you probably want to start retaining the right to exercise it at least partially. You might still trade part of the freedom: and there are many alternatives of different bargains which trade parts of the freedom and keep other parts. So, precisely what you want to do requires thought, but in any case you want to reconsider the old bargain, and you probably want to sell less of what you sold in the past.
fr: Du moins pas de notre vivant. Donc si quelqu'un vous paye pour que vous promettiez de ne pas voyager vers une autre &eacute;toile, vous pouvez tr&egrave;s bien faire affaire. Mais si je m'&eacute;tais pr&eacute;sent&eacute; &agrave; vous avec un astronef, vous ne pourriez plus penser que c'&eacute;tait une bonne affaire. Alors que vous aviez l'habitude de vendre une chose inutile, vous d&eacute;couvrez une utilisation pour elle&nbsp;; vous allez donc reconsid&eacute;rer les charmes des anciens march&eacute;s dont vous tiriez avantage. Typiquement dans une telle situation vous d&eacute;cidez que &laquo;&nbsp;je ne vais plus tout vendre de ce que j'ai; je vais en garder une partie et m'en servir&nbsp;&raquo;. Aussi, si vous aviez l'habitude de troquer une libert&eacute; dont vous ne pouviez rien faire, mais qu'&agrave; pr&eacute;sent vous pouvez l'exercer, vous voudrez sans doute commencer &agrave; vous r&eacute;server au moins le droit de l'exercer partiellement. Vous pourriez encore n&eacute;gocier une partie de cette libert&eacute;&nbsp;: il y a de nombreuses alternatives aux diff&eacute;rents march&eacute;s qui &eacute;changent une partie de la libert&eacute; tout en la maintenant sur d'autres plans. Ainsi, ce que vous voulez faire pr&eacute;cis&eacute;ment exige une r&eacute;flexion, mais dans tous les cas vous voudrez reconsid&eacute;rer l'ancien march&eacute;, et probablement vendre moins que ce vous vendiez auparavant.

source: But the publishers are trying to do exactly the opposite. At exactly the time when the public's interest is to keep part of the freedom to use it, the publishers are passing laws which make us give up more freedom. You see copyright was never intended to be an absolute monopoly on all the uses of a copyright work. It covered some uses and not others, but in recent times the publishers have been pushing to extend it further and further. Ending up most recently with things like the Digital Millennium Copyright Act in the US which they are also trying to turn into a treaty through the World Intellectual Property Organisation which is essentially an organisation representing the owners of copyrights and patents and which works to try to increase their power, and pretends to be doing so in the name of humanity rather than in the name of these particular companies.
fr: Or les &eacute;diteurs essayent de faire exactement l'oppos&eacute;. Au moment m&ecirc;me o&ugrave; l'int&eacute;r&ecirc;t du public est de se r&eacute;server une partie de libert&eacute; afin de l'exercer, les &eacute;diteurs font passer des lois qui nous demandent d'y renoncer davantage. Vous avez vu que le copyright n'a jamais &eacute;t&eacute; pr&eacute;vu pour &ecirc;tre un monopole absolu sur les utilisations d'un travail sous copyright. Il couvrait quelques utilisations et pas d'autres, mais ces derniers temps les &eacute;diteurs ont fait pression pour l'&eacute;tendre de plus en plus loin. Pour finir derni&egrave;rement avec des choses du genre la loi sur le copyright du millénaire numériqque aux &Eacute;tats-Unis. Qu'ils essayent &eacute;galement de transformer en trait&eacute; &agrave; travers l'Organisation mondiale de la propri&eacute;t&eacute; intellectuelle; (OMPI) qui est une organisation repr&eacute;sent&eacute;e essentiellement par les propri&eacute;taires de copyrights et de brevets et qui travaille &agrave; augmenter leur pouvoir, en pr&eacute;tendant le faire au nom de l'humanit&eacute; plut&ocirc;t qu'au nom de ces compagnies particuli&egrave;res.

source: Now, what are the consequences when copyright starts restricting activities that ordinary readers can do. Well, for one thing it's no longer an industrial regulation. It becomes an imposition on the public. For another, because of this, you find the public's starting to object to it You know, when it is stopping ordinary people from doing things that are natural in their lives you find ordinary people refusing to obey. Which means that copyright is no longer easy to enforce and that's why you see harsher and harsher punishments being adopted by governments that are basically serving the publishers rather than the public.
fr: Maintenant, qu'est-ce qui arrive lorsque le copyright commence &agrave; limiter des activit&eacute;s que les lecteurs ordinaires peuvent faire&nbsp;? Et bien, d'une part cela n'est plus un r&egrave;glement industriel. Cela devient un imp&ocirc;t sur le public. D'autre part, et pour cette raison, vous verrez le public commencer &agrave; s'y opposer. Vous savez, quand on demande &agrave; des gens ordinaires d'arr&ecirc;ter de faire des choses naturelles dans la vie, ils refusent d'ob&eacute;ir. Ce qui signifie qu'il n'est plus aussi facile d'imposer le copyright et c'est pourquoi vous voyez des punitions de plus en plus dures adopt&eacute;es par des gouvernements qui &agrave; la base servent les &eacute;diteurs plut&ocirc;t que le public.

source: Also, you have to question whether a copyright system is still beneficial. Basically, the thing that we have been paying is now valuable for us. Maybe the deal is a bad deal now. So all the things that made technology fit in well with the technology of the printing press make it fit badly with digital information technology. So, instead of like, charging the fee to cross the Atlantic in a boat, it's like charging a fee to cross a street. It's a big nuisance, because people cross the street all along the street, and making them pay is a pain in the neck.
fr: En outre, vous vous demandez en quoi un syst&egrave;me de copyright est-il encore b&eacute;n&eacute;fique. En fait, ce que nous avons pay&eacute; a maintenant de la valeur pour nous. Aussi l'affaire est-elle une mauvaise affaire d&eacute;sormais. Et tout ce qui s'adaptait &agrave; la technologie de la presse s'accorde mal avec la technologie num&eacute;rique de l'information. C'est comme si au lieu de percevoir des honoraires pour traverser l'Atlantique en bateau, on percevait des honoraires pour traverser la rue. Et c'est tr&egrave;s emb&ecirc;tant, parce que les gens traversent la rue tout le long de la rue, et les faire payer revient &agrave; leur casser les pieds.

source: New kinds of copyright
fr: Nouveau genre de copyright

source: Now what are some of the changes we might want to make in copyright law in order to adapt it to the situation that the public finds itself in? Well the extreme change might be to abolish copyright law but that isn't the only possible choice. There are various situations in which we could reduce the power of copyright without abolishing it entirely because there are various different actions that can be done with a copyright and there are various situations in which you might do them, and each of those is an independent question. Should copyright cover this or not? In addition, there is a question of &ldquo;How long?&rdquo;. Copyright used to be much shorter in its period or duration, and it's been extended over and over again in the past fifty years or so and in fact in now appears that the owners of copyrights are planning to keep on extending copyrights so that they will never expire again. The US constitution says that &ldquo;copyright must exist for a limited time&rdquo; but the publishers have found a way around this: every twenty years they make copyright twenty years longer, and this way, no copyright will ever expire again. Now a thousand years from now, copyright might last for 1200 years, just basically enough so that copyright on Mickey Mouse can not expire.
fr: Maintenant quels sont les changements que nous pourrions faire valoir dans la loi sur le copyright pour l'adapter &agrave; la situation dans laquelle le public se trouve&nbsp;? Un changement radical pourrait &ecirc;tre de supprimer la loi sur le copyright mais ce n'est pas le seul choix possible. Il y a diverses situations dans lesquelles nous pourrions r&eacute;duire la puissance du copyright sans la supprimer totalement, parce qu'il y a plusieurs actions diff&eacute;rentes qui pourraient &ecirc;tre men&eacute;es avec le copyright et il y a diverses situations dans lesquelles vous pourriez le faire, et chacune d'entre elles est une question ind&eacute;pendante. Le copyright pourrait-il les couvrir ou non&nbsp;? En outre, il y a la question de savoir &laquo;&nbsp;pour combien de temps&nbsp;?&nbsp;&raquo;. Le copyright &eacute;tait &agrave; l'&eacute;poque beaucoup plus court dans sa p&eacute;riode ou sa dur&eacute;e, et il a &eacute;t&eacute; prolong&eacute; &agrave; plusieurs reprises pendant les cinquante derni&egrave;res ann&eacute;es et il para&icirc;t de plus en plus clairement que les propri&eacute;taires de copyright projettent de maintenir l'extension des copyrights jusqu'&agrave; ce qu'ils n'expirent plus jamais. La constitution des &Eacute;tats-Unis d'Am&eacute;rique indique que le &laquo;&nbsp;copyright doit exister pour un temps limit&eacute;&nbsp;&raquo; mais les &eacute;diteurs ont trouv&eacute; une mani&egrave;re de le contourner&nbsp;: tous les vingt ans ils le prolongent de vingt ans, et de cette fa&ccedil;on, aucun copyright n'expirera plus jamais. Maintenant, dans mille ans, le copyright pourrait durer 1200 ann&eacute;es, en fait juste assez pour que le copyright sur la souris Mickey ne puisse plus expirer.

source: Because that's why, people believe that US Congress passed a law to extend copyright for twenty years. Disney was paying them, and paying the President too, with campaign funds of course, to make it lawful. See, if they just gave them cash it would be a crime, but contributing indirectly to campaigns is legal and that's what they do: to buy the legislators. So they passed the Sunny Bono copyright act. Now this is interesting: Sunny Bono was a congressman and a member of the Church of Scientology, which uses copyrights to suppress knowledge of its activities. So they have their pet congressman and they pushed very hard for increased copyright powers.
fr: C'est pourquoi, les gens croient que le Congr&egrave;s am&eacute;ricain a pass&eacute;une loi pour prolonger le copyright pendant vingt ans. Disney les apay&eacute;s, et a pay&eacute; le Pr&eacute;sident aussi, avec les fonds de campagne&eacute;videmment, pour rendre &ccedil;a l&eacute;gal. Voyez-vous, s'ils avaient juste pay&eacute; enliquide, cela aurait &eacute;t&eacute; un crime, mais contribuer indirectement auxcampagnes est l&eacute;gal et c'est ce qu'ils font&nbsp;: acheter les l&eacute;gislateurs.Aussi ils ont adopt&eacute; la loi &laquo;Sunny Bono&raquo; sur le copyright. Maintenant ce qui est int&eacute;ressant, c'est que Sunny Bono &eacute;tait un membre du Congr&egrave;s et un membre de l'&Eacute;glise de Scientologie, qui utilisait le copyright pour supprimer les informations sur ses activit&eacute;s. Ainsi, ils ont leur petit chouchou au Congr&egrave;s et ont pouss&eacute; tr&egrave;s fort pour accro&icirc;tre les pouvoirs du copyright.

source: Anyway, we were fortunate that Sunny Bono died but in his name they passed the Mickey Mouse Copyright Act of 1998 I believe. It's being challenged by the way, on the grounds that, there is a legal case that people hope to go to the Supreme Court and have the extension of old copyrights tossed out. In any case, there are all these different situations and questions where we could reduce the scope of copyright.
fr: Quoi qu'il en soit, nous avons eu la chance que Sunny Bono soit mort, mais en son nom ils ont pass&eacute; la Loi sur le copyright de la souris Mickey, en 1998 je crois. C'est remis en question cela dit, en raison de l'existence d'une possibilit&eacute; juridique de voir par la Cour Supr&ecirc;me les demandes d'extension de vieux droits rejet&eacute;es. Dans tous les cas, il y a des tas de situations et questions diff&eacute;rentes o&ugrave; nous pourrions r&eacute;duire la port&eacute;e du copyright.

source: So what are some of them? Well, first of all there are various different contexts for copying. There is commercial sale of copies in the stores at one extreme and at the other there is privately making a copy for your friend once in a while, and in between there are other things, like, there's broadcasting on TV or the radio, there's posting it on the website, there's handing it out to all the people in an organisation, and some of these things could be done either commercially or non-commercially. You know, you could imagine a company handing out copies to its staff or you could imagine a school doing it, or some private, non-profit organisation doing it. Different situations, and we don't have to treat them all the same. So one way in we could reclaim the&hellip; in general though, the activities that are the most private are those that are most crucial to our freedom and our way of life, whereas the most public and commercial are those that are most useful for providing some sort of income for authors so it's a natural situation for a compromise in which the limits of copyright are put somewhere in the middle so that a substantial part of the activity still is covered and provides an income for authors, while the activities that are most directly relevant to peoples' private lives become free again. And this is the sort of thing that I propose doing with copyright for things such as novels and biographies and memoires and essays and so on. That at the very minimum, people should always have a right to share a copy with a friend. It's when governments have to prevent that kind of activity that they have to start intruding into everyone's lives and using harsh punishments. The only way basically to stop people in their private lives from sharing is with a police state, but public commercial activities can be regulated much more easily and much more painlessly.
fr: Quels sont-ils pour certains&nbsp;? Et bien tout d'abord, il y a plusieurs contextes diff&eacute;rents pour la copie. Il y a la vente commerciale de copies dans des magasins &agrave; d'un c&ocirc;t&eacute;, et de l'autre il y a la copie priv&eacute;e pour un ami de temps &agrave; autre, et entre les deux il y a d'autres choses comme sa radio- ou t&eacute;l&eacute;-diffusion, son placement sur un site web, sa distribution collective dans une organisation, et toutes ces choses que l'on peut faire de fa&ccedil;on commerciale ou non-commerciale. Vous savez, vous pouvez imaginer une entreprise qui distribue des copies &agrave; son &eacute;quipe ou vous pouvez encore imaginer une &eacute;cole, ou quelque organisation priv&eacute;e, non-commerciale le faire. Diff&eacute;rentes situations que nous n'avons pas &agrave; traiter toutes de la m&ecirc;me mani&egrave;re. Aussi la fa&ccedil;on dont nous pourrions r&eacute;cup&eacute;rer le... comme en g&eacute;n&eacute;ral, les activit&eacute;s qui sont les plus intimes sont les plus importantes pour notre libert&eacute; et notre fa&ccedil;on de vivre, et que les plus publiques et commerciales sont les plus utiles &agrave; fournir un certain type de revenus pour les auteurs, il y a une situation naturelle de compromis dans lequel les limites du copyright sont pos&eacute;es quelquepart au milieu, de sorte qu'une part substantielle de l'activit&eacute; reste couverte et fournisse toujours un revenu pour les auteurs, pendant que celle qui rel&egrave;ve le plus directement de la vie priv&eacute;e des gens redevient libre. Et c'est ce genre de chose que je propose de faire avec le copyright pour des choses comme les romans, les biographies, les m&eacute;moires, les essais, etc. Qu'au strict minimum, les gens aient toujours le droit de partager une copie avec un ami. C'est quand les gouvernements ont &agrave; emp&ecirc;cher ce genre d'activit&eacute; qu'ils commencent &agrave; s'introduire dans la vie priv&eacute;e des gens et user de punitions s&eacute;v&egrave;res. La seule fa&ccedil;on d'emp&ecirc;cher les gens de partager dans leur vie priv&eacute;e c'est avec un &eacute;tat policier, mais des activit&eacute;s commerciales et publiques peuvent &ecirc;tre r&eacute;gl&eacute;es de fa&ccedil;on beaucoup plus efficace et indolore.

source: Now, where we should draw these lines depends, I believe, on the kind of work. Different works serve different purposes for their users. Until today we've had a copyright system that treats almost everything exactly alike except for music: there are a lot of legal exceptions for music. But there's no reason why we have to elevate simplicity above the practical consequences. We can treat different kinds of works differently. I propose a classification broadly into three kinds of works: functional works, works that express personal position, and works that are fundamentally aesthetic.
fr: Maintenant, l'endroit o&ugrave; nous pourrions tracer ces limites d&eacute;pend, je crois, du style de travail. Diff&eacute;rents travaux r&eacute;pondent &agrave; diff&eacute;rents besoinspour leurs utilisateurs. Jusqu'&agrave; aujourd'hui nous avons eu un syst&egrave;me de copyright qui traitait presque tout de la m&ecirc;me mani&egrave;re except&eacute; la musique&nbsp;: il y a beaucoup d'exceptions juridiques pour la musique. Mais il n'y a aucune raison de placer la simplicit&eacute; au dessus des cons&eacute;quences pratiques. Nous pouvons traiter les diff&eacute;rents types de travaux diff&eacute;remment. Je propose une classification g&eacute;n&eacute;ralement dans trois types de travaux&nbsp;: les travaux fonctionnels, les travaux qui expriment la position personnelle et les travaux fondamentalement esth&eacute;tiques.
