Repository: gitGNU/gnu_www-fr
Catalog: philosophy/dat.*.po
Languages: fr

source: The Right Way to Tax DAT - GNU Project - Free Software Foundation (FSF)
fr: La bonne fa&ccedil;on de taxer les DAT - GNU Project - Free Software Foundation (FSF)

source: The Right Way to Tax <abbr title="Digital Audio Tape">DAT</abbr>
fr: La bonne fa&ccedil;on de taxer les <abbr title="Digital Audio Tape">DAT</abbr>

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: <em> [This article was published in Wired magazine in 1992; the text has not been changed, but notes in square brackets have been added (with these notes emphasized for those browsers that will display emphasized text).] </em>
fr: <em>[Cet article a &eacute;t&eacute; publi&eacute; dans Wired magazine en 1992 ; le texte n'a pas &eacute;t&eacute; modifi&eacute;, mais les notes entre crochets ont &eacute;t&eacute; rajout&eacute;es. (pour les navigateurs pouvant les afficher).]</em>

source: Record company magnates don't like the digital audio tape recorder (<abbr>DAT</abbr>), which can make perfect copies of musical recordings. They fear that customers will copy music themselves, and stop buying prerecorded music.
fr: Les magnats des compagnies n'aiment pas les appareils &agrave; cassettes audio-num&eacute;riques (Digital Audio Tape), ces appareils qui peuvent faire des copies parfaites d'enregistrements musicaux. Ils craignent que les consommateurs fassent eux-m&ecirc;mes des copies et qu'ils arr&ecirc;tent d'acheter des enregistrements (disques ou autres).

source: Threatening lawsuits, they have obtained from the manufacturers of DATs an agreement to pay a fee for each <abbr>DAT</abbr> unit and each <abbr>DAT</abbr> tape sold to consumers. This fee is to be divided among various participants in the music business: musicians, composers, music publishers and record companies. In addition, <abbr>DAT</abbr> manufacturers have agreed to cripple <abbr>DAT</abbr> units so that they cannot make a copy of a copy of a prerecorded piece.
fr: Sous la menace de poursuites judiciaires, ils ont obtenu des fabricants de <abbr title="Digital Audio Tape">DAT</abbr> un arrangement par lequel ces derniers doivent reverser des &eacute;moluments pour chaque appareil et chaque cassette <abbr title="Digital Audio Tape">DAT</abbr> vendus. Cet argent devant &ecirc;tre partag&eacute; entre les divers acteurs du march&eacute; de la musique&nbsp;: musiciens, compositeurs, &eacute;diteurs de musique et les compagnies de disque. De plus, les fabricants de <abbr title="Digital Audio Tape">DAT</abbr> ont accept&eacute; de brider leurs appareils, de sorte qu'on ne puisse faire la copie d'une copie d'un morceau d&eacute;j&agrave; enregistr&eacute;.

source: Now the record companies have asked Congress to enact a law turning this fee into a tax and prohibiting manufacture of <abbr>DAT</abbr> tapedecks that function without imposed limitations.
fr: Aujourd'hui, les compagnies de disque ont demand&eacute; au Congr&egrave;s de r&eacute;diger une loi qui transforme ces &eacute;moluments en taxes et qui interdise la fabrication d'appareils <abbr title="Digital Audio Tape">DAT</abbr> qui fonctionnent sans les restrictions impos&eacute;es.

source: The stated purpose of the tax is to &ldquo;compensate&rdquo; musicians for copying done by individuals using <abbr>DAT</abbr>s. However, 57 percent of the funds collected would go to record companies and music publishers&mdash;leaving less than half to the people who participate in the creative process. Most of these remaining funds would go to musical superstars, and thus would do little to encourage musical creativity. Meanwhile, <abbr>DAT</abbr> users would be unable to make full use of the power of <abbr>DAT</abbr> technology.
fr: L'id&eacute;e de d&eacute;part de la taxe est de &laquo;compenser&raquo; les musiciens des copies faites par des individus utilisant des <abbr title="Digital Audio Tape">DAT</abbr>. Cependant, 57% des fonds r&eacute;colt&eacute;s iraient chez les compagnies de disques ou les &eacute;diteurs de musique (n'en laissant qu'un peu moins de la moiti&eacute; aux personnes ayant particip&eacute; &agrave; la cr&eacute;ation). La plupart de cette somme ira aux superstars de la musique, ce qui n'est pas fait pour encourager la cr&eacute;ativit&eacute; musicale. Entre-temps, les possesseurs de <abbr title="Digital Audio Tape">DAT</abbr> ne pourraient faire plein usage de cette technologie.

source: Here is a proposal for a different system for taxing <abbr>DAT</abbr>s and <abbr>DAT</abbr> tape&mdash;one designed to support music rather than cater to vested interests.
fr: Voici une proposition de syst&egrave;me de taxation des appareils et cassettes <abbr title="Digital Audio Tape">DAT</abbr> diff&eacute;rent; un syst&egrave;me qui se propose d'encourager la musique plut&ocirc;t que d'approvisionner des int&eacute;r&ecirc;ts acquis.

source: Collect funds with a tax on <abbr>DAT</abbr> machines and <abbr>DAT</abbr> tapes, as the current proposal provides.
fr: R&eacute;colter de l'argent en taxant les appareils et cassettes <abbr title="Digital Audio Tape">DAT</abbr>, comme la proposition actuelle le fait.

source: Use a survey system to measure the extent of copying of each musical piece.
fr: Utiliser un syst&egrave;me de surveillance qui permette de mesurer la port&eacute;e d'une copie, pour chaque morceau.

source: Distribute these funds entirely to the people who create music.
fr: Distribuer int&eacute;gralement ces fonds aux cr&eacute;ateurs de la musique.

source: Adjust each contributor's share so that it increases more slowly per copy as it gets larger. This spreads the funds more widely to support a larger number of musicians adequately.
fr: Ajuster la participation de chaque collaborateur de fa&ccedil;on &agrave; ce que plus la copie est importante, plus le montant de la participation augmente lentement. Cela permet de distribuer les fonds plus largement pour aider convenablement un plus grand nombre de musiciens.

source: Make no restrictions on the functioning of <abbr>DAT</abbr>s.
fr: Que les appareils <abbr title="Digital Audio Tape">DAT</abbr> ne soient pas brid&eacute;s dans leur fonctionnement.

source: What is the purpose of copyright?
fr: Quel est le but du copyright&nbsp;?

source: The record industry presents its proposal as a way to &ldquo;compensate&rdquo; musicians, assuming that they are entitled to be paid for any copy made. Many Americans believe that copyright law reflects a natural right of authors or musicians&mdash;that these are entitled to special consideration from public policy. However, any lawyer specializing in the field knows this is a misunderstanding, a view rejected by the American legal system.
fr: L'industrie du disque pr&eacute;sente sa proposition comme une &laquo;compensation&raquo; pour les musiciens, supposant qu'ils ont le droit d'&ecirc;tre pay&eacute;s pour toute copie effectu&eacute;e. Beaucoup d'Am&eacute;ricains croient que la loi sur le copyright est le reflet d'un droit naturel pour les auteurs ou les musiciens, qu'ils ont droit &agrave; une consid&eacute;ration sp&eacute;ciale de la part de la politique publique. Pourtant, n'importe quel homme de loi sp&eacute;cialis&eacute; dans ce domaine sait qu'il s'agit d'une m&eacute;prise, d'une fa&ccedil;on de voir rejet&eacute;e par le syst&egrave;me l&eacute;gal am&eacute;ricain.

source: The stated purpose of copyright, given in the U.S. Constitution, is to &ldquo;promote the progress of science and the useful arts&rdquo;. Progress in music means new and varied music for the public to enjoy: copyright is supposed to promote a public good, not a private one.
fr: Le principe de base du copyright, tel qu'il est donn&eacute; par la constitution des &Eacute;tats-Unis, est de &laquo;promouvoir l'avancement de la science et des arts utiles&raquo;. L'avancement, en musique, veut dire de nouvelles vari&eacute;t&eacute;s de musique pour la plus grande joie du public&nbsp;: le copyright est suppos&eacute; promouvoir un bien public, pas priv&eacute;.

source: Yet copyright is often thought of as a natural right by laymen and politicians, which often leads to wrong decisions about copyright policy. Even courts, defining the details of the copyright system, often let this thought creep back implicitly even though it is supposed to be excluded. This is a conceptual error because it mistakes a means (copyright) to a larger end (progress) for an end in itself.
fr: Le copyright est couramment vu par les hommes de loi et les politiciens comme un droit naturel, ce qui, souvent, conduit &agrave; de mauvaises d&eacute;cisions dans la politique du copyright. M&ecirc;me les tribunaux, en d&eacute;finissant les d&eacute;tails du syst&egrave;me de copyright, laissent implicitement s'insinuer cette id&eacute;e, alors m&ecirc;me qu'elle devrait &ecirc;tre exclue. Il s'agit d'une erreur de concept, parce qu'on confond une intention (le copyright) de bel aboutissement (l'avancement) avec l'aboutissement lui-m&ecirc;me.

source: Promoting progress in the arts does not inherently justify the idea that authors are entitled to any particular sort of copyright, or even that copyright should exist at all. Copyright is justified if the benefits of progress exceeds the burden that copyright imposes on everyone except the copyright holder.
fr: Promouvoir la marche en avant des arts ne justifie pas fondamentalement l'id&eacute;e que les auteurs aient droit &agrave; une sorte sp&eacute;ciale de copyright ou m&ecirc;me que le copyright existe. Le copyright ne se justifie que si les b&eacute;n&eacute;fices de l'avancement d&eacute;passent les charges impos&eacute;es par le copyright sur tout le monde, except&eacute; le d&eacute;positaire du copyright.

source: How do we make this cost/benefit comparison? It depends partly on facts (how does a particular law affect musical activity and music users) and partly on our value judgements about those results.
fr: Comment pouvons-nous faire cette comparaison entre co&ucirc;ts et b&eacute;n&eacute;fices&nbsp;? Cela d&eacute;pend en partie des faits (comme une loi en particulier affecte l'activit&eacute; musicale et les musiciens) et en partie de nos jugements de valeur sur ces r&eacute;sultats.

source: Let's assume that it is worth paying a <abbr>DAT</abbr> tax if the result is a significant increase in musical activity, and investigate how we should arrange the details of this tax in order to maximize the benefit. But first, let's review basic principles and facts which have a bearing on the inquiry.
fr: Supposons qu'il vaille mieux payer une taxe sur les <abbr title="Digital Audio Tape">DAT</abbr>, s'il doit en r&eacute;sulter un accroissement significatif de l'activit&eacute; musicale et cherchons comment on pourrait organiser les d&eacute;tails de cette taxe afin de porter au maximum les b&eacute;n&eacute;fices. Mais auparavant, passons en revue les principes de base et les faits qui ont un rapport avec cette recherche.

source: Diminishing returns
fr: La loi de la diminution des performances

source: The law of diminishing returns is a general principle of economics. It states that each additional increment of efforts or funds spent on a given goal typically produces a smaller and smaller increment in the results. There are exceptions to this law, but they are local; if you keep on increasing the inputs, you eventually leave the exceptions behind.
fr: La loi de la diminution des performances est un principe g&eacute;n&eacute;ral de l'&eacute;conomie. Elle dit que chaque augmentation suppl&eacute;mentaire d'un effort ou d'un financement, d&eacute;pens&eacute; dans un but donn&eacute;, produit typiquement un accroissement de plus en plus petit des performances. Il y a des exceptions &agrave; cette loi, mais elles sont isol&eacute;es&nbsp;; si vous continuez &agrave; augmenter les donn&eacute;es, vous pouvez bien laisser derri&egrave;re vous les exceptions.

source: For example, you can make traffic flow more smoothly by improving roads. Adding one lane to 20 miles of congested roads in a city might increase the average traffic speed by 15 miles an hour. Adding a second lane to those roads will not give the same improvement; this might increase the average speed by only 5 more miles an hour. The next additional lane might make no noticeable difference if the traffic jams are already gone. Yet each successive lane will cause greater dislocation as more and more buildings must be torn down to make room.
fr: Prenons un exemple&nbsp;: vous pouvez fluidifier la circulation en construisant des routes. Rajouter une voie de 32 km &agrave; une route citadine encombr&eacute;e, augmentera le trafic moyen d'environ 16 km/h. Rajoutez une autre voie &agrave; celles-ci et vous n'aurez pas la m&ecirc;me am&eacute;lioration (environ seulement 6 km/h de mieux). D'autres voies suppl&eacute;mentaires n'apporteront aucune am&eacute;lioration sensible de plus si les embouteillages ont &eacute;t&eacute; r&eacute;solus. Seulement, chaque voie suppl&eacute;mentaire causera un d&eacute;rangement plus grand et de plus en plus d'immeubles devront &ecirc;tre d&eacute;truits pour faire de la place.

source: When applied to the activities of musicians, diminishing returns tells us that each successive increase in the income of musicians will have a smaller effect on the amount of creativity in music.
fr: Si on applique cela &agrave; l'activit&eacute; des musiciens, la loi de la diminution des performances nous dit que chaque accroissement successif des revenus des musiciens aura un effet de plus en plus petit sur la masse cr&eacute;ative.

source: Diminishing returns is the first reason to reject the idea that any use of music &ldquo;should&rdquo; be covered by copyright. There is nothing to gain by trying to guarantee owners control of every possible aspect of the use of music or to give them a financial stake in every possible aftermarket. Extending copyright can only &ldquo;promote progress&rdquo; up to a certain point. Further extensions merely increase what the public pays to the owners for what they will do anyway. Extending copyright beyond that point is certainly undesirable.
fr: Cette diminution des performances est la premi&egrave;re raison pour laquelle on doit rejeter l'id&eacute;e que n'importe quelle utilisation de la musique &laquo;&nbsp;devrait&nbsp;&raquo; &ecirc;tre couverte par le copyright. Il n'y a rien &agrave; gagner &agrave; essayer de garantir aux propri&eacute;taires le contr&ocirc;le de tous les aspects possibles de l'utilisation de la musique ou de leur donner un enjeu financier dans tous les produits d&eacute;riv&eacute;s possibles. &Eacute;tendre le copyright ne peut &laquo;&nbsp;promouvoir l'avancement&nbsp;&raquo; que jusqu'&agrave; un certain point. D'autres extensions n'augmenteraient pas beaucoup ce que le public paye aux propri&eacute;taires pour une chose que de toutes fa&ccedil;ons ils feraient. Pousser le copyright au-del&agrave; de ce point est certainement ind&eacute;sirable.

source: Trade-offs
fr: Les &eacute;changes commerciaux

source: Those with a vested interest in extending copyright start the discussion by claiming that copyright &ldquo;should&rdquo; be extended as far as it can go. But the principle of diminishing returns renders this claim implausible. So they fall back on the position that copyright should be extended to maximize the rate of progress. But this too is wrong, because it ignores the existence of other trade-offs. Copyright imposes costs and burdens on the public, like any other government project. The benefit may not be worth the price.
fr: Ceux qui ont des int&eacute;r&ecirc;ts acquis dans l'extension du copyright entament la discussion en clamant que le copyright &laquo;&nbsp;devrait&nbsp;&raquo; &ecirc;tre &eacute;tendu autant que possible. Mais le principe de diminution des r&eacute;sultats rend cette revendication peu plausible. Alors, ils se retournent en disant que le copyright devrait &ecirc;tre &eacute;tendu pour augmenter le taux d'avancement. Mais c'est tout aussi faux, car c'est oublier l'existence d'autres &eacute;changes commerciaux. Le copyright impose au public des co&ucirc;ts et des charges, comme n'importe quel projet gouvernemental. Le b&eacute;n&eacute;fice n'en vaut peut-&ecirc;tre pas la peine.

source: Government fills many important functions, but few would say that any one of these functions should be expanded to maximize output. For example, governments build roads, and this is very useful. But few leaders would advocate building every road that could be built. Road construction is expensive, and citizens have other uses for their money. Too much concentration on building roads means that other social and individual needs will be unmet.
fr: Le gouvernement assume de nombreuses fonctions importantes, mais qui voudrait qu'une de ces fonctions soit port&eacute;e &agrave; son maximum&nbsp;? Par exemple, les gouvernements construisent des routes, tr&egrave;s bien. Mais quel leader pr&eacute;coniserait la construction de toutes les routes qu'il serait possible de construire&nbsp;? Construire des routes co&ucirc;te cher et les citoyens ont d'autres fa&ccedil;ons d'utiliser leur argent. Se concentrer sur la construction de routes implique d&eacute;laisser les autres besoins sociaux et individuels.

source: The same considerations apply to individual decisions. By spending more money, you can buy a bigger and fancier house. Most people would prefer the more expensive house, all else being equal. But given finite resources, at some point spending more on a house becomes a poor allocation of them.
fr: On peut appliquer les m&ecirc;mes consid&eacute;rations aux d&eacute;cisions individuelles. En y mettant le prix, vous pouvez vous acheter une maison plus grande, plus fantaisiste. La plupart des gens pr&eacute;f&egrave;reront la maison la plus ch&egrave;re, tout le reste &eacute;tant &eacute;gal. Mais, pour un budget bien d&eacute;fini, il arrive un moment o&ugrave; d&eacute;penser plus pour une maison ne repr&eacute;sente pas une grosse somme.

source: Copyright does not directly spend public funds, but it does impose a cost&mdash;a loss of freedom&mdash;on every citizen. The wider the scope of copyright, the more freedom we pay. We might prefer to exercise some of our freedoms rather than trade them away. We must judge any decision in copyright policy by comparing the benefits with the costs.
fr: Le copyright ne d&eacute;pense pas directement les fonds publics, mais impose vraiment un co&ucirc;t &agrave; chaque citoyen&nbsp;: une perte de libert&eacute;. Plus grande est l'&eacute;tendue du copyright, plus lourd est le prix &agrave; payer pour la libert&eacute;. Il serait pr&eacute;f&eacute;rable de jouir de nos libert&eacute;s plut&ocirc;t que de les gaspiller. Nous devons juger chaque d&eacute;cision concernant la politique du copyright en comparant les profits et les co&ucirc;ts.

source: &ldquo;Incentive&rdquo; is the wrong concept
fr: L'&laquo;&nbsp;incitation&nbsp;&raquo; est un mauvais concept

source: The idea of providing a monetary incentive for making music is based on a misunderstanding. Musicians hope primarily for other kinds of reward; they must. Very few musicians get rich from their music; a talented person whose primary goal is wealth would seek it in other ways.
fr: L'id&eacute;e d'inciter &agrave; faire de la musique par des esp&egrave;ces sonnantes et tr&eacute;buchantes est bas&eacute;e sur un malentendu. Le premier espoir d'un musicien, c'est fondamentalement une autre sorte de reconnaissance; ils doivent l'esp&eacute;rer. Il y en a tr&egrave;s peu qui deviennent riches avec leur musique&nbsp;; une personne ayant un talent musical et dont le but premier serait la prosp&eacute;rit&eacute; devrait songer &agrave; changer de m&eacute;tier.

source: In fact, psychological studies show that the desire for an extrinsic reward (such as profit) generally hampers creative activities such as writing music. The people who can do them well are usually those who do them mostly for their own sake.
fr: En fait, des &eacute;tudes psychologiques montrent que le d&eacute;sir extrins&egrave;que de r&eacute;compense (comme le profit), entrave en g&eacute;n&eacute;ral l'activit&eacute; cr&eacute;atrice, comme par exemple &eacute;crire de la musique. Ceux qui ont cette activit&eacute; cr&eacute;atrice sont, pour la plupart, ceux qui travaillent pour eux.

source: This is not to say that musicians don't care about being paid. Most hope to make a living from music so they will be free to devote their time to it. As long as they earn enough to live, they will make music as best they can. We might wish them to earn somewhat more than just enough, so they can live as well as most Americans. But to offer them wealth beyond this gains the public little&mdash;it is a matter of diminishing returns.
fr: Ce qui ne veut pas dire que les musiciens ne se pr&eacute;occupent pas d'&ecirc;tre pay&eacute;s. La plupart esp&egrave;rent vivre de leur musique, pour avoir la libert&eacute; d'y consacrer tout leur temps. Tant qu'ils auront de quoi vivre, ils feront de la musique du mieux qu'ils peuvent. On pourrait leur souhaiter de gagner plus que juste assez, pour qu'ils puissent vivre comme presque tout Am&eacute;ricain. Mais en faire plus pour leur offir la prosp&eacute;rit&eacute; n'obtient pas l'adh&eacute;sion du public, c'est une question de diminution des r&eacute;sultats.

source: With this understanding, let's consider how a tax on <abbr>DAT</abbr> tape could be designed to serve the intended purpose of copyright.
fr: Forts de cette compr&eacute;hension des choses, consid&eacute;rons maintenant comment une taxe sur un <abbr title="Digital Audio Tape">DAT</abbr> peut servir le but avou&eacute; du copyright.

source: Who should get the funds
fr: Qui doit r&eacute;colter les fonds&nbsp;?

source: If the purpose of the <abbr>DAT</abbr> tax is to better reward musicians and composers, then all the money collected should go to them&mdash;not just 43 percent. The musicians and composers are the ones who truly create the music. In principle, we could do without record companies entirely.
fr: Si le but des taxes sur le <abbr title="Digital Audio Tape">DAT</abbr> est de mieux r&eacute;mun&eacute;rer les musiciens et les compositeurs, alors on devrait leur reverser la totalit&eacute; de l'argent r&eacute;colt&eacute;, pas seulement 43&nbsp;%. Ce sont vraiment eux, les musiciens et les compositeurs, qui cr&eacute;ent la musique. En principe, on pourrait compl&egrave;tement se passer des maisons de disques.

source: Record companies do provide a useful service: they distribute prerecorded copies of music, usually of high quality. This service is widely used, and will probably remain so. And it is right that the purchasers of prerecorded copies should pay for this service. But listeners making copies for themselves or their friends do not consume this service; they use only the work of the musicians and composers. The record companies contribute only incidentally and their role is not essential.
fr: Le vrai service utile que rendent les maisons de disques, c'est de distribuer des enregistrements musicaux, g&eacute;n&eacute;ralement de haute qualit&eacute;. Ce service est largement utilis&eacute; et le restera probablement. Et c'est vrai que l'acheteur devrait payer pour ce service. Mais celui qui &eacute;coute de la musique et qui fait des copies pour lui-m&ecirc;me ou pour ses amis n'utilise pas ce service&nbsp;; il utilise simplement le travail des musiciens et des compositeurs. Le r&ocirc;le des maisons de disques est accidentel et pas vraiment essentiel.

source: Dividing the funds
fr: R&eacute;partir les fonds
