Repository: gitGNU/gnu_www-fr
Catalog: philosophy/dat.*.po
Languages: fr

source: What share of the tax revenues should each musician or composer get? The record company proposal would divide the money in proportion to record sales.
fr: Quelle part des revenus issus des taxes irait &agrave; chaque musicien ou compositeur&nbsp;? Ce que proposent les maisons de disques serait de r&eacute;partir l'argent en fonction des ventes de disques.

source: It makes sense to distribute the funds based on how much that musician's work is copied, more or less. But strict proportionality is not the best apportionment. If each musician gets a share in strict proportion to the amount of copying of his or her music, then a large share will go to make a few superstars even richer than they are now. This won't do much to promote musical culture or diversity.
fr: Il y a quelque chose de sens&eacute; dans le fait de distribuer les fonds en se basant sur combien de copies du travail du musicien ont &eacute;t&eacute; faites. Mais une proportion stricte n'est pas la meilleure r&eacute;partition. Si chaque musicien ou musicienne re&ccedil;oit une part strictement proportionnelle au nombre de copies de sa musique, une grande part rendra quelques superstars encore plus riches qu'elles ne le sont. Ce n'est pas cela qui va promouvoir la culture et la diversit&eacute; musicale.

source: We can promote music more effectively by making any one musician's share of the tax revenues taper off as copies increase. For example, we could calculate an &ldquo;adjusted number of copies&rdquo; which, beyond a certain point, increases more slowly than the actual number.
fr: Ce que nous pouvons faire pour promouvoir plus efficacement la musique, c'est de diminuer sa r&eacute;tribution pr&eacute;lev&eacute;e sur les taxes au fur et &agrave; mesure que le nombre de copies augmente. Par exemple, on pourrait calculer un &laquo;&nbsp;nombre adapt&eacute; de copies&nbsp;&raquo; qui, au-del&agrave; d'un certain point, augmente plus lentement que le nombre actuel.

source: The effect of tapering off will be to spread the money more widely, supporting more musicians at an adequate standard of living. This encourages diversity, which is what copyright is supposed to do.
fr: Ce qui permet de distribuer l'argent plus largement, d'aider plus de musiciens en leur donnant un niveau de vie convenable. Cela encourage la diversit&eacute;, ce qu'est suppos&eacute; faire le copyright.

source: The US government has already established a program to fund diversity in the arts: the <acronym title="National Endowment for the Arts">NEA</acronym>. However, <acronym>NEA</acronym> grants involve discretionary power, which makes them a center for controversy, sometimes because a few members of the public strongly dislike the work, and sometimes because hardly anyone particularly likes it. Spreading out <abbr>DAT</abbr> tax revenues will also have the effect of supporting less popular musicians. However, it will not support musicians whose work nobody likes. In addition, since it involves no discretion, no arbitrary decisions, there is little room for objection on account of any particular case.
fr: Le gouvernement am&eacute;ricain a d&eacute;j&agrave; &eacute;tabli un programme de financement de la diversit&eacute; des arts&nbsp;: le NEA. Cependant, ses subventions s'embrouillent dans un pouvoir discr&eacute;tionnaire, ce qui en fait un n&oelig;ud de controverses, quelques membres du public n'aimant pas du tout sa fa&ccedil;on de faire, ou alors parce que personne en particulier l'appr&eacute;cie. Disperser les revenus issus des taxes sur les DAT aura aussi comme effet d'aider moins de musiciens populaires. Toutefois, il n'aidera pas de musicien dont personne n'aime le travail. De plus, comme tout cela ne demande ni discr&eacute;tion, ni d&eacute;cision arbitraire, il y a peu de br&egrave;ches o&ugrave; s'engouffrer pour &eacute;mettre une opposition sur une affaire en particulier.

source: Encouraging home copying
fr: Encourager la copie personnelle

source: The record company proposal includes a requirement to make it difficult for home listeners to make copies. Specifically, it requires that consumer <abbr>DAT</abbr> machines refuse to copy a copy that was made on a consumer <abbr>DAT</abbr> machine. The argument for this requirement is based on the assumption that home copying is somehow unfair.
fr: La proposition des maisons de disques inclut une exigence, celle de rendre difficile la copie pour un auditeur. Cela se traduit pour le consommateur par le refus d'un appareil DAT de copier une copie faite sur un autre DAT. L'argument de cette exigence est que la copie personnelle est quelque chose de d&eacute;loyal.

source: In the past, many people have considered it unfair, because it reduced the income of musicians. The <abbr>DAT</abbr> tax makes this reason obsolete. Once home copying does contribute to the income of musicians, through the <abbr>DAT</abbr> tax, the reason to discourage home copying disappears.
fr: Dans le pass&eacute;, beaucoup de gens consid&eacute;raient cela comme d&eacute;loyal, parce que cela r&eacute;duisait les revenus des musiciens. Les taxes sur les DAT ont rendu cette raison obsol&egrave;te. &Agrave; partir du moment o&ugrave; la copie personnelle contribue &agrave; payer les musiciens via les taxes sur les DAT, la raison qui poussait &agrave; d&eacute;courager la copie personnelle dispara&icirc;t.

source: Therefore, if a <abbr>DAT</abbr> tax is adopted, the ability to copy <abbr>DAT</abbr> tapes should not be restricted. Home copying is more efficient than record companies and record stores; music lovers should be encouraged to use home copying as much as possible.
fr: Par cons&eacute;quent, si on accepte une taxe sur les DAT, on ne devrait pas brider la copie de cassettes DAT. La copie personnelle est plus efficace que les maisons de disque ou que les magasins de musique; les amoureux de la musique devraient &ecirc;tre encourag&eacute;s &agrave; copier chez eux autant que possible.

source: Measuring the use of each piece of music
fr: &Eacute;valuer l'utilisation de chaque morceau de musique

source: Today, nearly all the recorded music in the United States is purchased in record stores; home copying is but a small fraction. This will probably remain true for a long time, because record stores offer a place where a person can go to find a particular piece or to browse a wide selection. While this remains true, we can usually estimate the audience of a given piece fairly well by counting record sales.
fr: De nos jours, aux &Eacute;tat-Unis, la presque totalit&eacute; de la musique enregistr&eacute;e s'ach&egrave;te chez des disquaires&nbsp;; la copie personnelle n'est qu'une infime partie. Cela restera probablement longtemps ainsi, car les magasins de musique offrent un lieu o&ugrave; aller pour trouver un produit particulier ou faire son choix parmi un large &eacute;ventail. Tant que c'est ainsi, on peut facilement estimer tr&egrave;s correctement l'audience de tel ou tel morceau en comptant les ventes d'enregistrements.

source: Eventually, home copying may become so widespread that estimating its extent from sales figures may be unsatisfactory. This is already unsatisfactory for musicians who distribute independently without the help of record companies; and if any musicians need additional support, these are the ones. We need another way to estimate usage of any given piece, in order to distribute the tax funds.
fr: &Eacute;ventuellement, on peut envisager que la copie personnelle se d&eacute;veloppe largement, &agrave; tel point qu'estimer son &eacute;tendue par ses moyens de vente ne sera pas satisfaisant. Pas satisfaisant, &ccedil;a l'est d&eacute;j&agrave; pour les musiciens qui distribuent de fa&ccedil;on ind&eacute;pendante, sans l'aide des maisons de disque&nbsp;; et s'il y en a qui doivent &ecirc;tre aid&eacute;s, c'est bien eux. Nous avons besoin d'une estimation de l'usage de n'importe quel morceau, pour pouvoir distribuer les fonds r&eacute;colt&eacute;s par les taxes.

source: We can make these estimates by survey. From time to time, survey staff would ask randomly chosen members of the public to show what copies they have made of copyrighted music. The citizens asked would not be required to answer. But no penalty and no guilt would attach to having made copies, so most people will be glad to participate. Fans will hope to be chosen so that they can contribute to the count for their favorite musical groups.
fr: Ces &eacute;valuations peuvent se pratiquer par sondage. De temps en temps, le personnel de sondage demanderait &agrave; des membres du public choisis au hasard, de montrer les copies qu'ils ont faites de morceaux sous copyright. Ces citoyens ne seraient pas tenus de r&eacute;pondre. Mais comme il n'y aurait ni p&eacute;nalit&eacute; ni culpabilit&eacute; associ&eacute;e &agrave; la copie, les gens seraient heureux de participer. Les fans d'un groupe esp&eacute;reront &ecirc;tre choisis, ainsi ils participeraient au compte de leur groupe favori.

source: To make the survey more efficient and broader-based (and thus more accurate), it could be automated. The survey bureau could mail read-write memory cards to the chosen participants, who would connect them momentarily to their <abbr>DAT</abbr> units and then mail them back. With proper design, the survey bureau would have no way of knowing who had sent in any particular card, and thus no information about who had copied what, but they would still have an accurate total.
fr: Pour rendre ces sondages plus efficaces, pleinement &eacute;tablis (et donc plus pr&eacute;cis), on pourrait l'automatiser. Le bureau de sondage pourrait faire parvenir des cartes m&eacute;moire lisibles en lecture/&eacute;criture aux participants choisis, qui les connecteraient un temps sur leur <abbr title="Digital Audio Tape">DAT</abbr>, qui les renverraient. Si cela est bien fait, le bureau de sondage n'aurait aucun moyen de savoir qui a envoy&eacute; quoi et donc qui a copi&eacute; quoi, mais il aurait un total exact.

source: The record companies have proposed an excellent scheme for taxing the public to increase their own income, but this isn't a legitimate purpose of copyright. Through due attention to the ends of copyright rather than past means, we can design a system which supports musicians while giving citizens full freedom to copy music as they wish.
fr: Les maisons de disque ont propos&eacute; un excellent moyen pour taxer le public et augmenter leurs propres revenus, mais c'est n'est le but l&eacute;gitime du copyright. Si nous essayons de voir les finalit&eacute;s du copyright plut&ocirc;t que ses anciennes significations, nous pouvons esquisser un syst&egrave;me qui aide les musiciens tout en donnant aux citoyens la libert&eacute; totale de copier de la musique autant qu'ils veulent.

source: What You Can Do
fr: Ce que vous pouvez faire

source: <em> [This section is no longer applicable today; it is too late, because the <abbr>DAT</abbr> tax was bill was already passed and signed.] </em>
fr: <em>[Cette section n'est plus d'actualit&eacute;&nbsp;; c'est trop tard, car le projet de loi de taxe sur les <abbr title="Digital Audio Tape">DAT</abbr> qui &eacute;tait pr&eacute;vu est pass&eacute; et a &eacute;t&eacute; sign&eacute;.]</em>

source: Record company lobbyists are working hard to pass their form of <abbr>DAT</abbr> tax. There is little organized opposition, and little public debate. Their bill has already been sent out of committee in the Senate.
fr: Les groupes de pression des maisons de disque travaillent dur pour faire passer leur fa&ccedil;on de taxer les <abbr title="Digital Audio Tape">DAT</abbr>. Il y a un petit peu d'opposition organis&eacute;e et un petit peu de d&eacute;bat public. Leur projet a d&eacute;j&agrave; &eacute;t&eacute; envoy&eacute; &agrave; la commission du S&eacute;nat.

source: This article proposes an alternative to the record company plan. In order for this alternative, or any alternative, to have a chance, we must first prevent the hasty adoption of the record company plan. To help accomplish this, please write letters to:
fr: Cet article propose une alternative au plan des maisons de disque. Pour que cette alternative, ou toute autre alternative, aient une chance d'aboutir, nous devons tout d'abord pr&eacute;venir l'adoption h&acirc;tive du projet des maisons de disque. Pour cela, vous pouvez &eacute;crire &agrave&nbsp;:

source: Urge Congress to reject the record company bill so that this and other alternatives can be properly considered. It takes just a few minutes to write a short letter, but in combination with other people's letters it can do a great deal of good.
fr: Pressez le Congr&egrave;s de rejeter le projet des maisons de disques, pour qu'il soit possible de le reconsid&eacute;rer, lui ou d'autres alternatives&nbsp;! Cela ne prend que quelques minutes pour &eacute;crire une courte lettre, mais, avec le courrier d'autres gens, on peut faire avancer les choses vers du mieux.

source: If you know any musicians, composers, or songwriters, give them copies of this article. Many musicians prefer this alternative to the record company tax plan, and they are strongly motivated to act on their concern.
fr: Si vous connaissez des musiciens, des compositeurs, des interpr&egrave;tes, donnez-leur une copie de cet article. Beaucoup de musiciens pr&eacute;f&egrave;rent cette alternative &agrave; ce projet des maisons de disques et ils sont fortement motiv&eacute;s pour agir dans leur int&eacute;r&ecirc;t.

source: <em>[The article above was published in Wired magazine in 1992. The record company <abbr>DAT</abbr> tax bill was later signed into law by President George &ldquo;read my lips&rdquo; Bush. Although this was shortly before the 1992 election, little attention was paid to the fact that he had once again broken his vow not to approve any new taxes.] </em>
fr: <em>[L'article ci-dessus a &eacute;t&eacute; publi&eacute; dans Wired Magazine, en 1992. Le projet des maisons de disque de taxer les <abbr title="Digital Audio Tape">DAT</abbr> est devenu une loi qui a &eacute;t&eacute; sign&eacute;e par le Pr&eacute;sident George &laquo;&nbsp;read my lips&nbsp;&raquo; Bush. Cela se passait un peu avant les &eacute;lections de 1992, mais il n'a pas &eacute;t&eacute; fait mention qu'il a, une fois de plus, bris&eacute; son serment de ne plus approuver de nouvelles taxes.]</em>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections (or suggestions) to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 1992 Richard M. Stallman <br /> Verbatim copying in any medium is permitted without fee provided the copyright notice and this notice are preserved.
fr: Copyright &copy; 1992 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Pierre-Yves Enderlin.</br>Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
