Repository: gitGNU/gnu_www-fr
Catalog: philosophy/dmarti-patent.*.po
Languages: fr

source: Patent Reform Now - GNU Project - Free Software Foundation (FSF)
fr: R&eacute;formons les brevets maintenant - GNU Project - Free Software Foundation (FSF)

source: Patent Reform Now! Mail USPTO before 12 April 2001!
fr: R&eacute;formons les brevets maintenant&nbsp;! Contactez par courriel l'Office am&eacute;ricain des brevets et des marques d'ici au 12 Avril 2001&nbsp;!

source: by Don Marti <a href="mailto:dmarti@ssc.com">&lt;dmarti@ssc.com&gt;</a>
fr: par Don Marti <a href="mailto:dmarti@ssc.com">&lt;dmarti@ssc.com&gt;</a>

source: <em> [This page remains here for historical interest; we will post the results of this campaign when we hear who who has been put on the committee.] </em>
fr: <em>[Cette page reste ici pour son int&eacute;r&ecirc;t historique, nous publierons les r&eacute;sultats de cette campagne lorsque nous saurons qui a &eacute;t&eacute; nomm&eacute; au comit&eacute;.]</em>

source: 3 April 2001
fr: le 3 avril 2001

source: Only six working days remain until the deadline arrives to submit nominations for the US Patent and Trademark Office's Patent Public Advisory Committee. If you or someone you know has some helpful advice for USPTO and is a US citizen willing to serve, please submit a nomination. A letter and the person's resume is all you need to send. It doesn't take long, and you can do it by e-mail.
fr: Il ne reste que six jours ouvrables jusqu'&agrave; la date limite pour proposer des candidatures pour le Comit&eacute; consultatif public charg&eacute; des brevets [NdT&nbsp;: Patent Public Advisory Committee] au sein de l'Office am&eacute;ricain des brevets et des marques, l'<abbr title="United States Patent and Trademark Office">USPTO</abbr>. Si quelqu'un que vous connaissez ou vous-m&ecirc;me avez des suggestions utiles &agrave; formuler &agrave; l'USPTO et si vous &ecirc;tes un citoyen des &Eacute;tats-Unis, merci de soumettre des propositions de candidatures. Il suffit pour cela d'envoyer un courrier et le CV de la personne dont vous sugg&eacute;rez la nomination. &Ccedil;a ne prend pas longtemps et vous pouvez le faire par courriel.

source: Richard M. Stallman, inventor of notable software innovations including the Emacs editor and the software distribution model &ldquo;copyleft&rdquo;, is our choice for the committee. Stallman has shown reasoned opposition not only to the current trends of patenting other people's work and trivial new developments, but also to the patentability of mathematical algorithms and business methods. <a href="http://stallman.org/#serious">&ldquo;A serious bio&rdquo;</a> from his web site is the resume he offers; it summarizes his achievements.
fr: Notre choix pour le comit&eacute; est Richard M. Stallman (RMS), inventeur d'innovations logicielles significatives, dont l'&eacute;diteur Emacs et le mod&egrave;le de distribution de logiciels dit &laquo;&nbsp;gauche d'auteur&nbsp;&raquo; [NdT&nbsp;: copyleft]. Stallman a d&eacute;montr&eacute; une opposition motiv&eacute;e non seulement &agrave; l'&eacute;gard des tendances actuelles de la brevetabilit&eacute; du travail d'autrui et les nouveaux d&eacute;veloppements triviaux qui en d&eacute;coulent, mais aussi &agrave; l'&eacute;gard de la brevetabilit&eacute; des algorithmes math&eacute;matiques et des mod&egrave;les d'activit&eacute; &eacute;conomiques [NdT&nbsp;: business methods]. Sa <a href="http://stallman.org/#serious">&laquo;&nbsp;biographie s&eacute;rieuse&nbsp;&raquo;</a> disponible sur son site Web peut faire office de CV [pour le courrier &agrave; l'USPTO], car elle r&eacute;sume ses r&eacute;alisations.

source: If you a fan of other patent reform advocates, you might consider nominating one of them instead of, or in addition to, RMS. Lawrence Lessig, Eben Moglen and Tim O'Reilly might all make good committee members. Nominate your favorite. Or if you're ready to help <abbr title="United States Patent and Trademark Office">USPTO</abbr> fix its broken system, get someone to nominate you.
fr: Si vous soutenez d'autres d&eacute;fenseurs de la r&eacute;forme des brevets, vous pouvez envisager de d&eacute;signer l'un d'entre eux soit en plus soit &agrave; la place de RMS. Lawrence Lessig, Eben Moglen et Tim O'Reilly feraient tous de bons membres de ce comit&eacute;. D&eacute;signez votre favori. Ou bien, si vous &ecirc;tes pr&ecirc;t &agrave; aider l'USPTO &agrave; corriger son syst&egrave;me d&eacute;faillant, trouvez quelqu'un pour sugg&eacute;rer votre nomination.

source: Last year, Acting Secretary of Commerce Robert L. Mallett appointed <a href="http://www.uspto.gov/web/offices/com/speeches/00-43.htm">an initial complement of nine</a> to the committee: six lawyers, two patent-holding inventors and two professors. (One of the professors is a professor of law, so it adds up to nine, if you're counting.) None are patent reform advocates.
fr: L'ann&eacute;e derni&egrave;re, le Secr&eacute;taire d'&Eacute;tat au Commerce des &Eacute;tats-Unis Robert L. Mallet a d&eacute;sign&eacute; <a href="http://www.uspto.gov/web/offices/com/speeches/00-43.htm">un premier compl&eacute;ment de neuf personnes</a> &agrave; ce comit&eacute;, compl&eacute;ment constitu&eacute; de&nbsp;: six juristes, deux d&eacute;tenteurs d'invention et deux professeurs (dont l'un est professeur de droit, d'o&ugrave; le total de neuf, si vous comptez). Aucun n'est d&eacute;fenseur de la r&eacute;forme des brevets.

source: Here is the original notice from the Federal Register (converted from the <a href="http://www.uspto.gov/web/offices/com/sol/notices/pubadvcomnom.pdf"> original PDF file</a> on the USPTO site.)
fr: Voici le communiqu&eacute; initial du Registre F&eacute;d&eacute;ral [NdT&nbsp;: Federal Register] (transcrit &agrave; partir du <a href="http://www.uspto.gov/web/offices/com/sol/notices/pubadvcomnom.pdf">fichier original au format PDF</a> sur le site de l'USPTO).

source: Mail <a href="mailto:PPACnomination@uspto.gov">&lt;PPACnomination@uspto.gov&gt;</a> today.
fr: Contactez <a href="mailto:PPACnomination@uspto.gov">&lt;PPACnomination@uspto.gov&gt;</a> d&egrave;s aujourd'hui.

source: <b>DEPARTMENT OF COMMERCE </b>
fr: <b>S&Eacute;CR&Eacute;TARIAT D'&Eacute;TAT AU COMMERCE DES &Eacute;TATS-UNIS</b>

source: <br /><b>United States Patent and Trademark Office </b> <br />[Docket No. 000317075103502] <br />RIN 0651 XX22 <br /><b>Public Advisory Committees</b> <br /><b>AGENCY:</b> United States Patent and Trademark Office, Commerce. <br /><b>ACTION:</b> Notice and request for nominations.
fr: <b>Office am&eacute;ricain des brevets et des marques</b><br />[Dossier N&deg; 000317075103502]<br />RIN 0651 XX22<br /><b>Comit&eacute;s Consultatifs Publics</b><br /><b>AGENCE&nbsp;:</b> Office am&eacute;ricain des brevets et des marques, au sein du Secr&eacute;tariat d'&Eacute;tat au Commerce.<br /><b>ACTION&nbsp;:</b> Avis et demande de propositions en vue de nominations.

source: <b>SUMMARY </b>
fr: <b>R&Eacute;SUM&Eacute;</b>

source: On November 29, 1999, the President signed into law the Patent and Trademark Office Efficiency Act (the ``Act''), Pub. L. 106113, Appendix I, Title IV, Subtitle G, 113 Stat. 1501A 572, which, among other things, established two Public Advisory Committees to review the policies, goals, performance, budget and user fees of the United States Patent and Trademark Office (USPTO) with respect to patents, in the case of the Patent Public Advisory Committee, and with respect to trademarks, in the case of the Trademark Public Advisory Committee, and to advise the Director in these matters. The USPTO is requesting nominations for three (3) members to each Public Advisory Committee for terms beginning on July 13, 2001.
fr: Le 29 Novembre 1999, le pr&eacute;sident des &Eacute;tats-Unis a promulgu&eacute; la loi [NdT&nbsp;: Patent and Trademark Office Efficiency Act] relative au bon fonctionnement de l'Office am&eacute;ricain des brevets et des marques (appel&eacute;e dans la suite de ce document &laquo;&nbsp;la Loi&nbsp;&raquo;) Pub. L. 106113, Annexe I, Titre IV, Section G, 113 Stat. 1501A 572, qui entre autres choses a cr&eacute;&eacute; deux comit&eacute;s consultatifs publics dont l'objectif est de contr&ocirc;ler les politiques, les objectifs, les performances, les budgets et les frais imput&eacute;s par le Comit&eacute; Consultatif Public charg&eacute; des Brevets et par celui charg&eacute; des Marques, et de conseiller le directeur de l'Office dans ces domaines. L'USPTO demande des candidatures pour trois (3) membres dans chacun de ces comit&eacute;s, pour des mandats commen&ccedil;ant le 13 juillet 2001.

source: <b>DATES:</b> Nominations must be postmarked or electronically transmitted on or before April 12, 2001.
fr: <b>DATES&nbsp;:</b> Les candidatures doivent &ecirc;tre transmises par voie &eacute;lectronique ou exp&eacute;di&eacute;es par courrier au plus tard le 12 avril 2001, le cachet de la poste faisant foi dans le cas des courriers postaux.

source: <b>ADDRESSES:</b> Persons wishing to submit nominations should send the nominee's resume to Chief of Staff, Office of the Director of the USPTO, Washington, DC 20231; by electronic mail to PPACnomination@uspto.gov for the Patent Public Advisory Committee or TPACnomination@uspto.gov for the Trademark Public Advisory Committee; by facsimile transmission marked to the Chief of Staff's attention at (703) 305-8664; or by mail marked to the Chief of Staff's attention and addressed to the Office of the Director of the USPTO, Washington, DC 20231.
fr: <b>ADRESSES&nbsp;:</b> Les personnes qui souhaitent soumettre des candidatures doivent envoyer le curriculum vitae du candidat au directeur de cabinet de l'USPTO par courrier &eacute;lectronique &agrave; PPACnomination@uspto.gov pour le Comit&eacute; Consultatif Public charg&eacute; des Brevets et &agrave; TPACnomination@uspto.gov pour le Comit&eacute; Consultatif Public charg&eacute; des Marques, par t&eacute;l&eacute;copie &agrave; l'attention du directeur de cabinet au +1 (703) 305-8664, ou par courrier postal &agrave; l'attention du directeur de cabinet et adress&eacute; au bureau du directeur de l'USPTO, Washington, DC 20231, &Eacute;tats-Unis.

source: <b>FOR FURTHER INFORMATION CONTACT:</b> Chief of Staff by facsimile transmission marked to his attention at (703) 3058664, or by mail marked to his attention and addressed to the Office of the Director of the USPTO, Washington, DC 20231.
fr: <b>POUR DE PLUS AMPLES INFORMATIONS&nbsp;:</b> Contactez le directeur de cabinet par t&eacute;l&eacute;copie &agrave; son attention au +1 (703) 305-8664, ou par courrier postal &agrave; son attention et adress&eacute; au bureau du directeur de l'USPTO, Washington, DC 20231, &Eacute;tats-Unis.

source: <b>SUPPLEMENTARY INFORMATION:</b> Under the Act, the then-Acting Secretary of Commerce appointed members to the two Patent and Trademark Public Advisory Committees on July 13, 2000. The Advisory Committees' duties include:
fr: <b>INFORMATIONS SUPPL&Eacute;MENTAIRES&nbsp;:</b> En vertu de la Loi, le Secr&eacute;taire d'&Eacute;tat au Commerce a nomm&eacute; les membres des deux comit&eacute;s consultatifs publics le 13 juillet 2000. Les fonctions de ces comit&eacute;s consultatifs comprennent&nbsp;:

source: Review and advise the Director of the USPTO on matters relating to policies, goals, performance, budget, and user fees of the USPTO relating to patents and trademarks, respectively; and
fr: l'examen et le conseil du directeur de l'USPTO sur les questions relatives aux politiques, aux objectifs, &agrave; la performance, au budget et aux frais d'utilisation de l'USPTO concernant respectivement les brevets et les marques commerciales,

source: Within 60 days after the end of each fiscal year: (1) Prepare an annual report on the matters listed above; (2) transmit the report to the Secretary of Commerce, the President, and the Committees on the Judiciary of the Senate and the House of Representatives; and (3) publish the report in the Official Gazette of the USPTO. Members of the Patent and Trademark Public Advisory Committees are appointed by and serve at the pleasure of the Secretary of Commerce for three (3)-year terms.
fr: dans les 60 jours suivants la fin de chaque exercice budg&eacute;taires&nbsp;:<ol><li>la pr&eacute;paration d'un rapport annuel sur les questions &eacute;num&eacute;r&eacute;es ci-dessus&nbsp;;</li><li>la transmission de ce rapport au Secr&eacute;taire d'&Eacute;tat au Commerce, au Pr&eacute;sident des &Eacute;tats-Unis et aux commissions en charge de la justice au s&eacute;nat et &agrave; la chambre des repr&eacute;sentants&nbsp;;</li><li>la publication de ce rapport au Journal Officiel de l'USPTO. Les membres de ces comit&eacute;s consultatifs publics sont nomm&eacute;s par le Secr&eacute;taire d'&Eacute;tat au Commerce pour un mandat de trois (3) ans et sont responsables devant celui-ci.</li></ol>

source: <b>Advisory Committees</b>
fr: <b>Comit&eacute;s Consultatifs</b>

source: The Public Advisory Committees are each composed of nine (9) voting members who are appointed by the Secretary of Commerce (the ``Secretary'') and who have ``substantial backgrounds and achievement in finance, management, labor relations, science, technology, and office automation.'' 35 U.S.C. 5(b)(3). The Public Advisory Committee members must be United States citizens and represent the interests of diverse users of the USPTO both large and small entity applicants in proportion to the number of such applications filed. In the case of the Patent Public Advisory Committee, at least twenty-five (25) percent of the members must represent ``small business concerns, independent inventors, and nonprofit organizations,'' and at least one member must represent the independent inventors' community. 35 U.S.C. 5(b)(2). Each of the Public Advisory Committees also includes three (3) non-voting members representing each labor organization recognized by the USPTO.
fr: Les comit&eacute;s consultatifs publics sont chacun compos&eacute;s de neuf (9) membres votants qui sont nomm&eacute;s par le Secr&eacute;taire d'&Eacute;tat au Commerce et qui ont &laquo;&nbsp;des r&eacute;f&eacute;rences et des r&eacute;alisations substantielles dans les milieux de la finance, de la gestion, du monde du travail, de la science, de la technologie et de la bureautique&nbsp;&raquo; (R&eacute;f.&nbsp;: 35 U.S.C. 5(b)(3)). Les membres de ce comit&eacute; doivent &ecirc;tre citoyens des &Eacute;tats-Unis et repr&eacute;senter les int&eacute;r&ecirc;ts des divers membres de l'USPTO, grands et petits, au prorata du nombre de telles demandes d&eacute;pos&eacute;es. Dans le cas du Comit&eacute; Consultatif Public en charg&eacute; des Brevets, au moins vingt-cinq pour cent (25%) des membres doivent repr&eacute;senter &laquo;&nbsp;les petites entreprises, les inventeurs ind&eacute;pendants et les organismes &agrave; but non lucratif&nbsp;&raquo;, et au moins un membre doit repr&eacute;senter &laquo;&nbsp;les inventeurs ind&eacute;pendants&nbsp;&raquo; (R&eacute;f.&nbsp;: 35 U.S.C. 5(b)(2)). Chacun des comit&eacute;s comprend &eacute;galement trois (3) membres observateurs repr&eacute;sentants chacune des organisations syndicales reconnues par l'USPTO.

source: <b>Procedures and Guidelines of the Patent and Trademark Public Advisory Committees</b>
fr: <b>Proc&eacute;dures et lignes directrices des Comit&eacute;s Consultatifs Publics charg&eacute;s des Brevets et des Marques</b>

source: Each newly appointed member of the Patent and Trademark Public Advisory Committees will serve for a term of three years. Members appointed in the current fiscal year shall serve from July 13, 2001, to July 12, 2004. As required by the Act, members of the Patent and Trademark Public Advisory Committees will receive compensation for each day, including travel time, while the member is attending meetings or engaged in the business of that Advisory Committee. The rate of compensation is the daily equivalent of the annual rate of basic pay in effect for level III of the Executive Schedule under section 5314 of title 5, United States Code. While away from home or regular place of business, each member will be allowed travel expenses, including per diem in lieu of subsistence, as authorized by Section 5703 of Title 5, United States Code. The USPTO will provide the necessary administrative support, including technical assistance, for the Committees. Applicability of Certain Ethics Laws Members of each Public Advisory Committee shall be special Government employees within the meaning of Section 202 of Title 18, United States Code. The following additional information assumes that members are not engaged in Public Advisory Committee business more than sixty days during each calendar year:
fr: Chaque nouveau membre de ces comit&eacute;s est nomm&eacute; pour un mandat de trois ans. Les membres nomm&eacute;s au cours de la pr&eacute;sente ann&eacute;e fiscale serviront du 13 juillet 2001 au 12 juillet 2004. Comme l'exige la Loi, les membres de ces comit&eacute;s recevront une indemnit&eacute; pour chaque jour o&ugrave; ils participent &agrave; des r&eacute;unions ou se livrent &agrave; des activit&eacute;s li&eacute;es &agrave; leur comit&eacute;, y compris leur d&eacute;placement. Le montant de l'indemnit&eacute; journali&egrave;re correspond au prorata journalier du salaire annuel de base en vigueur pour les postes de niveau III tels que d&eacute;finis dans l'article 5314 du titre 5 du Code des &Eacute;tats-Unis [NdT&nbsp;: United States Code]. Lors des d&eacute;placements et de l'activit&eacute; usuelle, chaque membre aura droit au remboursement de ses notes de frais, comme l'y autorise l'article 5703 du titre 5 du Code des &Eacute;tats-Unis. L'USPTO fournira le soutien administratif n&eacute;cessaire pour les comit&eacute;s, y compris l'assistance technique. Au sens de l'article 202 du titre 18 du Code des &Eacute;tats-Unis, les membres sont soumis &agrave; certaines lois sur l'&eacute;thique en tant qu'&laquo;&nbsp;agents sp&eacute;ciaux de l'&Eacute;tat&nbsp;&raquo; [NdT&nbsp;: Special Government Agent]. Les points suivant supposent que les membres ne sont pas impliqu&eacute;s dans les Comit&eacute;s Consultatifs Publics plus de soixante jours par ann&eacute;e civile&nbsp;:

source: Each member will be required to file a confidential financial disclosure form within thirty (30) days of appointment. 5 C.F.R. 2634.202(c), 2634.204, 2634.903, and 2634.904(b).
fr: Chaque membre sera tenu de signer un accord de non-divulgation des donn&eacute;esfinanci&egrave;res dans les trente (30) jours suivants sa nomination (R&eacute;f&nbsp;:5 C.F.R. 2634.202(c), 2634.204, 2634.903 et 2634.904(b)).

source: Each member will be subject to many of the public integrity laws, including criminal bars against representing a party, 18 U.S.C. 203(c), or acting where the United States has an interest, 18 U.S.C. 205(c), in a particular matter that came before the member's committee and that involved at least one specific party. See also 18 U.S.C. 207 for post-membership bars. A member also must not act on a matter in which the member (or any of certain closely related entities) has a financial interest. 18 U.S.C. 208.
fr: Chaque membre sera soumis &agrave; la plupart des lois sur l'int&eacute;grit&eacute; publique, qui sont les poursuites p&eacute;nales contre ceux qui repr&eacute;senteraient un parti politique (R&eacute;f&nbsp;: 18 U.S.C. 203(c)) ou qui agiraient &agrave; l'encontre des int&eacute;r&ecirc;ts des &Eacute;tats-Unis (R&eacute;f&nbsp;: 18 U.S.C. 205(c)) en particulier sur toute question qui serait venue &agrave; l'attention du membre du fait de sa pr&eacute;sence au comit&eacute; et qui impliquerait au moins une partie sp&eacute;cifique. Les clauses de 18 U.S.C. 207 concernant les interdictions incombant au membre apr&egrave;s son mandat pourront aussi s'appliquer. Un membre ne doit pas non plus agir sur une question pour laquelle ce membre (ou n'importe quelle personne physique ou morale qui lui est proche) a un int&eacute;r&ecirc;t financier (R&eacute;f&nbsp;: 18 U.S.C. 208).

source: Representation of foreign interests may also raise issues. 35 U.S.C. 5(a)(1) and 18 U.S.C. 219.
fr: Le fait de repr&eacute;senter des int&eacute;r&ecirc;ts &eacute;trangers peut &eacute;galement soulever des probl&egrave;mes (R&eacute;f&nbsp;: 35 U.S.C. 5(a)(1) et 18 U.S.C. 219).

source: <b>Meetings of the Patent and Trademark Public Advisory Committees </b>
fr: <b>R&eacute;unions des Comit&eacute;s Consultatifs Publics charg&eacute;s des Brevets et des Marques</b>

source: Meetings of each Advisory Committee will take place at the call of the chair to consider an agenda set by the chair. Meetings may be conducted in person, electronically through the Internet, or by other appropriate means. The meetings of each Advisory Committee will be open to the public except each Advisory Committee may, by majority vote, meet in executive session when considering personnel or other confidential matters. Nominees must also have the ability to participate in Committee business through the Internet.
fr: Les s&eacute;ances de chaque comit&eacute; auront lieu &agrave; la demande du pr&eacute;sident du comit&eacute; et porteront sur un ordre du jour d&eacute;fini par ce dernier. Les s&eacute;ances pourront se d&eacute;rouler sous la forme de r&eacute;unions physiques ou par voie &eacute;lectronique sur Internet ou encore par tout autre moyen appropri&eacute;. Les r&eacute;unions seront ouvertes au public, sauf quand les membres auront d&eacute;cid&eacute;, par un vote &agrave; la majorit&eacute;, de se r&eacute;unir &agrave; huis clos pour les sujets relatifs aux ressources humaines et pour les autres sujets confidentiels. Les candidats doivent &eacute;galement avoir la capacit&eacute; &agrave; participer aux s&eacute;ances du Comit&eacute; via Internet.

source: <b>Procedure for Submitting Nominations</b>
fr: <b>Proc&eacute;dure de proposition de candidatures</b>

source: Submit resumes for nominations for the Patent Public Advisory Committee and the Trademark Public Advisory Committee to the USPTO's Chief of Staff as provided above.
fr: Envoyez le curriculum vitae du candidat pour les Comit&eacute;s consultatifs Publics charg&eacute;s des Brevet et des Marques au directeur de cabinet de l'USPTO, comme indiqu&eacute; ci-dessus.

source: Dated: March 7, 2001. <br />Nicholas P. Godici,
fr: Date&nbsp;: 7 mars 2001.<br />Nicholas P. Godici,

source: <i>Acting Under Secretary of Commerce for Intellectual Property and Acting Director of the United States Patent and Trademark Office.</i>
fr: <i>Agissant en tant que Charg&eacute; de la propri&eacute;t&eacute; intellectuelle et directeur de l'Office am&eacute;ricain des brevets et des marques, sous l'autorit&eacute; du Secr&eacute;taire d'&Eacute;tat au Commerce.</i>

source: [FR Doc. 016238 Filed 31201; 8:45 am] <br /> BILLING CODE 351016U
fr: [FR Doc. 016238 D&eacute;p&ocirc;t 31201; 8:45 am]<br />BILLING CODE 351016U

source: Please send questions and comments regarding this specific page to <a href="mailto:dmarti@ssc.com">Don Marti &lt;dmarti@ssc.com&gt;</a>.
fr: Veuillez envoyer les questions et commentaires concernant cette page à <a href="mailto:dmarti@ssc.com">Don Marti &lt;dmarti@ssc.com&gt;</a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF.
