Repository: gitGNU/gnu_www-fr
Catalog: philosophy/dmarti-patent.*.po
Languages: fr

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: This article is reprinted here with permission from Don Marti.
fr: Cet article est republi&eacute; ici avec la permission de Don Marti.

source: Copyright &copy; 2001, Specialized Systems Consultants, Inc. All rights reserved.
fr: Copyright &copy; 2001, Specialized Systems Consultants, Inc. Tous droits réservés.

source: First published on the Linux Journal web site 3 April 2001. Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: Initialement publi&eacute; sur le site Web du Linux Journal, le 3 Avril 2001.<br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: ?<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
