Repository: gitGNU/gnu_www-fr
Catalog: philosophy/drdobbs-letter.*.po
Languages: fr

source: Letter to the Editor of Dr. Dobb's Journal - GNU Project - Free Software Foundation (FSF)
fr: Lettre au r&eacute;dacteur du Dr. Dobb's Journal - GNU Project - Free Software Foundation (FSF)

source: Letter to the Editor of Dr. Dobb's Journal
fr: Lettre au r&eacute;dacteur du Dr. Dobb's Journal

source: Dear Editor,
fr: Cher r&eacute;dacteur,

source: I am sure you don't realize how ironic it is to associate me and Tim O'Reilly with &ldquo;open source&rdquo;.
fr: Je suis s&ucirc;r que vous ne r&eacute;alisez pas &agrave; quel point il est ironique d'associer Tim O'Reilly et moi-m&ecirc;me avec le terme &laquo;&nbsp;open source&nbsp;&raquo;.

source: If the House Un-American Activities Committee asked me, &ldquo;Are you now or have you ever been a supporter of the open source movement,&rdquo; I could proudly and cheerfully say no. I've been campaigning since 1984 for <em>free software</em>&mdash;free as in freedom. (See the GNU Manifesto, Dr. Dobb's Journal, Sept. 1985.)
fr: Si la Commission de la Chambre des repr&eacute;sentants sur les activit&eacute;s anti-am&eacute;ricaines (House Un-American Activities Committee) me demandait, &laquo;&nbsp;&Ecirc;tes-vous maintenant ou avez-vous jamais &eacute;t&eacute; un partisan du mouvement open source&nbsp;&raquo;, je pourrais fi&egrave;rement et joyeusement r&eacute;pondre non. Je fais campagne depuis 1984 pour le <em>logiciel libre</em> -- libre comme dans le mot libert&eacute;. (Lisez le Manifeste GNU, Dr. Dobb's Journal, sept. 1985.)

source: Free software means, roughly, that you are free to study what it does, free to change it, free to redistribute it, and free to publish improved versions. (See <a href="/philosophy/free-sw.html">http://www.gnu.org/philosophy/free-sw.html</a> for more details.) You deserve these freedoms; everyone deserves them. I wrote the GNU General Public License (GNU GPL), the target of <a href="/philosophy/gpl-american-way.html">Microsoft's greatest ire</a>, to defend these freedoms for all users, in the spirit of the free software movement.
fr: Logiciel libre signifie, en gros, que vous &ecirc;tes libre d'&eacute;tudier ce qu'il fait, libre de le modifier, libre de le redistribuer et libre d'en publier des versions am&eacute;lior&eacute;es. (Visitez le site <a href="/philosophy/free-sw.fr.html">http://www.gnu.org/philosophy/free-sw.fr.html</a> pour plus de d&eacute;tails). Vous m&eacute;ritez ces libert&eacute;s&nbsp;; tout le monde les m&eacute;rite. J'ai &eacute;crit la GNU General Public License (GNU GPL), cible de la <a href="/philosophy/gpl-american-way.fr.html">plus grosse des col&egrave;res de Microsoft</a>, dans le but de d&eacute;fendre ces libert&eacute;s pour tous les utilisateurs, dans l'esprit du mouvement du logiciel libre.

source: Years later, in 1998, another group began operating under the term &ldquo;open source&rdquo;. They have contributed to the free software community in practical ways, but they stand for very different views. They studiously avoid the issues of freedom and principle that we raise in the free software movement; they cite only short-term practical benefits as the reasons for what they do.
fr: Des ann&eacute;es plus tard, en 1998, un autre groupe s'est mis &agrave; op&eacute;rer sous le terme de &laquo;&nbsp;open source&nbsp;&raquo;. Ils ont contribu&eacute; &agrave; la communaut&eacute; des logiciels libres de mani&egrave;re pratique, mais ils d&eacute;fendent un point de vue tr&egrave;s diff&eacute;rent. Ils &eacute;vitent soigneusement les questions de libert&eacute; et le principe que nous mettons en avant dans le mouvement du logiciel libre&nbsp;; ils ne citent que quelques avantages pratiques &agrave; court terme comme raison de ce qu'ils font.

source: Their stated definition for the term &ldquo;open source&rdquo; is somewhat broader than free software, and thus includes my work. But describing the GNU GPL as an &ldquo;open source license,&rdquo; as Microsoft did, is more than half misleading. The GNU GPL embodies the firm philosophy of the free software movement; it doesn't come from the open source movement. I am not a supporter of the open source movement, and never have been.
fr: Ils ont affirm&eacute; que la d&eacute;finition du terme &laquo;&nbsp;open source&nbsp;&raquo; est l&eacute;g&egrave;rement plus large que le logiciel libre et qu'elle inclut donc mon travail. Mais d&eacute;crire la GNU GPL comme une &laquo;&nbsp;licence open source&nbsp;&raquo;, de la m&ecirc;me fa&ccedil;on que Microsoft l'a fait, est plus que fallacieux. La GNU GPL incarne la philosophie solide du mouvement du logiciel libre&nbsp;; elle ne provient pas du mouvement open source. Je ne suis pas un partisan du mouvement open source et ne l'ai jamais &eacute;t&eacute;.

source: Tim O'Reilly, by contrast, is a pillar of the open source movement, at least to hear him tell it. However, if you look at actions rather than words, most of the manuals published by O'Reilly Associates do not qualify as open source, let alone as free. The handful of free titles are exceptions. He could easily excuse himself to <abbr title="House Un-American Activities Committee">HUAC</abbr>&mdash;&ldquo;Yes, I talked about open source, but I didn't really do much of it.&rdquo;
fr: Tim O'Reilly, en comparaison, est un pilier du mouvement open source, du moins selon ses dires. Toutefois, si vous prenez en compte les actions plut&ocirc;t que les paroles, la plupart des manuels publi&eacute;s par O'Reilly Associates ne sont pas d&eacute;finis comme open source, encore moins libres. La poign&eacute;e de titres libres sont des exceptions. Il pourrait facilement s'excuser &agrave; l'<abbr title="House Un-American Activities Committee">HUAC</abbr> -- &laquo;&nbsp;Oui, j'ai parl&eacute; sur l'open source, mais je n'en ai pas fait grand chose.&nbsp;&raquo;

source: If O'Reilly moves to selling free-as-in-freedom books in the future, he could become a true supporter of the free software movement, or at least the open source movement. [Later in 2001, O'Reilly Associates published a couple of additional free books. We are grateful for this contribution to the free software community, and we look forward to more of the same.]
fr: Si O'Reilly &eacute;volue vers la vente de livres libres comme dans le mot libert&eacute; dans le futur, il pourrait devenir un vrai partisan du mouvement du logiciel libre [Derni&egrave;rement en 2001, O'Reilly Associates a publi&eacute; quelques livres libres suppl&eacute;mentaires. Nous leur sommes reconnaissants de cette contribution &agrave; la communaut&eacute;, et nous attendons avec int&eacute;r&ecirc;t encore plus sur ce sujet].

source: With the recent founding of FSF-Europe, and the coming inauguration of FSF-India, the free software movement is going stronger than ever. Please don't lump us in with the other movement in our community.
fr: Avec la cr&eacute;ation r&eacute;cente de la FSF-Europe, et la prochaine inauguration de la FSF-India, le mouvement du logiciel libre devient plus fort que jamais. Veuillez ne pas nous m&eacute;langer avec l'autre mouvement dans notre communaut&eacute;.

source: Sincerely,
fr: Bien &agrave; vous,

source: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Richard Stallman President, Free Software Foundation
fr: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Richard Stallman Pr&eacute;sident, Free Software Foundation

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: ?<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
