Repository: gitGNU/gnu_www-fr
Catalog: philosophy/ebooks.*.po
Languages: fr

source: E-Books: Freedom Or Copyright - RMS
fr: Livres &eacute;lectroniques : Libert&eacute; ou droit d'auteur - RMS

source: E-Books: Freedom Or Copyright
fr: Livres &eacute;lectroniques : Libert&eacute; ou droit d'auteur

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: Once upon a time, in the age of the printing press, an industrial regulation was established to cover the business of writing and publishing. It was called copyright. Copyright's purpose, stated in the US Constitution, was to &ldquo;promote progress&rdquo;&mdash;that is, to encourage publication. The method used was to make publishers get permission from authors for using recent works.
fr: Il &eacute;tait une fois, &agrave; l'&acirc;ge de la presse imprim&eacute;e, une r&eacute;glementation industrielle qui fut &eacute;tablie pour prot&eacute;ger l'&eacute;conomie de l'&eacute;criture et de la publication. Elle fut appel&eacute;e copyright (droit d'auteur). Le but du copyright, d&eacute;clar&eacute; dans la Constitution am&eacute;ricaine, &eacute;tait de &laquo;promouvoir le progr&egrave;s&raquo; &mdash; c'est-&agrave;-dire, d'encourager la publication. La m&eacute;thode utilis&eacute;e fut de donner le droit aux &eacute;diteurs d'obtenir la permission des auteurs pour utiliser leurs œuvres r&eacute;centes.

source: Ordinary readers had little reason to disapprove, since copyright restricted only publication, not the things a reader could do. If it raised the price of a book a small amount, that was only money; it did not contort readers' way of life. Copyright provided a public benefit, as intended, with little burden on the public. It did its job well&mdash;back then.
fr: Les lecteurs n'avaient que peu de raisons de d&eacute;sapprouver, puisque le copyright ne restreignait que la publication, pas ce qu'un lecteur pouvait faire. Si cela augmentait le prix d'un livre d'une petite somme, il ne s'agissait que d'argent; cela ne modifiait pas la fa&ccedil;on de vivre des lecteurs. Le copyright apportait au public un b&eacute;n&eacute;fice, comme cela &eacute;tait pr&eacute;vu, avec tr&egrave;s peu de contrepartie pour le public. Il remplissait bien son son r&ocirc;le en retour.

source: Then a new way of distributing information came about: computers and networks. The advantage of digital information technology is that it facilitates copying and manipulating information, including software, musical recordings and books. Networks offered the possibility of unlimited access to all sorts of data, an information utopia.
fr: Alors, un nouveau moyen de distribution de l'information apparut&nbsp;: les ordinateurs et les r&eacute;seaux. L'avantage de la technologie de l'information num&eacute;rique, est que cela facilite la copie et la manipulation de l'information; cela comprend les logiciels, les enregistrements musicaux et les livres. Les r&eacute;seaux offrent la possibilit&eacute; d'un acc&egrave;s illimit&eacute; &agrave; toutes sortes de donn&eacute;es, l'information absolue.

source: So they prevailed upon the US government to give them the Digital Millennium Copyright Act of 1998, a law giving them total legal power over almost anything a reader might do with an e-book. Even reading it without authorization is a crime.
fr: Aussi, ils firent pression sur le gouvernement am&eacute;ricain pour qu'il leur donne le «&nbsp;Digital Millennium Copyright Act&nbsp;» (la Loi du mill&eacute;naire sur le droit d'auteur num&eacute;rique) de 1998, une loi leur donnant un total pouvoir l&eacute;gal sur presque tout ce que peut faire un lecteur avec un livre &eacute;lectronique. M&ecirc;me le lire sans autorisation est un crime.

source: We still have the same old freedoms in using paper books. But if e-books replace printed books, that exception will do little good. With &ldquo;electronic ink&rdquo;, which makes it possible to download new text onto an apparently printed piece of paper, even newspapers could become ephemeral. Imagine: no more used book stores; no more lending a book to your friend; no more borrowing one from the public library&mdash;no more &ldquo;leaks&rdquo; that might give someone a chance to read without paying. And judging from the ads for Microsoft Reader, no more anonymous purchasing of books. This is the world publishers have in mind for us.
fr: Nous avons toujours les m&ecirc;mes anciennes libert&eacute;s en utilisant des livres papier. Mais si les livres &eacute;lectroniques remplacent les livres imprim&eacute;s, cetteexception ne sera que de peu de r&eacute;confort. Avec «&nbsp;l'encre &eacute;lectronique&nbsp;», qui rend possible le t&eacute;l&eacute;chargement d'un nouveau texte sur une feuille de papier apparemment imprim&eacute;e, m&ecirc;me les journaux pourraient devenir &eacute;ph&eacute;m&egrave;res. Imaginez&nbsp;: plus de magasins de livres d'occasion; plus de pr&ecirc;t de livre &agrave; un ami; plus d'emprunt dans une biblioth&egrave;que publique &mdash; plus de possibilit&eacute; qui donnerait &agrave; quelqu'un une chance de lire sans payer. Et &agrave; en juger par les publicit&eacute;s pour Microsoft Reader, plus d'achat anonyme de livres. Voici le monde que les &eacute;diteurs ont en t&ecirc;te pour nous.

source: Why is there so little public debate about these momentous changes? Most citizens have not yet had occasion to come to grips with the political issues raised by this futuristic technology. Besides, the public has been taught that copyright exists to &ldquo;protect&rdquo; the copyright holders, with the implication that the public's interests do not count.
fr: Pourquoi y a-t-il si peu de d&eacute;bats publics autour de ces changements consid&eacute;rables&nbsp;? La plupart des citoyens n'ont pas encore eu l'occasion d'&ecirc;tre aux prises avec les probl&egrave;mes politiques soulev&eacute;s par cette technologie futuriste. De plus, on a dit au public que le copyright existe pour «&nbsp;prot&eacute;ger&nbsp;» les d&eacute;tenteurs de copyright, avec l'implication que les int&eacute;r&ecirc;ts du public ne comptent pas.

source: But when the public at large begins to use e-books, and discovers the regime that the publishers have prepared for them, they will begin to resist. Humanity will not accept this yoke forever.
fr: Mais quand une grande partie du public commencera &agrave; utiliser les livres &eacute;lectroniques, et d&eacute;couvrira le r&eacute;gime que les &eacute;diteurs ont pr&eacute;par&eacute; pour eux, ils commenceront &agrave; r&eacute;sister. L'Humanit&eacute; n'acceptera pas &eacute;ternellement ce joug.

source: The publishers would have us believe that suppressive copyright is the only way to keep art alive, but we do not need a War on Copying to encourage a diversity of published works; as the Grateful Dead showed, copying among fans is not a problem for the artists. By legalizing the noncommercial copying of e-books, we can turn copyright back into the industrial regulation it once was.
fr: Les &eacute;diteurs voudraient nous faire croire que des droits d'auteur r&eacute;pressifs sont la seule fa&ccedil;on de conserver la cr&eacute;ation artistique, mais nous n'avons pas besoin d'une «&nbsp;Guerre contre la copie&nbsp;» pour encourager la diversit&eacute; des oeuvres publi&eacute;es; comme l'ont montr&eacute; les Grateful Dead, la copie parmi les fans n'est pas un probl&egrave;me pour les artistes. En l&eacute;galisant la copie &agrave; but non commercial de livres &eacute;lectroniques, nous pouvons renvoyer le copyright &agrave; son r&ocirc;le de r&eacute;gulation industrielle qu'il fut nagu&egrave;re.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections (or suggestions) to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2000 Richard Stallman <br /> Verbatim copying and distribution of this entire article are permitted in any medium, provided the copyright notice and this notice are preserved.
fr: Copyright &copy; 2000 Richard Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
