Repository: gitGNU/gnu_www-fr
Catalog: philosophy/enforcing-gpl.*.po
Languages: fr

source: But perhaps we have succeeded too well. If I had used the courts to enforce the GPL years ago, Microsoft's whispering would now be falling on deaf ears. Just this month I have been working on a couple of moderately sticky situations. &ldquo;Look,&rdquo; I say, &ldquo;at how many people all over the world are pressuring me to enforce the GPL in court, just to prove I can. I really need to make an example of someone. Would you like to volunteer?&rdquo;
fr: Mais peut-&ecirc;tre avons-nous trop bien r&eacute;ussi dans cette voie. Si j'avais saisi les tribunaux afin de d&eacute;fendre la GPL il y a quelques ann&eacute;es, les ragots de Microsoft ne trouveraient pas d'auditoire aujourd'hui. Rien que ce mois-ci, j'ai travaill&eacute; sur une ou deux affaires relativement d&eacute;licates. &laquo;&nbsp;Constatez&nbsp;&raquo;, ai-je dit, &laquo;&nbsp;&agrave; quel point sont nombreux les gens qui, dans le monde entier, me pressent de d&eacute;fendre la GPL en justice, juste afin de prouver que je le peux. J'ai vraiment besoin de faire un exemple&nbsp;; &ecirc;tes-vous volontaire&nbsp;?&nbsp;&raquo;.

source: Someday someone will. But that someone's customers are going to go elsewhere, talented technologists who don't want their own reputations associated with such an enterprise will quit, and bad publicity will smother them. And that's all before we even walk into court. The first person who tries it will certainly wish he hadn't. Our way of doing law has been as unusual as our way of doing software, but that's just the point. Free software matters because it turns out that the different way is the right way after all.
fr: Un jour, quelqu'un le sera. Mais les clients de cette personne iront voir ailleurs, les techniciens talentueux qui ne voudront pas voir leur propre r&eacute;putation associ&eacute;e avec celle d'une telle entreprise la quitteront, et une mauvaise publicit&eacute; l'etouffera. Et cela, avant m&ecirc;me que le proc&egrave;s n'ait lieu. La premi&egrave;re personne qui s'y frottera le regrettera tr&egrave;s certainement. Notre fa&ccedil;on de faire du droit est aussi inhabituelle que notre fa&ccedil;on de faire du logiciel, mais c'est bien ce qui doit &ecirc;tre retenu. Le logiciel libre est important parce qu'il d&eacute;montre qu'une fa&ccedil;on de faire diff&eacute;rente est finalement la bonne fa&ccedil;on de faire.

source: <cite> Eben Moglen is professor of law and legal history at Columbia University Law School. He serves without fee as General Counsel of the Free Software Foundation. </cite>
fr: <cite>Eben Moglen est professeur de droit et d'histoire l&eacute;gale &agrave; l'&Eacute;cole de droit de l'Universit&eacute; de Colombia. Il fait b&eacute;n&eacute;volement office d'Avocat conseil de la Fondation pour le Logiciel Libre.</cite>

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;: <ol><li id="TransNote1"><abbr title="Fear, Uncertainty and Doubt">FUD</abbr>(Peur, incertitude et doute)&nbsp;: Sorte de rumeur destin&eacute;e &agrave; semer la confusion dans les esprits.</li></ol>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Jean-Jacques Puig.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
