Repository: gitGNU/gnu_www-fr
Catalog: philosophy/enforcing-gpl.*.po
Languages: fr

source: Enforcing the GNU GPL - GNU Project - Free Software Foundation (FSF)
fr: Faire respecter la GPL GNU - GNU Project - Free Software Foundation (FSF)

source: GNU, FSF, Free Software Foundation, Linux, violation, general, public, license, gpl, general public license, enforcing, freedom, software, Eben, Moglen, Eben Moglen
fr: GNU, FSF, Free Software Foundation, Linux, violation, g&eacute;n&eacute;rale, publique, licence, gpl, licence publique g&eacute;n&eacute;rale, appliquer, libert&eacute;, logiciel, Eben, Moglen, Eben Moglen

source: In his essay, Enforcing the GNU GPL, Eben Moglen, legal counsel to the FSF, talks about how enforcement of the GNU General Public License is typically carried out.
fr: Dans cet essai, Faire respecter la GPL, Eben Moglen, avocat conseil auprès de la FSF, discute de la façon dont la Licence publique générale GNU est typiquement appliquée.

source: Enforcing the GNU GPL
fr: Faire respecter la GPL GNU

source: by <a href="http://moglen.law.columbia.edu/"><strong>Eben Moglen</strong></a>
fr: par <a href="http://moglen.law.columbia.edu/"><strong>Eben Moglen</strong></a>

source: <em>10 September 2001</em>
fr: <em>10 Septembre 2001</em>

source: Microsoft's anti-GPL offensive this summer has sparked renewed speculation about whether the GPL is &ldquo;enforceable.&rdquo; This particular example of &ldquo;FUD&rdquo; (fear, uncertainty and doubt) is always a little amusing to me. I'm the only lawyer on earth who can say this, I suppose, but it makes me wonder what everyone's wondering about: Enforcing the <a href="/licenses/gpl.html">GPL</a> is something that I do all the time.
fr: L'offensive anti-GPL de Microsoft lors de l'&eacute;t&eacute; dernier a soulev&eacute; de nombreuses interrogations quand &agrave; la capacit&eacute; &agrave; &laquo;&nbsp;faire respecter la GPL&nbsp;&raquo;. Ce sp&eacute;cimen de &laquo;&nbsp;<abbr title="Fear, Uncertainty and Doubt">FUD</abbr><sup><a href="#TransNote1">1</a></sup></a>&nbsp;&raquo; m'amuse toujours un peu. Je pr&eacute;sume que je suis le seul avocat sur terre &agrave; pouvoir le dire, mais cela me fait penser &agrave; ce sur quoi tout le monde s'interroge : faire respecter la <a href="/licenses/gpl.html">GPL</a> est mon lot quotidien.

source: Because <a href="/philosophy/free-sw.html">free software</a> is an unorthodox concept in contemporary society, people tend to assume that such an atypical goal must be pursued using unusually ingenious, and therefore fragile, legal machinery. But the assumption is faulty. The goal of the Free Software Foundation in designing and publishing the GPL, <em>is</em> unfortunately unusual: we're reshaping how programs are made in order to give everyone the right to understand, repair, improve, and redistribute the best-quality software on earth. This is a transformative enterprise; it shows how in the new, networked society traditional ways of doing business can be displaced by completely different models of production and distribution. But the GPL, the legal device that makes everything else possible, is a very robust machine precisely because it is made of the simplest working parts.
fr: Sous pr&eacute;texte que le <a href="/philosophy/free-sw.fr.html">logiciel libre</a> constitue, dans notre soci&eacute;t&eacute; actuelle, un concept peu orthodoxe, les gens ont tendance &agrave; croire qu'un objectif aussi atypique doit &ecirc;tre soutenu par une m&eacute;canique l&eacute;gale inhabituellement ing&eacute;nieuse, et donc fragile. Mais cette assomption est fausse. Le but de la Fondation pour le Logiciel Libre, en concevant et en publiant la GPL <cite>est</cite> malheureusement inhabituel&nbsp;: nous red&eacute;finissons la conception des programmes afin de donner &agrave; tous le droit de comprendre, de r&eacute;parer, d'am&eacute;liorer et de redistribuer les meilleurs logiciels de la plan&egrave;te. Il s'agit d'un effort de transformation; il montre comment les anciens paradigmes des affaires peuvent &ecirc;tre remplac&eacute;s, au sein d'une soci&eacute;t&eacute; nouvelle et &laquo;&nbsp;connect&eacute;e&nbsp;&raquo;, par des mod&egrave;les de production et de distribution radicalement diff&eacute;rents. Mais la GPL, cet outil l&eacute;gal qui rend tout le reste possible, est une m&eacute;canique des plus robustes, pr&eacute;cis&eacute;ment parce qu'elle est con&ccedil;ue d'&eacute;l&eacute;ments des plus simples, d&eacute;j&agrave; op&eacute;rationnels.

source: The essence of copyright law, like other systems of property rules, is the power to exclude. The copyright holder is legally empowered to exclude all others from copying, distributing, and making derivative works.
fr: &Agrave; l'instar des autres syst&egrave;mes de lois sur la propri&eacute;t&eacute;, l'essence m&ecirc;me de la loi sur le copyright, est l'interdiction. Le d&eacute;tenteur du copyright dispose l&eacute;galement du pouvoir d'interdire aux autres la copie, la distribution et la cr&eacute;ation de produits d&eacute;riv&eacute;s.

source: This right to exclude implies an equally large power to license&mdash;that is, to grant permission to do what would otherwise be forbidden. Licenses are not contracts: the work's user is obliged to remain within the bounds of the license not because she voluntarily promised, but because she doesn't have any right to act at all except as the license permits.
fr: Ce droit &agrave; l'interdiction est &eacute;galement un grand pouvoir de la licence : celui de garantir une autorisation qui sinon serait interdite. Les licences ne sont pas des contrats&nbsp;: l'utilisateur n'est pas contraint de rester dans les limites de la licence par sa propre volont&eacute;, mais parce qu'il n'a pas le droit de faire quoi que ce soit d'autre que ce que la licence permet.

source: But most proprietary software companies want more power than copyright alone gives them. These companies say their software is &ldquo;licensed&rdquo; to consumers, but the license contains obligations that copyright law knows nothing about. Software you're not allowed to understand, for example, often requires you to agree not to decompile it. Copyright law doesn't prohibit decompilation, the prohibition is just a contract term you agree to as a condition of getting the software when you buy the product under shrink wrap in a store, or accept a &ldquo;clickwrap license&rdquo; on line. Copyright is just leverage for taking even more away from users.
fr: Mais la majorit&eacute; des &eacute;diteurs de logiciels propri&eacute;taires veut plus de pouvoir que le copyright seul ne leur en conc&egrave;de. Ces &eacute;diteurs disent que les consommateurs &laquo;&nbsp;acqui&egrave;rent une licence&nbsp;&raquo; de leur logiciel, mais la licence contient des restrictions qui ne sont pas reconnues par la loi sur le copyright. Par exemple, un logiciel dont vous n'&ecirc;tes pas autoris&eacute; &agrave; comprendre le fonctionnement requiert souvent de votre part la promesse que vous ne le d&eacute;compilerez pas. La loi sur le copyright n'interdit pas la d&eacute;compilation, cette interdiction est seulement un terme contractuel que vous acceptez comme condition en vue d'obtenir le logiciel, quand vous achetez en magasin un logiciel comportant un cachet ou en ligne quand vous devez accepter la licence par un &laquo;&nbsp;clic&nbsp;&raquo;. Le copyright est alors juste un moyen de soutirer encore plus aux utilisateurs.

source: The GPL, on the other hand, subtracts from copyright rather than adding to it. The license doesn't have to be complicated, because we try to control users as little as possible. Copyright grants publishers power to forbid users to exercise rights to copy, modify, and distribute that we believe all users should have; the GPL thus relaxes almost all the restrictions of the copyright system. The only thing we absolutely require is that anyone distributing GPL'd works or works made from GPL'd works distribute in turn under GPL. That condition is a very minor restriction, from the copyright point of view. Much more restrictive licenses are routinely held enforceable: every license involved in every single copyright lawsuit is more restrictive than the GPL.
fr: &Agrave; l'oppos&eacute;, la GPL &ocirc;te des restrictions au copyright, au lieu d'en rajouter. La licence n'a pas &agrave; &ecirc;tre complexe, puisque nous essayons d'entraver le moins possible l'utilisateur. Le copyright donne aux &eacute;diteurs le pouvoir d'interdire aux utilisateurs le droit de copier, de modifier et de distribuer, alors que nous consid&eacute;rons ces droits comme l&eacute;gitimes; la GPL assouplit donc quasiment toutes les restrictions du copyright, &agrave; l'exception de l'obligation pour toute personne distribuant des travaux sous GPL, ou travaillant &agrave; partir de tels travaux, de distribuer &agrave; son tour sous licence GPL. Cette restriction, d'un point de vue copyright, est des plus mineures. On fait respecter quotidiennement des licences bien plus restrictives&nbsp;: les licences impliqu&eacute;es dans les jugements de copyright sont toujours plus restrictives que la GPL.

source: Because there's nothing complex or controversial about the license's substantive provisions, I have never even seen a serious argument that the GPL exceeds a licensor's powers. But it is sometimes said that the GPL can't be enforced because users haven't &ldquo;accepted&rdquo; it.
fr: Comme les restrictions de la licence ne sont pas complexes et ne pr&ecirc;tent pas &agrave; controverses, je n'ai jamais vu d'arguments s&eacute;rieux prouvant que la licence d&eacute;passe les moyens de celui qui l'accepte. En revanche, on entend parfois dire que la GPL ne peut pas d&eacute;fendue parce que les utilisateurs ne l'ont pas &laquo;&nbsp;accept&eacute;e&nbsp;&raquo;.

source: This claim is based on a misunderstanding. The license does not require anyone to accept it in order to acquire, install, use, inspect, or even experimentally modify GPL'd software. All of those activities are either forbidden or controlled by proprietary software firms, so they require you to accept a license, including contractual provisions outside the reach of copyright, before you can use their works. The free software movement thinks all those activities are rights, which all users ought to have; we don't even <em>want</em> to cover those activities by license. Almost everyone who uses GPL'd software from day to day needs no license, and accepts none. The GPL only obliges you if you distribute software made from GPL'd code, and only needs to be accepted when redistribution occurs. And because no one can ever redistribute without a license, we can safely presume that anyone redistributing GPL'd software intended to accept the GPL. After all, the GPL requires each copy of covered software to include the license text, so everyone is fully informed.
fr: L'incompr&eacute;hension est &agrave; l'origine de cet a-priori. Il n'est pas n&eacute;cessaire d'accepter la licence afin d'obtenir, d'installer, d'utiliser ou m&ecirc;me de modifier un logiciel plac&eacute; sous GPL. Les &eacute;diteurs de logiciels propri&eacute;taires interdisent ou contr&ocirc;lent ces actions, ce qui les contraint &agrave; vous faire accepter une licence, assortie de restrictions contractuelles qui sortent du cadre du copyright, avant que vous ne puissiez utiliser leurs produits. Le mouvement pour le logiciel libre pense que ces actions (obtenir, installer, utiliser, modifier) constituent des droits que tout utilisateur devrait avoir. Nous ne <cite>voulons</cite> m&ecirc;me pas couvrir ces activit&eacute;s par une licence. Presque tous les utilisateurs quotidiens de logiciels sous GPL n'ont nul besoin de licence, et n'en acceptent aucune. La GPL ne vous contraint que lorsque vous distribuez des logiciels issus de codes sous GPL, et ne doit &ecirc;tre accept&eacute;e qu'au moment o&ugrave; la redistribution prend effet. Et parce que personne ne peut faire de redistribution sans licence, nous pouvons supposer avec une certaine assurance que quiconque redistribue des logiciels sous GPL accepte la GPL en connaissance de cause. Apr&egrave;s tout, la GPL n&eacute;cessite de la part de chaque copie du logiciel prot&eacute;g&eacute; d'inclure le texte de la licence, afin que tous soient pleinement inform&eacute;s.

source: Despite the FUD, as a copyright license the GPL is absolutely solid. That's why I've been able to enforce it dozens of times over nearly ten years, without ever going to court.
fr: En d&eacute;pit de la rumeur, la licence GPL, en tant que licence de copyright, est tout &agrave; fait robuste. C'est pour cela que j'ai &eacute;t&eacute; en mesure de la d&eacute;fendre une douzaine de fois en dix ans, sans m&ecirc;me avoir eu &agrave; pousser jusqu'au tribunal.

source: Meanwhile, much murmuring has been going on in recent months to the supposed effect that the absence of judicial enforcement, in US or other courts, somehow demonstrates that there is something wrong with the GPL, that its unusual policy goal is implemented in a technically indefensible way, or that the Free Software Foundation, which authors the license, is afraid of testing it in court. Precisely the reverse is true. We do not find ourselves taking the GPL to court because no one has yet been willing to risk contesting it with us there.
fr: Cependant, beaucoup de bruits courent depuis quelques mois sur l'effet suppos&eacute; de l'absence de recours en justice, aux &Eacute;tats-Unis comme ailleurs, qui serait la preuve d'un d&eacute;faut dans la GPL, que son objectif &eacute;thique inhabituel est concr&eacute;tis&eacute; d'une mani&egrave;re ind&eacute;fendable techniquement, et que la Fondation pour le Logiciel Libre, qui a cr&eacute;&eacute; la licence, craint de la d&eacute;fendre en tribunal. C'est pr&eacute;cis&eacute;ment le contraire qui est vrai. Nous n' avons pas &eacute;t&eacute; amen&eacute;s &agrave; d&eacute;fendre la GPL en jugement pr&eacute;cis&eacute;ment parce que personne jusqu'ici n'a os&eacute; prendre le risque d'en venir &agrave; ces extr&eacute;mit&eacute;s contre nous.

source: So what happens when the GPL is violated? With software for which the Free Software Foundation holds the copyright (either because we wrote the programs in the first place, or because free software authors have assigned us the copyright, in order to take advantage of our expertise in protecting their software's freedom), <a href="/licenses/gpl-violation.html">the first step is a report</a>, usually received by email to <a href="mailto:license-violation@gnu.org">&lt;license-violation@gnu.org&gt;</a>. <a href="/licenses/gpl-violation.html">We ask the reporters of violations to help us establish necessary facts</a>, and then we conduct whatever further investigation is required.
fr: Donc, qu'arrive-t'il quand la GPL est viol&eacute;e&nbsp;? Pour les logiciels pour lesquels la Fondation pour le Logiciel Libre d&eacute;tient le copyright (soit parce que nous sommes les auteurs des programmes en premier lieu, soit parce que les auteurs de logiciels libres nous ont c&eacute;d&eacute; le copyright, afin de b&eacute;n&eacute;ficier de notre expertise dans la protection de la libert&eacute; logicielle), il convient <a href="/licences/gpl-violation.html">de r&eacute;diger en premier lieu un rapport</a>, habituellement envoy&eacute; par mail &agrave; <a href="mailto:licence-violation&#64;gnu.org">&lt;licence-violation&#64;gnu.org&gt;</a>. <a href="/licences/gpl-violation.html">Nous prions les personnes reportant ces abus de nous aider &agrave; &eacute;tablir les faits n&eacute;cessaires</a>, &agrave; la suite de quoi nous menons les recherches en profondeur qui s'imposent.

source: We reach this stage dozens of times a year. A quiet initial contact is usually sufficient to resolve the problem. Parties thought they were complying with GPL, and are pleased to follow advice on the correction of an error. Sometimes, however, we believe that confidence-building measures will be required, because the scale of the violation or its persistence in time makes mere voluntary compliance insufficient. In such situations we work with organizations to establish GPL-compliance programs within their enterprises, led by senior managers who report to us, and directly to their enterprises' managing boards, regularly. In particularly complex cases, we have sometimes insisted upon measures that would make subsequent judicial enforcement simple and rapid in the event of future violation.
fr: Nous aboutissons &agrave; ce stade une douzaine de fois par an. Un contact initial en douceur suffit g&eacute;n&eacute;ralement &agrave; r&eacute;soudre le probl&egrave;me. Les parties pensaient &ecirc;tre en accord avec la GPL, et &eacute;taient enchant&eacute;es de suivre nos recommandations afin de corriger l'erreur. Cependant, nous pensons que des mesures de confiance sont parfois n&eacute;cessaires, quand la violation est importante ou quand ses effets dans le temps persistent, et que la simple intention de conformit&eacute; &agrave; la licence est insuffisante. Dans de telles situations, nous travaillons avec des organisations afin de constituer dans leur entreprise des programmes de conformit&eacute; &agrave; la GPL, dirig&eacute;s par des chefs de projet qui, r&eacute;guli&egrave;rement, nous rendent des comptes ainsi qu'au comit&eacute; de gestion de projets de leurs entreprises. Dans certains cas particuli&egrave;rement complexes, nous avons parfois soulign&eacute; les mesures qui pourraient permettre une mise en application judiciaire simple et rapide en cas de r&eacute;p&eacute;tition de la violation.

source: In approximately a decade of enforcing the GPL, I have never insisted on payment of damages to the Foundation for violation of the license, and I have rarely required public admission of wrongdoing. Our position has always been that compliance with the license, and security for future good behavior, are the most important goals. We have done everything to make it easy for violators to comply, and we have offered oblivion with respect to past faults.
fr: En approximativement dix ans de d&eacute;fense de la GPL, je n'ai jamais insist&eacute; sur le paiement de dommages &agrave; la Fondation pour violation de la licence, et j'ai rarement eu besoin de faire admettre publiquement les abus. Notre conviction a toujours &eacute;t&eacute; que la conformit&eacute; avec la licence, et la certitude d'un comportement ad&eacute;quat &agrave; l'avenir, constituent les objectifs les plus importants. Nous avons tout fait pour aider les contrevenants &agrave; respecter la licence, et nous avons offert le pardon pour les fautes pass&eacute;es.

source: In the early years of the free software movement, this was probably the only strategy available. Expensive and burdensome litigation might have destroyed the FSF, or at least prevented it from doing what we knew was necessary to make the free software movement the permanent force in reshaping the software industry that it has now become. Over time, however, we persisted in our approach to license enforcement not because we had to, but because it worked. An entire industry grew up around free software, all of whose participants understood the overwhelming importance of the GPL&mdash;no one wanted to be seen as the villain who stole free software, and no one wanted to be the customer, business partner, or even employee of such a bad actor. Faced with a choice between compliance without publicity or a campaign of bad publicity and a litigation battle they could not win, violators chose not to play it the hard way.
fr: Dans les premi&egrave;res ann&eacute;es du mouvement pour le logiciel libre, cela constituait probablement la seule strat&eacute;gie disponible. Des contentieux lourds et co&ucirc;teux auraient pu d&eacute;truire la Fondation pour le Logiciel Libre, ou du moins l'emp&ecirc;cher de faire ce que nous savions n&eacute;cessaire afin que le mouvement pour le logiciel libre devienne ce qu'il est aujourd'hui&nbsp;: cette force permanente qui redessine le paysage de l'industrie logicielle. Cependant, avec le temps, nous avons poursuivi notre approche de d&eacute;fense l&eacute;gale de la licence, non parce que cela &eacute;tait n&eacute;cessaire, mais parce que &ccedil;a marchait. Toute une industrie est n&eacute;e autour du logiciel libre, dont tous les participants comprennent l'importance critique de la GPL&nbsp;; personne ne veut &ecirc;tre consid&eacute;r&eacute; comme l'escroc qui vole le logiciel libre, et personne ne veut &ecirc;tre le client, le partenaire commercial, ou m&ecirc;me l'employ&eacute; d'un aussi mauvais joueur. Entre une conformit&eacute; sans publicit&eacute; et une campagne de mauvaise publicit&eacute; assortie d'un contentieux qu'ils ne peuvent gagner, les escrocs ont d&eacute;cid&eacute; d'&eacute;viter de jouer la partie d'une fa&ccedil;on &laquo;muscl&eacute;e&raquo;.

source: We have even, once or twice, faced enterprises which, under US copyright law, were engaged in deliberate, criminal copyright infringement: taking the source code of GPL'd software, recompiling it with an attempt to conceal its origin, and offering it for sale as a proprietary product. I have assisted free software developers other than the FSF to deal with such problems, which we have resolved&mdash;since the criminal infringer would not voluntarily desist and, in the cases I have in mind, legal technicalities prevented actual criminal prosecution of the violators&mdash;by talking to redistributors and potential customers. &ldquo;Why would you want to pay serious money,&rdquo; we have asked, &ldquo;for software that infringes our license and will bog you down in complex legal problems, when you can have the real thing for free?&rdquo; Customers have never failed to see the pertinence of the question. The stealing of free software is one place where, indeed, crime doesn't pay.
fr: Une fois ou deux, nous avons m&ecirc;me fait face &agrave; des entreprises qui, du point de vue de la loi am&eacute;ricaine sur le copyright, enfreignaient volontairement et de fa&ccedil;on criminelle le copyright : r&eacute;cup&eacute;rant le code source d'un logiciel sous GPL, le recompilant en essayant de dissimuler son origine, et le mettant en vente &agrave; l' image d'un produit propri&eacute;taire. J'ai aid&eacute; des d&eacute;veloppeurs de logiciels libres autres que ceux de la Fondation pour le Logiciel Libre &agrave; faire face &agrave; ces probl&egrave;mes, que nous avons r&eacute;solus -- puisque les criminels en infraction ne voulaient pas c&eacute;der volontairement et que, dans le cas auquel je pense, des artefacts l&eacute;gaux emp&ecirc;chaient la poursuite des contrevenants -- en parlant aux revendeurs et aux clients potentiels. &laquo;&nbsp;Pourquoi voudriez-vous d&eacute;penser de l' argent&nbsp;&raquo;, leur avons-nous demand&eacute;, &laquo;&nbsp;pour un logiciel qui rentre en infraction avec notre licence et qui vous enlise dans des probl&egrave;mes l&eacute;gaux complexes, alors que vous pouvez avoir l'original gratuitement&nbsp;?&nbsp;&raquo;. La pertinence d'une telle question n'a jamais &eacute;chapp&eacute; aux clients. Le vol de logiciel libre est un cas o&ugrave;, assur&eacute;ment, le crime ne paie pas.
