Repository: gitGNU/gnu_www-fr
Catalog: philosophy/essays-and-articles.*.po
Languages: fr

source: <a href="/philosophy/w3c-patent.html">FSF's Position on W3 Consortium &ldquo;Royalty-Free&rdquo; Patent Policy</a> rewritten
fr: <a href="/philosophy/w3c-patent.fr.html">Position de la FSF sur la politique de brevet &laquo;&nbsp;libres de droits&nbsp;&raquo; (&laquo;&nbsp;Royalty-Free&nbsp;&raquo;) du Consortium W3 (W3C)</a> r&eacute;&eacute;crit

source: <a href="/philosophy/guardian-article.html">That's fighting talk</a> a slightly modified version of the article, originally published in <a href="http://www.guardian.co.uk">The Guardian</a> of London by <a href="http://www.stallman.org">Richard Stallman</a> and Nick Hill.
fr: <a href="/philosophy/guardian-article.fr.html">Joutes verbales (That's fighting talk)</a>, une version l&eacute;g&agrave;rement modifi&eacute;e de l'article, publi&eacute; &agrave; l'origine dans <a href="http://www.guardian.co.uk">The Guardian</a> de Londres par <a href="http://www.stallman.org">Richard Stallman</a> et Nick Hill.

source: How to Protect the <a href="/philosophy/protecting.html">Right to Write Software</a> (independent of whether it's free or not)
fr: Comment prot&eacute;ger le <a href="/philosophy/protecting.fr.html">droit d'&eacute;crire des logiciels</a> (ind&eacute;pendamment du fait qu'ils soient libres ou non)

source: In <a href="http://www.eff.org/IP/DMCA/Felten_v_RIAA/20010606_eff_felten_pr.html"> Felten v. RIAA</a>, scientists are asking a court to rule that the Digital Millennium Copyright Act (DMCA) does not prohibit them from publishing their research.
fr: Dans <a href="http://www.eff.org/IP/DMCA/Felten_v_RIAA/20010606_eff_felten_pr.html">Felten v. RIAA</a>, des scientifiques demandent &agrave; une cour de juger que le Digital Millennium Copyright Act (DMCA) ne les emp&ecirc;che pas de publier leur recherche.

source: <a href="http://www.eff.org/IP/Video/MPAA_DVD_cases/">EFF &ldquo;Intellectual Property: MPAA (Motion Picture Association of America) DVD Cases&rdquo; Archive</a>
fr: <a href="http://www.eff.org/IP/Video/MPAA_DVD_cases/">L'archive de l'EFF &laquo;&nbsp;Intellectual Property : MPAA (Motion Picture Association of America) DVD Cases&nbsp;&raquo;</a>

source: <a href="/philosophy/patent-reform-is-not-enough.html">Patent Reform Is Not Enough</a>
fr: <a href="/philosophy/patent-reform-is-not-enough.fr.html">Une r&eacute;forme des brevets n'est pas suffisante</a>

source: <a href="/philosophy/savingeurope.html">Saving Europe from Software Patents</a>
fr: <a href="/philosophy/savingeurope.fr.html">Sauver l'Europe des brevets logiciels</a>

source: <a href="/philosophy/amazon.html">Boycott Amazon!</a>
fr: <a href="/philosophy/amazon.fr.html">Boycottez Amazon&nbsp;!</a>

source: <a href="http://www.researchoninnovation.org/patent.pdf" id="SequentialIPandI">Sequential Innovation, Patents, and Imitation</a> is a paper that presents a mathematical model showing how patents can impede progress in fields like software.
fr: <a href="http://www.researchoninnovation.org/patent.pdf" id="SequentialIPandI">Innovation s&eacute;quentielle, brevets, et imitation</a> est un article qui pr&eacute;sente un mod&egrave;le math&eacute;matique montrant comment les brevets peuvent freiner le progr&egrave;s dans des domaines comme celui du logiciel.

source: <a href="/philosophy/hague.html">Harm from the Hague</a>.
fr: <a href="/philosophy/hague.fr.html">Le danger de La Haye</a>

source: <a href="http://technology.guardian.co.uk/online/comment/story/0,12449,1540984,00.html"> Soft sell</a>. An article by Richard M. Stallman published in <a href="http://www.guardian.co.uk">The Guardian</a>.
fr: <a href="http://technology.guardian.co.uk/online/comment/story/0,12449,1540984,00.html">Soft sell</a>. Un article de Richard M. Stallman publi&eacute; dans <a href="http://www.guardian.co.uk">The Guardian</a>.

source: <a href="http://www.guardian.co.uk/technology/2005/jun/23/onlinesupplement.insideit"> Patent absurdity</a>, an article by Richard M. Stallman published in <a href="http://www.guardian.co.uk">The Guardian</a>.
fr: <a href="http://www.guardian.co.uk/technology/2005/jun/23/onlinesupplement.insideit">L'absurdité des brevets</a>, un article de Richard M. Stallman publié dans <a href="http://www.guardian.co.uk">The Guardian</a>.

source: <a href="/philosophy/trivial-patent.html">The Anatomy of a Trivial Patent</a>, by Richard M. Stallman.
fr: <a href="/philosophy/trivial-patent.fr.html">L'anatomie d'un brevet trivial</a>, par Richard M. Stallman.

source: <a href="/philosophy/gif.html">Why there are no GIF files on GNU web pages</a>, While this story is a historical illustration of the danger of software patents, these particular patents are now no longer a concern. For details of our website <a href="/server/fsf-html-style-sheet.html#UseofGraphics">policies regarding GIFs</a>, see our web <a href="/server/standards/">web guidelines</a>.
fr: <a href="/philosophy/gif.fr.html">Pourquoi il n'y a pas de fichiers GIF sur les pages Web de GNU</a>. Cette histoire est une illustration historique du danger des brevets logiciels&nbsp;; ces brevets particuliers ne sont plus un prob&egrave;me maintenant (voir la <a href="#venuenote">note de bas de page</a> ci-dessous. Pour des d&eacute;tails sur la <a href="/server/fsf-html-style-sheet.html#UseofGraphics">politique concernant les fichiers GIF</a> sur notre site Web, veuillez consulter le <a href="/server/standards/">guide de conduite Web</a>.

source: Cultural and Social Issues
fr: Problèmes culturels et sociaux

source: <a href="/philosophy/wsis.html">World Summit on the Information Society</a>
fr: <a href="/philosophy/wsis.fr.html">Sommet mondial sur la soci&eacute;t&eacute; de l'information</a>

source: <a href="/philosophy/lessig-fsfs-intro.html">The introduction by Lawrence Lessig</a> to <a href="http://shop.fsf.org/product/free-software-free-society/"><i>Free Software, Free Society: The Selected Essays of Richard M. Stallman</i></a> is available for reading.
fr: <a href="/philosophy/lessig-fsfs-intro.fr.html">L'introduction par Lawrence Lessig</a> &agrave; <a href="http://shop.fsf.org/product/free-software-free-society/"><i>Free Software, Free Society: The Selected Essays of Richard M. Stallman</i></a> est disponible &agrave; la lecture.

source: <a href="/philosophy/wassenaar.html">Encryption software volunteers needed in countries without export control</a>.
fr: <a href="/philosophy/wassenaar.fr.html">On recherche des b&eacute;n&eacute;voles de la cryptographie logicielle dans des pays sans contr&ocirc;le des exportations</a>.

source: How to Protect the <a href="/philosophy/basic-freedoms.html"> Freedoms of Speech, Press, and Association</a> on the Internet
fr: Comment prot&eacute;ger les <a href="/philosophy/basic-freedoms.fr.html">libert&eacute;s d'expression, de la presse et d'association</a> sur Interne

source: <a href="/philosophy/privacyaction.html">Protect Postal Privacy</a>, a campaign to resist the proposed rule by the United States Postal Service to collect private information from customers.
fr: <a href="/philosophy/privacyaction.fr.html">Prot&eacute;ger l'anonymat postal</a>, une campagne pour r&eacute;sister &agrave; une proposition de r&egrave;glement du Service postal des &Eacute;tats-Unis pour collecter des informations sur ses clients.

source: <a href="/philosophy/ucita.html">Why We Must Fight UCITA</a>
fr: <a href="/philosophy/ucita.fr.html">Pourquoi nous devons contrer UCITA</a>

source: <a href="http://www.infoworld.com/articles/op/xml/00/11/27/001127opfoster.xml"> A world with UCITA may allow fine print to outweigh the right thing</a> by Ed Foster <a href="mailto:gripe@infoworld.com"> &lt;gripe@infoworld.com&gt;</a>
fr: <a href="http://www.infoworld.com/articles/op/xml/00/11/27/001127opfoster.xml">A world with UCITA may allow fine print to outweigh the right thing</a> par Ed Foster <a href="mailto:gripe&#64;infoworld.com">&lt;gripe&#64;infoworld.com&gt;</a>

source: <a href="/philosophy/second-sight.html">Free Software and (e-)Government</a> &mdash; an article from The Guardian, by Richard Stallman (originally published under the title &ldquo;Second Sight&rdquo;).
fr: <a href="/philosophy/second-sight.fr.html">Logiciels libres et (e-)gouvernement</a>. Un article du journal The Guardian, par Richard M. Stallman (initialement publié sous le titre «&nbsp;Clairvoyance&nbsp;»)

source: <a href="http://www.insnet.org/ins_headlines.rxml?cust=212&amp;id=967"> Free Software and Sustainable Development</a> &mdash; A short article by Richard Stallman regarding the use of proprietary software in cultural development.
fr: <a href="http://www.insnet.org/ins_headlines.rxml?cust=212&amp;id=967">Free Software and Sustainable Development</a> - Un court article par Richard Stallman concernant l'utilisation de logiciels propri&eacute;taires dans le d&eacute;veloppement culturel.

source: Misc
fr: Divers

source: <a href="/philosophy/sun-in-night-time.html">The Curious Incident of Sun in the Night-Time</a>, by Richard M. Stallman.
fr: <a href="/philosophy/sun-in-night-time.fr.html">Le curieux non-&eacute;v&eacute;nement de Sun dans la p&eacute;nombre</a> par Richard M. Stallman.

source: <a href="http://counterpunch.org/baker08192004.html">Why We Need &ldquo;Free Software&rdquo; Voting Machines</a>
fr: <a href="http://counterpunch.org/baker08192004.html">Pourquoi avons-nous besoin de machines &agrave; voter &agrave; base de logiciel libre</a>

source: <a href="/philosophy/sco/sco-gnu-linux.html">SCO, GNU, and Linux</a>, by Richard Stallman, discusses how SCO's lawsuit against IBM pertains to the work of the GNU project. Please see the <a href="/philosophy/sco/sco.html">FSF SCO Response Page</a> for more details on this subject.
fr: <a href="/philosophy/sco/sco-gnu-linux.fr.html">SCO, GNU et Linux</a>, par Richard Stallman, parle de la fa&ccedil;on dont les poursuites judiciaires de SCO contre IBM, sont relatives au travail du projet GNU. Veuillez consulter la <a href="/philosophy/sco/sco.fr.html">page de la r&eacute;ponse de la FSF &agrave; SCO</a>pour plus de d&eacute;tails sur ce sujet.

source: <a href="/philosophy/ms-doj-tunney.html">FSF's Statement in Response to Proposed Revised Final Judgment in Microsoft vs. United States, submitted to the US Department of Justice under the Tunney Act</a>.
fr: <a href="/philosophy/ms-doj-tunney.fr.html">La d&eacute;claration de la FSF en r&eacute;ponse au jugement final r&eacute;vis&eacute; propos&eacute; dans Microsoft contre &Eacute;tats-Unis, soumise au Minist&egrave;re de la justice am&eacute;ricain dans le cadre du Tunney Act</a>.

source: <a href="/philosophy/new-monopoly.html">U.S. Congress Threatens to Establish a New Kind of Monopoly</a>, an attempt of the Congress to create a private monopoly over repeating publicly known information.
fr: <a href="/philosophy/new-monopoly.fr.html">Le Cong&egrave;s am&eacute;ricain menace d'établir une nouvelle sorte de monopole</a>, une tentative du congr&egrave;s pour cr&eacute;er un monopole priv&eacute; sur des informations publiques connues.

source: <a href="/philosophy/dat.html">The Right Way to Tax DAT</a>
fr: <a href="/philosophy/dat.fr.html">La bonne fa&ccedil;on de taxer les DAT</a>

source: <a href="/philosophy/censoring-emacs.html">Censoring My Software</a>, by <a href="http://www.stallman.org">Richard Stallman</a>
fr: <a href="/philosophy/censoring-emacs.fr.html">Censurer mon logiciel</a>, par <a href="http://www.stallman.org">Richard Stallman</a>

source: <a href="/philosophy/motivation.html">Studies Find Reward Often No Motivator</a>
fr: <a href="/philosophy/motivation.fr.html">Des &eacute;tudes montrent que la r&eacute;mun&eacute;ration n'est souvent pas une motivation</a>

source: Terminology and Definitions
fr: Terminologie et d&eacute;finitions

source: <a href="/philosophy/words-to-avoid.html">Confusing Words</a> which You Might Want to Avoid
fr: <a href="/philosophy/words-to-avoid.fr.html">Termes pr&ecirc;tant &agrave; confusion</a> qu'il vaut mieux &eacute;viter

source: <a href="/philosophy/free-software-for-freedom.html">&ldquo;Open Source Software&rdquo; or &ldquo;Free Software&rdquo;?</a> (This is an older essay about the same topic as the previous one.)
fr: <a href="/philosophy/free-software-for-freedom.fr.html">&laquo;&nbsp;Logiciel open source&nbsp;&raquo; ou &laquo;&nbsp;Logiciel libre&nbsp;&raquo;</a>&nbsp;? (C'est un essai plus ancien sur le m&ecirc;me sujet que l'essai pr&eacute;c&eacute;dent).

source: Richard Stallman wrote <a href="/philosophy/drdobbs-letter.html">letter to the editor</a> of Dr. Dobb's Journal in June which further explains the distinction between the Free Software and Open Source movements.
fr: Richard Stallman a &eacute;crit <a href="/philosophy/drdobbs-letter.fr.html">lettre &agrave; l'&eacute;diteur</a> du Dr. Dobb's Journal de juin qui explique encore plus la diff&eacute;rence entre les mouvements du Logiciel Libre et Open Source.

source: <a href="/philosophy/fs-translations.html">Translations of the term &ldquo;free software&rdquo;</a> into various languages
fr: <a href="/philosophy/fs-translations.fr.html">Traductions du terme &laquo;&nbsp;logiciel libre&nbsp;&raquo;</a> en diverses langues

source: Upholding Software Freedom
fr: Maintenir la libert&eacute; des logiciels

source: <a href="/philosophy/use-free-software.html">The Free Software Community After 20 Years</a>, With great but incomplete success, what now?
fr: <a href="/philosophy/use-free-software.fr.html">La communaut&eacute; du logiciel libre apr&egrave;s 20 ans</a>, avec un grand succ&egrave;s mais incomplet, et maintenant&nbsp;?

source: <a href="/philosophy/mcvoy.html">Thank You, Larry McVoy</a> by Richard M. Stallman
fr: <a href="/philosophy/mcvoy.fr.html">Merci Larry McVoy</a> par Richard M. Stallman

source: <a href="/philosophy/social-inertia.html">Overcoming Social Inertia</a>, by Richard M. Stallman
fr: <a href="/philosophy/social-inertia.fr.html">Vaincre l'inertie sociale</a>, par Richard M. Stallman

source: <a href="/philosophy/compromise.html">Avoiding Ruinous Compromises</a>
fr: <a href="/philosophy/compromise.html">Éviter les compromis ruineux</a>

source: Philosophical humor
fr: Humour philosophique

source: <a href="/fun/humor.html#Philosophy">Philosophy Humor</a>. We don't have to be serious <i>all</i> the time.
fr: <a href="/fun/humor.html#Philosophy">Humour philosophique</a>. Nous n'avons pas &agrave; &ecirc;tre s&eacute;rieux <i>tout</i> le temps.

source: <a href="speeches-and-interview.html">Speeches and interviews</a>
fr: <a href="speeches-and-interview.fr.html">Discours et entretiens</a>

source: <a href="third-party-ideas.html">Third party ideas</a>
fr: <a href="third-party-ideas.fr.html">Id&eacute;es de tierces personnes</a>

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Odile Bénassy.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
