Repository: gitGNU/gnu_www-fr
Catalog: philosophy/essays-and-articles.*.po
Languages: fr

source: This page lists a series of articles describing the philosophy of the free software movement, which is the motivation for our development of the free software operating system GNU.
fr: Cette page recense une série d'articles décrivant la philosophie du mouvement pour le logiciel libre, qui est la motivation de notre développement du système d'exploitation libre GNU.

source: <a id="TOCFreedomOrganizations">We</a> <a id="FreedomOrganizations">also</a> keep a list of <a href="/links/links.html#FreedomOrganizations">Organizations that Work for Freedom in Computer Development and Electronic Communications</a>.
fr: <a id="TOCFreedomOrganizations">Nous</a> <a id="FreedomOrganizations">conservons</a> aussi une liste d'<a href="/links/links.fr.html#FreedomOrganizations">organisations qui oeuvrent pour la libert&eacute; dans le d&eacute;veloppement informatique et les communications &eacute;lectroniques</a>.

source: About Free Software
fr: &Agrave; propos du logiciel libre

source: Free software is a matter of freedom: people should be free to use software in all the ways that are socially useful. Software differs from material objects&mdash;such as chairs, sandwiches, and gasoline&mdash;in that it can be copied and changed much more easily. These possibilities make software as useful as it is; we believe software users should be able to make use of them.
fr: Le logiciel libre est une question de libert&eacute;&nbsp;: tout le monde devrait pouvoir &ecirc;tre libre d'utiliser des logiciels de toutes les fa&ccedil;ons qui sont utiles socialement. Le logiciel diff&egrave;re des objets mat&eacute;riels (tels que des chaises, des sandwiches et de l'essence) en ce qu'il peut &ecirc;tre copi&eacute; et modifi&eacute; beaucoup plus facilement. Ces possibilit&eacute;s rendent le logiciel aussi utile qu'il peut l'&ecirc;tre; nous croyons que les utilisateurs de logiciels devraient pouvoir les utiliser.

source: <a href="/philosophy/free-sw.html">What is Free Software?</a>
fr: <a href="/philosophy/free-sw.fr.html">Qu'est-ce qu'un logiciel libre&nbsp;?</a>

source: <a href="/philosophy/why-free.html">Why Software Should Not Have Owners</a>
fr: <a href="/philosophy/why-free.fr.html">Pourquoi les logiciels ne devraient pas avoir de propri&eacute;taires</a>

source: <a href="/philosophy/shouldbefree.html">Why Software Should Be Free</a> (This is an older and longer essay about the same topic as the previous one)
fr: <a href="/philosophy/shouldbefree.fr.html">Pourquoi le logiciel devrait &ecirc;tre libre</a>. (C'est un essai plus ancien et plus long sur le m&ecirc;me sujet que le pr&eacute;c&eacute;dent).

source: <a href="/philosophy/free-doc.html">Why Free Software Needs Free Documentation</a>
fr: <a href="/philosophy/free-doc.fr.html">Pourquoi les logiciels libres ont besoin de manuels libres</a>

source: <a href="/philosophy/selling.html">Selling Free Software</a> is OK!
fr: <a href="/philosophy/selling.fr.html">Vendre des logiciels libres</a> ce n'est pas un problème&nbsp;!

source: <a href="/philosophy/categories.html">Categories of Free and Non-Free Software</a>
fr: <a href="/philosophy/categories.fr.html">Cat&eacute;gories de logiciels libres et non libres</a>

source: <a href="/software/reliability.html">Free Software is More Reliable!</a>
fr: <a href="/software/reliability.fr.html">Le logiciel libre est plus fiable</a>&nbsp;!

source: <a href="/philosophy/open-source-misses-the-point.html">Why &ldquo;Open Source&rdquo; misses the point of Free Software</a>
fr: <a href="/philosophy/open-source-misses-the-point.fr.html">Pourquoi l'&laquo;&nbsp;open source&nbsp;&raquo; passe &agrave; c&ocirc;t&eacute; du probl&egrave;me que soul&egrave;ve le logiciel libre&nbsp;?</a>

source: <a href="/philosophy/linux-gnu-freedom.html">Linux, GNU, and Freedom</a>
fr: <a href="/philosophy/linux-gnu-freedom.fr.html">Linux, GNU et la liberté</a>

source: <a href="/philosophy/gnutella.html" id="Gnutella">Regarding Gnutella</a>
fr: <a href="/philosophy/gnutella.fr.html" id="Gnutella">&Agrave; propos de Gnutella</a>

source: <a href="/philosophy/schools.html">Why Schools Should Use Exclusively Free Software</a>
fr: <a href="/philosophy/schools.fr.html">Pourquoi les &eacute;coles ne devraient utiliser exclusivement que des logiciels libres</a>

source: <a href="/philosophy/my_doom.html">MyDoom and You</a>
fr: <a href="/philosophy/my_doom.fr.html">MyDoom et vous</a>

source: <a href="/philosophy/15-years-of-free-software.html">15 Years of Free Software</a>
fr: <a href="/philosophy/15-years-of-free-software.fr.html">15 ans de logiciels libres</a>

source: <a href="/philosophy/free-software-intro.html">Free Software movement</a>
fr: <a href="/philosophy/free-software-intro.fr.html">Le mouvement du logiciel libre</a>

source: <a href="/philosophy/your-freedom-needs-free-software.html">Your Freedom Needs Free Software</a>
fr: <a href="/philosophy/your-freedom-needs-free-software.fr.html">Votre libert&eacute; a besoin de logiciels libres</a>

source: <a href="/philosophy/fs-motives.html">Motives For Writing Free Software</a>
fr: <a href="/philosophy/fs-motives.fr.html">Raisons d'écrire des logiciels libres</a>

source: About the GNU Operating System
fr: À propos du système d'exploitation GNU

source: <a href="/gnu/initial-announcement.html">Initial announcement of the GNU Operating System</a>
fr: <a href="/gnu/initial-announcement.fr.html">Annonce initiale du projet GNU</a>

source: <a href="/gnu/manifesto.html">The GNU Manifesto</a>
fr: <a href="/gnu/manifesto.fr.html">Le Manifeste GNU</a>

source: <a href="/gnu/gnu-history.html">Brief history of the GNU Project</a>
fr: <a href="/gnu/gnu-history.fr.html">Br&egrave;ve histoire du projet GNU</a>

source: <a href="/gnu/thegnuproject.html">The GNU Project</a>, a longer and more complete description of the project and its history.
fr: <a href="/gnu/thegnuproject.fr.html">Le projet GNU</a>, une description plus longue et plus compl&egrave;te du projet et de son histoire.

source: <a href="/fsf/fsf.html">What is the Free Software Foundation?</a>
fr: <a href="/fsf/fsf.fr.html">Qu'est-ce que la Free Software Foundation (Fondation pour le logiciel libre)&nbsp;?</a>

source: <a href="/gnu/why-gnu-linux.html">Why GNU/Linux?</a>
fr: <a href="/gnu/why-gnu-linux.fr.html">Pourquoi GNU/Linux&nbsp;?</a>

source: Licensing Free Software
fr: Licences de Logiciels Libres

source: <a href="/licenses/licenses.html">General information on licensing and copyleft</a>
fr: <a href="/licenses/licenses.fr.html">Informations g&eacute;n&eacute;rales sur les licences et le copyleft</a>

source: <a href="/licenses/license-list.html">A list of specific free software licenses</a>
fr: <a href="/licenses/license-list.fr.html">Une liste de licences de logiciels libres sp&eacute;cifiques</a>

source: <a href="/licenses/gpl-faq.html">Frequently Asked Questions About the GNU Licenses</a>
fr: <a href="/licenses/gpl-faq.fr.html">Foire aux questions sur les licences GNU</a>

source: <a href="/licenses/why-not-lgpl.html">Why You Shouldn't Use the Lesser GPL for Your Next Library</a>
fr: <a href="/licenses/why-not-lgpl.fr.html">Pourquoi vous ne devriez pas utiliser la Lesser GPL pour votre prochaine biblioth&egrave;que</a>

source: <a href="/copyleft/copyleft.html">Copyleft</a>
fr: <a href="/copyleft/copyleft.fr.html">Copyleft</a>

source: <a href="/philosophy/why-copyleft.html">Why Copyleft?</a>
fr: <a href="/philosophy/why-copyleft.fr.html">Pourquoi le copyleft&nbsp;?</a>

source: <a href="/philosophy/university.html">Releasing Free Software if You Work at a University</a>
fr: <a href="/philosophy/university.fr.html">&Eacute;crire des logiciels libres si vous travaillez &agrave; l'universit&eacute;</a>

source: <a href="/philosophy/pragmatic.html">Copyleft: Pragmatic Idealism</a>
fr: <a href="/philosophy/pragmatic.fr.html">Copyleft&nbsp;: Id&eacute;alisme pragmatique</a>

source: <a href="/philosophy/javascript-trap.html">Javascript Trap</a> &mdash; You may be running non-free programs on your computer every day without realizing it &mdash; through your web browser.
fr: <a href="/philosophy/javascript-trap.html">Le piège JavaScript</a> &mdash; Il se peut que vous exécutiez des programmes non-libres sur votre ordinateur toute la journée sans le savoir &mdash;&nbsp;par l'intermédiaire de votre navigateur Web.

source: <a href="/philosophy/vaccination.html">Viral Code and Vaccination</a>, an article by Robert J. Chassell
fr: <a href="/philosophy/vaccination.html">Code viral et vaccination</a>, un article de Robert J. Chassell

source: <a href="http://www.fsf.org/blogs/licensing/20050211.html">Censorship envy and licensing</a>
fr: <a href="http://www.fsf.org/blogs/licensing/20050211.html">Censorship envy and licensing</a> (Tentation de censure et licence)

source: <a href="/philosophy/x.html">The X Window System Trap</a>
fr: <a href="/philosophy/x.fr.html">Le pi&egrave;ge X Window System</a>

source: <a href="/philosophy/apsl.html">The Problems of the Apple License</a>
fr: <a href="/philosophy/apsl.fr.html">Les probl&egrave;mes avec la licence Apple</a>

source: <a href="/philosophy/bsd.html">The BSD License Problem</a>
fr: <a href="/philosophy/bsd.fr.html">Le probl&egrave;me de la licence BSD</a>

source: <a href="/philosophy/netscape-npl.html">The Netscape Public License Has Serious Problems</a>
fr: <a href="/philosophy/netscape-npl.fr.html">La Netscape Public License a de s&eacute;rieux probl&egrave;mes</a>

source: <a href="/philosophy/udi.html">The Free Software Movement and UDI</a>
fr: <a href="/philosophy/udi.fr.html">La communaut&eacute; du logiciel libre et UDI</a>

source: <a href="/philosophy/gates.html">It's not the Gates, it's the bars</a>, an article by Richard Stallman published in BBC News in 2008
fr: <a href="/philosophy/gates.fr.html">Ce ne sont pas des barri&egrave;res mais une prison</a>, un article de Richard Stallman publi&eacute; dans BBC News en 2008

source: <a href="/philosophy/microsoft-antitrust.html">The Microsoft Antitrust Trial and Free Software</a>
fr: <a href="/philosophy/microsoft-antitrust.fr.html">Le proc&egrave;s antitrust de Microsoft et le logiciel libre</a>

source: <a href="/philosophy/microsoft-verdict.html">On the Microsoft Verdict</a>
fr: <a href="/philosophy/microsoft-verdict.fr.html">&Agrave; propos du verdict Microsoft</a>

source: <a href="/philosophy/microsoft-new-monopoly.html">Microsoft's New Monopoly</a>
fr: <a href="/philosophy/microsoft-new-monopoly.fr.html">Le nouveau monopole de Microsoft</a>

source: <a href="/philosophy/plan-nine.html" id="PlanNineLicense">The Problems of the Plan 9 License</a>
fr: <a href="/philosophy/plan-nine.fr.html" id="PlanNineLicense">Les probl&egrave;mes de la licence de Plan 9</a>

source: <a href="/philosophy/motif.html" id="MotifLicense">The New Motif License</a>
fr: <a href="/philosophy/motif.fr.html" id="MotifLicense">La nouvelle licence Motif</a>

source: <a href="/philosophy/using-gfdl.html" id="UsingGFDL">Using the GNU FDL</a>
fr: <a href="/philosophy/using-gfdl.fr.html" id="UsingGFDL">Utiliser la FDL GNU</a>

source: <a href="/philosophy/gpl-american-way.html" id="GPLAmericanWay">The GNU GPL and the American Way</a>
fr: <a href="/philosophy/gpl-american-way.fr.html" id="GPLAmericanWay">La GNU GPL et l'American Way</a>

source: <a href="/philosophy/gpl-american-dream.html" id="GPLAmericanDream">The GNU GPL and the American Dream</a>
fr: <a href="/philosophy/gpl-american-dream.fr.html" id="GPLAmericanDream">La GNU GPL et le R&ecirc;ve am&eacute;ricain</a>

source: <a href="/philosophy/enforcing-gpl.html" id="EnforcingGPL">Enforcing the GNU GPL</a>
fr: <a href="/philosophy/enforcing-gpl.fr.html" id="EnforcingGPL">Faire respecter la GPL GNU</a>

source: <a href="/philosophy/freedom-or-power.html" id="FreedomOrPower">Freedom or Power?</a>
fr: <a href="/philosophy/freedom-or-power.fr.html" id="FreedomOrPower">Libert&eacute; ou pouvoir&nbsp;?</a>

source: <a href="/philosophy/no-word-attachments.html" id="NoWordAttachments">We Can Put an End to Word Attachments</a>
fr: <a href="/philosophy/no-word-attachments.fr.html" id="NoWordAttachments">Nous pouvons mettre un terme aux pi&egrave;ces jointes Word</a>

source: <a href="/philosophy/java-trap.html" id="JavaTrap">Free But Shackled - The Java Trap</a> (Although as of December 2006 Sun is in the middle of <a href="http://www.fsf.org/news/fsf-welcomes-gpl-java.html">re-releasing its Java platform under GNU GPL</a>, the issue described in this article still remains important)
fr: <a href="/philosophy/java-trap.fr.html" id="JavaTrap">Libre mais entrav&eacute; - Le pi&egrave;ge Java</a> (Bien qu'en D&eacute;cembre 2006, Sun est en train de <a href="http://www.fsf.org/news/fsf-welcomes-gpl-java.html">republier sa plateforme Java sous la licence GPL GNU</a>, le probl&egrave;me d&eacute;crit dans cet article demeure important)

source: <a href="/philosophy/fighting-software-patents.html" id="FightingSoftwarePatents">Fighting Software Patents - Singly and Together</a>
fr: <a href="/philosophy/fighting-software-patents.fr.html" id="FightingSoftwarePatents">Combattre les brevets logiciels - S&eacute;par&eacute;ment ou Ensemble</a>

source: <a href="/philosophy/software-literary-patents.html" id="SoftwareLiteraryPatents"> Software Patents and Literary Patents</a>, by Richard M. Stallman, speaking of patenting artistic techniques, US patent (6,935,954) covers making game characters start to hallucinate when (according to the game) they are being driven insane. That is getting pretty close to the hypothetical examples cited in this article.
fr: <a href="/philosophy/software-literary-patents.fr.html" id="SoftwareLiteraryPatents">Les brevets logiciels et les brevets litt&eacute;raires</a> par Richard M. Stallman, qui parle du brevetage des techniques artistiques, le brevet am&eacute;ricain (6&nbsp;935&nbsp;954) qui couvre la conception de personnages de jeu qui commencent &agrave; halluciner quand (d'apr&egrave;s le jeu) ils sont rendus fous. Ce qui est tr&egrave;s proche des exemples hypoth&eacute;tiques donn&eacute;s dans cet article.

source: <a href="/philosophy/rtlinux-patent.html">GPL-compliant version of RTLinux Open Patent License in Works</a>
fr: <a href="/philosophy/rtlinux-patent.fr.html">La version compatible GPL de la &laquo;&nbsp;Open Patent RTLinux License&nbsp;&raquo; effective</a>

source: Laws and Issues
fr: L&eacute;gislation

source: <a href="/philosophy/pirate-party.html">How the Swedish Pirate Party Platform Backfires on Free Software</a>
fr: <a href="/philosophy/pirate-party.fr.html">Pourquoi les propositions du Parti Pirate suédois se retournent contre le logiciel libre</a>

source: <a href="/philosophy/misinterpreting-copyright.html">Misinterpreting Copyright</a> is another essay by <a href="http://www.stallman.org">Richard Stallman</a> about the flaws in popular defenses of copyright law.
fr: <a href="/philosophy/misinterpreting-copyright.fr.html">Mauvaise interpr&eacute;tation du droit d'auteur</a> est un autre essai de <a href="http://www.stallman.org">RichardStallman</a> sur les d&eacute;fauts dans les d&eacute;fenses populaires de la loi sur le droit d'auteur.

source: <a href="/philosophy/eldred-amicus.html">FSF's Brief Amicus Curiae in the Eldred v. Ashcroft Supreme Court case</a>
fr: <a href="/philosophy/eldred-amicus.fr.html">Le Brief Amicus Curiae de la FSF dans l'affaire Eldred v. Ashcroft de la Cour Supr&ecirc;me des &Eacute;tats-Unis d'Am&eacute;rique</a>

source: <a href="/philosophy/push-copyright-aside.html">Science must &ldquo;push copyright aside&rdquo;</a>, another work of <a href="http://www.stallman.org">Richard Stallman</a> that appeared in the <a href="http://www.nature.com/nature/debates/e-access/Articles/stallman.html"> Nature Webdebates</a> in 2001, explains how copyright is impeding progress in scientific research. You may also be interested in <a href="http://www.publiclibraryofscience.org">The Public Library of Science</a>, which is dedicated to making scientific research freely available to all on the Internet.
fr: <a href="/philosophy/push-copyright-aside.fr.html">La science doit &laquo;&nbsp;mettre de c&ocirc;t&eacute; les droits d'auteur&nbsp;&raquo;</a>, un autre papier de <a href="http://www.stallman.org">Richard Stallman</a> paru dans <a href="http://www.nature.com/nature/debates/e-access/Articles/stallman.html">Les d&eacute;bats Web de Nature</a> (Nature Webdebates) en 2001, qui explique comment le copyright freine le progr&egrave;s dans la recherche scientifique. Vous pourriez aussi être intéressé par <a href="http://www.publiclibraryofscience.org">La bibliothèque publique de la science</a>, qui est dédiée à la mise à disposition libre des recherches scientifiques pour tous sur Internet.

source: <a href="/philosophy/reevaluating-copyright.html">Reevaluating Copyright: The Public must prevail</a>
fr: <a href="/philosophy/reevaluating-copyright.fr.html">R&eacute;&eacute;valuer le copyright&nbsp;: le public doit avoir le dernier mot</a>

source: <a href="http://cyber.law.harvard.edu/openlaw/eldredvashcroft/cyber/complaint_orig.html"> Eldred v. Reno</a> is about a lawsuit to overturn a law that extends copyright by 20 extra years.
fr: <a href="http://cyber.law.harvard.edu/openlaw/eldredvashcroft/cyber/complaint_orig.html">Eldred contre Reno</a> au sujet d'un proc&egrave;s visant &agrave; annuler une loi qui &eacute;tend le copyright de 20 ans de plus.

source: <a href="/philosophy/freedom-or-copyright.html">Freedom-Or Copyright?</a>, by <a href="http://www.stallman.org/">Richard Stallman</a> (an <a href="/philosophy/freedom-or-copyright-old.html">older version</a> of this essay remains online as well).
fr: <a href="/philosophy/freedom-or-copyright.fr.html">Libert&eacute; ou copyright&nbsp;?</a> par <a href="http://www.stallman.org/">Richard Stallman</a> (une <a href="/philosophy/freedom-or-copyright-old.fr.html">version plus ancienne</a> de cet essai est également disponible).

source: <a href="/philosophy/copyright-versus-community.html" id="StallmanTalkLSM"> Copyright versus community in the age of computer networks</a>: is a verbatim transcript of a talk by <a href="http://www.stallman.org"> Richard Stallman</a> at the Logiciel Libre Conference in July 2000.
fr: <a href="copyright-versus-community.fr.html" id="StallmanTalkLSM">Copyright contre communaut&eacute; &agrave; l'&acirc;ge des r&eacute;seaux informatiques</a>&nbsp;: est une transcription litt&eacute;rale d'un discours de <a href="http://www.stallman.org">Richard Stallman</a> &agrave; la Conf&eacute;rence sur le logiciel libre de juillet 2000.

source: <a href="http://www.oii.ox.ac.uk/resources/feedback/OIIFB_GPL2_20040903.pdf"> An English translation</a> of the famous decision of the District Court of Munich (Germany) regarding the enforceability and validity of the GPL. The translation was done by the Oxford Internet Institute.
fr: <a href="http://www.oii.ox.ac.uk/resources/feedback/OIIFB_GPL2_20040903.pdf">Une traduction en anglais</a> de la fameuse d&eacute;cision du District Court de Munich(Allemagne) concernant l'applicabilit&eacute; et la validit&eacute; de la GPL. La traduction a &eacute;t&eacute; faite par l'Oxford Internet Institute.

source: Digital Restrictions Management
fr: Gestion des restrictions numériques

source: <a href="http://www.bostonreview.net/BR33.2/stallman.php">The root of this problem is software controlled by its developer</a>, by Richard&nbsp;M. Stallman.
fr: <a href="http://www.bostonreview.net/BR33.2/stallman.php">La racine de ce probl&egrave;me est le logiciel contr&ocirc;l&eacute; par son d&eacute;veloppeur</a>, par Richard&nbsp;M. Stallman.

source: <a href="/philosophy/computing-progress.html">Computing &ldquo;progress&rdquo;: good and bad</a>, by Richard M. Stallman.
fr: <a href="/philosophy/computing-progress.fr.html">Le &laquo;&nbsp;Progr&egrave;s&nbsp;&raquo;&nbsp;: du bon et du mauvais</a>, par Richard M. Stallman.

source: <a href="/philosophy/why-audio-format-matters.html">Why Audio Format matters</a> by Karl Fogel
fr: <a href="/philosophy/why-audio-format-matters.fr.html">Pourquoi les formats audio comptent</a> par Karl Fogel

source: <a href="/philosophy/opposing-drm.html">Opposing Digital Rights Mismanagement</a>, by Richard M. Stallman, answers a few common questions about DRM.
fr: <a href="/philosophy/opposing-drm.fr.html">S'opposer &agrave; la m&eacute;gestion des droits num&eacute;riques</a>, par Richard M. Stallman qui r&eacute;pond &agrave; quelques questions communes sur les <abbr title="Digital Rights Management">DRM</abbr>.

source: <a href="/philosophy/ebooks.html">Ebooks: Freedom Or Copyright</a> a slightly modified version of the article, originally published in Technology Review in 2000, by <a href="http://www.stallman.org"> Richard Stallman</a>
fr: <a href="/philosophy/ebooks.fr.html">Livres &eacute;lectroniques : libert&eacute; ou copyright</a> une version l&eacute;g&agrave;rement modifi&eacute;e de l'article, publi&eacute; &agrave; l'origine dans Technology Review en 2000, par <a href="http://www.stallman.org">Richard Stallman</a>

source: <a href="/philosophy/can-you-trust.html">Can you trust your computer?</a>, a work by <a href="http://www.stallman.org">Richard Stallman</a> about the so-called &ldquo;trusted computing&rdquo; initiatives.
fr: <a href="/philosophy/can-you-trust.fr.html">Pouvez-vous faire confiance &agrave; votre ordinateur?</a>, un travail de <a href="http://www.stallman.org">Richard Stallman</a> sur les initiatives de la soi-disant &laquo;&nbsp;informatique de confiance&nbsp;&raquo;.

source: <a href="/philosophy/right-to-read.html">The Right to Read: A Dystopian Short Story</a> by <a href="http://www.stallman.org/"> Richard Stallman</a>
fr: <a href="/philosophy/right-to-read.fr.html">Le droit de lire : une courte histoire dystopienne</a> par <a href="http://www.stallman.org/">Richard Stallman</a>

source: The propaganda term <a href="/philosophy/words-to-avoid.html#IntellectualProperty"> &ldquo;Intellectual Property&rdquo;</a>
fr: Le terme de propagande <a href="/philosophy/words-to-avoid.fr.html#IntellectualProperty">«&nbsp;Propriété intellectuelle&nbsp;»</a>

source: <a href="/philosophy/no-ip-ethos.html">Don't Let &ldquo;Intellectual Property&rdquo; Twist Your Ethos</a>, by Richard&nbsp;M. Stallman.
fr: <a href="/philosophy/no-ip-ethos.fr.html">Ne laissez pas la &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; d&eacute;former votre ethos</a> par Richard M. Stallman.

source: Comments from Richard Stallman on <a href="/philosophy/ipjustice.html">the ICLC's rejection of the IP Enforcement Directive</a>
fr: Commentaires de Richard Stallman sur <a href="/philosophy/ipjustice.fr.html">le rejet de l'ICLC de la Directive de renforcement de la propri&eacute;t&eacute; intellectuelle</a>

source: Richard Stallman has written <a href="/philosophy/boldrin-levine.html">a review of Boldrin and Levine's &ldquo;The case against intellectual property.&rdquo;</a>
fr: Richard Stallman a &eacute;crit <a href="/philosophy/boldrin-levine.fr.html">une critique sur &laquo;&nbsp;L'affaire contre la propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; de Boldrin et Levine.</a>

source: <a href="/philosophy/not-ipr.html">Did You Say &ldquo;Intellectual Property&rdquo;? It's a Seductive Mirage</a>. An essay on the true meaning of the phrase &ldquo;Intellectual Property&rdquo;, by Richard M. Stallman
fr: <a href="/philosophy/not-ipr.fr.html">Vous avez dit &laquo;&nbsp;Propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;&nbsp;? C'est un s&eacute;duisant mirage</a>. Un essai sur la vraie signification du terme &laquo;&nbsp;Propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;, par Richard M. Stallman

source: Patents
fr: Brevets
