Repository: gitGNU/gnu_www-fr
Catalog: philosophy/freedom-*-power.*.po
Languages: fr

source: Freedom Or Power? - GNU Project - Free Software Foundation (FSF)
fr: Libert&eacute;, ou pouvoir&nbsp;? - GNU Project - Free Software Foundation (FSF)

source: GNU, FSF, Free Software Foundation, Linux, general, public, license, gpl, general public license, freedom, software, power, rights
fr: GNU, FSF, Free Software Foundation, Linux, générale, publique, licence, gpl, licence publique générale, liberté, logiciel, pouvoir, droits

source: Freedom or Power?
fr: Libert&eacute;, ou pouvoir&nbsp;?

source: by <strong>Bradley M. Kuhn</strong> and <strong>Richard M. Stallman</strong>
fr: par <strong>Bradley M. Kuhn</strong> et <strong>Richard M. Stallman</strong>

source: The love of liberty is the love of others; the love of power is the love of ourselves.<br /> -- William Hazlitt
fr: &laquo;&nbsp;L'amour de la libert&eacute; est l'amour des autres&nbsp;; l'amour du pouvoir est l'amour de soi-m&ecirc;me.&nbsp;&raquo;<br /> -- William Hazlitt

source: In the free software movement, we stand for freedom for the users of software. We formulated our views by looking at what freedoms are necessary for a good way of life, and permit useful programs to foster a community of goodwill, cooperation, and collaboration. <a href="/philosophy/free-sw.html">Our criteria for free software</a> specify the freedoms that a program's users need so that they can cooperate in a community.
fr: Dans le Mouvement pour le logiciel libre, nous d&eacute;fendons la libert&eacute; des utilisateurs de logiciels. Nous avons formul&eacute; nos vues en cherchant en quoi les libert&eacute;s sont n&eacute;cessaire pour vivre bien et en quoi elles permettent &agrave; des programmes utiles de d&eacute;velopper une communaut&eacute; de bonne volont&eacute;, de coop&eacute;ration et de collaboration. <a href="/philosophy/free-sw.fr.html">Nos crit&egrave;res pour les logiciels libres</a> sp&eacute;cifient les libert&eacute;s dont les utilisateurs ont besoin pour pouvoir travailler ensemble dans une communaut&eacute;.

source: We stand for freedom for programmers as well as for other users. Most of us are programmers, and we want freedom for ourselves as well as for you. But each of us uses software written by others, and we want freedom when using that software, not just when using our own code. We stand for freedom for all users, whether they program often, occasionally, or not at all.
fr: Nous d&eacute;fendons la libert&eacute; des programmeurs de m&ecirc;me que celle des autres utilisateurs. La plupart d'entre nous sommes programmeurs et souhaitons la libert&eacute; pour nous-m&ecirc;mes autant que pour vous. Mais chacun de nous utilise des logiciels d&eacute;velopp&eacute;s par d'autres et nous voulons &ecirc;tre libres en utilisant ces logiciels et pas seulement en utilisant notre propre code. Nous d&eacute;fendons la libert&eacute; pour tous les utilisateurs, qu'ils programment souvent, occasionnellement, ou pas du tout.

source: However, one so-called freedom that we do not advocate is the &ldquo;freedom to choose any license you want for software you write.&rdquo; We reject this because it is really a form of power, not a freedom.
fr: Pourtant, une soi-disant libert&eacute; que nous ne soutenons pas est la &laquo;&nbsp;libert&eacute; de choisir la licence que vous voulez pour le logiciel que vous d&eacute;veloppez&nbsp;&raquo;. Nous rejetons celle-ci car c'est en r&eacute;alit&eacute; une forme de pouvoir et non une libert&eacute;.

source: This oft overlooked distinction is crucial. Freedom is being able to make decisions that affect mainly you; power is being able to make decisions that affect others more than you. If we confuse power with freedom, we will fail to uphold real freedom.
fr: Cette distinction, souvent &eacute;lud&eacute;e, est cruciale. La libert&eacute;, c'est le fait d'&ecirc;tre en mesure de prendre des d&eacute;cisions qui vous affectent en premier lieu. Le pouvoir, c'est le fait d'&ecirc;tre en mesure de prendre des d&eacute;cisions qui affectent les autres plus que vous. Si vous confondez pouvoir et libert&eacute;, nous &eacute;chouerons dans le soutien de la vraie libert&eacute;.

source: Making a program proprietary is an exercise of power. Copyright law today grants software developers that power, so they and only they choose the rules to impose on everyone else&mdash;a relatively small number of people make the basic software decisions for all users, typically by denying their freedom. When users lack the freedoms that define free software, they can't tell what the software is doing, can't check for back doors, can't monitor possible viruses and worms, can't find out what personal information is being reported (or stop the reports, even if they do find out). If it breaks, they can't fix it; they have to wait for the developer to exercise its power to do so. If it simply isn't quite what they need, they are stuck with it. They can't help each other improve it.
fr: Le logiciel propri&eacute;taire est un exercice de pouvoir. Aujourd'hui, les lois sur les droits d'auteurs accordent ce pouvoir aux auteurs, aussi choisissent-ils tout seul les r&egrave;gles imposables &agrave; tous les autres. Un nombre relativement faible de personnes prennent des d&eacute;cisions fondamentales concernant les logiciels, pour tout le monde, et g&eacute;n&eacute;ralement en niant leurs libert&eacute;s. Quand les utilisateurs sont priv&eacute;s des libert&eacute;s d&eacute;finies par les logiciels libres, ils ne peuvent pas savoir exactement ce que fait le logiciel, ni contr&ocirc;ler l'existence de portes d&eacute;rob&eacute;es, ni surveiller l'apparition possible de virus ou de vers, ni d&eacute;couvrir quelles informations personnelles sont divulgu&eacute;es sur eux, ni emp&ecirc;cher cette divulgation, m&ecirc;me s'ils la d&eacute;couvrent. Si le logiciel casse, ils ne peuvent pas le r&eacute;parer; ils doivent attendre que le d&eacute;veloppeur exerce son pouvoir. Si le logiciel ne correspond pas tout &agrave; fait &agrave; leurs besoins, ils sont tout de m&ecirc;me bloqu&eacute;s avec la version fournie. Ils ne peuvent pas s'entr'aider pour l'am&eacute;liorer.

source: Proprietary software developers are often businesses. We in the free software movement are not opposed to business, but we have seen what happens when a software business has the &ldquo;freedom&rdquo; to impose arbitrary rules on the users of software. Microsoft is an egregious example of how denying users' freedoms can lead to direct harm, but it is not the only example. Even when there is no monopoly, proprietary software harms society. A choice of masters is not freedom.
fr: Les d&eacute;veloppeurs de logiciels propri&eacute;taires sont souvent des entreprises. Dans le Mouvement des logiciels libres, nous ne sommes pas contre les entreprises. Simplement, nous avons vu ce qui se passe quand une entreprise de logiciels a la &laquo;&nbsp;libert&eacute;&nbsp;&raquo; d'imposer des r&egrave;gles arbitraires aux utilisateurs. Microsoft est un exemple flagrant de la mani&egrave;re dont la n&eacute;gation des libert&eacute;s des utilisateurs peut causer directement du tort, mais ce n'est pas le seul. M&ecirc;me quand il n'existe pas de monopole, les logiciels propri&eacute;taires l&egrave;sent les int&eacute;r&ecirc;ts de la soci&eacute;t&eacute;. Avoir le choix de son dictateur, ce n'est pas la libert&eacute;.

source: Discussions of rights and rules for software have often concentrated on the interests of programmers alone. Few people in the world program regularly, and fewer still are owners of proprietary software businesses. But the entire developed world now needs and uses software, so software developers now control the way it lives, does business, communicates, and is entertained. The ethical and political issues are not addressed by the slogan of &ldquo;freedom of choice (for developers only).&rdquo;
fr: Les discussions sur les droits et les r&egrave;gles concernant les logiciels se sont souvent concentr&eacute;es sur les int&eacute;r&ecirc;ts des seuls programmeurs. Peu de personnes dans le monde programment r&eacute;guli&egrave;rement et encore moins nombreuses sont celles qui d&eacute;tiennent des entreprises de logiciels propri&eacute;taires. Mais maintenant, le monde civilis&eacute; a besoin de logiciels et les utilise, aussi les d&eacute;veloppeurs contr&ocirc;lent la mani&egrave;re dont le monde vit, fait des affaires, communique et se distrait. Les probl&egrave;mes &eacute;thiques et politiques ne se traitent pas avec un slogan comme &laquo;&nbsp;la libert&eacute; de choix (pour d&eacute;veloppeurs seulement)&nbsp;&raquo;.

source: We believe you should decide what to do with the software you use; however, that is not what today's law says. Current copyright law places us in the position of power over users of our code, whether we like it or not. The ethical response to this situation is to proclaim freedom for each user, just as the Bill of Rights was supposed to exercise government power by guaranteeing each citizen's freedoms. That is what the <a href="/copyleft/copyleft.html">GNU General Public License</a> is for: it puts you in control of your usage of the software while <a href="/philosophy/why-copyleft.html">protecting you from others</a> who would like to take control of your decisions.
fr: Nous croyons qu'il vous appartient de d&eacute;cider de ce que vous voulez faire du logiciel que vous utilisez&nbsp;; pourtant, ce n'est pas ce que disent les lois d'aujourd'hui. Les lois actuelles sur les droits d'auteurs nous placent dans une position de pouvoir sur les utilisateurs de notre code, que cela nous plaise ou non. La r&eacute;ponse &eacute;thique &agrave; cette situation est de proclamer la libert&eacute; pour chaque utilisateur, de m&ecirc;me que la D&eacute;claration des Droits de l'Homme &eacute;tait charg&eacute;e de d&eacute;finir le pouvoir du gouvernement en garantissant les libert&eacute;s de chaque citoyen. Voil&agrave; le but de la <a href="/copyleft/copyleft.fr.html">GNU GPL</a>&nbsp;: elle vous donne le contr&ocirc;le de l'utilisation du logiciel tout en <a href="/philosophy/why-copyleft.fr.html">vous prot&eacute;geant</a> de ceux qui veulent prendre le contr&ocirc;le de vos d&eacute;cisions.

source: This essay is published in <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>
fr: Cet essai est publié dans <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2001, 2009 Bradley M. Kuhn and Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted without royalty in any medium, provided this notice is preserved.
fr: Copyright &copy; 2001, 2009 Bradley M. Kuhn et Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Benjamin Drieu.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
