Repository: gitGNU/gnu_www-fr
Catalog: philosophy/free-*.*.po
Languages: fr

source: The Free Software Definition - GNU Project - Free Software Foundation (FSF)
fr: Définition d'un logiciel libre - GNU Project - Free Software Foundation (FSF)

source: GNU, FSF, Free Software Foundation, Linux, Emacs, GCC, Unix, Free Software, Operating System, GNU Kernel, HURD, GNU HURD, Hurd
fr: GNU, FSF, Free Software Foundation, Linux, Emacs, GCC, Unix, logiciel libre, système d'exploitation, noyau GNU, HURD, GNU HURD, Hurd

source: Since 1983, developing the free Unix style operating system GNU, so that computer users can have the freedom to share and improve the software they use.
fr: Depuis 1983, nous développons le système d'exploitation libre GNU, de type Unix, pour que les utilisateurs d'ordinateurs puissent avoir la liberté de partager et d'améliorer les logiciels qu'ils utilisent.

source: What's New
fr: Quoi de neuf&nbsp;?

source: New Free Software
fr: Nouveaux logiciels libres

source: The Free Software Definition
fr: Définition d'un logiciel libre

source: We maintain this free software definition to show clearly what must be true about a particular software program for it to be considered free software. From time to time we revise this definition to clarify it. If you would like to review the changes we've made, please see the <a href="#History">History section</a> below for more information.
fr: Nous maintenons cette définition du logiciel libre pour décrire clairement les conditions à remplir pour qu'un logiciel soit considéré comme libre. De temps à autre, nous modifions cette définitions afin de la clarifier. Si vous souhaitez avoir un aperçu des changements que nous y avons apporté, veuillez consulter la <a href="#History">section Histoire</a> ci-dessous pour plus d'informations.

source: &ldquo;Free software&rdquo; is a matter of liberty, not price. To understand the concept, you should think of &ldquo;free&rdquo; as in &ldquo;free speech,&rdquo; not as in &ldquo;free beer.&rdquo;
fr: L'expression «&nbsp;logiciel libre&nbsp;» fait référence à la liberté et non pas au prix. Pour comprendre le concept, vous devez penser à la «&nbsp;liberté d'expression&nbsp;», pas à «&nbsp;l'entrée libre&nbsp;».

source: Free software is a matter of the users' freedom to run, copy, distribute, study, change and improve the software. More precisely, it means that the program's users have the four essential freedoms:
fr: L'expression «&nbsp;logiciel libre&nbsp;» fait référence à la liberté pour les utilisateurs d'exécuter, de copier, de distribuer, d'étudier, de modifier et d'améliorer le logiciel. Plus précisément, cela signifie que les utilisateurs ont les quatre libertés essentielles&nbsp;:

source: The freedom to run the program, for any purpose (freedom 0).
fr: La liberté d'exécuter le programme, pour tous les usages (liberté 0).

source: The freedom to study how the program works, and change it to make it do what you wish (freedom 1). Access to the source code is a precondition for this.
fr: La liberté d'étudier le fonctionnement du programme, et de l'adapter à vos besoins (liberté 1). Pour ceci l'accès au code source est une condition requise.

source: The freedom to redistribute copies so you can help your neighbor (freedom 2).
fr: La liberté de redistribuer des copies, donc d'aider votre voisin, (liberté 2).

source: The freedom to distribute copies of your modified versions to others (freedom 3). By doing this you can give the whole community a chance to benefit from your changes. Access to the source code is a precondition for this.
fr: La liberté de distribuer des copies de vos versions modifiées à d'autres (liberté 3). En faisant cela, vous pouvez faire profiter toute la communauté de vos changements. L'accès au code source est une condition requise.

source: A program is free software if users have all of these freedoms. Thus, you should be free to redistribute copies, either with or without modifications, either gratis or charging a fee for distribution, to <a href="#exportcontrol">anyone anywhere</a>. Being free to do these things means (among other things) that you do not have to ask or pay for permission to do so.
fr: Un programme est un logiciel libre si les utilisateurs ont toutes ces libertés. Ainsi, vous êtes libre de redistribuer des copies, avec ou sans modification, gratuitement ou non, à <a href="#exportcontrol">tout le monde, partout</a>. Être libre de faire ceci signifie (entre autres) que vous n'avez pas à demander ou à payer pour en avoir la permission.

source: You should also have the freedom to make modifications and use them privately in your own work or play, without even mentioning that they exist. If you do publish your changes, you should not be required to notify anyone in particular, or in any particular way.
fr: Vous devez aussi avoir la liberté de faire des modifications et de les utiliser à titre privé dans votre travail ou vos loisirs, sans en mentionner l'existence. Si vous publiez vos modifications, vous n'êtes pas obligé de prévenir quelqu'un de particulier ou de le faire d'une manière particulière.

source: The freedom to run the program means the freedom for any kind of person or organization to use it on any kind of computer system, for any kind of overall job and purpose, without being required to communicate about it with the developer or any other specific entity. In this freedom, it is the <em>user's</em> purpose that matters, not the <em>developer's</em> purpose; you as a user are free to run the program for your purposes, and if you distribute it to someone else, she is then free to run it for her purposes, but you are not entitled to impose your purposes on her.
fr: La liberté d'utiliser un programme est la liberté pour tout type de personne ou d'organisation de l'utiliser pour tout type de système informatique, pour tout type de tâche et sans être obligé de communiquer à ce sujet avec le développeur ou tout autre entité spécifique. Dans cette liberté, il est question de ce que veut faire <em>l'utilisateur</em>, pas le développeur&nbsp;; en tant qu'utilisateur, vous êtes libre d'exécuter un programme comme bon vous semble et si vous le redistribuez à quelqu'un d'autre, cette personne est libre de l'exécuter comme bon lui semble, mais vous n'êtes pas autorisé à lui imposer vos conditions.

source: The freedom to redistribute copies must include binary or executable forms of the program, as well as source code, for both modified and unmodified versions. (Distributing programs in runnable form is necessary for conveniently installable free operating systems.) It is OK if there is no way to produce a binary or executable form for a certain program (since some languages don't support that feature), but you must have the freedom to redistribute such forms should you find or develop a way to make them.
fr: La liberté de redistribuer des copies doit inclure les formes binaires ou exécutables du programme (tout comme le code source) à la fois pour les versions modifiées ou non modifiées du programme (diffuser des programmes sous une forme exécutable est nécessaire pour une installation commode des systémes d'exploitation libres). Il y a une exception s'il n'y a pas moyen de produire une version binaire ou exécutable (puisque certains langages ne supportent pas cette caractéristique), mais le public doit avoir la liberté de distribuer de telles formes s'ils ont un moyen d'en produire.

source: In order for freedoms 1 and 3 (the freedom to make changes and the freedom to publish improved versions) to be meaningful, you must have access to the source code of the program. Therefore, accessibility of source code is a necessary condition for free software. Obfuscated &ldquo;source code&rdquo; is not real source code and does not count as source code.
fr: Afin que les libertés 1 et 3 (la liberté de faire des changements et la liberté de publier les versions améliorées) aient un sens, vous devez avoir accès au code source. Ainsi, l'accès au code source est une condition nécessaire pour un logiciel libre. Du code source rendu illisible («&nbsp;obfuscated&nbsp;») ne compte pas comme du code source.

source: Freedom 1 includes the freedom to use your changed version in place of the original. If the program is delivered in a product designed to run someone else's modified versions but refuse to run yours &mdash; a practice known as &ldquo;tivoization&rdquo; or (in its practitioners' perverse terminology) as &ldquo;secure boot&rdquo; &mdash; freedom 1 becomes a theoretical fiction rather than a practical freedom. This is not sufficient. In other words, these binaries are not free software even if the source code they are compiled from is free.
fr: La liberté 1 inclut la liberté d'utiliser votre version modifiée à la place de l'original. Si le programme est livré dans un produit conçu pour exécuter les versions modifiées de quelqu'un d'autre, mais qui refuse d'exécuter les vôtres &mdash;&nbsp;une pratique connue sous le nom de «&nbsp;tivoïsation&nbsp;» ou (dans la terminologie pernicieuse de ses partisans) de «&nbsp;secure boot&nbsp;»&nbsp;&mdash; la liberté 1 devient une fiction théorique plutôt qu'une liberté pratique. Ceci n'est pas suffisant. En d'autres termes, ces binaires ne sont pas libres, même si le code source à partir duquel ils ont été compilés l'est.

source: One important way to modify a program is by merging in available free subroutines and modules. If the program's license says that you cannot merge in a suitably licensed existing module &mdash; for instance, if it requires you to be the copyright holder of any code you add &mdash; then the license is too restrictive to qualify as free.
fr: Un moyen important de modifier un programme est de le fusionner avec des modules ou des sous-programmes disponibles libres. Si la licence du programme indique que vous ne pouvez pas le fusionner dans un module existant, par exemple si elle impose que vous soyez le détenteur du copyright de tout code que vous ajoutez, alors la licence est trop restrictive pour être qualifiée de libre.

source: Freedom 3 includes the freedom to release your modified versions as free software. A free license may also permit other ways of releasing them; in other words, it does not have to be a <a href="/copyleft/copyleft.html">copyleft</a> license. However, a license that requires modified versions to be nonfree does not qualify as a free license.
fr: La liberté 3 inclut la liberté de distribuer vos versions modifiées en tant que logiciels libres. Une licence libre peut permettre d'autres façons de les distribuer&nbsp;; en d'autres termes, elle n'a pas à être un <a href="/copyleft/copyleft.fr.html">gauche d'auteur</a>. Cependant, une licence qui impose que les versions modifiées soient non libres ne peut pas être qualifiée de licence libre.

source: In order for these freedoms to be real, they must be permanent and irrevocable as long as you do nothing wrong; if the developer of the software has the power to revoke the license, or retroactively change its terms, without your doing anything wrong to give cause, the software is not free.
fr: Pour que ces libertés soient réelles, elles doivent être permanentes et irrévocables tant que vous n'avez rien fait de mal&nbsp;; si le développeur du logiciel a le droit de révoquer la licence ou de changer rétroactivement ses termes, sans que vous n'ayez fait quoi que ce soit de mal pour le justifier, le logiciel n'est pas libre.

source: However, certain kinds of rules about the manner of distributing free software are acceptable, when they don't conflict with the central freedoms. For example, copyleft (very simply stated) is the rule that when redistributing the program, you cannot add restrictions to deny other people the central freedoms. This rule does not conflict with the central freedoms; rather it protects them.
fr: Cependant, certains types de règles sur la manière de distribuer le logiciel libre sont acceptables tant que ces règles ne rentrent pas en conflit avec les libertés fondamentales. Par exemple, le copyleft (pour résumer très simplement) est une règle qui établit que lorsque vous redistribuez les programmes, vous ne pouvez ajouter de restrictions pour retirer les libertés fondamentales au public. Cette règle ne rentre pas en conflit avec les libertés fondamentales&nbsp;; en fait, elle les protège.

source: &ldquo;Free software&rdquo; does not mean &ldquo;noncommercial.&rdquo; A free program must be available for commercial use, commercial development, and commercial distribution. Commercial development of free software is no longer unusual; such free commercial software is very important. You may have paid money to get copies of free software, or you may have obtained copies at no charge. But regardless of how you got your copies, you always have the freedom to copy and change the software, even to <a href="/philosophy/selling.html">sell copies</a>.
fr: «&nbsp;Logiciel libre&nbsp;» ne signifie pas «&nbsp;non commercial&nbsp;». Un logiciel libre doit être disponible pour un usage commercial, pour le développement commercial et la distribution commerciale. Le développement commercial de logiciel libre n'est plus l'exception&nbsp;; de tels logiciels libres commerciaux sont très importants. Vous pouvez avoir payé pour obtenir une copie d'un logiciel libre ou vous pouvez l'avoir obtenu gratuitement. Mais indifféremment de la manière dont vous vous l'êtes procuré, vous avez toujours la liberté de copier et de modifier un logiciel et même d'en <a href="/philosophy/selling.fr.html">vendre des copies</a>.

source: Whether a change constitutes an improvement is a subjective matter. If your modifications are limited, in substance, to changes that someone else considers an improvement, that is not freedom.
fr: Qu'un changement constitue une amélioration ou pas est subjectif. Si vos modifications sont limitées, en substance, aux changements que quelqu'un d'autre considère comme une amélioration, ce n'est pas la liberté.

source: However, rules about how to package a modified version are acceptable, if they don't substantively limit your freedom to release modified versions, or your freedom to make and use modified versions privately. Thus, it is acceptable for the license to require that you change the name of the modified version, remove a logo, or identify your modifications as yours. As long as these requirements are not so burdensome that they effectively hamper you from releasing your changes, they are acceptable; you're already making other changes to the program, so you won't have trouble making a few more.
fr: Cependant, des règles qui régissent la manière dont une version peut être modifiée sont acceptables si elles ne limitent pas de manière substantielle votre liberté de produire des versions modifiées, ou votre liberté de créer et d'utiliser des versions modifiées pour votre usage privé. Ainsi, il est acceptable que la licence impose que vous changiez le nom de la version modifiée, que vous enleviez un logo, ou que vous marquiez vos modifications comme étant de votre fait. Tant que ces contraintes ne sont pas si lourdes qu'elles vous empêchent en pratique de distribuer vos changements, elles sont acceptables. Vous avez déjà fait d'autres changements dans le programme, alors quelques-uns de plus ne sont pas gênants.

source: Rules that &ldquo;if you make your version available in this way, you must make it available in that way also&rdquo; can be acceptable too, on the same condition. An example of such an acceptable rule is one saying that if you have distributed a modified version and a previous developer asks for a copy of it, you must send one. (Note that such a rule still leaves you the choice of whether to distribute your version at all.) Rules that require release of source code to the users for versions that you put into public use are also acceptable.
fr: Une règle qui impose que «&nbsp;si vous rendez votre version disponible comme ceci, vous devez aussi la rendre disponible comme cela&nbsp;» peut aussi être acceptable, sous les mêmes conditions. Un exemple d'une telle règle acceptable est si elle stipule que si vous avez distribué une version modifiée et si un ancien développeur en demande une copie, vous devez lui envoyer (notez qu'une telle règle vous laisse néanmoins le choix de distribuer votre version ou pas). Les règles qui nécessitent la fourniture du code source aux utilisateurs pour des versions qui ont été distribuées publiquement sont aussi acceptables.

source: In the GNU project, we use <a href="/copyleft/copyleft.html">copyleft</a> to protect these freedoms legally for everyone. But <a href="/philosophy/categories.html#Non-CopyleftedFreeSoftware">noncopylefted free software</a> also exists. We believe there are important reasons why <a href="/philosophy/pragmatic.html">it is better to use copyleft</a>, but if your program is noncopylefted free software, it is still basically ethical. (See <a href="/philosophy/categories.html">Categories of Free Software</a> for a description of how &ldquo;free software,&rdquo; &ldquo;copylefted software&rdquo; and other categories of software relate to each other.)
fr: Dans le projet GNU, nous utilisons le «&nbsp;<a href="/copyleft/copyleft.fr.html">copyleft</a>&nbsp;» pour protéger ces libertés. Mais des <a href="/philosophy/categories.fr.html#Non-CopyleftedFreeSoftware">logiciels libres non-copyleftés</a> existent aussi. Nous croyons qu'il y a de bonnes raisons qui font <a href="/philosophy/pragmatic.fr.html">qu'il est mieux d'utiliser le copyleft</a>, mais si votre programme est libre non-copylefté, il est quand même basiquement éthique (consultez les <a href="/philosophy/categories.fr.html">catégories de logiciels libres</a> pour une discussion sur les liens entre «&nbsp;logiciel libre&nbsp;», «&nbsp;logiciel copylefté&nbsp;», et encore d'autres catégories).

source: Sometimes government <a id="exportcontrol">export control regulations</a> and trade sanctions can constrain your freedom to distribute copies of programs internationally. Software developers do not have the power to eliminate or override these restrictions, but what they can and must do is refuse to impose them as conditions of use of the program. In this way, the restrictions will not affect activities and people outside the jurisdictions of these governments. Thus, free software licenses must not require obedience to any export regulations as a condition of any of the essential freedoms.
fr: Parfois <a id="exportcontrol">le contrôle gouvernemental des exportations</a> ou des sanctions économiques peuvent vous priver de la liberté de distribuer des copies de programmes à l'étranger. Les développeurs de logiciels n'ont pas le pouvoir d'éliminer ou de passer outre ces restrictions, mais ce qu'ils peuvent et doivent faire, est de refuser d'imposer eux-mêmes des conditions à l'utilisation des programmes. De cette manière, les restrictions n'affecteront pas les activités et les personnes se trouvant hors de la juridiction de leurs gouvernements.

source: Most free software licenses are based on copyright, and there are limits on what kinds of requirements can be imposed through copyright. If a copyright-based license respects freedom in the ways described above, it is unlikely to have some other sort of problem that we never anticipated (though this does happen occasionally). However, some free software licenses are based on contracts, and contracts can impose a much larger range of possible restrictions. That means there are many possible ways such a license could be unacceptably restrictive and nonfree.
fr: La plupart des licences de logiciels sont basées sur le droit d'auteur, or les types d'exigences que le droit d'auteur peut imposer ont des limites. Si une licence basée sur le droit d'auteur respecte la liberté de la manière décrite plus haut, il est improbable que nous ayons une autre sorte de problème que nous n'ayons pas anticipé (bien que cela arrive parfois). Cependant, certaines licences de logiciels sont basées sur le droit du contrat et les contrats impliquent un champ bien plus large de restrictions. Cela signifie qu'il y a bien plus de possibilités pour qu'une licence de ce type puisse restreindre de manière inacceptable la liberté des utilisateurs et ainsi devenir non libre. Cela signifie qu'il existe plein de manières pour qu'une telle licence soit intolérablement restrictive et non libre.

source: We can't possibly list all the ways that might happen. If a contract-based license restricts the user in an unusual way that copyright-based licenses cannot, and which isn't mentioned here as legitimate, we will have to think about it, and we will probably conclude it is nonfree.
fr: Nous ne pouvons pas lister tout ce qui pourrait se passer. Si une licence basée sur le contrat restreint l'utilisateur d'une manière inhabituelle que les licences basées sur le copyright ne peuvent pas faire et qui n'est pas mentionnée ici comme légitime, nous devrons y réfléchir et nous conclurons probablement qu'elle n'est pas libre.

source: When talking about free software, it is best to avoid using terms like &ldquo;give away&rdquo; or &ldquo;for free,&rdquo; because those terms imply that the issue is about price, not freedom. Some common terms such as &ldquo;piracy&rdquo; embody opinions we hope you won't endorse. See <a href="/philosophy/words-to-avoid.html">Confusing Words and Phrases that are Worth Avoiding</a> for a discussion of these terms. We also have a list of proper <a href="/philosophy/fs-translations.html">translations of &ldquo;free software&rdquo;</a> into various languages.
fr: Quand vous parlez des logiciels libres, il est préférable de ne pas utiliser de termes comme «&nbsp;donner&nbsp;» ou «&nbsp;gratuit&nbsp;», car ils laissent supposer que la finalité des logiciels libres est le prix et non la liberté. Certains termes répandus comme «&nbsp;piratage&nbsp;» comportent des idées auxquelles nous espérons que vous n'adhérerez pas. Lisez <a href="/philosophy/words-to-avoid.fr.html">Termes prêtant à confusion, que vous devriez éviter</a> pour un essai sur l'utilisation de ces termes. Nous avons aussi une liste de <a href="/philosophy/fs-translations.fr.html">traductions de «&nbsp;free software&nbsp;»</a> dans de nombreuses langues.
