Repository: gitGNU/gnu_www-fr
Catalog: philosophy/free-software-for-freedom.*.po
Languages: fr

source: Why &ldquo;Free Software&rdquo; is better than &ldquo;Open Source&rdquo; - GNU Project - Free Software Foundation (FSF)
fr: Pourquoi &laquo;&nbsp;logiciel libre&nbsp;&raquo; est-il meilleur que &laquo;&nbsp;open source&nbsp;&raquo; - GNU Project - Free Software Foundation (FSF)

source: Why &ldquo;Free Software&rdquo; is better than &ldquo;Open Source&rdquo;
fr: Pourquoi &laquo;&nbsp;logiciel libre&nbsp;&raquo; est-il meilleur que &laquo;&nbsp;open source&nbsp;&raquo;

source: <a href="/philosophy/open-source-misses-the-point.html">&ldquo;Open Source&rdquo; misses the point of Free Software</a> is an updated version of this article.
fr: <a href="/philosophy/open-source-misses-the-point.fr.html">Pourquoi l'&laquo;&nbsp;open source&nbsp;&raquo; passe &agrave; côt&eacute; du probl&egrave;me que soul&egrave;ve le logiciel libre</a> est une version mise &agrave; jour de cet article.

source: While free software by any other name would give you the same freedom, it makes a big difference which name we use: different words <em>convey different ideas</em>.
fr: Bien que la libert&eacute; d'un logiciel ne soit pas d&eacute;pendante du nom qu'on lui donne, il y a des diff&eacute;rences dans les noms qu'on lui accorde&nbsp;: des mots diff&eacute;rents apportent des id&eacute;es diff&eacute;rentes.

source: In 1998, some of the people in the free software community began using the term <a href="http://www.opensource.org/">&ldquo;open source software&rdquo;</a> instead of <a href="/philosophy/free-sw.html">&ldquo;free software&rdquo;</a> to describe what they do. The term &ldquo;open source&rdquo; quickly became associated with a different approach, a different philosophy, different values, and even a different criterion for which licenses are acceptable. The Free Software movement and the Open Source movement are today <a href="#relationship"> separate movements</a> with different views and goals, although we can and do work together on some practical projects.
fr: En 1998, quelques personnes de la communaut&eacute; du logiciel libre ont commenc&eacute; &agrave; utiliser le terme &laquo;&nbsp;<a href="http://www.opensource.org/">open source</a>&nbsp;&raquo; (<em>logiciel ouvert</em>) au lieu de <a href="/philosophy/free-sw.fr.html">&laquo;&nbsp;logiciel libre&nbsp;&raquo; (<em>free software</em>)</a>). Le terme &laquo;&nbsp;open source&nbsp;&raquo; devint rapidement associ&eacute; &agrave; une approche, &agrave; une philosophie, &agrave; des valeurs et m&ecirc;me &agrave; des crit&egrave;res diff&eacute;rents pour lesquels les licences sont acceptables. Le Mouvement du logiciel libre et le Mouvement open source sont aujourd'hui des <a href="#relationship">mouvements s&eacute;par&eacute;s</a>, avec des vues et des objectifs diff&eacute;rents, bien que nous puissions travailler ensemble, et nous le faisons, sur quelques projets concrets.

source: The fundamental difference between the two movements is in their values, their ways of looking at the world. For the Open Source movement, the issue of whether software should be open source is a practical question, not an ethical one. As one person put it, &ldquo;Open source is a development methodology; free software is a social movement.&rdquo; For the Open Source movement, non-free software is a suboptimal solution. For the Free Software movement, non-free software is a social problem and free software is the solution.
fr: La diff&eacute;rence fondamentale entre les deux mouvements se situe dans leurs valeurs, leurs fa&ccedil;ons de voir le monde. Pour le Mouvement open source, la question de savoir si un logiciel devrait &ecirc;tre open source est une question pratique, non &eacute;thique. Comme quelqu'un l'a dit&nbsp;: &laquo;&nbsp;le Mouvement open source est une m&eacute;thodologie de d&eacute;veloppement&nbsp;; le Mouvement du logiciel libre, un mouvement social&nbsp;&raquo;. Pour le Mouvement open source, un logiciel non libre est une solution sous-optimale. Pour le Mouvement du logiciel libre, le logiciel non libre est un probl&egrave;me social et le logiciel libre en est la solution.

source: Relationship between the Free Software movement and Open Source movement
fr: Relations entre le Mouvement du logiciel libre et le Mouvement open source

source: The Free Software movement and the Open Source movement are like two political camps within the free software community.
fr: Le Mouvement du logiciel libre et le Mouvement open source sont comme deux partis politiques &agrave; travers notre communaut&eacute;.

source: Radical groups in the 1960s developed a reputation for factionalism: organizations split because of disagreements on details of strategy, and then treated each other as enemies. Or at least, such is the image people have of them, whether or not it was true.
fr: Les groupes radicaux des ann&eacute;es 1960 sont connus pour leur factionalisme&nbsp;: les organisations se s&eacute;parent &agrave; cause de divergences dans des d&eacute;tails de strat&eacute;gie, et se d&eacute;testent alors. Ils sont d'accord sur les principes de base, et n'ont de divergences que sur des recommandations pratiques&nbsp;; mais ils se consid&egrave;rent comme des ennemis, et se battent sauvagement.

source: The relationship between the Free Software movement and the Open Source movement is just the opposite of that picture. We disagree on the basic principles, but agree more or less on the practical recommendations. So we can and do work together on many specific projects. We don't think of the Open Source movement as an enemy. The enemy is <a href="/philosophy/categories.html#ProprietarySoftware"> proprietary software</a>.
fr: Pour le Mouvement du logiciel libre et le Mouvement open source, c'est tout simplement le contraire. Nous ne sommes pas d'accord sur les principes de base, mais nous sommes d'accord sur la plupart des recommandations pratiques. Nous travaillons ensemble sur de nombreux projets sp&eacute;cifiques.

source: We are not against the Open Source movement, but we don't want to be lumped in with them. We acknowledge that they have contributed to our community, but we created this community, and we want people to know this. We want people to associate our achievements with our values and our philosophy, not with theirs. We want to be heard, not obscured behind a group with different views. To prevent people from thinking we are part of them, we take pains to avoid using the word &ldquo;open&rdquo; to describe free software, or its contrary, &ldquo;closed&rdquo;, in talking about non-free software.
fr: Dans le Mouvement du logiciel libre, nous ne pensons pas que le Mouvement open source soit un ennemi. L'ennemi est <a href="/philosophy/categories.fr.html#ProprietarySoftware">le logiciel propri&eacute;taire</a>. Mais nous voulons que les personnes de notre communaut&eacute; sachent que nous ne sommes pas pareils qu'eux&nbsp;!

source: So please mention the Free Software movement when you talk about the work we have done, and the software we have developed&mdash;such as the <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> operating system.
fr: Alors veuillez mentionner le Mouvement du logiciel libre lorsque vous parlez du travail que vous avez accompli, et du logiciel que vous avez d&eacute;velopp&eacute;, tout comme du syst&egrave;me d'exploitation <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a>.

source: Comparing the two terms
fr: Comparaison des deux termes

source: This rest of this article compares the two terms &ldquo;free software&rdquo; and &ldquo;open source&rdquo;. It shows why the term &ldquo;open source&rdquo; does not solve any problems, and in fact creates some.
fr: Le reste de cet article compare les termes &laquo;&nbsp;logiciel libre&nbsp;&raquo; et &laquo;&nbsp;open source&nbsp;&raquo;. Il montre pourquoi le terme &laquo;&nbsp;open source&nbsp;&raquo; ne r&eacute;sout aucun probl&egrave;me, et en fait en cr&eacute;e m&ecirc;me certains.

source: Ambiguity
fr: Ambigu&iuml;t&eacute;

source: The term &ldquo;free software&rdquo; has an ambiguity problem: an unintended meaning, &ldquo;Software you can get for zero price,&rdquo; fits the term just as well as the intended meaning, &ldquo;software which gives the user certain freedoms.&rdquo; We address this problem by publishing a <a href="/philosophy/free-sw.html"> more precise definition of free software</a>, but this is not a perfect solution; it cannot completely eliminate the problem. An unambiguously correct term would be better, if it didn't have other problems.
fr: Le terme &laquo;&nbsp;free software&nbsp;&raquo; pose un probl&egrave;me d'ambigu&iuml;t&eacute;&nbsp;:une signification involontaire, &laquo;&nbsp;logiciel gratuit&nbsp;&raquo;, (<i>N.d.T.&nbsp;: free =gratuit ou libre en anglais</i>) est aussi valable que la signification voulue, &laquo;&nbsp;logiciel qui accorde des libert&eacute;s &agrave; l'utilisateur&nbsp;&raquo;. Nous r&eacute;solvons ce probl&egrave;me en publiant <a href="/philosophy/free-sw.fr.html"> une d&eacute;finition plus pr&eacute;cise du logiciel libre</a>, mais ce n'est qu'une solution partielle&nbsp;; elle ne peut pas &eacute;liminer compl&egrave;tement le probl&egrave;me. Un terme correct et non ambigu serait meilleur, en supposant que cela n'entra&icirc;ne pas d'autres probl&egrave;mes.

source: Unfortunately, all the alternatives in English have problems of their own. We've looked at many alternatives that people have suggested, but none is so clearly &ldquo;right&rdquo; that switching to it would be a good idea. Every proposed replacement for &ldquo;free software&rdquo; has a similar kind of semantic problem, or worse&mdash;and this includes &ldquo;open source software.&rdquo;
fr: Malheureusement, toutes les alternatives ont leurs propres d&eacute;fauts. Nous avons &eacute;tudi&eacute; de nombreuses alternatives que l'on nous a sugg&eacute;r&eacute;es, et alors que certaines &eacute;vitaient ce probl&egrave;me, elles en entra&icirc;naient de nouveaux, aucune n'&eacute;tant suffisamment &laquo;&nbsp;correcte&nbsp;&raquo; pour que ce soit une bonne id&eacute;e de l'utiliser. Chaque alternative propos&eacute;e pour &laquo;&nbsp;free software&nbsp;&raquo; posait les m&ecirc;mes sortes de probl&egrave;mes s&eacute;mantiques, ou pire, ce qui est le cas de &laquo;&nbsp;open source&nbsp;&raquo;.

source: The official definition of &ldquo;open source software,&rdquo; as published by the Open Source Initiative, is very close to our definition of free software; however, it is a little looser in some respects, and they have accepted a few licenses that we consider unacceptably restrictive of the users. However, the obvious meaning for the expression &ldquo;open source software&rdquo; is &ldquo;You can look at the source code.&rdquo; This is a much weaker criterion than free software; it includes free software, but also includes <a href="/philosophy/categories.html#semi-freeSoftware">semi-free</a> programs such as Xv, and even some <a href="/philosophy/categories.html#ProprietarySoftware"> proprietary</a> programs, including Qt under its original license (before the QPL).
fr: La d&eacute;finition officielle de &laquo;&nbsp;logiciel open source&nbsp;&raquo;, telle qu'elle est publi&eacute;e par la Open Source Initiative, est tr&egrave;s proche de notre d&eacute;finition de logiciel libre&nbsp;; cependant, elle est un peu vague sur certains aspects, et ils ont accept&eacute; quelques licences que nous consid&eacute;rons restrictives de fa&ccedil;on inacceptable pour les utilisateurs. La signification &eacute;vidente de &laquo;&nbsp;open source&nbsp;&raquo; est &laquo;&nbsp;Vous pouvez avoir le code source&nbsp;&raquo;. Cette cat&eacute;gorie de logiciels n'est clairement pas la m&ecirc;me que celle de logiciels libres. Elle inclut les logiciels libres, mais aussi les logiciels <a href="/philosophy/categories.fr.html#semi-freeSoftware">semi-libres</a> tels que Xv, et m&ecirc;me les logiciels <a href="/philosophy/categories.fr.html#ProprietarySoftware">non-libres</a> tels que Qt sous sa licence d'origine.

source: That obvious meaning for &ldquo;open source&rdquo; is not the meaning that its advocates intend. The result is that most people misunderstand what those advocates are advocating. Here is how writer Neal Stephenson defined &ldquo;open source&rdquo;:
fr: La signification explicite d'&laquo;&nbsp;open source&nbsp;&raquo; n'est pas la signification que ses partisans d&eacute;sirent (leur d&eacute;finition &laquo;&nbsp;officielle&nbsp;&raquo; est plus proche de &laquo;&nbsp;logiciel libre&nbsp;&raquo;). Le r&eacute;sultat est que le public comprend g&eacute;n&eacute;ralement mal la signification de ces termes. Voici comment l'&eacute;crivain Neal Stephenson d&eacute;finit &laquo;&nbsp;open source&nbsp;&raquo;&nbsp;:

source: Linux is &ldquo;open source&rdquo; software meaning, simply, that anyone can get copies of its source code files.
fr: Linux est un logiciel &laquo;&nbsp;open source&nbsp;&raquo; signifie, simplement, que n'importe qui peut obtenir des copies de ses fichiers sources.

source: I don't think he deliberately sought to reject or dispute the &ldquo;official&rdquo; definition. I think he simply applied the conventions of the English language to come up with a meaning for the term. The state of Kansas published a similar definition:
fr: Je ne pense pas qu'il avait l'id&eacute;e de d&eacute;lib&eacute;r&eacute;ment rejeter ou critiquer la d&eacute;finition &laquo;&nbsp;officielle&nbsp;&raquo;. Il a simplement appliqu&eacute; les conventions de la langue anglaise, et tir&eacute; la conclusion naturelle. L'&eacute;tat du Kansas a publi&eacute; une d&eacute;finition similaire&nbsp;:

source: Make use of open-source software (OSS). OSS is software for which the source code is freely and publicly available, though the specific licensing agreements vary as to what one is allowed to do with that code.
fr: De l'utilisation de logiciel open source (OSS). L'OSS est un logiciel pour lequel le code source est librement et publiquement accessible, bien que les accords de licence sp&eacute;cifiques varient sur ce que chacun est autoris&eacute; &agrave; faire avec ce code.

source: Of course, the open source people have tried to deal with this by publishing a precise definition for the term, just as we have done for &ldquo;free software.&rdquo;
fr: Bien s&ucirc;r, il est possible de r&eacute;soudre ce probl&egrave;me en publiant une d&eacute;finition pr&eacute;cise, comme nous l'avons fait pour &laquo;&nbsp;free software&nbsp;&raquo;.

source: But the explanation for &ldquo;free software&rdquo; is simple&mdash;a person who has grasped the idea of &ldquo;free speech, not free beer&rdquo; will not get it wrong again. There is no such succinct way to explain the official meaning of &ldquo;open source&rdquo; and show clearly why the natural definition is the wrong one.
fr: Mais l'explication pour &laquo;&nbsp;logiciel libre&nbsp;&raquo; est simple -- une personne qui a saisi l'id&eacute;e de &laquo;&nbsp;discours libre, pas bi&egrave;re gratuite&nbsp;&raquo; (&laquo;&nbsp;free speech, not free beer&nbsp;&raquo;) ne commettra plus l'erreur. Il n'y a pas de mani&egrave;re aussi succincte pour expliquer la signification de &laquo;&nbsp;open source&nbsp;&raquo; et pour montrer clairement pourquoi la d&eacute;finition naturelle n'est pas la bonne.

source: Fear of Freedom
fr: Peur de la libert&eacute;

source: The main argument for the term &ldquo;open source software&rdquo; is that &ldquo;free software&rdquo; makes some people uneasy. That's true: talking about freedom, about ethical issues, about responsibilities as well as convenience, is asking people to think about things they might rather ignore. This can trigger discomfort, and some people may reject the idea for that. It does not follow that society would be better off if we stop talking about these things.
fr: L'argument principal pour le terme &laquo;&nbsp;open source&nbsp;&raquo; est que &laquo;&nbsp;free software&nbsp;&raquo; rend certaines personnes m&eacute;fiantes. C'est vrai&nbsp;: parler de libert&eacute;, de questions &eacute;thiques, de responsabilit&eacute;s aussi bien que de convenance, c'est demander aux gens de r&eacute;fl&eacute;chir &agrave; des choses qu'ils pr&eacute;f&eacute;reraient ignorer; cela peut induire une certaine g&ecirc;ne. Mais nous ne rendrions pas la soci&eacute;t&eacute; meilleure si nous arr&ecirc;tions de parler de ces choses.

source: Years ago, free software developers noticed this discomfort reaction, and some started exploring an approach for avoiding it. They figured that by keeping quiet about ethics and freedom, and talking only about the immediate practical benefits of certain free software, they might be able to &ldquo;sell&rdquo; the software more effectively to certain users, especially business. The term &ldquo;open source&rdquo; is offered as a way of doing more of this&mdash;a way to be &ldquo;more acceptable to business.&rdquo; The views and values of the Open Source movement stem from this decision.
fr: Il y a quelques ann&eacute;es, des d&eacute;veloppeurs de logiciels libres ont remarqu&eacute; cette r&eacute;action, et certains ont commenc&eacute; &agrave; explorer des voies pour l'&eacute;viter. Ils ont imagin&eacute; qu'en restant prudent &agrave; propos de l'&eacute;thique et de la libert&eacute;, et en ne parlant que des b&eacute;n&eacute;fices pratiques et imm&eacute;diats de certains logiciels libres, ils pouvaient &laquo;&nbsp;vendre&nbsp;&raquo; le logiciel libre plus efficacement &agrave; certains utilisateurs, principalement en entreprise. C'est pour cela qu'ils ont utilis&eacute; le terme &laquo;&nbsp;open source&nbsp;&raquo;, pour &ecirc;tre &laquo;&nbsp;plus acceptable en entreprise&nbsp;&raquo;.

source: This approach has proved effective, in its own terms. Today many people are switching to free software for purely practical reasons. That is good, as far as it goes, but that isn't all we need to do! Attracting users to free software is not the whole job, just the first step.
fr: Cette approche a prouv&eacute; son efficacit&eacute;, &agrave; sa mani&egrave;re. Aujourd'hui, beaucoup de personnes se mettent au logiciel libre pour des raisons purement pratiques. C'est une bonne chose, mais ce n'est pas la seule chose que nous devons entreprendre&nbsp;! Attirer des utilisateurs vers le logiciel libre n'est pas le but final que nous devons atteindre, mais juste le premier pas.

source: Sooner or later these users will be invited to switch back to proprietary software for some practical advantage. Countless companies seek to offer such temptation, and why would users decline? Only if they have learned to <em>value the freedom</em> free software gives them, for its own sake. It is up to us to spread this idea&mdash;and in order to do that, we have to talk about freedom. A certain amount of the &ldquo;keep quiet&rdquo; approach to business can be useful for the community, but we must have plenty of freedom talk too.
fr: T&ocirc;t ou tard ces utilisateurs seront tent&eacute;s de retourner au logiciel propri&eacute;taire pour d'autres avantages pratiques. Des entreprises mineures cherchent &agrave; profiter d'une telle tentation, et pourquoi les utilisateurs refuseraient-ils&nbsp;? Seulement s'ils ont compris <em>l'importance de la libert&eacute;</em> dans le logiciel libre pour elle-m&ecirc;me. C'est &agrave; nous de r&eacute;pandre cette id&eacute;e, et pour le faire nous devons parler de libert&eacute;. Une certaine partie de l'approche &laquo;&nbsp;prudente&nbsp;&raquo; est utile pour la communaut&eacute;, mais nous devons &eacute;galement avoir beaucoup de discours sur la libert&eacute;.

source: At present, we have plenty of &ldquo;keep quiet&rdquo;, but not enough freedom talk. Most people involved with free software say little about freedom&mdash;usually because they seek to be &ldquo;more acceptable to business.&rdquo; Software distributors especially show this pattern. Some <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> operating system distributions add proprietary packages to the basic free system, and they invite users to consider this an advantage, rather than a step backwards from freedom.
fr: &Agrave; pr&eacute;sent, nous avons beaucoup de partisans de l'approche &laquo;&nbsp;prudente&nbsp;&raquo;, mais pas assez de discours sur la libert&eacute;. La plupart des personnes concern&eacute;es par le logiciel libre parlent peu de la libert&eacute;, souvent parce qu'elle cherchent &agrave; &ecirc;tre &laquo;&nbsp;plus acceptables en entreprise&nbsp;&raquo;. Les distributeurs de logiciels pr&eacute;sentent essentiellement cet aspect. Quelques distributions du syst&egrave;me d'exploitation <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a> ajoutent des paquetages propri&eacute;taires au syst&egrave;me libre de base, et ils esp&egrave;rent que les utilisateurs consid&egrave;rent cela comme un avantage, plut&ocirc;t qu'un retour en arri&egrave;re.

source: We are failing to keep up with the influx of free software users, failing to teach people about freedom and our community as fast as they enter it. This is why non-free software (which Qt was when it first became popular), and partially non-free operating system distributions, find such fertile ground. To stop using the word &ldquo;free&rdquo; now would be a mistake; we need more, not less, talk about freedom.
fr: Nous n'arrivons pas &agrave; g&eacute;rer le flux entrant des utilisateurs de logiciels libres, nous n'arrivons pas &agrave; leur parler de libert&eacute; et de notre communaut&eacute; d&egrave;s qu'ils y entrent. C'est pourquoi les logiciels non-libres (comme Qt, &agrave; l'&eacute;poque o&ugrave; celui-ci devint populaire) et des distributions en partie non-libres de syst&egrave;mes d'exploitation trouvent une terre si fertile. Abandonner maintenant le mot &laquo;&nbsp;libre&nbsp;&raquo; serait une erreur; nous devons parler plus (et pas moins) de la libert&eacute;.

source: If those using the term &ldquo;open source&rdquo; draw more users into our community, that is a contribution, but the rest of us will have to work even harder to bring the issue of freedom to those users' attention. We have to say, &ldquo;It's free software and it gives you freedom!&rdquo;&mdash;more and louder than ever before.
fr: Esp&eacute;rons que ceux qui utilisent le terme &laquo;&nbsp;open source&nbsp;&raquo; attireront en fait plus d'utilisateurs dans notre communaut&eacute; mais s'ils y arrivent, le restant de notre communaut&eacute; devra travailler encore plus durement pour porter le probl&egrave;me de la libert&eacute; aux oreilles de ces utilisateurs. Nous devons dire &laquo;&nbsp;C'est un logiciel libre et il vous donne la libert&eacute;&nbsp;&raquo; plus souvent et plus fort qu'auparavant.

source: Would a Trademark Help?
fr: Est-ce qu'une marque d&eacute;pos&eacute;e nous aiderait&nbsp;?
