Repository: gitGNU/gnu_www-fr
Catalog: philosophy/free-software-for-freedom.*.po
Languages: fr

source: The advocates of &ldquo;open source software&rdquo; tried to make it a trademark, saying this would enable them to prevent misuse. This initiative was later dropped, the term being too descriptive to qualify as a trademark; thus, the legal status of &ldquo;open source&rdquo; is the same as that of &ldquo;free software&rdquo;: there is no <em>legal</em> constraint on using it. I have heard reports of a number of companies' calling software packages &ldquo;open source&rdquo; even though they did not fit the official definition; I have observed some instances myself.
fr: Les partisans du &laquo;&nbsp;logiciel open source&nbsp;&raquo; ont essay&eacute; d'en faire une marque d&eacute;pos&eacute;e, en disant que &ccedil;a leur permettra d'&eacute;viter les abus. L'essai &eacute;choua lorsque la d&eacute;marche cessa de prendre effet en 1999&nbsp;; ainsi, le statut l&eacute;gal d'&laquo;&nbsp;open source&nbsp;&raquo; est le m&ecirc;me que celui de &laquo;&nbsp;free software&nbsp;&raquo; il n'y a pas de contrainte <em>l&eacute;gale</em> &agrave; son utilisation. J'ai entendu parler d'entreprises appelant des logiciels &laquo;&nbsp;open source&nbsp;&raquo; m&ecirc;me s'ils ne correspondaient pas &agrave; la d&eacute;finition officielle&nbsp;; j'ai personnellement observ&eacute; quelques exemples.

source: But would it have made a big difference to use a term that is a trademark? Not necessarily.
fr: Mais est-ce que cela ferait une grosse diff&eacute;rence d'utiliser un terme qui est d&eacute;pos&eacute;&nbsp;? Pas nécessairement.

source: Companies also made announcements that give the impression that a program is &ldquo;open source software&rdquo; without explicitly saying so. For example, one IBM announcement, about a program that did not fit the official definition, said this:
fr: Des entreprises font parfois des annonces qui donnent l'impression qu'un programme est un &laquo;&nbsp;logiciel open source&nbsp;&raquo; sans vraiment le dire explicitement. Par exemple, les annonces d'IBM &agrave; propos d'un programme qui ne correspond pas &agrave; la d&eacute;finition officielle dit ceci&nbsp;:

source: As is common in the open source community, users of the ... technology will also be able to collaborate with IBM ...
fr: Comme c'est courant dans la communaut&eacute; open source, les utilisateurs de la technologie&hellip; vont aussi pouvoir collaborer avec IBM&hellip;

source: This did not actually say that the program <em>was</em> &ldquo;open source&rdquo;, but many readers did not notice that detail. (I should note that IBM was sincerely trying to make this program free software, and later adopted a new license which does make it free software and &ldquo;open source&rdquo;; but when that announcement was made, the program did not qualify as either one.)
fr: Ceci ne disait pas vraiment que le programme <em>&eacute;tait</em> &laquo;&nbsp;open source&nbsp;&raquo;, mais beaucoup de lecteurs n'ont pas not&eacute; ce d&eacute;tail (je devrais noter qu'IBM essayait sinc&egrave;rement de rendre son programme libre, et adopta plus tard une nouvelle licence qui le rendit libre et &laquo;&nbsp;open source&nbsp;&raquo;; mais quand l'annonce fut faite, le programme n'&eacute;tait ni l'un ni l'autre).

source: And here is how Cygnus Solutions, which was formed to be a free software company and subsequently branched out (so to speak) into proprietary software, advertised some proprietary software products:
fr: Et voici comment Cygnus Solutions, qui a &eacute;t&eacute; form&eacute;e pour &ecirc;tre une entreprise de logiciels libres et qui a &eacute;tendu par la suite ses activit&eacute;s (pour ainsi dire) dans le monde du logiciel propri&eacute;taire, fit de la publicit&eacute; pour des logiciels propri&eacute;taires&nbsp;:

source: Cygnus Solutions is a leader in the open source market and has just launched two products into the [GNU/]Linux marketplace.
fr: Cygnus Solutions fait partie des leaders du march&eacute; de l'open source et vient juste de lancer deux nouveaux produits sur le march&eacute; Linux.

source: Unlike IBM, Cygnus was not trying to make these packages free software, and the packages did not come close to qualifying. But Cygnus didn't actually say that these are &ldquo;open source software&rdquo;, they just made use of the term to give careless readers that impression.
fr: Contrairement &agrave; IBM, Cygnus n'essayait pas de rendre ses logiciels libres, et ses logiciels &eacute;taient loin d'&ecirc;tre des logiciels libres. Mais Cygnus ne dit pas vraiment que ce sont des &laquo;&nbsp;logiciels open source&nbsp;&raquo;, ils &eacute;crivent juste une phrase vague pour essayer d'obtenir l'attitude favorable qui vient avec ce terme.

source: These observations suggest that a trademark would not have truly prevented the confusion that comes with the term &ldquo;open source&rdquo;.
fr: Ces observations sugg&egrave;rent qu'une marque d&eacute;pos&eacute;e n'aurait pas vraiment r&eacute;solu les probl&egrave;mes du terme &laquo;&nbsp;open source&nbsp;&raquo;.

source: Misunderstandings(?) of &ldquo;Open Source&rdquo;
fr: Incompr&eacute;hensions(?) au sujet d'&laquo;&nbsp;open source&nbsp;&raquo;

source: The Open Source Definition is clear enough, and it is quite clear that the typical non-free program does not qualify. So you would think that &ldquo;Open Source company&rdquo; would mean one whose products are free software (or close to it), right? Alas, many companies are trying to give it a different meaning.
fr: La d&eacute;finition de l'open source est assez claire, et il est compl&egrave;tement clair que le programme typiquement non libre n'y correspond pas. Alors vous pourriez penser qu'une &laquo;&nbsp;entreprise open source&nbsp;&raquo; fait des logiciels libres, n'est-ce-pas&nbsp;? H&eacute;las, denombreuses entreprises essayent de lui donner une autre d&eacute;finition.

source: At the &ldquo;Open Source Developers Day&rdquo; meeting in August 1998, several of the commercial developers invited said they intend to make only a part of their work free software (or &ldquo;open source&rdquo;). The focus of their business is on developing proprietary add-ons (software or <a href="/philosophy/free-doc.html">manuals</a>) to sell to the users of this free software. They ask us to regard this as legitimate, as part of our community, because some of the money is donated to free software development.
fr: Au colloque &laquo;&nbsp;Open Source Developers Day&nbsp;&raquo; en ao&ucirc;t 1998, plusieurs des d&eacute;veloppeurs commerciaux invit&eacute;s dirent qu'ils n'avaient l'intention de rendre qu'une partie de leur travail libre (ou &laquo;&nbsp;open source&nbsp;&raquo;). La partie principale de leur activit&eacute; est de d&eacute;velopper des extensions propri&eacute;taires (logiciels ou <a href="free-doc.fr.html">manuels</a>) &agrave; vendre aux utilisateurs de logiciel libre. Ils nous demandent de consid&eacute;rer ceci comme l&eacute;gitime en tant que part de notre communaut&eacute;, car une partie des b&eacute;n&eacute;fices est revers&eacute; au d&eacute;veloppement de logiciels libres.

source: In effect, these companies seek to gain the favorable cachet of &ldquo;open source&rdquo; for their proprietary software products&mdash;even though those are not &ldquo;open source software&rdquo;&mdash;because they have some relationship to free software or because the same company also maintains some free software. (One company founder said quite explicitly that they would put, into the free package they support, as little of their work as the community would stand for.)
fr: En effet, ces entreprises cherchent &agrave; acqu&eacute;rir l'apparence favorable de l'&laquo;&nbsp;open source&nbsp;&raquo; pour leurs logiciels propri&eacute;taires, tout en sachant que ce ne sont pas des &laquo;&nbsp;logiciels open source&nbsp;&raquo;, car ils ont quelques relations avec le logiciel libre ou parce que la m&ecirc;me entreprise maintient des logiciels libres (le fondateur d'une entreprise dit explicitement qu'il consacrerait le minimum de travail que la communaut&eacute; accepterait dans le logiciel libre qu'ils maintiennent).

source: Over the years, many companies have contributed to free software development. Some of these companies primarily developed non-free software, but the two activities were separate; thus, we could ignore their non-free products, and work with them on free software projects. Then we could honestly thank them afterward for their free software contributions, without talking about the rest of what they did.
fr: &Agrave; travers les ann&eacute;es, de nombreuses entreprises ont contribu&eacute; au d&eacute;veloppement de logiciels libres. Certaines de ces entreprises d&eacute;veloppaient d'abord des logiciels propri&eacute;taires, mais les deux activit&eacute;s &eacute;taient s&eacute;par&eacute;es; ainsi, nous pouvions ignorer leurs produits non libres, et travailler avec eux sur leurs projets libres. Alors, nous pouvions par la suite les remercier honn&ecirc;tement pour leur contribution au logiciel libre, sans parler du reste de leurs activit&eacute;s.

source: We cannot do the same with these new companies, because they won't let us. These companies actively invite the public to lump all their activities together; they want us to regard their non-free software as favorably as we would regard a real contribution, although it is not one. They present themselves as &ldquo;open source companies,&rdquo; hoping that we will get a warm fuzzy feeling about them, and that we will be fuzzy-minded in applying it.
fr: Nous ne pouvons plus faire de m&ecirc;me avec ces nouvelles entreprises, car elles n'avanceront pas ainsi. Ces entreprises essayent activement de conduire le public &agrave; consid&eacute;rer leurs activit&eacute;s en bloc; elles veulent que nous consid&eacute;rions leurs logiciels non libres aussi favorablement qu'une vraie contribution, m&ecirc;me si ce n'en est pas une. Elles se pr&eacute;sentent elles-m&ecirc;mes comme des &laquo;&nbsp;entreprises open source&nbsp;&raquo;, en esp&eacute;rant que nous allons ressentir un sentiment positif &agrave; leur propos, et que nous allons l'appliquer aveugl&eacute;ment.

source: This manipulative practice would be no less harmful if it were done using the term &ldquo;free software.&rdquo; But companies do not seem to use the term &ldquo;free software&rdquo; that way; perhaps its association with idealism makes it seem unsuitable. The term &ldquo;open source&rdquo; opened the door for this.
fr: Cette pratique manipulatrice ne serait pas moins grave si elle &eacute;tait faite en utilisant le terme &laquo;&nbsp;logiciel libre&nbsp;&raquo;. Mais des entreprises n'ont pas l'air d'utiliser le terme &laquo;&nbsp;logiciel libre&nbsp;&raquo; de cette mani&egrave;re; peut-&ecirc;tre que l'association avec l'id&eacute;alisme le rend inappropri&eacute;. Le terme &laquo;&nbsp;open source&nbsp;&raquo; &agrave; ouvert la porte &agrave; ces d&eacute;rives.

source: At a trade show in late 1998, dedicated to the operating system often referred to as <a href="/gnu/linux-and-gnu.html">&ldquo;Linux&rdquo;</a>, the featured speaker was an executive from a prominent software company. He was probably invited on account of his company's decision to &ldquo;support&rdquo; that system. Unfortunately, their form of &ldquo;support&rdquo; consists of releasing non-free software that works with the system&mdash;in other words, using our community as a market but not contributing to it.
fr: Fin 1998, &agrave; une exposition d&eacute;di&eacute;e au syst&egrave;me d'exploitation qu'on appelle souvent <a href="/gnu/linux-and-gnu.fr.html">&laquo;&nbsp;Linux&nbsp;&raquo;</a>, l'intervenant &eacute;tait un cadre d'une importante entreprise de logiciels. Il a certainement &eacute;t&eacute; invit&eacute; gr&acirc;ce &agrave; la d&eacute;cision de son entreprise de &laquo;&nbsp;supporter&nbsp;&raquo; ce syst&egrave;me. Malheureusement, leur support consiste &agrave; &eacute;diter des logiciels non libres qui fonctionnent sur ce syst&egrave;me, en d'autres mots, utiliser notre communaut&eacute; comme march&eacute; mais sans y contribuer.

source: He said, &ldquo;There is no way we will make our product open source, but perhaps we will make it &lsquo;internal&rsquo; open source. If we allow our customer support staff to have access to the source code, they could fix bugs for the customers, and we could provide a better product and better service.&rdquo; (This is not an exact quote, as I did not write his words down, but it gets the gist.)
fr: Il dit &laquo;&nbsp;Nous ne rendrons pas notre produit open source, mais peut-&ecirc;tre le rendrons-nous open source en &laquo;&nbsp;interne&nbsp;&raquo;. Si nous autorisons notre support client &agrave; avoir acc&egrave;s au code source, ils pourraient corriger des bugs pour le client, et nous pourrions fournir un meilleur produit et un meilleur service&nbsp;&raquo;. (Ce n'est pas la citation exacte puisque je ne l'ai pas not&eacute;e, mais &ccedil;'en est l'essentiel).

source: People in the audience afterward told me, &ldquo;He just doesn't get the point.&rdquo; But is that so? Which point did he not get?
fr: Des personnes du public me dirent plus tard &laquo;&nbsp;Il n'a tout simplement rien compris&nbsp;&raquo;. Mais est-ce le cas&nbsp;? Quel point n'a t-il pas compris&nbsp;?

source: He did not miss the point of the Open Source movement. That movement does not say users should have freedom, only that allowing more people to look at the source code and help improve it makes for faster and better development. The executive grasped that point completely; unwilling to carry out that approach in full, users included, he was considering implementing it partially, within the company.
fr: Il n'a pas rat&eacute; tout ce qui est habituellement associ&eacute; au terme &laquo;&nbsp;open source&nbsp;&raquo;. Ceci ne dit rien sur la libert&eacute;, mais dit seulement qu'autoriser plus de personnes &agrave; acc&eacute;der au code source et aider &agrave; l'am&eacute;liorer rendra le d&eacute;veloppement plus rapide et plus efficace. Le cadre a compl&egrave;tement assimil&eacute; ce point; en n&eacute;gligeant pour d'autres raisons de conduire cette approche jusqu'&agrave; la fin, en incluant les utilisateurs, il a juste pens&eacute; &agrave; le mettre en &oelig;uvre partiellement, &agrave; l'int&eacute;rieur de l'entreprise.

source: The point that he missed is the point that &ldquo;open source&rdquo; was designed not to raise: the point that users <em>deserve</em> freedom.
fr: Ce qu'il n'a pas compris c'est que l'&laquo;&nbsp;open source&nbsp;&raquo; n'a pas été conçu pour relever que les utilisateurs <em>m&eacute;ritent</em> la libert&eacute;.

source: Spreading the idea of freedom is a big job&mdash;it needs your help. That's why we stick to the term &ldquo;free software&rdquo; in the GNU Project, so we can help do that job. If you feel that freedom and community are important for their own sake&mdash;not just for the convenience they bring&mdash;please join us in using the term &ldquo;free software&rdquo;.
fr: Faire progresser l'id&eacute;e de la libert&eacute; est un gros travail (qui a besoin de votre aide). Le projet GNU s'attachera au terme &laquo;&nbsp;logiciel libre&nbsp;&raquo;. Si vous croyez que la libert&eacute; et la communaut&eacute; sont importantes en tant que telles, pas juste pour la commodit&eacute; qu'elles apportent, rejoignez-nous en utilisant le terme &laquo;&nbsp;logiciel libre&nbsp;&raquo;.

source: Joe Barr wrote an article called <a href="http://www.itworld.com/AppDev/350/LWD010523vcontrol4/">Live and let license</a> that gives his perspective on this issue.
fr: Joe Barr a &eacute;crit un article intitul&eacute; <a href="http://www.itworld.com/AppDev/350/LWD010523vcontrol4/">Live and let license</a> (croissez et faites des licences) qui donne son point de vue sur le probl&egrave;me.

source: Lakhani and Wolf's <a href="http://freesoftware.mit.edu/papers/lakhaniwolf.pdf">paper on the motivation of free software developers</a> says that a considerable fraction are motivated by the view that software should be free. This was despite the fact that they surveyed the developers on SourceForge, a site that does not support the view that this is an ethical issue.
fr: Le <a href="http://freesoftware.mit.edu/papers/lakhaniwolf.pdf">document sur la motivation des d&eacute;veloppeurs de logiciels libres</a> de Lakhani et Wolf, dit qu'une part consid&eacute;rable d'entre eux est motiv&eacute;e par l'id&eacute;e que le logiciel devrait &ecirc;tre libre. Ce, en d&eacute;pit du fait qu'ils ont interrog&eacute; les d&eacute;veloppeurs sur SourceForge, un site qui ne soutient pas l'id&eacute;e qu'il s'agit d'un probl&egrave;me &eacute;thique.

source: This essay is published in <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>.
fr: Cet essai est publi&eacute; dans <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections (or suggestions) to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Benjamin Drieu.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
