Repository: gitGNU/gnu_www-fr
Catalog: philosophy/freedom-*-copyright-old.*.po
Languages: fr

source: Freedom&mdash;or Copyright? - GNU Project - Free Software Foundation (FSF)
fr: La Libert&eacute; ou le Copyright&nbsp;? - GNU Project - Free Software Foundation (FSF)

source: Freedom&mdash;or Copyright?
fr: La Libert&eacute; ou le Copyright&nbsp;?

source: by <strong>Richard M. Stallman</strong>
fr: par <strong>Richard Stallman</strong>

source: The brave new world of e-books: no more used book stores, no more lending a book to your friend, no more borrowing one from the public library, no purchasing a book except with a credit card that identifies what you read. Even reading an e-book without authorization is a crime.
fr: Le meilleur des mondes avec les livres &eacute;lectroniques&nbsp;: plus de magasins de livres d'occasion, plus de pr&ecirc;t de livres &agrave; un ami, plus d'emprunt de livres dans une biblioth&egrave;que publique, plus d'achat de livre sans carte de cr&eacute;dit qui identifie ce que vous lisez. M&ecirc;me lire un livre &eacute;lectronique sans autorisation est un d&eacute;lit.

source: Once upon a time, in the age of the printing press, an industrial regulation was established for the business of writing and publishing. It was called copyright. Copyright's purpose was to encourage the publication of a diversity of written works. Copyright's method was to make publishers get permission from authors to reprint recent writings.
fr: Il &eacute;tait une fois, au temps de la presse papier, la mise en place d'une r&eacute;gulation industrielle sur le march&eacute; de l'&eacute;criture et de l'imprimerie. On l'a appel&eacute;e le copyright. Le but du copyright &eacute;tait d'encourager la publication de la diversit&eacute; des travaux &eacute;crits. Sa m&eacute;thode consistait &agrave; ce que les auteurs donnent leur permission aux &eacute;diteurs de r&eacute;-imprimer leurs travaux r&eacute;cents.

source: Ordinary readers had little reason to disapprove, since copyright restricted only publication, not the things a reader could do. If it raised the price of a book a small amount, that was only money. Copyright provided a public benefit, as intended, with little burden on the public. It did its job well&mdash;back then.
fr: Le lecteur moyen avait peu de raisons de ne pas &ecirc;tre d'accord, &agrave; partir du moment o&ugrave; le copyright se limitait &agrave; la publication, pas &agrave; ce que le lecteur pouvait faire. M&ecirc;me si le prix s'en trouvait l&eacute;g&egrave;rement augment&eacute;, il ne s'agissait que d'argent. Le copyright &eacute;tait b&eacute;n&eacute;fique pour le public, comme pr&eacute;vu, et n'a &eacute;t&eacute; que de peu de charge pour le public. Il remplissait bien son r&ocirc;le alors.

source: Then a new way of distributing information came about: computers and networks. The advantage of digital information technology is that it facilitates copying and manipulating information, including software, musical recordings and books. Networks offered the possibility of unlimited access to all sorts of data&mdash;an information utopia.
fr: Puis une nouvelle fa&ccedil;on de distribuer de l'information est apparue&nbsp;: les ordinateurs et les r&eacute;seaux. L'avantage de la technologie de l'information num&eacute;rique est qu'elle facilite la copie et la manipulation de l'information, qu'il s'agisse de logiciels, de musique ou de livres. Les r&eacute;seaux offrent une possibilit&eacute; d'acc&egrave;s illimit&eacute;e &agrave; toutes sortes d'informations&mdash; une utopie de l'information.

source: But one obstacle stood in the way: copyright. Readers who made use of their computers to share published information were technically copyright infringers. The world had changed, and what was once an industrial regulation on publishers had become a restriction on the public it was meant to serve.
fr: Mais un obstacle se tenait sur le chemin&nbsp;: le copyright. Les lecteurs qui utilisaient leurs ordinateurs pour partager l'information publi&eacute;e &eacute;taient techniquement des contrevenants au copyright. Le monde a chang&eacute; et ce qui avait &eacute;t&eacute; jadis une r&eacute;gulation industrielle est devenu une restriction pour le public, qu'elle &eacute;tait sens&eacute;e servir.

source: In a democracy, a law that prohibits a popular, natural and useful activity is usually soon relaxed. But the powerful publishers' lobby was determined to prevent the public from taking advantage of the power of their computers, and found copyright a suitable weapon. Under their influence, rather than relaxing copyright to suit the new circumstances, governments made it stricter than ever, imposing harsh penalties on readers caught sharing.
fr: Dans une d&eacute;mocratie, une loi qui interdit une activit&eacute; populaire, naturelle et utile est normalement bien vite assouplie. Mais le puissant lobby des &eacute;diteurs &eacute;tait d&eacute;termin&eacute; &agrave; emp&ecirc;cher le public de tirer avantage de leurs ordinateurs et a trouv&eacute; dans le copyright l'arme qu'il fallait. Sous son influence, plut&ocirc;t que d'assouplir le copyright en fonction des nouvelles circonstances, les gouvernements l'ont rendu plus strict que jamais, imposant de rudes p&eacute;nalit&eacute;s aux lecteurs pris en train de partager.

source: But that wasn't the last of it. Computers can be powerful tools of domination when a few people control what other people's computers do. The publishers realized that by forcing people to use specially designated software to watch videos and read e-books, they can gain unprecedented power: they can compel readers to pay, and identify themselves, every time they read a book!
fr: Mais ce n'&eacute;tait pas tout. Les ordinateurs peuvent devenir de puissants outils de domination quand seules quelques personnes contr&ocirc;lent ce que font les ordinateurs des autres. Les &eacute;diteurs ont bien vite compris qu'en for&ccedil;ant les gens &agrave; utiliser des logiciels sp&eacute;cifiques pour regarder des vid&eacute;os et lire des livres &eacute;lectroniques, ils pouvaient gagner un pouvoir sans pr&eacute;c&eacute;dent&nbsp;: astreindre les gens &agrave; payer et &agrave; s'identifier eux-m&ecirc;mes &agrave; chaque fois qu'ils liraient un livre&nbsp;!

source: That is the publishers' dream, and they prevailed upon the U.S. government to enact the Digital Millennium Copyright Act of 1998. This law gives them total legal power over almost anything a reader might do with an e-book, as long as they publish the book in encrypted form. Even reading the book without authorization is a crime.
fr: Le r&ecirc;ve pour les &eacute;diteurs, qui ont pouss&eacute; le gouvernement am&eacute;ricain &agrave; voter le Digital Millennium Copyright Act (DMCA) en 1998. Cette loi donne aux &eacute;diteurs un pouvoir l&eacute;gal absolu sur tout ce que pourrait faire un lecteur avec un livre &eacute;lectronique, tant qu'ils publient le livre sous forme chiffr&eacute;e. M&ecirc;me le lire sans autorisation est un d&eacute;lit&nbsp;!

source: We still have the same old freedoms in using paper books. But if e-books replace printed books, that exception will do little good. With &ldquo;electronic ink&rdquo;, which makes it possible to download new text onto an apparently printed piece of paper, even newspapers could become ephemeral. Imagine: no more used book stores; no more lending a book to your friend; no more borrowing one from the public library&mdash;no more &ldquo;leaks&rdquo; that might give someone a chance to read without paying. (And judging from the ads for Microsoft Reader, no more anonymous purchasing of books either.) This is the world publishers have in mind for us.
fr: Nous avons toujours les m&ecirc;mes vieilles libert&eacute;s avec les livres imprim&eacute;s. Mais si les livres &eacute;lectroniques remplacent un jour les livres imprim&eacute;s, cette exception sera pratiquement inutile. Avec &laquo;l'encre &eacute;lectronique&raquo;, qui permet de t&eacute;l&eacute;charger un nouveau texte sur ce qui pourrait passer pour du papier imprim&eacute;, m&ecirc;mes les journaux deviendraient &eacute;ph&eacute;m&egrave;res. Imaginez&nbsp;: plus de bouquinistes, plus de pr&ecirc;ts de livres &agrave; un ami, plus de pr&ecirc;ts &agrave; la biblioth&eacute;que publique&mdash; plus aucune chance de lire sans payer (et si on s'en r&eacute;f&egrave;re aux publicit&eacute;s pour Microsoft Reader, plus d'acquisitions anonymes de livres non plus). C'est l&agrave; le monde que les &eacute;diteurs ont en t&ecirc;te pour nous.

source: Why is there so little public debate about these momentous changes? Most citizens have not yet had occasion to come to grips with the political issues raised by this futuristic technology. Besides, the public has been taught that copyright exists to &ldquo;protect&rdquo; the copyright holders, with the implication that the public's interests do not count. (The biased term &ldquo;<a href="/philosophy/not-ipr.html"> intellectual property</a>&rdquo; also promotes that view; in addition, it encourages the mistake of trying to treat several laws that are almost totally different&mdash;such as copyright law and patent law&mdash;as if they were a single issue.)
fr: Pourquoi y a-t-il aussi peu de d&eacute;bats publics autour de ces changements d'importance&nbsp;? La plupart des citoyens n'ont pas encore eu l'occasion de prendre pied dans les int&eacute;r&ecirc;ts politiques n&eacute;s de cette technologie futuriste. De plus, le public a &eacute;t&eacute; berc&eacute; par l'enseignement de ce que le copyright &laquo;prot&egrave;ge&raquo; les d&eacute;tenteurs du copyright, avec comme implication que les int&eacute;r&ecirc;ts publics ne comptent pas. (Le terme trompeur &laquo;&nbsp;<a href="not-ipr.fr.html"> propri&eacute;t&eacute; intellectuelle</a>&nbsp;&raquo; alimente aussi cette vision&nbsp;; de plus, il encourage l'erreur d'essayer de traiter plusieurs lois qui sont presque totalement diff&eacute;rentes&mdash;comme la loi sur le copyright et la loi sur les brevets&mdash;comme un seul et m&ecirc;me probl&egrave;me).

source: But when the public at large begins to use e-books, and discovers the regime that the publishers have prepared for them, they will begin to resist. Humanity will not accept this yoke forever.
fr: Mais quand le public dans sa majorit&eacute; commencera &agrave; utiliser les livres &eacute;lectroniques et qu'il d&eacute;couvrira le r&eacute;gime que les &eacute;diteurs ont concoct&eacute; pour lui, il commencera &agrave; entrer dans la r&eacute;sistance. L'Humanit&eacute; n'acceptera pas ce joug <em>ad vitam aeternam</em>.

source: The publishers would have us believe that suppressive copyright is the only way to keep art alive, but we do not need a War on Copying to encourage a diversity of published works; as the Grateful Dead showed, private copying among fans is not necessarily a problem for artists. (In 2007, Radiohead made millions by inviting fans to copy an album and pay whatever amount they wish; a few years before, Stephen King got hundreds of thousands for an e-book which people could copy.) By legalizing the copying of e-books among friends, we can turn copyright back into the industrial regulation it once was.
fr: Les &eacute;diteurs aimeraient que l'on croit qu'un copyright r&eacute;pressif est la seule fa&ccedil;on de garder l'art en vie, mais nous n'avons pas besoin d'une Guerre du Copyright pour encourager la diversit&eacute; des travaux publi&eacute;s&nbsp;: comme l'a montr&eacute; Grateful Dead, la copie priv&eacute;e au sein des fans n'est pas forc&eacute;ment un probl&egrave;me pour les artistes. (En 2007, Radiohead a gagn&eacute; des millions en invitant ses fans &agrave; copier un album et &agrave; payer le montant qu'ils voulaient&nbsp;; quelques ann&eacute;es auparavant, Stephen King a gagn&eacute; des centaines de milliers de dollars pour un livre &eacute;lectronique que les gens pouvaient copier). En l&eacute;galisant la copie de livres &eacute;lectroniques entre amis, nous pouvons transformer le copyright en ce qu'il fut, une r&eacute;gulation industrielle.

source: For some kinds of writing, we should go even further. For scholarly papers and monographs, everyone should be encouraged to republish them verbatim online; this helps protect the scholarly record while making it more accessible. For textbooks and most reference works, publication of modified versions should be allowed as well, since that encourages improvement.
fr: Pour certains types d'&eacute;crits, nous devrions m&ecirc;me aller plus loin. Pour les livres scolaires et les monographies, tout le monde devrait &ecirc;tre encourag&eacute; &agrave; les reproduire en ligne mot pour mot; cela aide &agrave; prot&eacute;ger la litt&eacute;rature scolaire tout en la rendant plus accessible. Pour ce qui est des manuels et de la plupart des travaux de r&eacute;f&eacute;rence, la publication de versions modifi&eacute;es devrait elle aussi &ecirc;tre permise, dans la mesure o&ugrave; cela encourage les am&eacute;liorations.

source: Eventually, when computer networks provide an easy way to send someone a small amount of money, the whole rationale for restricting verbatim copying will go away. If you like a book, and a box pops up on your computer saying &ldquo;Click here to give the author one dollar&rdquo;, wouldn't you click? Copyright for books and music, as it applies to distributing verbatim unmodified copies, will be entirely obsolete. And not a moment too soon!
fr: Finalement, quand les r&eacute;seaux informatiques permettront de faire transiter de petites sommes d'argent, l'argumentation enti&egrave;re de la restriction de la copie textuelle s'&eacute;vaporera. Si vous aimez un livre et qu'un menu contextuel vous invite &agrave; &laquo;&nbsp;cliquer ici pour envoyer un dollar &agrave; l'auteur&nbsp;&raquo;, ne cliqueriez-vous pas? Le copyright sur les livres et la musique, comme il s'applique aujourd'hui &agrave; la distribution de copies textuelles non modifi&eacute;es, deviendra compl&egrave;tement obsol&egrave;te. Et plus vite qu'on ne le croit&nbsp;!

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 1999, 2008 Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 1999, 2008 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Pierre-Yves Enderlin.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
