Repository: gitGNU/gnu_www-fr
Catalog: philosophy/free-world.*.po
Languages: fr

source: Only the Free World Can Stand Up to Microsoft
fr: Seul le monde libre peut r&eacute;sister &agrave; Microsoft

source: by <strong>Tom Hull</strong>
fr: par <strong>Tom Hull</strong>

source: This article is part of our section of <a href="/philosophy/philosophy.html#ThirdPartyIdeas">Third Party Ideas</a>.
fr: Cet article est une partie de notre section <a href="/philosophy/philosophy.fr.html#ThirdPartyIdeas">Id&eacute;es de tierces personnes</a>.

source: The reproduction and distribution cost of software is zero at the margin. This means that in theory it is no more expensive to produce software which can be freely distributed and used by everybody than it is to produce software for a limited clientele.
fr: Le co&ucirc;t de reproduction et de distribution des logiciels est proche de z&eacute;ro. Ce qui signifie, qu'en th&eacute;orie, il n'est pas plus co&ucirc;teux de produire des logiciels qui peuvent &ecirc;tre librement distribu&eacute;s et utilis&eacute;s par n'importe qui que de produire des logiciels pour une client&egrave;le limit&eacute;e.

source: The pricing of software bears no relationship to the cost of its development. The two factors that do matter are market size (which is limited by price and utility) and competition. Given a market for a software product, the maximum margin can be obtained by precluding or eliminating competition.
fr: Le prix du logiciel n'a aucun rapport avec le co&ucirc;t de son d&eacute;veloppement. Les deux facteurs qui comptent vraiment sont la taille du march&eacute; (qui est limit&eacute; par le prix et l'utilit&eacute; du logiciel) et la comp&eacute;tition. Pour un march&eacute; d'un logiciel donn&eacute;, la marge maximum peut &ecirc;tre obtenue en excluant ou en &eacute;liminant la comp&eacute;tition.

source: Software companies that are able to thwart competition attain pinnacles of power which are inconceivable in other industries. Partly this is due to the enormous cash flows that are possible in the absence of competition from products with nil reproduction costs, but largely it is due to the complexity of software itself, which allows dominant companies to design &ldquo;standards&rdquo; which exclude future competition.
fr: Les &eacute;diteurs de logiciels qui sont capables de contrecarrer la comp&eacute;tition atteignent des sommets de pouvoir qui sont inconcevables dans les autres industries. C'est d&ucirc; en partie &agrave; l'&eacute;norme chiffre d'affaires qui est possible en l'absence de concurrents de produits dont le co&ucirc;t de reproduction est nul, mais aussi c'est largement d&ucirc; &agrave; la complexit&eacute; du logiciel lui-m&ecirc;me, qui permet &agrave; des entreprises dominantes de cr&eacute;er des «&nbsp;standards&nbsp;» qui excluent la comp&eacute;tition future.

source: All niche markets for software rapidly evolve toward monopoly or an equilibrium where a small number of players tacitly agree not to mutually destroy their profits. (Established companies can defend their market share by reducing their prices to practically nothing, making price competition suicidal for newcomers.) However, there are cases of asymetrical competition, where a large company with other sources of income can destroy a smaller company that depends on a single niche revenue stream.
fr: Pour le logiciel, tous les march&eacute;s de niche &eacute;voluent rapidement vers un monopole ou un &eacute;quilibre mutuel o&ugrave; un petit nombre d'acteurs se mettent d'accord tacitement afin de ne pas d&eacute;truire leurs profits respectifs (les entreprises &eacute;tablies peuvent d&eacute;fendre leurs parts de march&eacute; en r&eacute;duisant leurs prix &agrave; pratiquement rien, rendant la comp&eacute;tition sur le prix suicidaire pour les nouveaux arrivants). Cependant, il y a des cas de comp&eacute;tition asym&eacute;trique, o&ugrave; un grand nombre d'entreprises avec d'autres sources de revenus peuvent d&eacute;truire une plus petite entreprise qui d&eacute;pend d'une seule source de revenus.

source: Microsoft has a secure revenue stream based on its dominant position in personal computer operating systems software, and uses the power inherent in that position to favor its other business activities with its ability to dictate &ldquo;standards&rdquo; and to undermine competition, especially where power (as opposed to mere money) is at stake.
fr: Microsoft a une source de revenus solide bas&eacute;e sur sa position dominante dans le march&eacute; des syst&egrave;mes d'exploitation pour ordinateurs personnels, et utilise le pouvoir inh&eacute;rent &agrave; cette position pour favoriser ses autres activit&eacute;s marchandes, gr&acirc;ce &agrave; sa possibilit&eacute; de dicter des «&nbsp;standards&nbsp;» et de saper la comp&eacute;tition, sp&eacute;cialement quand le pouvoir (et non pas l'argent seul) est en jeu.

source: Capitalists invest in new software ventures with the hope of gaining a dominant position in a new niche market. There is essentially no new investment in existing niche markets, since it is impossible to compete with an established dominant player on the basis of lower costs and the possible gains of an uphill battle for a small share of a shrinking pie rarely justify the risks. In their wildest dreams these capitalists want nothing so much as to be just like Microsoft.
fr: Les capitalistes investissent dans les nouvelles entreprises de logiciel avec l'espoir de gagner une position dominante dans un nouveau march&eacute; de niche. Il n'y a essentiellement pas de nouveaux investissements dans un march&eacute; de niche existant, car il est impossible d'entrer en comp&eacute;tition avec un acteur dominant &eacute;tabli sur la base de co&ucirc;ts plus bas. De plus, les gains potentiels d'une bataille difficile pour une petite part d'un g&acirc;teau qui s'amenuise justifient rarement les risques. Dans leurs r&ecirc;ves les plus fous, ces capitalistes ne veulent rien plus que devenir exactement comme Microsoft.

source: The drive to restrain Microsoft under the rubric of antitrust law seems mostly to be the effort of companies who find their own power positions threatened by Microsoft's activities. They seek to make it harder for Microsoft to undermine their own businesses. However, they are fundamentally similar to Microsoft in that they don't question a world where technology companies working from private caches of intellectual property are able to control the use of that technology for their own best profit.
fr: La campagne pour placer Microsoft sous le coup de la loi antitrust semble majoritairement &ecirc;tre l'effort d'entreprises qui trouvent leur propre pouvoir menac&eacute; par les activit&eacute;s de Microsoft. Ils cherchent &agrave; rendre plus difficile la sape de leur propre activit&eacute; par Microsoft, mais cependant, ils sont fondamentalement identiques &agrave; Microsoft car ils ne remettent pas en question un monde o&ugrave; les entreprises de technologie travaillant &agrave; partir de capitalisation de propri&eacute;t&eacute; intellectuelle sont capables de contr&ocirc;ler l'utilisation de cette technologie pour leur propre profit maximal.

source: In the market equation, demand is equal to, and in many ways the master of, production. Yet in the world we live in, production is highly organized and efficient and commands enormous financial resources and seductive powers of persuasion, while demand is fragmented, uninformed, and powerless. While consumers can still kill a product that they have no desire for, they are nearly powerless to direct or even influence the detailed designs of those products. For software products, consumers can only choose among a given set of alternatives, which are extremely complex, dauntingly impenetrable, and generally designed more for the company's anticompetitive purposes than for the user's tasks. (Even the old fashioned option of doing without is often impossible due to the intricate web of interdependencies as new hardware and software march in lock step into the future.)
fr: Dans l'&eacute;quation du march&eacute;, la demande est &eacute;gale &agrave; la production et de beaucoup de fa&ccedil;ons, son ma&icirc;tre. Encore que dans le monde dans lequel nous vivons, la production est tr&egrave;s organis&eacute;e, efficace et commande &agrave; d'&eacute;normes ressources financi&egrave;res et des pouvoirs s&eacute;duisants de persuasion, alors que la demande est fragment&eacute;e, mal inform&eacute;e et passive. M&ecirc;me si les consommateurs peuvent toujours tuer un produit pour lequel ils n'ont pas de d&eacute;sir, ils sont presque passifs pour diriger ou m&ecirc;me influencer la conception d&eacute;taill&eacute;e de ces produits. Pour les produits logiciels, les consommateurs peuvent seulement choisir parmi un ensemble donn&eacute; d'alternatives, qui sont extr&ecirc;mement complexes, d&eacute;sesp&eacute;r&eacute;ment imp&eacute;n&eacute;trables et g&eacute;n&eacute;ralement con&ccedil;ues plus pour les desseins anticomp&eacute;titifs de l'entreprise que pour les besoins de l'utilisateur (m&ecirc;me l'option d&eacute;mod&eacute;e de faire sans est souvent impossible en raison de l'inextricable entrelacement d'interd&eacute;pendances au fur et &agrave; mesure que la marche forc&eacute;e de nouveaux mat&eacute;riels et logiciels nous entra&icirc;ne inexorablement vers le futur.

source: The real &ldquo;killer software&rdquo; is free software: software that is free of intellectual property claims; that is published in source code form, so can be inspected, evaluated, fixed and enhanced by anyone with a mind to do so; that is freely distributed and can be installed on machines and used without limit. Free software is the software that kills the closed, nefarious software product industry. It is software that users can select intelligently, to do today's tasks, and which they can collaboratively build on to handle future needs. Free software is the one thing that not even Microsoft can compete with.
fr: Le seul vrai &#171;&nbsp;logiciel qui tue&nbsp;&#187; est le logiciel libre&nbsp;: le logiciel libre de revendication de propri&eacute;t&eacute; intellectuelle, qui est publi&eacute; sous forme de code source, qui peut &ecirc;tre inspect&eacute;, &eacute;valu&eacute;, corrig&eacute; et am&eacute;lior&eacute; par tout le monde ayant l'envie de le faire, qui est distribu&eacute; librement et qui peut &ecirc;tre install&eacute; sur autant de machines que d&eacute;sir&eacute; et utilis&eacute; sans limites. Le logiciel libre est le logiciel qui tue l'industrie des produits ferm&eacute;s et sc&eacute;l&eacute;rats. Ce sont des logiciels que les utilisateurs peuvent s&eacute;lectionner intelligemment pour remplir les besoins d'aujourd'hui et qui peuvent &ecirc;tre con&ccedil;us de mani&egrave;re collective pour r&eacute;pondre &agrave; des besoins futurs. Le logiciel libre est la seule chose avec qui m&ecirc;me Microsoft ne peut pas rivaliser.

source: Still, there is one core problem: who pays for developing free software? The usual answer &mdash; which leads to all of the trouble above &mdash; is that investors pay for development, which they recover from their profits. The only real answer is that development costs must be paid for by users. The key point here is that what is paid for is not the distribution or use of the software, but its development, and that the development of free software implies that it can be used by anyone. I think there is a simple way to handle this: anyone who wants a piece of software developed or enhanced posts a &ldquo;request-for-proposal,&rdquo; including a sum that the requester is willing to contribute towards its development. Intermediary organizations can pool these requests, and interested parties can up the ante. Developers can then search through the current postings and bid on development work or work on spec. Developers can also post their own proposals, which users can then buy into.
fr: Cependant, il y a un probl&egrave;me fondamental&nbsp;: qui paye pour d&eacute;velopper des logiciels libres&nbsp;? La r&eacute;ponse habituelle, qui m&egrave;ne &agrave; tous les probl&egrave;mes d&eacute;crits ci-dessus, est que des investisseurs payent pour le d&eacute;veloppement, qu'ils r&eacute;cup&egrave;rent pour leur profit. La seule r&eacute;elle r&eacute;ponse est que les co&ucirc;ts de d&eacute;veloppement doivent &ecirc;tre pay&eacute;s par les utilisateurs eux-m&ecirc;mes. Le point crucial est ici que ce pourquoi on paye, n'est pas la distribution ou l'utilisation du logiciel, mais son d&eacute;veloppement. Et ce d&eacute;veloppement de logiciel libre implique que tout le monde puisse l'utiliser. Je pense qu'il y a une mani&egrave;re simple de le g&eacute;rer&nbsp;: tous ceux qui veulent voir un logiciel d&eacute;velopp&eacute; ou am&eacute;lior&eacute; postent une &#171;&nbsp;requ&ecirc;te de projet&nbsp;&#187; incluant une somme pour contribuer &agrave; son d&eacute;veloppement. Des organisations interm&eacute;diaires peuvent mettre en commun ces requ&ecirc;tes et des parties int&eacute;ress&eacute;es peuvent placer la barre plus haut. Les d&eacute;veloppeurs peuvent alors effectuer des recherches &agrave; travers les demandes et effectuer des ench&egrave;res sur le travail de d&eacute;veloppement ou travailler sur les sp&eacute;cifications. Les d&eacute;veloppeurs peuvent aussi poster leurs propres propositions que les utilisateurs peuvent alors acheter.

source: Free software can be developed less expensively than closed software products. Even for well paid professional developers, fully underwritten by conscientious users, the cost of free software would be significantly less than the premiums now being paid for empire building. The quality would be better, especially in terms of fitness for use. Free distribution would ensure maximum exposure and choice: a free market based purely on utility and quality. The service component of software would also open up: anyone who wanted to could start from the same code, to learn, support, and teach. The best service providers would succeed.
fr: Le logiciel libre peut &ecirc;tre d&eacute;velopp&eacute; pour moins cher que les produits logiciels ferm&eacute;s. M&ecirc;me pour des professionnels du d&eacute;veloppement bien pay&eacute;es, enti&egrave;rement financ&eacute;s par des utilisateurs consciencieux, le co&ucirc;t du logiciel libre serait significativement inf&eacute;rieur que les primes aujourd'hui pay&eacute;s &agrave; la construction d'un empire. La qualit&eacute; serait meilleure, tout sp&eacute;cialement en termes d'ad&eacute;quation d'utilisation. La libre distribution assurerait une couverture et un choix maximum&nbsp;: un march&eacute; libre bas&eacute; purement sur l'utilit&eacute; et la qualit&eacute;. La composante du service sur les logiciels s'ouvrirait aussi&nbsp;: tous ceux qui le voudraient pourraient commencer &agrave; partir du m&ecirc;me code &agrave; apprendre, offrir du support et enseigner. Les meilleurs fournisseurs de service auraient du succ&egrave;s.

source: Simple steps can get this movement underway: Form an initial organization to sort out the technical issues, suggest working arrangements, study the economics, hack out a legal framework, seed and coordinate the requests, and canvas for initial technology contributions (including the large body of currently available freeware), do some evangelical work. Urge large companies and organizations to budget a small fraction of their annual software outlays for proposals. Set up a review group for intellectual property issues, challenge dubious claims, and investigate the feasibility of buying and releasing rights to valid claims. Encourage the development of more local organizations &mdash; local to place, to industry, to niche, to taste &mdash; with the initial group breaking up or fading away: common methods and procedures, but no centralized control.
fr: Des &eacute;tapes simples peuvent mettre ce mouvement en route&nbsp;: formons une organisation initiale pour classer les probl&egrave;mes techniques, sugg&eacute;rer des arrangements de travail, &eacute;tudier l'&eacute;conomie, esquisser un cadre l&eacute;gal, faire germer et coordonner les requ&ecirc;tes et chercher des contributions initiales (en incluant le corps &eacute;norme de logiciels libres d&eacute;j&agrave; disponibles), effectuer un peu de travail d'&eacute;vang&eacute;lisation. Demander &agrave; de grosses entreprises et &agrave; des organisations de budg&eacute;tiser une petite fraction de leurs d&eacute;penses de logiciels pour des propositions. Mettre en place un groupe d'&eacute;tude de probl&egrave;mes sur la propri&eacute;t&eacute; intellectuelle, contester les revendications douteuses et enqu&ecirc;ter sur la faisabilit&eacute; de l'achat et de la lib&eacute;ration de droits pour valider des revendications. Encourager le d&eacute;veloppement d'organisations plus locales, locales g&eacute;ographiquement, &agrave; une industrie, une niche, un go&ucirc;t, avec le groupe initial se s&eacute;parant ou s'affaiblissant&nbsp;: des m&eacute;thodes et des proc&eacute;dures communes, mais pas de contr&ocirc;le centralis&eacute;.

source: Let's call this organization, this whole framework, &ldquo;The Free World.&rdquo; It stands for free and open knowledge, free and open development, software that works for you. Take a stand. Make a contribution. You have nothing to lose but <kbd>CTL-ALT-DEL</kbd>.
fr: Appelons cette organisation, le cadre entier, &#171;&nbsp;Le Monde Libre&nbsp;&#187;. Cela signifie une connaissance libre et ouverte, un d&eacute;veloppement libre et ouvert, des logiciels qui travaillent pour vous. Faites une pause. Contribuez. Vous n'avez rien &agrave; perdre &agrave; part Ctrl-Alt-Del.

source: Additional notes can be found at <a href="/philosophy/free-world-notes.html"> http://www.gnu.org/philosophy/free-world-notes.html</a>.
fr: Vous trouverez des notes suppl&eacute;mentaires sur&nbsp;: <a href="/philosophy/free-world-notes.html">http://www.gnu.org/philosophy/free-world-notes.html</a>.

source: Please send questions and comments regarding this specific page to Tom Hull <a href="mailto:ftwalk@contex.com">&lt;ftwalk@contex.com&gt;</a>.
fr: Veuillez envoyer les questions et commentaire concernant cette page à Tom Hull <a href="mailto:ftwalk@contex.com">&lt;ftwalk@contex.com&gt;</a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 1997 Tom Hull <br />You may link to this document and/or redistribute it electronically.
fr: Copyright &copy; 1997 Tom Hull <br />Vous pouvez faire des liens vers ce document et/ou le redistribuer électroniquement.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: ?<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
