Repository: gitGNU/gnu_www-fr
Catalog: philosophy/free-*.*.po
Languages: fr

source: Finally, note that criteria such as those stated in this free software definition require careful thought for their interpretation. To decide whether a specific software license qualifies as a free software license, we judge it based on these criteria to determine whether it fits their spirit as well as the precise words. If a license includes unconscionable restrictions, we reject it, even if we did not anticipate the issue in these criteria. Sometimes a license requirement raises an issue that calls for extensive thought, including discussions with a lawyer, before we can decide if the requirement is acceptable. When we reach a conclusion about a new issue, we often update these criteria to make it easier to see why certain licenses do or don't qualify.
fr: Enfin, notez que les critères tels que ceux développés dans cette définition du logiciel libre demandent une réflexion sérieuse quant à leur interprétation. Pour décider si une licence de logiciel particulière est définie comme libre, nous la jugeons sur ces critères pour déterminer si elle convient à leur esprit tout comme à leur formulation précise. Si une licence inclut des restrictions inacceptables, nous la rejetons même si nous n'avons pas anticipé le problème dans ces critères. Quelquefois les conditions d'une licence soulèvent un problème qui nécessite des réflexions intenses, y compris des discussions avec un juriste, avant que nous puissions décider si la condition est acceptable. Quand nous arrivons à une conclusion concernant un nouveau problème, nous mettons souvent à jour ces critères pour rendre plus facile le fait de savoir si une licence est une licence logicielle libre ou non.

source: If you are interested in whether a specific license qualifies as a free software license, see our <a href="/licenses/license-list.html">list of licenses</a>. If the license you are concerned with is not listed there, you can ask us about it by sending us email at <a href="mailto:licensing@gnu.org">&lt;licensing@gnu.org&gt;</a>.
fr: Si vous voulez savoir si une licence spécifique est définie comme «&nbsp;libre&nbsp;», reportez-vous à notre <a href="/licenses/license-list.fr.html">liste de licences</a>. Si la licence qui vous intéresse n'y est pas listée, vous pouvez nous demander des précisions en nous envoyant un mail à <a href="mailto:licensing&#64;gnu.org">&lt;licensing&#64;gnu.org&gt;</a>.

source: If you are contemplating writing a new license, please contact the Free Software Foundation first by writing to that address. The proliferation of different free software licenses means increased work for users in understanding the licenses; we may be able to help you find an existing free software license that meets your needs.
fr: Si vous envisagez d'écrire une nouvelle licence, veuillez contacter la Free Software Foundation d'abord, en écrivant à cette adresse. La prolifération de différentes licences de logiciels libres implique un travail grandissant pour les utilisateurs dans la compréhension des licences&nbsp;; nous pouvons vous aider à trouver une licence existante de logiciel libre qui réponde à vos besoins.

source: If that isn't possible, if you really need a new license, with our help you can ensure that the license really is a free software license and avoid various practical problems.
fr: Si ce n'est pas possible, si vous avez vraiment besoin d'une nouvelle licence, avec notre aide, vous pouvez vous assurer que la licence est vraiment une licence de logiciel libre et éviter divers problèmes pratiques.

source: Beyond Software
fr: Au-delà du logiciel

source: <a href="/philosophy/free-doc.html">Software manuals must be free</a>, for the same reasons that software must be free, and because the manuals are in effect part of the software.
fr: Les <a href="/philosophy/free-doc.fr.html">manuels de logiciels doivent être libres</a>, pour les mêmes raisons que les logiciels doivent être libres, et parce que les manuels font en effet partie des logiciels.

source: The same arguments also make sense for other kinds of works of practical use &mdash; that is to say, works that embody useful knowledge, such as educational works and reference works. <a href="http://wikipedia.org">Wikipedia</a> is the best-known example.
fr: Les mêmes arguments peuvent aussi s'appliquer à d'autres types de travaux à usage pratique &mdash; c'est-à-dire, des travaux qui intègrent de la connaissance utile, tels que les ouvrages éducatifs et les ouvrages de référence. <a href="http://wikipedia.org">Wikipedia</a> est le meilleur exemple connu.

source: Any kind of work <em>can</em> be free, and the definition of free software has been extended to a definition of <a href="http://freedomdefined.org/"> free cultural works</a> applicable to any kind of works.
fr: Tout type d'&oelig;uvre <em>peut</em> être libre, et la définition du logiciel libre a été étendu à la définition des <a href="http://freedomdefined.org/">&oelig;uvres culturelles libres</a> applicable à tout type d'&oelig;uvre.

source: Open Source?
fr: Open Source&nbsp;?

source: Another group has started using the term &ldquo;open source&rdquo; to mean something close (but not identical) to &ldquo;free software.&rdquo; We prefer the term &ldquo;free software&rdquo; because, once you have heard that it refers to freedom rather than price, it calls to mind freedom. The word &ldquo;open&rdquo; <a href="/philosophy/open-source-misses-the-point.html"> never refers to freedom</a>.
fr: Un autre groupe a commencé à utiliser le terme «&nbsp;open source&nbsp;» pour exprimer quelque chose de proche (mais pas d'identique) au «&nbsp;logiciel libre&nbsp;». Nous préférons le terme «&nbsp;logiciel libre&nbsp;» parce que, une fois que vous avez entendu que ce terme réfère à la liberté plutôt qu'au prix, il appelle à prêter attention à la liberté. Le mot «&nbsp;open&nbsp;» <a href="/philosophy/open-source-misses-the-point.fr.html">ne renvoie pas à la liberté</a>.

source: History
fr: Histoire

source: From time to time we revise this Free Software Definition to clarify it. Here we provide a list of those modifications, along with links to illustrate exactly what changed, so that others can review them if they like.
fr: De temps en temps, nous révisons la définition du logiciel libre pour la clarifier. Nous fournissons ici une liste de ces modifications, ainsi que les liens pour illustrer exactement ce qui a changé, de sorte que d'autres puissent l'examiner s'ils le désirent.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.91&amp;r2=1.92">Version 1.92</a>: Clarify that obfuscated code does not qualify as source code.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.91&amp;r2=1.92">Version 1.92</a>&nbsp;: Clarifie que le code rendu illisible (<em>obfuscated</em>) n'est pas considéré comme du code source.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.89&amp;r2=1.90">Version 1.90</a>: Clarify that freedom 3 means the right to distribute copies of your own modified or improved version, not a right to participate in someone else's development project.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.89&amp;r2=1.90">Version 1.90</a>&nbsp;: Clarifie que la liberté 3 signifie le droit de redistribuer des copies de sa propre version modifiée ou améliorée, et pas le droit de participer au développement d'un projet d'un tiers.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.88&amp;r2=1.89">Version 1.89</a>: Freedom 3 includes the right to release modified versions as free software.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.88&amp;r2=1.89">Version 1.89</a>&nbsp;: la liberté 3 inclut le droit de distribuer des versions modifiées en tant que logiciel libre.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.79&amp;r2=1.80">Version 1.80</a>: Freedom 1 must be practical, not just theoretical; i.e., no tivoization.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.79&amp;r2=1.80">Version 1.80</a>&nbsp;: la liberté 1 doit être pratique, pas seulement théorique&nbsp;; c'est-à-dire, pas de tivoïsation.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.76&amp;r2=1.77">Version 1.77</a>: Clarify that all retroactive changes to the license are unacceptable, even if it's not described as a complete replacement.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.76&amp;r2=1.77">Version 1.77</a>&nbsp;: clarifie que tout changement rétroactif de la licence est inacceptable, même si ce n'est pas décrit comme un remplacement complet.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.73&amp;r2=1.74">Version 1.74</a>: Four clarifications of points not explicit enough, or stated in some places but not reflected everywhere:
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.73&amp;r2=1.74">Version 1.74</a>&nbsp;: Clarification de quatre points pas assez explicites, ou mentionnés dans divers endroits mais pas reportés partout&nbsp;:

source: "Improvements" does not mean the license can substantively limit what kinds of modified versions you can release. Freedom 3 includes distributing modified versions, not just changes.
fr: «&nbsp;Améliorations&nbsp;» ne signifie pas que la licence peut de façon substantielle limiter le type de versions modifiées que vous pouvez publier. La liberté&nbsp;3 comprend la distribution de versions modifiées, pas seulement des changements.

source: The right to merge in existing modules refers to those that are suitably licensed.
fr: Le droit de fusionner dans des modules existants se réfère à ceux qui sont sous licence appropriée.

source: Explicitly state the conclusion of the point about export controls.
fr: Déclare explicitement la conclusion sur le point parlant des contrôles à l'exportation.

source: Imposing a license change constitutes revoking the old license.
fr: Imposer un changement de licence constitue une révocation de l'ancienne licence.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.56&amp;r2=1.57">Version 1.57</a>: Add &quot;Beyond Software&quot; section.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.56&amp;r2=1.57">Version 1.57</a>&nbsp;: Ajout de la section «&nbsp;Au-delà du logiciel&nbsp;».

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.45&amp;r2=1.46">Version 1.46</a>: Clarify whose purpose is significant in the freedom to run the program for any purpose.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.45&amp;r2=1.46">Version 1.46</a>&nbsp;: Clarification des buts significatifs dans la liberté d'exécuter un programme dans n'importe quel but.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.40&amp;r2=1.41">Version 1.41</a>: Clarify wording about contract-based licenses.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.40&amp;r2=1.41">Version 1.41</a>&nbsp;: Clarification de la formulation au sujet des licences basées sur des contrats.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.39&amp;r2=1.40">Version 1.40</a>: Explain that a free license must allow to you use other available free software to create your modifications.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.39&amp;r2=1.40">Version 1.40</a>&nbsp;: Explication qu'une licence libre doit vous autoriser à utiliser d'autres logiciels libres disponibles pour créer vos modifications.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.38&amp;r2=1.39">Version 1.39</a>: Note that it is acceptable for a license to require you to provide source for versions of the software you put into public use.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.38&amp;r2=1.39">Version 1.39</a>&nbsp;: Note qu'il est acceptable pour une licence de nécessiter que vous produisiez les sources des versions de logiciels mis à disposition au publiquement.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.30&amp;r2=1.31">Version 1.31</a>: Note that it is acceptable for a license to require you to identify yourself as the author of modifications. Other minor clarifications throughout the text.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.30&amp;r2=1.31">Version 1.31</a>&nbsp;: Note qu'il est acceptable pour une licence de nécessiter de vous identifier en tant qu'auteur de modifications. D'autres clarifications mineures dans le texte.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.22&amp;r2=1.23">Version 1.23</a>: Address potential problems related to contract-based licenses.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.22&amp;r2=1.23">Version 1.23</a>&nbsp;: Adresse les problèmes potentiels relatifs aux licences basées sur des contrats.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.15&amp;r2=1.16">Version 1.16</a>: Explain why distribution of binaries is important.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.15&amp;r2=1.16">Version 1.16</a>&nbsp;: Explique pourquoi la distribution de binaires est importante.

source: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.10&amp;r2=1.11">Version 1.11</a>: Note that a free license may require you to send a copy of versions you distribute to the author.
fr: <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;r1=1.10&amp;r2=1.11">Version 1.11</a>&nbsp;: Note qu'une licence libre peut nécessiter que vous envoyiez une copie des versions que vous distribuez à l'auteur.

source: There are gaps in the version numbers because there are many other changes that do not affect the substance of the definition at all. Instead, they fix links, add translations, and so on. If you would like to review the complete list of changes, you can do so on our <a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;view=log">cvsweb interface</a>.
fr: Il y a des espaces entre les numéros de versions car il y a eu beaucoup d'autres changements qui n'affectent pas du tout l'essence de la définition. Ils corrigent plutôt des liens, ajoutent des traductions, etc. Si vous voulez consulter la liste intégrale des changements, vous pouvez le faire sur l'<a href="http://web.cvs.savannah.gnu.org/viewvc/www/philosophy/free-sw.html?root=www&amp;view=log">interface cvsweb</a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.

source: Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
fr: Cette page peut-être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Karl Pradène.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
