Repository: gitGNU/gnu_www-fr
Catalog: philosophy/free-doc.*.po
Languages: fr

source: Free Software and Free Manuals - GNU Project - Free Software Foundation (FSF)
fr: Logiciels et manuels libres - GNU Project - Free Software Foundation (FSF)

source: Free Software and Free Manuals
fr: Logiciels et manuels libres

source: <a href="/copyleft/fdl.html">The GNU Free Documentation License</a>
fr: La <a href="/copyleft/fdl.html">Licence pour la Documentation Libre GNU</a> (GNU Free Documentation License)

source: The biggest deficiency in free operating systems is not in the software&mdash;it is the lack of good free manuals that we can include in these systems. Many of our most important programs do not come with full manuals. Documentation is an essential part of any software package; when an important free software package does not come with a free manual, that is a major gap. We have many such gaps today.
fr: Le plus grand d&eacute;faut des syst&egrave;mes d'exploitation libres n'est pas dans le logiciel, mais dans le manque de bons manuels libres que nous pouvons y inclure. Beaucoup de nos programmes les plus importants ne sont pas fournis avec des manuels complets. La documentation est une partie essentielle de tout logiciel; quand un logiciel libre important n'est pas fourni avec un manuel libre, c'est un manque majeur. Aujourd'hui, nous avons de nombreux manques importants.

source: Once upon a time, many years ago, I thought I would learn Perl. I got a copy of a free manual, but I found it hard to read. When I asked Perl users about alternatives, they told me that there were better introductory manuals&mdash;but those were not free.
fr: Il y a de nombreuses ann&eacute;es, j'ai voulu essayer d'apprendre Perl. J'avais une copie d'un manuel libre, mais je ne l'ai pas trouv&eacute; facile d'acc&egrave;s. Lorsque j'ai demand&eacute; &agrave; des utilisateurs de Perl s'il existait une alternative, ils me dirent qu'il y avait de meilleurs manuels d'introduction, mais que ceux-ci n'&eacute;taient pas libres.

source: Why was this? The authors of the good manuals had written them for O'Reilly Associates, which published them with restrictive terms&mdash;no copying, no modification, source files not available&mdash;which exclude them from the free software community.
fr: Mais pourquoi cela&nbsp;? Les auteurs de ces bons manuels les ont &eacute;crit pour O'Reilly Associates, qui les publie sous des termes restrictifs (pas de copie, pas de modification, les sources ne sont pas disponibles). Cela les exclut de la communaut&eacute; du logiciel libre.

source: That wasn't the first time this sort of thing has happened, and (to our community's great loss) it was far from the last. Proprietary manual publishers have enticed a great many authors to restrict their manuals since then. Many times I have heard a GNU user eagerly tell me about a manual that he is writing, with which he expects to help the GNU project&mdash;and then had my hopes dashed, as he proceeded to explain that he had signed a contract with a publisher that would restrict it so that we cannot use it.
fr: Ce n'&eacute;tait pas la premi&egrave;re fois que ce genre de choses se produisait, et (malheureusement pour notre communaut&eacute;) c'en est loin d'&ecirc;tre fini. Les &eacute;diteurs de manuels propri&eacute;taires ont encourag&eacute; un grand nombre d'auteurs &agrave; restreindre leurs manuels depuis. J'ai souvent entendu un utilisateur de GNU me parler d'un manuel qu'il &eacute;tait en train d'&eacute;crire et avec lequel il comptait aider le projet GNU, puis d&eacute;cevoir mes espoirs en expliquant qu'il avait sign&eacute; un contrat avec un &eacute;diteur qui restreindrait son manuel de telle mani&egrave;re que nous ne pourrions pas l'utiliser.

source: Given that writing good English is a rare skill among programmers, we can ill afford to lose manuals this way.
fr: &Eacute;tant donn&eacute; la raret&eacute; de bons r&eacute;dacteurs en langue anglaise parmi les programmeurs, nous ne pouvons pas nous permettre de perdre des manuels de cette mani&egrave;re.

source: Free documentation, like free software, is a matter of freedom, not price. The problem with these manuals was not that O'Reilly Associates charged a price for printed copies&mdash;that in itself is fine. (The Free Software Foundation <a href="/doc/doc.html#DescriptionsOfGNUDocumentation">sells printed copies</a> of free <a href="/doc/doc.html">GNU manuals</a>, too.) But GNU manuals are available in source code form, while these manuals are available only on paper. GNU manuals come with permission to copy and modify; the Perl manuals do not. These restrictions are the problems.
fr: L'int&eacute;r&ecirc;t d'une documentation libre (tout comme pour un logiciel libre) est la libert&eacute;, pas le prix. Le probl&egrave;me avec ces manuels n'&eacute;tait pas que O'Reilly Associates vende les versions imprim&eacute;es de ses manuels, ce qui est bon en soi. (La Free Software Foundation <a href="/doc/doc.html#DescriptionsOfGNUDocumentation"> vend aussi des impressions</a> des <a href="/doc/doc.html">manuels GNU</a>). Mais les manuels GNU sont disponibles sous forme de code source, alors que ces manuels-l&agrave; ne sont disponibles que sous forme imprim&eacute;e. Les manuels de GNU sont distribu&eacute;s avec la permission de les copier et de les modifier; mais pas ces manuels de Perl. Ces restrictions sont le probl&egrave;me.

source: The criterion for a free manual is pretty much the same as for free software: it is a matter of giving all users certain freedoms. Redistribution (including commercial redistribution) must be permitted, so that the manual can accompany every copy of the program, on-line or on paper. Permission for modification is crucial too.
fr: Les conditions &agrave; remplir pour un manuel libre sont &agrave; peu pr&egrave;s les m&ecirc;mes que pour un logiciel; il s'agit de donner &agrave; tous les utilisateurs certaines libert&eacute;s. La redistribution (y compris une distribution commerciale) doit &ecirc;tre autoris&eacute;e afin que le manuel accompagne chaque copie du programme, de mani&egrave;re &eacute;lectronique ou imprim&eacute;e. Permettre les modifications est crucial aussi.

source: As a general rule, I don't believe that it is essential for people to have permission to modify all sorts of articles and books. The issues for writings are not necessarily the same as those for software. For example, I don't think you or I are obliged to give permission to modify articles like this one, which describe our actions and our views.
fr: En r&egrave;gle g&eacute;n&eacute;rale, je ne crois pas qu'il soit essentiel que nous ayons la permission de modifier toutes sortes d'articles ou de livres. Les probl&egrave;mes de l'&eacute;criture ne sont pas forc&eacute;ment les m&ecirc;mes que ceux du logiciel. Par exemple, je ne crois pas que vous ou moi devrions nous sentir oblig&eacute;s de donner la permission de modifier des articles tels que celui-ci, qui d&eacute;crivent nos actions et nos positions.

source: But there is a particular reason why the freedom to modify is crucial for documentation for free software. When people exercise their right to modify the software, and add or change its features, if they are conscientious they will change the manual too&mdash;so they can provide accurate and usable documentation with the modified program. A manual which forbids programmers to be conscientious and finish the job, or more precisely requires them to write a new manual from scratch if they change the program, does not fill our community's needs.
fr: Mais il y a une raison particuli&egrave;re pour laquelle la libert&eacute; de modifier des documentations libres traitant de logiciels libres est cruciale. Lorsque les programmeurs exercent leur droit de modifier un logiciel et d'ajouter ou de modifier des fonctionnalit&eacute;s, s'il sont consciencieux, ils changeront aussi le manuel afin de pouvoir fournir une documentation pr&eacute;cise et utilisable avec leur propre version du programme. Un manuel qui interdirait aux programmeurs d'&ecirc;tre consciencieux et de finir leur travail, ou qui leur imposerait d'&eacute;crire un nouveau manuel &agrave; partir de z&eacute;ro s'ils modifient le programme ne r&eacute;pond pas aux besoins de notre communaut&eacute;.

source: While a blanket prohibition on modification is unacceptable, some kinds of limits on the method of modification pose no problem. For example, requirements to preserve the original author's copyright notice, the distribution terms, or the list of authors, are ok. It is also no problem to require modified versions to include notice that they were modified, even to have entire sections that may not be deleted or changed, as long as these sections deal with nontechnical topics. (Some GNU manuals have them.)
fr: M&ecirc;me si un refus total des modifications est inacceptable, quelques limites sur la mani&egrave;re de modifier une documentation ne pose pas de probl&egrave;me. Par exemple, il est normal d'avoir des injonctions de pr&eacute;server la notice de copyright originale, les termes de distribution ou la liste des auteurs. Il n'y a pas non plus de probl&egrave;me &agrave; demander que les versions modifi&eacute;es incluent une notice expliquant qu'il s'agit d'une version modifi&eacute;e, et m&ecirc;me d'avoir des sections enti&egrave;res qui ne puissent ni &ecirc;tre supprim&eacute;es ni &ecirc;tre modifi&eacute;es, du moment qu'il ne s'agit pas de sections ayant trait &agrave; des sujets techniques (certains manuels GNU en ont).

source: These kinds of restrictions are not a problem because, as a practical matter, they don't stop the conscientious programmer from adapting the manual to fit the modified program. In other words, they don't block the free software community from making full use of the manual.
fr: Ce type de restrictions n'est pas un probl&egrave;me, car d'une mani&egrave;re pratique elles n'emp&ecirc;chent pas le programmeur consciencieux d'adapter le manuel pour correspondre au programme modifi&eacute;. En d'autres termes, elles n'emp&ecirc;chent pas la communaut&eacute; du logiciel libre de faire son &oelig;uvre &agrave; la fois sur le programme et sur le manuel.

source: However, it must be possible to modify all the <em>technical</em> content of the manual, and then distribute the result in all the usual media, through all the usual channels; otherwise, the restrictions do block the community, the manual is not free, and so we need another manual.
fr: De toutes fa&ccedil;ons, il doit &ecirc;tre possible de modifier toute la partie <em>technique</em> du manuel&nbsp;; sinon ces restrictions bloquent la communaut&eacute;, le manuel n'est pas libre, et nous avons besoin d'un autre manuel.

source: Unfortunately, it is often hard to find someone to write another manual when a proprietary manual exists. The obstacle is that many users think that a proprietary manual is good enough&mdash;so they don't see the need to write a free manual. They do not see that the free operating system has a gap that needs filling.
fr: Malheureusement, il est souvent difficile de trouver quelqu'un pour &eacute;crire un autre manuel quand un manuel propri&eacute;taire existe d&eacute;j&agrave;. L'obstacle est que la plupart des utilisateurs pensent qu'un manuel propri&eacute;taire est suffisament bon, alors ils ne ressentent pas le besoin d'&eacute;crire un manuel libre. Il ne voient pas qu'un syst&egrave;me d'exploitation libre a une fissure qui n&eacute;cessite un colmatage.

source: Why do users think that proprietary manuals are good enough? Some have not considered the issue. I hope this article will do something to change that.
fr: Pourquoi ces utilisateurs pensent-ils que les manuels propri&eacute;taires sont suffisament bons&nbsp;? La plupart ne se sont pas pench&eacute;s sur le probl&egrave;me. J'esp&egrave;re que cet article sera utile dans ce sens.

source: Other users consider proprietary manuals acceptable for the same reason so many people consider proprietary software acceptable: they judge in purely practical terms, not using freedom as a criterion. These people are entitled to their opinions, but since those opinions spring from values which do not include freedom, they are no guide for those of us who do value freedom.
fr: D'autres utilisateurs consid&egrave;rent les manuels propri&eacute;taires acceptables pour la m&ecirc;me raison qu'&eacute;norm&eacute;ment de personnes consid&egrave;rent le logiciel propri&eacute;taire acceptable&nbsp;: ils pensent en termes purement pratiques, sans mettre la libert&eacute; en compte. Ces personnes sont attach&eacute;es &agrave; leurs opinions, mais comme ces opinions d&eacute;coulent de valeurs qui n'incluent pas la libert&eacute;, ils ne sont pas un mod&egrave;le pour ceux d'entre nous qui s'attachent &agrave; la libert&eacute;.

source: Please spread the word about this issue. We continue to lose manuals to proprietary publishing. If we spread the word that proprietary manuals are not sufficient, perhaps the next person who wants to help GNU by writing documentation will realize, before it is too late, that he must above all make it free.
fr: Je vous encourage &agrave; parler de ce probl&egrave;me autour de vous. Nous continuons &agrave; perdre des manuels au profit d'&eacute;ditions propri&eacute;taires. Si nous faisons savoir que les manuels propri&eacute;taires ne sont pas suffisants, peut-&ecirc;tre que la prochaine personne qui voudra aider GNU en &eacute;crivant de la documentation r&eacute;alisera, avant qu'il soit trop tard, qu'elle devra avant tout la rendre libre.

source: We can also encourage commercial publishers to sell free, copylefted manuals instead of proprietary ones. One way you can help this is to check the distribution terms of a manual before you buy it, and prefer copylefted manuals to non-copylefted ones.
fr: Nous pouvons de plus encourager les &eacute;diteurs &agrave; vendre des manuels libres et d&eacute;nu&eacute;s de copyright au lieu de manuels propri&eacute;taires. Une fa&ccedil;on de le faire est de v&eacute;rifier les termes de distribution de manuels avant de les acheter, et de pr&eacute;f&eacute;rer les manuels sans copyright &agrave; des manuels copyright&eacute;s.

source: [Note: We now maintain a <a href="/doc/other-free-books.html">web page that lists free books available from other publishers</a>].
fr: [Note&nbsp;: Nous maintenons une <a href="/doc/other-free-books.html">page Web listant les livres publi&eacute;s, par d'autres &eacute;diteurs, en tant que documentation libre</a>]

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Benjamin Drieu.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
