Repository: gitGNU/gnu_www-fr
Catalog: philosophy/fs-motives.*.po
Languages: fr

source: Motives For Writing Free Software
fr: Raisons d'écrire des logiciels libres

source: These are some of the motives for writing free software.
fr: Voici quelques unes des raisons d'écrire des logiciels libres.

source: <strong>Fun.</strong> For some people, often the best programmers, writing software is the greatest fun, especially when there is no boss to tell you what to do. Nearly all free software developers share this motive.
fr: <strong>Le plaisir</strong>. Pour certaines personnes, souvent les meilleurs programmeurs, écrire des logiciels est un vrai plaisir, particulièrement quand il n'y a pas de chef pour vous dire quoi faire. Pratiquement tous les développeurs de logiciels libres partagent cette motivation.

source: <strong>Political idealism.</strong> The desire to build a world of freedom, and help computer users escape from the power of software developers.
fr: <strong>L'idéalisme politique</strong>. Le désir de bâtir un monde de liberté, et d'aider les utilisateurs d'ordinateurs à échapper au pouvoir des développeurs de logiciels.

source: <strong>To be admired.</strong> If you write a successful, useful free program, the users will admire you. That feels very good.
fr: <strong>Pour être admiré</strong>. Si vous écrivez un logiciel libre utile et populaire, les utilisateurs vous admireront. C'est une sensation très agréable.

source: <strong>Professional reputation.</strong> If you write a successful, useful free program, that will suffice to show you are a good programmer.
fr: <strong>La réputation professionnelle</strong>. Si vous écrivez un logiciel libre utilie et populaire, cela suffira à montrer que vous êtes un bon programmeur.

source: <strong>Gratitude.</strong> If you have used the community's free programs for years, and it has been important to your work, you feel grateful and indebted to their developers. When you write a program that could be useful to many people, that is your chance to pay it forward.
fr: <strong>La gratitude</strong>. Si vous avez utilisé les logiciels libres de la communauté depuis des années, et que cela a été important pour votre travail, vous vous sentez reconnaissant et redevable envres leurs développeurs. Quand vous écrivez un programme qui pourrait être utilisé par beaucoup de monde, c'est pour vous le moyen de rendre la pareille.

source: <strong>Hatred for Microsoft.</strong> It is a mistake to focus our criticism <a href="/philosophy/microsoft.html">narrowly on Microsoft</a>. Indeed, Microsoft is evil, since it makes non-free software. Even worse, it implements <a href="http://DefectiveByDesign.org">Digital Restrictions Management</a> in that software. But many other companies do one or both of these. Nonetheless, it is a fact that many people utterly despise Microsoft, and some contribute to free software based on that feeling.
fr: <strong>La haine de Microsoft</strong>. C'est une erreur de concentrer notre critique sur <a href="/philosophy/microsoft.fr.html">seulement Microsoft</a>. Oui, Microsoft est mauvais car il développe des logiciels non-libres. Et pire, il met en œuvre une <a href="http://DefectiveByDesign.org">gestion des restrictions numériques</a> dans ces logiciels. Mais beaucoup d'autres sociétés font la même chose. Néanmoins, c'est un fait que beaucoup de gens méprisent au plus haut point Microsoft, et certaines d'entre elles contribuent au logiciel libre pour cette raison.

source: <strong>Money.</strong> A considerable number of people are paid to develop free software or have built businesses around it.
fr: <strong>L'argent</strong>. Un nombre considérable de personnes sont payées pour développer des logiciels libres ou ont monté des sociétés gravitant autour du logiciel libre.

source: <strong>Wanting a better program to use.</strong> People often work on improvements in programs they use, in order to make them more convenient. (Some commentators recognize no motive other than this, but their picture of human nature is too narrow.)
fr: <strong>La volonté d'un meilleur programme à utiliser</strong>. Les gens travaillent souvent sur des améliorations des programmes qu'ils utilisent, pour les rendre plus pratiques. (Certains commentateurs ne reconnaissent d'autres raisons que celle-ci, mais leur vision de la nature humaine est trop étroite).

source: Human nature is complex, and it is quite common for a person to have multiple simultaneous motives for a single action.
fr: La nature humaine est complexe, et il est tout à fait courant pour une personne d'avoir plusieurs raisons pour une seule action.

source: Each person is different, and there could be other motives that are missing from this list. If you know of other motives not listed here, please send email to <a href="mailto:campaigns@gnu.org">&lt;campaigns@gnu.org&gt;</a>. If we think the other motives are likely to influence many developers, we will add them to the list.
fr: Chaque personne est différente, et il pourrait y avoir d'autres raisons que nous avons manquées dans cette liste. Si vous connaissez d'autres raisons qui ne seraient pas citées ici, veuillez envoyer un courriel à <a href="mailto:campaigns@gnu.org">&lt;campaigns@gnu.org&gt;</a>. Si nous pensons que les autres raisons sont susceptibles d'influencer beaucoup de développeurs, nous les ajouterons à cette liste.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web à <a href="mailto:webmasters@gnu.org">webmasters@gnu.org</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
