Repository: gitGNU/gnu_www-fr
Catalog: philosophy/gates.*.po
Languages: fr

source: It's not the Gates, it's the bars - RMS
fr: Ce ne sont pas des barri&egrave;res mais une prison - RMS

source: It's not the Gates, it's the bars
fr: Ce ne sont pas des barri&egrave;res mais une prison

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a><br /> Founder, Free Software Foundation
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a><br /> fondateur de la Free Software Foundation.

source: <em>(This article was <a href="http://news.bbc.co.uk/1/hi/technology/7487060.stm">published by BBC News in 2008</a>.)</em>
fr: <em>(Ceci est un article <a href="http://news.bbc.co.uk/1/hi/technology/7487060.stm">publi&eacute; dans BBC News en 2008</a>).</em>

source: To pay so much attention to Bill Gates' retirement is missing the point. What really matters is not Gates, nor Microsoft, but the unethical system of restrictions that Microsoft&mdash;like many other software companies&mdash;imposes on its customers.
fr: Accorder autant d'attention au d&eacute;part en retraite de Bill Gates, c'est &ecirc;tre &agrave; c&ocirc;t&eacute; de la plaque&nbsp;; ce qui importe vraiment n'est ni Gates, ni Microsoft, mais le syst&egrave;me de restrictions sans aucune &eacute;thique que Microsoft (&agrave; l'instar de nombreuses autres soci&eacute;t&eacute;s, impose &agrave; ses clients.

source: That statement may surprise you, since most people interested in computers have strong feelings about Microsoft. Businessmen and their tame politicians admire its success in building an empire over so many computer users. Many outside the computer field credit Microsoft for advances which it only took advantage of, such as making computers cheap and fast, and convenient graphical user interfaces.
fr: Cette affirmation pourrait bien vous surprendre, puisque la plupart des personnes qui &eacute;prouvent de l'int&eacute;r&ecirc;t pour l'informatique, ont un avis tranch&eacute; et positif en faveur de Microsoft. Les hommes d'affaires, et les politiques qui soutiennent Microsoft, sans se poser beaucoup de questions, admirent la r&eacute;ussite et l'&eacute;dification de cet empire informatique avec 95&nbsp;% d'utilisateurs dans le monde.Nombreux sont ceux qui, hors du milieu de l'informatique, pensent &agrave; tort que c'est Microsoft qui a r&eacute;alis&eacute; des avanc&eacute;es, comme fabriquer des ordinateurs rapides et peu co&ucirc;teux, ainsi que des interfaces graphiques pratiques.

source: Many computerists specially hate Gates and Microsoft. They have plenty of reasons. Microsoft persistently engages in anti-competitive behaviour, and has been convicted three times. (Bush, who let Microsoft off the hook for the second US conviction, was invited to Microsoft headquarters to solicit funds for the 2000 election. In the UK, Microsoft established a major office in Gordon Brown's constituency. Both lawful, both potentially corrupting.)
fr: De nombreux informaticiens &laquo;&nbsp;ha&iuml;ssent&nbsp;&raquo; Bill Gates et Microsoft, &agrave; juste titre, pour de nombreuses raisons. Microsoft ne cesse de pratiquer avec obstination des comportements anti-concurrentiels et a &eacute;t&eacute; condamn&eacute; pour cela &agrave; trois reprises. (George W. Bush, qui a sorti Microsoft du p&eacute;trin &agrave; la suite de la deuxi&egrave;me condamnation am&eacute;ricaine, a &eacute;t&eacute; invit&eacute; au <acronym title="Quartier g&eacute;n&eacute;ral">QG</acronym> de Microsoft afin de recevoir des fonds pour sa campagne de l'ann&eacute;e 2000. Au Royaume-Uni, Microsoft a &eacute;tabli un bureau important dans la circonscription de Gordon Brown. &Agrave; la fois l&eacute;gal et potentiellement corrupteur).

source: Many users hate the &ldquo;Microsoft tax&rdquo;, the retail contracts that make you pay for Windows on your computer even if you won't use it. (In some countries you can get a refund, but the effort required is daunting.) There's also the Digital Restrictions Management: software features designed to &ldquo;stop&rdquo; you from accessing your files freely. (Increased restriction of users seems to be the main advance of Vista.)
fr: De nombreux utilisateurs d&eacute;testent la &laquo;&nbsp;taxe Microsoft&nbsp;&raquo;, le contrat de licence &agrave; payer pour avoir Windows sur leur ordinateur, m&ecirc;me s'ils n'ont pas l'intention de s'en servir. (Ils peuvent obtenir le remboursement dans certains pays, mais l'effort &agrave; fournir pour obtenir satisfaction est d&eacute;courageant). Sans parler des verrous num&eacute;riques&nbsp;: des bouts de logiciels qui ont pour but de vous emp&ecirc;cher d'acc&eacute;der &agrave; vos fichiers librement. (Des restrictions suppl&eacute;mentaires et insupportables de la libert&eacute; des utilisateurs, semblent &ecirc;tre surtout &laquo;&nbsp;le grand progr&egrave;s&nbsp;&raquo; du syst&egrave;me Windows Vista).

source: Then there are the gratuitous incompatibilities and obstacles to interoperation with other software. (This is why the EU required Microsoft to publish interface specifications.) This year Microsoft packed standards committees with its supporters to procure ISO approval of its unwieldy, unimplementable and patented &ldquo;open standard&rdquo; for documents. (The EU is now investigating this.)
fr: Ensuite, vous devez subir les incompatibilit&eacute;s et les obstacles &agrave; l'interop&eacute;rabilit&eacute; sans motif avec bien d'autres logiciels non Microsoft. C'est pour cela que l'<acronym title="Union europ&eacute;enne">UE</acronym> a ordonn&eacute; &agrave; Microsoft de publier ses sp&eacute;cifications d'interfaces. Cette ann&eacute;e, Microsoft a infiltr&eacute; les comit&eacute;s de normalisation avec ses supporters, afin de d&eacute;crocher la norme <acronym title="International Standard Organization">ISO</acronym> pour son &laquo;&nbsp;format ouvert&nbsp;&raquo; de documents, syst&egrave;me lourd, impossible &agrave; mettre en &oelig;uvre et farci de brevets. (En ce moment m&ecirc;me, l'UE enqu&ecirc;te sur les m&eacute;thodes de Microsoft &agrave; ce sujet).

source: These actions are intolerable, of course, but they are not isolated events. They are systematic symptoms of a deeper wrong which most people don't recognize: proprietary software.
fr: Ces agissements sont bien entendu intol&eacute;rables, mais ne sont nullement isol&eacute;s. Ce sont des sympt&ocirc;mes syst&eacute;matiques d'un mal bien plus profond dont la plupart des gens ne se rendent pas compte&nbsp;: le logiciel privateur&nbsp;<sup><a href="#TransNote1">1</a></sup>.

source: Microsoft's software is distributed under licenses that keep users divided and helpless. The users are divided because they are forbidden to share copies with anyone else. The users are helpless because they don't have the source code that programmers can read and change.
fr: Les logiciels Microsoft sont distribu&eacute;s sous des licences qui laissent leurs utilisateurs divis&eacute;s et ligot&eacute;s. Ces utilisateurs sont divis&eacute;s, parce qu'il leur est interdit de partager des copies avec qui que ce soit. Ces utilisateurs sont ligot&eacute;s, parce qu'ils n'ont pas acc&egrave;s au code source des logiciels, permettant aux programmeurs de lire, modifier et am&eacute;liorer le programme.

source: If you're a programmer and you want to change the software, for yourself or for someone else, you can't. If you're a business and you want to pay a programmer to make the software suit your needs better, you can't. If you copy it to share with your friend, which is simple good-neighbourliness, they call you a &ldquo;pirate&rdquo;. Microsoft would have us believe that helping your neighbour is the moral equivalent of attacking a ship.
fr: Si vous &ecirc;tes programmeur et que vous voulez modifier ces logiciels, pour vous-m&ecirc;me ou quelqu'un d'autre, vous ne le pouvez pas. Si vous &ecirc;tes dans les affaires et que vous voulez payer un programmeur pour ajuster ces logiciels &agrave; vos besoins, vous ne le pouvez pas. Si vous en faites une copie, et que vous la partagez avec un ami, ce qui est rien de plus naturel et convivial, on vous traite de &laquo;&nbsp;pirate&nbsp;&raquo;. Microsoft voudrait nous faire croire, qu'aider son voisin est moralement &eacute;quivalent &agrave; attaquer un navire.

source: The most important thing that Microsoft has done is to promote this unjust social system. Gates is personally identified with it, due to his infamous open letter which rebuked microcomputer users for sharing copies of his software. It said, in effect, &ldquo;If you don't let me keep you divided and helpless, I won't write the software and you won't have any. Surrender to me, or you're lost!&rdquo;
fr: La chose la plus importante qu'ait fait Microsoft a &eacute;t&eacute; de promouvoir ce syst&egrave;me social d&eacute;loyal. Gates en est l'ic&ocirc;ne m&ecirc;me, &agrave; cause de son inf&acirc;me lettre ouverte aux utilisateurs d'ordinateurs, qu'il abreuvait d'insultes parce qu'ils partageaient des copies de ses programmes. Elle disait en substance&nbsp;: &laquo;&nbsp;Si vous m'emp&ecirc;chez de vous garder divis&eacute;s et ligot&eacute;s, je n'&eacute;crirai plus de programmes et vous n'en aurez plus du tout. Rendez-vous, ou vous &ecirc;tes perdu&nbsp;!&nbsp;&raquo;

source: But Gates didn't invent proprietary software, and thousands of other companies do the same thing. It's wrong&mdash;no matter who does it. Microsoft, Apple, Adobe, and the rest, offer you software that gives them power over you. A change in executives or companies is not important. What we need to change is this system.
fr: Cependant, Gates n'a pas invent&eacute; le logiciel privateur, et des milliers d'autres soci&eacute;t&eacute;s font de m&ecirc;me. Il est fonci&egrave;rement mauvais (quel qu'en soit l'auteur). Microsoft, Apple, Adobe, et les autres, vous proposent des logiciels qui leur donnent un pouvoir sur vous. Peu importe l'entreprise ou le dirigeant, l&agrave; n'est pas le probl&egrave;me. Ce dont nous avons besoin, c'est de changer le syst&egrave;me.

source: That's what the free software movement is all about. &ldquo;Free&rdquo; refers to freedom: we write and publish software that users are free to share and modify. We do this systematically, for freedom's sake; some of us paid, many as volunteers. We already have complete free operating systems, including GNU/Linux. Our aim is to deliver a complete range of useful free software, so that no computer user will be tempted to cede her freedom to get software.
fr: C'est en cela que consiste le mouvement du logiciel libre. Quand nous disons &laquo;&nbsp;libre&nbsp;&raquo;, nous parlons de libert&eacute;&nbsp;: nous &eacute;crivons et publions des logiciels que les utilisateurs sont libres de partager et de modifier. Nous agissons ainsi syst&eacute;matiquement, au nom de la libert&eacute;&nbsp;; certains d'entre nous sont pay&eacute;s, d'autres sont b&eacute;n&eacute;voles. Nous disposons d&eacute;j&agrave; de syst&egrave;mes d'exploitation libres complets, au rang desquels GNU/Linux. Notre but est d'offrir une gamme compl&egrave;te de logiciels libres et utiles, afin qu'aucun utilisateur ne se voit tent&eacute; de c&eacute;der sa libert&eacute; contre du logiciel propri&eacute;taire.

source: In 1984, when I started the free software movement, I was hardly aware of Gates' letter. But I'd heard similar demands from others, and I had a response: &ldquo;If your software would keep us divided and helpless, please don't write it. We are better off without it. We will find other ways to use our computers, and preserve our freedom.&rdquo;
fr: En 1984, quand j'ai lanc&eacute; le mouvement pour le logiciel libre, j'avais &agrave; peine entendu parler de la lettre de Gates&nbsp;; mais j'avais entendu des propos similaires de la part d'autres, et j'avais une r&eacute;ponse&nbsp;: &laquo;&nbsp;Si votre logiciel tient &agrave; nous garder divis&eacute;s et ligot&eacute;s, veuillez ne pas l'&eacute;crire. Nous nous d&eacute;brouillons tr&egrave;s bien sans vous. Nous trouverons bien d'autres moyens d'utiliser nos ordinateurs et de conserver notre libert&eacute;&nbsp;&raquo;.

source: In 1992, when the GNU operating system was completed by the kernel, Linux, you had to be a wizard to run it. Today GNU/Linux is user-friendly: in parts of Spain and India, it's standard in schools. Tens of millions use it, around the world. You can use it too.
fr: En 1992, quand le syst&egrave;me d'exploitation GNU a &eacute;t&eacute; compl&eacute;t&eacute; par le noyau Linux, vous deviez &ecirc;tre tr&egrave;s pointu en informatique pour faire marcher le tout. Aujourd'hui, GNU/Linux est facile d'acc&egrave;s&nbsp;: dans certaines r&eacute;gions d'Espagne ou d'Inde, c'est le syst&egrave;me par d&eacute;faut dans les &eacute;coles. Des dizaines de millions de personnes l'utilisent par del&agrave; le monde. Vous aussi, vous pouvez l'utiliser.

source: Gates may be gone, but the walls and bars of proprietary software he helped create remain&mdash;for now. Dismantling them is up to us.
fr: Gates est peut-&ecirc;tre parti, mais les murs et les barreaux du logiciel privateur, qu'il a contribu&eacute; &agrave; &eacute;lever, sont encore l&agrave; (pour le moment). C'est &agrave; nous de les abattre.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Note du relecteur</b>&nbsp;:<br /><ol><li id="TransNote1">Logiciel privateur = logiciel propri&eacute;taire</li></ol>

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Richard Stallman is the founder of the Free Software Foundation. You can copy and redistribute this article under the <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution Noderivs 3.0 license</a>.
fr: Richard Stallman est le fondateur de la Free Software Foundation. Vous pouvez copier et redistribuer cet article selon les termes de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution Noderivs 3.0</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Pierre-Marie Pédrot.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
