Repository: gitGNU/gnu_www-fr
Catalog: philosophy/gnutella.*.po
Languages: fr

source: Regarding Gnutella - GNU Project - Free Software Foundation (FSF)
fr: &Agrave; propos de Gnutella - GNU Project - Free Software Foundation (FSF)

source: Regarding Gnutella
fr: &Agrave; propos de Gnutella

source: &ldquo;Gnutella&rdquo; is, at present, the name for a protocol for distributed file sharing, mostly used for music files. The name also sometimes refers to the network itself, as well as the original Gnutella software. The situation is quite confusing. For more on Gnutella's origin and history, please refer to the <a href="http://en.wikipedia.org/wiki/Gnutella">Wikipedia article</a> on the subject.
fr: &laquo;&nbsp;Gnutella&nbsp;&raquo; est &agrave; pr&eacute;sent le nom d'un protocole de partage de fichiers par le r&eacute;seau, principalement des fichiers de musique. Le nom se r&eacute;f&egrave;re parfois au r&eacute;seau lui-m&ecirc;me aussi bien qu'au logiciel Gnutella original. La situation est assez confuse. Pour plus d'informations sur l'origine et l'histoire de Gnutella, veuillez vous r&eacute;f&eacute;rer &agrave; <a href="http://fr.wikipedia.org/wiki/Gnutella">l'article Wikipedia</a> sur le sujet.

source: In any case, the name was originally a word play on &ldquo;GNU&rdquo; (the original developers planned to release their code under the GNU GPL, and may have had in mind contributing it to the GNU project) and &ldquo;Nutella&rdquo; (a candy bar that the original developers enjoyed). However, neither the original software nor any of the related current projects are <a href="/philosophy/categories.html#GNUsoftware">official GNU packages</a>. We have asked that the Gnutella developers change the name to avoid confusion; perhaps that will happen in the future.
fr: Dans tous les cas, le nom &eacute;tait &agrave; l'origine un jeu de mot sur &laquo;&nbsp;GNU&nbsp;&raquo; (les d&eacute;veloppeurs originaux avaient pour but de distribuer leur code sous GNU GPL et avaient peut-&ecirc;tre dans l'id&eacute;e de contribuer au projet GNU) et sur &laquo;&nbsp;Nutella&nbsp;&raquo; (une friandise que les d&eacute;veloppeurs appr&eacute;ciaient). Cependant, ni le logiciel original ni aucun des projets relatifs ne sont <a href="/philosophy/categories.fr.html#GNUsoftware">officiellement des logiciels GNU</a>. Nous avons demand&eacute; aux d&eacute;veloppeurs de Gnutella de changer le nom pour &eacute;viter la confusion, peut &ecirc;tre le feront-ils dans le futur.

source: There are a number of free software programs that implement the Gnutella protocol, such as <a href="http://gtk-gnutella.sourceforge.net/">gtk-gnutella</a>, <a href="http://mutella.sourceforge.net/">mutella</a>, and <a href="http://sourceforge.net/projects/gnucleus/">gnucleus</a>. Please note, however, that none of these programs are officially <a href="/philosophy/categories.html#GNUsoftware">GNU software</a> either. GNU has its own peer-to-peer networking program, <a href="/software/GNUnet/">GNUnet</a>, whose documentation includes a <a href="http://gnunet.org/faq.php3#compare">comparison of the protocols</a>.
fr: Il existe un certain nombre de programmes en d&eacute;veloppement qui sont con&ccedil;us pour utiliser le protocole Gnutella. Tel que <a href="http://gtk-gnutella.sourceforge.net/">gtk-gnutella</a>, <a href="http://mutella.sourceforge.net/">mutella</a>, and <a href="http://sourceforge.net/projects/gnucleus/">gnucleus</a>. Maisaucun de ces deux programmes n'est officiellement un <a href="/philosophy/categories.fr.html#GNUsoftware">logiciel GNU</a>. GNU a son propre programme de r&eacute;seau peer-to-peer, <a href="/software/GNUnet/">GNUnet</a>, dont la documentation inclut une <a href="http://gnunet.org/faq.php3#compare">comparaison des protocoles</a>.

source: The Free Software Foundation is concerned with the freedom to copy and change software; music is outside our scope. But there is a partial similarity in the ethical issues of copying software and copying recordings of music. Some articles in the <a href="/philosophy/philosophy.html#Laws">philosophy</a> directory relate to the issue of copying for things other than software. Some of the <a href="/philosophy/philosophy.html#ThirdPartyIdeas">other people's articles</a> we have links to are also relevant.
fr: La Fondation pour le Logiciel Libre est soucieuse de la libert&eacute; de copier et de modifier le logiciel; la musique sort de notre champ d'action. Mais il y a une similarit&eacute; partielle entre les questions &eacute;thiques de la copie de logiciels et la copie d'enregistrements musicaux. Certains articles dans notre r&eacute;pertoire <a href="/philosophy/philosophy.fr.html#Laws">philosophique</a> traitent de ce qui entoure la libert&eacute; de copie dans d'autres domaines que celui du logiciel. Quelques <a href="/philosophy/philosophy.fr.html#ThirdPartyIdeas">articles &eacute;crits par d'autres personnes</a> vers lesquels nous avons des liens sont tout aussi pertinents.

source: No matter what sort of published information is being shared, we urge people to reject the assumption that some person or company has a natural right to prohibit sharing and dictate exactly how the public can use it. Even the US legal system nominally <a href="/philosophy/reevaluating-copyright.html">rejects</a> that anti-social idea.
fr: Quel que soit le type d'information publi&eacute;e qui est partag&eacute;, nous invitons prestement le public &agrave; rejeter l'id&eacute;e que quelque personne ou soci&eacute;t&eacute; ait le droit naturel d'interdire le partage ainsi que de dicter exactement comment le public peut l'utiliser. M&ecirc;me le syst&egrave;me judiciaire des &Eacute;tats-Unis. <a href="/philosophy/reevaluating-copyright.fr.html">rejette</a> formellement cette id&eacute;e anti-sociale.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Wolfgang Sourdeau.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
