Repository: gitGNU/gnu_www-fr
Catalog: philosophy/gpl-american-dream.*.po
Languages: fr

source: The GNU GPL and the American Dream - GNU Project - Free Software Foundation (FSF)
fr: GNU GPL comme incarnation du r&ecirc;ve am&eacute;ricain - GNU Project - Free Software Foundation (FSF)

source: The GNU GPL and the American Dream
fr: GNU GPL comme incarnation du r&ecirc;ve am&eacute;ricain

source: by <strong>Bradley M. Kuhn</strong>
fr: par <strong>Bradley M. Kuhn</strong>

source: When I was in grade school, right here in the United States of America, I was taught that our country was the &ldquo;land of opportunity&rdquo;. My teachers told me that my country was special, because anyone with a good idea and a drive to do good work could make a living, and be successful too. They called it the &ldquo;American Dream&rdquo;.
fr: Lorsque j'&eacute;tais encore sur les bancs des classes secondaires, ici au cœur des &Eacute;tats-Unis, l'&eacute;cole n'a cess&eacute; de me r&eacute;p&eacute;ter combien notre pays &eacute;tait la &laquo;terre de l'&eacute;galit&eacute; des chances&raquo;. Selon mes professeurs, la chance d'&ecirc;tre n&eacute; ici me permettait, pourvu qu'une id&eacute;e lumineuse me travers&acirc;t l'esprit, et que le courage ne v&icirc;nt pas &agrave; me manquer pour la concr&eacute;tiser, d'en faire mon gagne-pain, voire ma r&eacute;ussite. Pour eux, il &eacute;tait donc l&agrave;, le &laquo;r&ecirc;ve am&eacute;ricain&raquo;.

source: What was the cornerstone to the &ldquo;American Dream&rdquo;? It was equality&mdash;everyone had the same chance in our society to choose their own way. I could have any career I wanted, and if I worked hard, I would be successful.
fr: Mais qu'&eacute;tait donc la pierre angulaire de ce «&nbsp;r&ecirc;ve am&eacute;ricain&nbsp;»&nbsp;? Sans nul doute l'&eacute;galit&eacute;&nbsp;: chaque citoyen de ce pays avait le droit de choisir sa route. Quelle que f&ucirc;t la carri&egrave;re que je pusse d&eacute;sirer, &agrave; force de travail, celle-ci deviendrait ma r&eacute;ussite.

source: It turned out that I had some talent for working with computers&mdash;in particular, computer software. Indoctrinated with the &ldquo;American Dream&rdquo;, I learned as much as I could about computer software. I wanted my chance at success.
fr: &Agrave; l'&eacute;poque, il s'av&eacute;rait que je disposais d'un talent certain en mati&egrave;re d'informatique, et plus pr&eacute;cis&eacute;ment dans le domaine du logiciel. Endoctrin&eacute; &agrave; grands coups de «&nbsp;r&ecirc;ve am&eacute;ricain&nbsp;», je me mis &agrave; apprendre chaque d&eacute;tail de ce domaine. Je ne devais laisser aucune chance &agrave; la fatalit&eacute;. Ma connaissance serait ma r&eacute;ussite.

source: I quickly discovered though, that in many cases, not all the players in the field of computer software were equal. By the time I entered the field, large companies like Microsoft tended to control much of the technology. And, that technology was available to me under licensing agreements that forbid me to study and learn from it. I was completely prohibited from viewing the program source code of the software.
fr: Pourtant, quelle ne fut pas ma surprise lorsque je d&eacute;couvris que l'informatique n'offrait pas toujours cette «&nbsp;&eacute;galit&eacute; des chances&nbsp;» &agrave; ses acteurs. Au moment o&ugrave; je pus en faire mon m&eacute;tier, nombre de compagnies de la carrure de Microsoft avaient tendance &agrave; exercer un contr&ocirc;le sur la technologie. Je d&eacute;couvris aussi que cette technologie &eacute;tait enrob&eacute;e de toutes sortes de licences m'emp&ecirc;chant purement et simplement d'y porter un regard scientifique, ou tout simplement de l'&eacute;tudier. Pire&nbsp;: il m'&eacute;tait interdit de consulter le code source de ces logiciels.

source: I found out, too, that those with lots of money could negotiate different licenses. If they paid enough, they could get permission to study and learn from the source code. Typically, such licenses cost many thousands of dollars, and being young and relatively poor, I was out of luck.
fr: Autre d&eacute;couverte&nbsp;: les plus fortun&eacute;s se r&eacute;servaient le droit de n&eacute;gocier diff&eacute;rents brevets ou licences. Pourvu qu'ils en aient les moyens,ils pouvaient obtenir la permission d'&eacute;tudier le code source. En g&eacute;n&eacute;ral, la simple consultation de ce code pouvait co&ucirc;ter rien moins que des centaines de milliers de dollars. Jeune et relativement pauvre, les portes se refermaient sur moi.

source: After spending my early years in the software business a bit downtrodden by my inability to learn more, I eventually discovered another body of software that did allow me to study and learn. This software was released under a license called the GNU General Public License (GNU GPL). Instead of restricting my freedom to study and learn from it, this license was specifically designed to allow me to learn. The license ensured that no matter what happened to the public versions of the software, I'd always be able to study its source code.
fr: Apr&egrave;s avoir pass&eacute; mes plus jeunes ann&eacute;es dans le domaine de l'informatique, me sentant comme mis &agrave; l'&eacute;cart par la seule impossibilit&eacute; d'apprendre davantage, je d&eacute;sesp&eacute;rais jusqu'au jour o&ugrave; une nouvelle forme de logiciels se pr&eacute;senta &agrave; moi, qui me permit de reprendre mes &laquo;&eacute;tudes&raquo; l&agrave; o&ugrave; je les avais laiss&eacute;es. Cette technologie &eacute;tait plac&eacute;e sous le signe de la GNU General Public License qui, au lieu de m'emp&ecirc;cher de porter un regard aux sources du progr&egrave;s, m'y encourageait tout simplement. Cette licence m'assurait que, quel que f&ucirc;t le devenir des versions publiques d'un logiciel, il me serait toujours permis d'en conna&icirc;tre la source.

source: I quickly built my career around this software. I got lots of work configuring, installing, administering, and teaching about that software. Thanks to the GNU GPL, I always knew that I could stay competitive in my business, because I would always be able to learn easily about new innovations as soon as they were made. This gave me a unique ability to innovate myself. I could innovate quickly, and impress my employers. I was even able to start my own consulting business. My own business! The pinnacle of the American Dream!
fr: Rapidement, je basais toute ma carri&egrave;re autour de cette technologie. Le temps vint &agrave; manquer tant j'&eacute;tais occup&eacute; par des t&acirc;ches comme laconfiguration, l'installation, l'administration et la formation. Gr&acirc;ce &agrave; la GNU GPL, j'&eacute;tais convaincu de toujours pouvoir rester &agrave; la hauteur de mes concurrents, du simple fait que nul ne m'interdisait l'acc&egrave;s aux technologies et &agrave; leur apprentissage, et ce d&egrave;s leur sortie. Il ne m'en fallait pas davantage pour me consacrer moi-m&ecirc;me &agrave; l'innovation. Je pouvais d&eacute;sormais innover au quart de tour et, ainsi, me d&eacute;marquer aux yeux de mes employeurs. Je pus enfin d&eacute;marrer ma propre entreprise de consultance. Comprenez bien&nbsp;: mon propre business. &Agrave; moi le «&nbsp;r&ecirc;ve am&eacute;ricain&nbsp;»&nbsp;!

source: Thus, I was quite surprised last week when a vice president at Microsoft hinted that the GNU GPL contradicted the American Way.
fr: Surprise, il va de soi, lorsque, la semaine derni&egrave;re, j'entendis le vice pr&eacute;sident de Microsoft condamner la GNU GPL comme &eacute;tant en totale contradiction avec les fondements de notre Am&eacute;rique.

source: The GNU GPL is specifically designed to make sure that all technological innovators, programmers, and software users are given equal footing. Each high school student, independent contractor, small business, and large corporation are given an equal chance to innovate. We all start the race from the same point. Those people with deep understanding of the software and an ability to make it work well for others are most likely to succeed, and they do succeed.
fr: La GNU GPL est sp&eacute;cifiquement destin&eacute;e &agrave; assurer &agrave; tous les innovateurs, programmeurs et utilisateurs de logiciels, un acc&egrave;s &eacute;gal aux technologies. Ainsi, chaque &eacute;tudiant, ind&eacute;pendant, PME ou grande entreprise disposent aujourd'hui des m&ecirc;mes chances en mati&egrave;re d'innovation. Nous prenons tous le m&ecirc;me train, celui de la technologie, dans la m&ecirc;me gare. Les plus chevronn&eacute;s, les plus dou&eacute;s ont la possibilit&eacute; de r&eacute;ussir en offrant aux autres leurs comp&eacute;tences, quelle que soit leur origine. Succ&egrave;s garanti.

source: That is exactly what the American Way is about, at least the way I learned it in grade school. I hope that we won't let Microsoft and others change the definition.
fr: N'est-ce pas cela que l'on appelle l'American Way&nbsp;? Du moins, c'est ce qu'il m'en reste de cette &eacute;poque o&ugrave; j'&eacute;tais encore sur les bancs de l'&eacute;cole. Gageons que nous ne permettrons pas &agrave; Microsoft d'en alt&eacute;rer la d&eacute;finition.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections (or suggestions) to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2001 Bradley M. Kuhn <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2001 Bradley M. Kuhn <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: ?<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
