Repository: gitGNU/gnu_www-fr
Catalog: philosophy/gpl-american-way.*.po
Languages: fr

source: The GNU GPL and the American Way - GNU Project - Free Software Foundation (FSF)
fr: La GNU GPL et l'American Way - GNU Project - Free Software Foundation (FSF)

source: The GNU GPL and the American Way
fr: La GNU GPL et l'American Way

source: by <strong>Richard M. Stallman</strong>
fr: par <strong>Richard M. Stallman</strong>

source: Microsoft describes the GNU General Public License (GNU GPL) as an &ldquo;open source&rdquo; license, and says it is against the American Way. To understand the GNU GPL, and recognize how it embodies the American Way, you must first be aware that the GPL was not designed for open source.
fr: Microsoft d&eacute;crit la GNU General Public License (GNU GPL) comme une licence &laquo;&nbsp;Open Source&nbsp;&raquo; et affirme qu'elle est contraire &agrave; l'American Way (<em>la Mani&egrave;re Am&eacute;ricaine</em>). Pour comprendre la GNU GPL et comprendre en quoi elle incarne l'American Way, vous devez d'abord &ecirc;tre conscient que la GPL n'a pas &eacute;t&eacute; con&ccedil;ue pour l'Open Source.

source: The Open Source Movement, which was launched in 1998, aims to develop powerful, reliable software and improved technology, by inviting the public to collaborate in software development. Many developers in that movement use the GNU GPL, and they are welcome to use it. But the ideas and logic of the GPL cannot be found in the Open Source Movement. They stem from the deeper goals and values of the Free Software Movement.
fr: Le mouvement Open Source, d&eacute;marr&eacute; en 1998, a pour but de d&eacute;velopper des logiciels puissants et fiables, ainsi que d'am&eacute;liorer la technologie en invitant le public &agrave; collaborer au d&eacute;veloppement des logiciels. Beaucoup de d&eacute;veloppeurs de ce mouvement utilisent la GNU GPL et ils sont invit&eacute;s &agrave; le faire. Mais les id&eacute;es et la logique de la GPL ne peut pas &ecirc;tre trouv&eacute;es dans le mouvement Open Source. Elles proviennent des buts et des valeurs plus profonds du mouvement du logiciel libre.

source: The Free Software Movement was founded in 1984, but its inspiration comes from the ideals of 1776: freedom, community, and voluntary cooperation. This is what leads to free enterprise, to free speech, and to free software.
fr: Le mouvement du logiciel libre a &eacute;t&eacute; fond&eacute; en 1984, mais son inspiration vient des id&eacute;aux de 1776&nbsp;: la libert&eacute;, la communaut&eacute; et la coop&eacute;ration volontaire. C'est ce qui m&egrave;ne &agrave; la libre entreprise, &agrave; la libert&eacute; d'expression et au logiciel libre.

source: As in &ldquo;free enterprise&rdquo; and &ldquo;free speech&rdquo;, the &ldquo;free&rdquo; in &ldquo;free software&rdquo; refers to freedom, not price; specifically, it means that you have the freedom to study, change, and redistribute the software you use. These freedoms permit citizens to help themselves and help each other, and thus participate in a community. This contrasts with the more common proprietary software, which keeps users helpless and divided: the inner workings are secret, and you are prohibited from sharing the program with your neighbor. Powerful, reliable software and improved technology are useful byproducts of freedom, but the freedom to have a community is important in its own right.
fr: Comme dans le cas de la &laquo;&nbsp;libre entreprise&nbsp;&raquo; et de la &laquo;&nbsp;libert&eacute; d'expression&nbsp;&raquo;, le terme &laquo;&nbsp;libre&nbsp;&raquo; dans le terme &laquo;&nbsp;logiciel libre&nbsp;&raquo; fait r&eacute;f&eacute;rence &agrave; la libert&eacute;, pas au prix ; plus sp&eacute;cifiquement, il signifie que vous avez la libert&eacute; d'&eacute;tudier, de modifier et de redistribuer les logiciels que vous utilisez. Ces libert&eacute;s permettent aux citoyens de s'aider eux-m&ecirc;mes, de s'aider les uns les autres et de participer ainsi &agrave; une communaut&eacute;. Cette mani&egrave;re de proc&eacute;der contraste avec celle du logiciel propri&eacute;taire, plus r&eacute;pandu, qui maintient les utilisateurs impuissants et divis&eacute;s&nbsp;: l'architecture d'un programme est secr&egrave;te et on vous interdit de la partager avec votre voisin. Des logiciels puissants, fiables et une technologie am&eacute;lior&eacute;e sont des cons&eacute;quences heureuses de la libert&eacute;, mais la libert&eacute; d'avoir une communaut&eacute; est importante en elle-m&ecirc;me.

source: We could not establish a community of freedom in the land of proprietary software where each program had its lord. We had to build a new land in cyberspace&mdash;the free software GNU operating system, which we started writing in 1984. In 1991, when GNU was almost finished, the kernel Linux written by Linus Torvalds filled the last gap; soon the free GNU/Linux system was available. Today millions of users use GNU/Linux and enjoy the benefits of freedom and community.
fr: Nous ne pouvions pas &eacute;tablir une communaut&eacute; de libert&eacute; sur les terres des logiciels propri&eacute;taires, o&ugrave; chaque programme avait son seigneur. Nous devions constituer une nouvelle terre dans le cyber-espace, le syst&egrave;me d'exploitation libre GNU, que nous avons commenc&eacute; &agrave; &eacute;crire en 1984. En 1991, alors que le syst&egrave;me GNU &eacute;tait presque fini, le noyau Linux &eacute;crit par Linus Torvalds a rempli le dernier vide&nbsp;; peu apr&egrave;s, le syst&egrave;me libre GNU/Linux &eacute;tait disponible. Aujourd'hui, des millions d'utilisateurs utilisent GNU/Linux et jouissent des b&eacute;n&eacute;fices de la libert&eacute; et de la communaut&eacute;.

source: I designed the GNU GPL to uphold and defend the freedoms that define free software&mdash;to use the words of 1776, it establishes them as inalienable rights for programs released under the GPL. It ensures that you have the freedom to study, change, and redistribute the program, by saying that nobody is authorized to take these freedoms away from you by redistributing the program under a restrictive license.
fr: J'ai con&ccedil;u la GNU GPL pour soutenir et d&eacute;fendre les libert&eacute;s qui d&eacute;finissent le logiciel libre&nbsp;; pour employer les mots de 1776, elle les &eacute;tablit comme des droits inali&eacute;nables pour des programmes couverts par la GPL. Elle garantit que vous avez la libert&eacute; d'&eacute;tudier, de modifier et de redistribuer un programme, en affirmant que personne n'est autoris&eacute; &agrave; vous retirer ces libert&eacute;s en le redistribuant.

source: For the sake of cooperation, we encourage others to modify and extend the programs that we publish. For the sake of freedom, we set the condition that these modified versions of our programs must respect your freedom just like the original version. We encourage two-way cooperation by rejecting parasites: whoever wishes to copy parts of our software into his program must let us use parts of that program in our programs. Nobody is forced to join our club, but those who wish to participate must offer us the same cooperation they receive from us. That makes the system fair.
fr: Par &eacute;gard pour la coop&eacute;ration, nous encourageons les autres &agrave; modifier et &agrave; &eacute;tendre les programmes que nous publions. Par &eacute;gard pour la libert&eacute;, nous posons la condition que ces versions modifi&eacute;es de nos programmes doivent respecter votre libert&eacute; comme le ferait la version originale. Nous encourageons la coop&eacute;ration &agrave; deux sens en rejetant les parasites&nbsp;: tous ceux qui veulent copier des parties de nos logiciels dans leurs programmes doivent nous laisser employer des parties de ce programme dans nos programmes. Personne n'est forc&eacute; de rejoindre notre club, mais ceux qui veulent participer doivent nous offrir la m&ecirc;me coop&eacute;ration que celle qu'ils re&ccedil;oivent de nous. C'est ce qui rend le syst&egrave;me favorable.

source: Millions of users, tens of thousands of developers, and companies as large as IBM, Intel, and Sun, have chosen to participate on this basis. But some companies want the advantages without the responsibilities.
fr: Des millions d'utilisateurs, des dizaines de milliers de d&eacute;veloppeurs et des soci&eacute;t&eacute;s aussi importantes qu'IBM, Intel et Sun ont voulu participer sur cette base. Mais quelques soci&eacute;t&eacute;s veulent les avantages sans les responsabilit&eacute;s.

source: From time to time, companies have said to us, &ldquo;We would make an improved version of this program if you allow us to release it without freedom.&rdquo; We say, &ldquo;No thanks&mdash;your improvements might be useful if they were free, but if we can't use them in freedom, they are no good at all.&rdquo; Then they appeal to our egos, saying that our code will have &ldquo;more users&rdquo; inside their proprietary programs. We respond that we value our community's freedom more than an irrelevant form of popularity.
fr: De temps en temps, des soci&eacute;t&eacute;s nous disent&nbsp;: &laquo;&nbsp;Nous ferions bien une version am&eacute;lior&eacute;e de ce programme si vous nous permettiez de le publier sans la libert&eacute;&nbsp;&raquo;. Nous leur disons &laquo;&nbsp;non merci, vos am&eacute;liorations pourraient &ecirc;tre utiles si elles &eacute;taient libres, mais si nous ne pouvons pas les employer en toute libert&eacute;, elles sont totalement inutiles&nbsp;&raquo;. Alors ces soci&eacute;t&eacute;s font appel &agrave; nos egos, affirmant que notre code aurait &laquo;&nbsp;plus d'utilisateurs&nbsp;&raquo; &agrave; l'int&eacute;rieur de leurs programmes propri&eacute;taires. Nous r&eacute;pondons que nous estimons plus la libert&eacute; de notre communaut&eacute; qu'une forme de popularit&eacute; hors de propos.

source: Microsoft surely would like to have the benefit of our code without the responsibilities. But it has another, more specific purpose in attacking the GNU GPL. Microsoft is known generally for imitation rather than innovation. When Microsoft does something new, its purpose is strategic&mdash;not to improve computing for its users, but to close off alternatives for them.
fr: Microsoft aimerait s&ucirc;rement avoir l'avantage de notre code sans les responsabilit&eacute;s. Mais cette soci&eacute;t&eacute; poursuit un autre but plus sp&eacute;cifique en attaquant la GNU GPL. On conna&icirc;t d'habitude plus Microsoft pour l'imitation que pour l'innovation. Quand Microsoft con&ccedil;oit quelque chose de nouveau, son but est strat&eacute;gique&nbsp;; il ne s'agit pas d'am&eacute;liorer l'informatique pour ses utilisateurs, mais de verrouiller les alternatives.

source: Microsoft uses an anticompetitive strategy called &ldquo;embrace and extend&rdquo;. This means they start with the technology others are using, add a minor wrinkle which is secret so that nobody else can imitate it, then use that secret wrinkle so that only Microsoft software can communicate with other Microsoft software. In some cases, this makes it hard for you to use a non-Microsoft program when others you work with use a Microsoft program. In other cases, this makes it hard for you to use a non-Microsoft program for job A if you use a Microsoft program for job B. Either way, &ldquo;embrace and extend&rdquo; magnifies the effect of Microsoft's market power.
fr: Microsoft utilise une strat&eacute;gie anticomp&eacute;titive appel&eacute;e &laquo;&nbsp;inclure et &eacute;tendre&nbsp;&raquo;. Cela signifie qu'ils commencent par employer la technologie que les autres utilisent, qu'ils ajoutent un d&eacute;tail mineur qui reste secret afin que personne d'autre ne puisse l'imiter et enfin qu'ils emploient ce d&eacute;tail secret pour que seuls les logiciels de Microsoft puissent communiquer avec d'autres logiciels de Microsoft. Dans certains cas, cela vous rend difficile l'emploi d'un programme non-Microsoft quand ceux avec qui vous travaillez utilisent un programme Microsoft. Dans d'autres cas, cela vous rend difficile l'emploi d'un programme non-Microsoft pour un travail A si vous employez un programme Microsoft pour un travail B. D'une fa&ccedil;on ou de l'autre, la strat&eacute;gie &laquo;&nbsp;d'inclusion et d'extension&nbsp;&raquo; amplifie l'effet de la force de vente de Microsoft.

source: No license can stop Microsoft from practicing &ldquo;embrace and extend&rdquo; if they are determined to do so at all costs. If they write their own program from scratch, and use none of our code, the license on our code does not affect them. But a total rewrite is costly and hard, and even Microsoft can't do it all the time. Hence their campaign to persuade us to abandon the license that protects our community, the license that won't let them say, &ldquo;What's yours is mine, and what's mine is mine.&rdquo; They want us to let them take whatever they want, without ever giving anything back. They want us to abandon our defenses.
fr: Aucune licence ne peut arr&ecirc;ter la politique &laquo;&nbsp;d'inclusion et d'extension&nbsp;&raquo; de Microsoft s'ils sont d&eacute;termin&eacute;s &agrave; la poursuivre &agrave; tout prix. S'ils &eacute;crivent leur propre programme &agrave; partir de rien et n'emploient aucune partie de notre code, la licence sur notre code ne les affectera pas. Mais une r&eacute;&eacute;criture totale est co&ucirc;teuse et difficile et m&ecirc;me Microsoft ne peut pas tout le temps se permettre de le faire. D'o&ugrave; leur campagne pour nous persuader d'abandonner la licence qui prot&egrave;ge notre communaut&eacute;, la licence qui ne les laissera pas dire &laquo;&nbsp;ce qui est &agrave; vous est &agrave; moi et ce qui est &agrave; moi est &agrave; moi&nbsp;&raquo;. Ils veulent que nous les laissions prendre ce qu'ils veulent, sans jamais rendre quelque chose. Ils veulent que nous abandonnions nos d&eacute;fenses.

source: But defenselessness is not the American Way. In the land of the brave and the free, we defend our freedom with the GNU GPL.
fr: Mais l'absence de d&eacute;fense n'est pas l'American Way. Sur la terre du courageux et du libre, nous d&eacute;fendons notre libert&eacute; avec la GNU GPL.

source: Addendum:
fr: Addendum&nbsp;:

source: Microsoft says that the GPL is against &ldquo;intellectual property rights.&rdquo; I have no opinion on &ldquo;intellectual property rights,&rdquo; because the term is too broad to have a sensible opinion about. It is a catch-all, covering copyrights, patents, trademarks, and other disparate areas of law; areas so different, in the laws and in their effects, that any statement about all of them at once is surely simplistic. To think intelligently about copyrights, patents or trademarks, you must think about them separately. The first step is declining to lump them together as &ldquo;intellectual property&rdquo;.
fr: Microsoft affirme que la GPL va contre les &laquo;&nbsp;droits de la propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;. Je n'ai aucun avis sur les &laquo;&nbsp;droits de la propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;, parce que le terme est trop large pour permettre de formuler un avis sens&eacute; sur le sujet. C'est un fourre-tout, couvrant les copyrights, les brevets, les marques et d'autres secteurs l&eacute;galement disparates; des secteurs si diff&eacute;rents, dans les lois et dans leurs effets, que n'importe quelle d&eacute;claration sur leur totalit&eacute; est tr&egrave;s certainement simpliste. Pour penser intelligemment aux copyrights, aux brevets ou aux marques, vous devez y penser s&eacute;par&eacute;ment. Le premier pas est de refuser de les mettre dans un tas sous la d&eacute;nomination de &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;.

source: My views about copyright take an hour to expound, but one general principle applies: it cannot justify denying the public important freedoms. As Abraham Lincoln put it, &ldquo;Whenever there is a conflict between human rights and property rights, human rights must prevail.&rdquo; Property rights are meant to advance human well-being, not as an excuse to disregard it.
fr: Mes opinions sur le copyright prendraient une heure &agrave; exposer, mais un principe g&eacute;n&eacute;ral s'applique&nbsp;: on ne peut pas justifier la n&eacute;gation des libert&eacute;s publiques importantes. Comme Abraham Lincoln l'a exprim&eacute;, &laquo;&nbsp;chaque fois qu'il y a conflit entre les droits de l'homme et les droits de la propri&eacute;t&eacute;, les droits de l'homme doivent pr&eacute;valoir&nbsp;&raquo;. Les droits de la propri&eacute;t&eacute; sont con&ccedil;us pour faire avancer le bien-&ecirc;tre del'Humanit&eacute; et pas comme excuse pour la m&eacute;priser.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2001 Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2001 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Benjamin Drieu.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
