Repository: gitGNU/gnu_www-fr
Catalog: philosophy/guardian-article.*.po
Languages: fr

source: That's fighting talk
fr: That's fighting talk <sup><a href="#TransNote1">1</a></sup>

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a> and <strong>Nick Hill</strong>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a> et <strong>Nick Hill</strong>

source: The computer industry is threatened by a Wild West-style land grab. The biggest, richest companies are being assisted by governments to take unassailable exclusive control of the ideas that programmers combine to make a program.
fr: L'industrie informatique est menac&eacute;e par une conqu&ecirc;te de style Far West. Les soci&eacute;t&eacute;s les plus grosses et les plus riches sont assist&eacute;es par les gouvernements pour prendre un contr&ocirc;le exclusif inamovible sur les id&eacute;es que les programmeurs assemblent pour en faire un programme.

source: Our society is becoming more dependent on information technology. At the same time, centralised control over and ownership of the information technology field is increasing, and mega-corporations with law-given dominion over our computers could take away our freedoms and democracy. With an effective monopoly on modern software, the largest grabbers of the &ldquo;land&rdquo; will have control over what we can ask our computers to do, and control over production and distribution of information on the net, through monopolies that the EU plans to give them.
fr: Notre soci&eacute;t&eacute; devient de plus en plus d&eacute;pendante de la technologie de l'information. En m&ecirc;me temps, la propri&eacute;t&eacute; et le contr&ocirc;le centralis&eacute; dans le domaine de la technologie de l'information s'accro&icirc;t et les mega-soci&eacute;t&eacute;s, gr&acirc;ce aux lois f&eacute;d&eacute;rales sur les ordinateurs pourraient nous priver de nos libert&eacute;s et de la d&eacute;mocratie. Avec un monopole efficace sur le logiciel moderne, les plus grands conqu&eacute;rants de cette &laquo;terre&raquo; auront le contr&ocirc;le sur ce que nous demanderons &agrave; nos ordinateurs de faire, et sur la production et la distribution de l'information sur le Web, par l'interm&eacute;diaire des monopoles que l'Union europ&eacute;enne envisage de leur donner.

source: The monopolies are patents, each one restricting use of one or several of these software ideas. We call them &ldquo;software patents&rdquo; because they restrict what we programmers can make software do. How do these monopolies work? If you wish to use your computer as a word processor, it must follow instructions that tell it how to act like a word processor. This is analogous to instructions found on a musical score, which tell an orchestra how to play a symphony. The instructions are not simple. They are made up of thousands of smaller instructions, much like sequences of notes and chords. A symphonic score embodies hundreds of musical ideas, and a computer program uses hundreds or thousands of software ideas. Since each idea is abstract, there are often different ways to describe it: thus, some ideas can be patented in multiple ways.
fr: Ces monopoles sont les brevets, chacun d'eux restreignant l'utilisation d'une ou plusieurs de ces id&eacute;es dans les logiciels. Nous les appelons &laquo;brevets logiciels&raquo; car ils restreignent ce que nous, programmeurs, pouvons faire faire au logiciel. Comment fonctionnent ces monopoles&nbsp;? Si vous d&eacute;sirez utiliser votre ordinateur comme un traitement de texte, il doit suivre les instructions qui lui indiquent comment faire pour fonctionner comme un traitement de texte. C'est comparable aux instructions sur les partitions musicales, qui indiquent &agrave; un orchestre comment jouer une symphonie. Les instructions ne sont pas simples. Elles sont compos&eacute;es de milliers d'instructions plus petites, un peu comme des suites de notes et d'accords. La partition d'une symphonie comprend des centaines d'id&eacute;es musicales, et un logiciel utilise des centaines ou des milliers d'id&eacute;es logicielles. Puisque chaque id&eacute;e est abstraite, il y a souvent diff&eacute;rentes fa&ccedil;ons de la d&eacute;crire : par cons&eacute;quent, les id&eacute;es peuvent &ecirc;tre brevet&eacute;es de multiples fa&ccedil;ons.

source: The US, which has had software patents since the 1980s, shows what this can do to development of everyday software. For example, in the US there are 39 monopoly claims over a standard way of showing video using software techniques (the <abbr title="Moving Picture Experts Group">MPEG</abbr> 2 format).
fr: Les &Eacute;tats-Unis, qui ont des brevets logiciels depuis les ann&eacute;es 80, montrent ce que cela peut faire au d&eacute;veloppement logiciel de tous les jours. Par exemple, aux &Eacute;tats-Unis, il y a 39 revendications de monopoles sur une fa&ccedil;on standard d'afficher de la vid&eacute;o en utilisant des techniques logicielles (le format MPEG 2).

source: Since a single piece of software can embody thousands of ideas together, and those ideas are arbitrary in scope and abstract in nature, writing software will only be worthwhile for those who are rich and have a large software monopoly portfolio: those with the war chest and clout to fight off claims that might otherwise sink a business. In the US, the average cost of defending against an invalid patent claim is $1.5 million. The courts favour the wealthy, so even when a small business gets a few patents, it will find them useless.
fr: Puisque qu'une simple partie de logiciel peut englober des milliers d'id&eacute;es, et que ces id&eacute;es sont arbitrairement dans le champ d'application et sont abstraites par nature, &eacute;crire un logiciel ne sera valable que pour ceux qui sont riches et qui ont un gros portefeuille de monopoles logiciels : ceux qui ont un tr&eacute;sor de guerre et qui peuvent &eacute;craser les revendications qui couleraient leurs affaires. Aux &Eacute;tats-Unis, le co&ucirc;t moyen pour se d&eacute;fendre contre une revendication de brevet invalide est de 1,5 million de dollars. Les tribunaux favorisent les plus fortun&eacute;s, aussi, m&ecirc;me si une petite soci&eacute;t&eacute; obtient quelques brevets, ils ne lui seront d'aucune utilit&eacute;.

source: Software patents are being claimed at a tremendous rate in the US. If they become legal in Europe, most of those US patents will be extended to Europe also. This is likely to have a devastating effect on European software development&mdash;leading to job losses, a poorer economy, more expensive computer use, and less choice and less freedom for the end user. The advocates of software patents in Europe, and the probable beneficiaries of them, are the patent bureaucracy (more influence on more areas of life), patent lawyers (more business from both plaintiffs and defendants), and computer mega-corporations such as IBM and Microsoft.
fr: Les revendications de brevets logiciels se font &agrave; un rythme effr&eacute;n&eacute; aux &Eacute;tats-Unis. S'ils devenaient l&eacute;gaux en Europe, la plupart de ces brevets am&eacute;ricains seront &eacute;tendus &agrave; l'Europe &eacute;galement. Il est vraisemblable que cela aura un effet d&eacute;vastateur sur le d&eacute;veloppement du logiciel europ&eacute;en &mdash; conduisant &agrave; des pertes d'emploi, une &eacute;conomie plus faible, une utilisation plus on&eacute;reuse des ordinateurs, et moins de choix et de libert&eacute; pour l'utilisateur. Les avocats des brevets logiciels en Europe, et leurs b&eacute;n&eacute;ficiaires probables, sont la bureaucratie des brevets (plus d'influence sur plus de domaines), les avocats en brevet (plus d'affaires, des plaignants comme des accusateurs), et les g&eacute;ants informatiques comme IBM et Microsoft.

source: Foremost among the software mega-corporations is Microsoft. Even as part of the European commission investigates Microsoft for monopolistic practices, another part is planning to hand it an unending series of overlapping 20-year monopolies. Bill Gates wrote in his Challenges and Strategy memo of May 16 1991 that &ldquo;If people had understood how patents would be granted when most of today's ideas were invented and had taken out patents, the industry would be at a complete standstill today. The solution &hellip; is patenting as much as we can &hellip; A future start-up with no patents of its own will be forced to pay whatever price the giants choose to impose.&rdquo; Today Microsoft hopes to parlay software patents into a permanent monopoly on many areas of software.
fr: De plus, parmi ces g&eacute;ants de l'informatique se trouve Microsoft. M&ecirc;me si une partie de la Commission europ&eacute;enne enqu&ecirc;te sur les pratiques monopolistiques de Microsoft, une autre partie pr&eacute;voit de lui pr&ecirc;ter main-forte pour une interminable s&eacute;rie de monopoles de plus de 20 ans. Bill Gates a &eacute;crit dans son m&eacute;mo &laquo;&nbsp;Challenges and Strategy&nbsp;&raquo; du 16 mai 1991 que&nbsp;: &laquo;&nbsp;Si les gens avaient compris comment se faire accorder des brevets quand la plupart des id&eacute;es actuelles furent invent&eacute;es, l'industrie serait en compl&egrave;te stagnation aujourd'hui. La solution est&hellip; de breveter autant que nous le pouvons&hellip; Une nouvelle start-up sans brevet lui appartenant serait forc&eacute;e de payer le prix impos&eacute;, quel qu'il soit, par les g&eacute;ants de l'informatique&nbsp;&raquo;. Aujourd'hui, Microsoft tente le tout pour le tout, dans un monopole permanent sur beaucoup de domaines du logiciel.

source: The European commission says its proposed directive on computer-implemented inventions will disallow software patents. But the text was actually written by the Business Software Alliance, which represents the largest software companies. (The commission didn't admit this&mdash;we detected it.) It contains vague words that we suspect are designed to open the door for software patents.
fr: La Commission europ&eacute;enne pr&eacute;tend que sa proposition de directive sur les inventions mises en &oelig;uvre par ordinateurs rejetterait les brevets logiciels. Mais le texte &eacute;tait en fait &eacute;crit par la Business Software Alliance, qui repr&eacute;sente les plus grandes soci&eacute;t&eacute;s informatiques. (La Commission ne l'a pas admis &mdash; nous l'avons d&eacute;couvert). Il contient des termes vagues que nous pensons &ecirc;tre con&ccedil;us pour ouvrir la porte aux brevets logiciels.

source: The text says that computer-related patents must make a &ldquo;technical contribution&rdquo;; the commission says that means &ldquo;no software patents&rdquo;. But &ldquo;technical&rdquo; can be interpreted in many ways. The European patent office is already registering software patents of dubious legal validity, defying the treaty that governs it and the governments that established it. Operating under those words, it will stretch them to allow all kinds of software patents.
fr: Le texte dit que les inventions relatives aux ordinateurs doivent repr&eacute;senter une &laquo;&nbsp;contribution technique&nbsp;&raquo;. La Commission dit que cela signifie &laquo;&nbsp;pas de brevet logiciel&nbsp;&raquo;. Mais &laquo;&nbsp;technique&nbsp;&raquo; peut &ecirc;tre interpr&eacute;t&eacute; de diverses mani&egrave;res. L'Office europ&eacute;en des brevets enregistre d&eacute;j&agrave; des brevets logiciels dont la validit&eacute; l&eacute;gale est douteuse, d&eacute;fiant le trait&eacute; qui le gouverne et les gouvernements qui l'ont cr&eacute;&eacute;. En utilisant ces mots, il les &eacute;tendra jusqu'&agrave; autoriser toute sorte de brevets logiciels.

source: Arlene McCarthy, <abbr title="Member of the European Parliament">MEP</abbr> for north-west England, has been a key figure promoting and acting as rapporteur for this proposed directive. The cosmetic changes she has so far proposed do nothing to solve the problem. However, the cultural affairs commission's amendment that defines &ldquo;technical&rdquo; will assure British and European software developers that they will not risk a lawsuit simply by writing and distributing a software package.
fr: Arlene McCarthy, Membre du Parlement europ&eacute;en pour le nord-ouest de l'Angleterre, a &eacute;t&eacute; une des figures de proue en promouvant et en agissant comme rapporteur pour cette proposition de directive. Les changements cosm&eacute;tiques qu'elle a propos&eacute;s jusqu'ici n'ont rien fait pour r&eacute;soudre le probl&egrave;me. Toutefois, l'amendement de la Commission de la culture, de la jeunesse, de l'&eacute;ducation, des m&eacute;dias et des sports (CULT), qui d&eacute;finit le terme &laquo;&nbsp;technique&nbsp;&raquo;, assurera que les d&eacute;veloppeurs de logiciels europ&eacute;ens et britanniques ne risqueront pas de poursuites judiciaires pour avoir &eacute;crit et distribu&eacute; un paquetage logiciel.

source: The vague words drafted by the mega-corporations must be replaced with clear, decisive wording. Wording that will ensure that our information future will not be hijacked by the interests of a few rich organisations.
fr: Les termes vagues propos&eacute;s par les mega-soci&eacute;t&eacute;s doivent &ecirc;tre remplac&eacute;s avec une formulation claire et d&eacute;terminante. Une formulation qui assurera que le futur de notre information ne sera pas d&eacute;tourn&eacute; par les int&eacute;r&ecirc;ts de quelques riches organisations.

source: Please go to <a href="http://www.softwarepatents.co.uk">http://www.softwarepatents.co.uk</a> to learn more, and then talk with the <abbr>MEP</abbr>s from your region.
fr: Veuillez vous rendre sur <a href="http://www.softwarepatents.co.uk">http://www.softwarepatents.co.uk</a> pour en apprendre plus, et parler avec le Membre du Parlement europ&eacute;en de votre r&eacute;gion.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;:<br /><ol><li id="TransNote1">C'est une rubrique du Guardian que l'onpourrait traduire par &laquo;&nbsp;Joutes verbales&nbsp;&raquo; ou &laquo;&nbsp;&Ccedil;a, c'est du d&eacute;bat&nbsp;!&nbsp;&raquo;.</li></ol>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections (or suggestions) to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2003 Richard M Stallman and Nicholas R Hill <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2003 Richard M Stallman et Nicholas R Hill <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
