Repository: gitGNU/gnu_www-fr
Catalog: philosophy/hague.*.po
Languages: fr

source: Harm from the Hague - GNU Project - Free Software Foundation (FSF)
fr: Le danger de la Haye - GNU Project - Free Software Foundation (FSF)

source: Harm from the Hague
fr: Le danger de la Haye

source: By <a href="http://www.stallman.org">Richard Stallman</a>, June 2001
fr: par <a href="mailto:rms&#64;gnu.org">Richard Stallman</a>, juin 2001

source: Europeans have energetically opposed and thwarted the attempt to introduce software patents in Europe. A proposed treaty, now being negotiated, threatens to subject software developers in Europe and other countries to U.S. software patents &mdash; and other harmful laws from around the world. The problem is not just for programmers; authors of all kinds will face new dangers. Even the censorship laws of various countries could have globalized effect.
fr: Les europ&eacute;ens se sont oppos&eacute;s &eacute;nergiquement et ont contrecarr&eacute; la tentative d'introduction des brevets logiciels en Europe. Une proposition de trait&eacute;, en cours de n&eacute;gociation, menace d'assujettir les d&eacute;veloppeurs de logiciels en Europe et dans d'autres pays au syst&egrave;me des brevets am&eacute;ricains et d'autres lois dangereuses de par le monde. Le probl&egrave;me ne concerne pas uniquement les programmeurs&nbsp;; les auteurs de tout type seront confront&eacute;s &agrave; de nouveaux dangers. M&ecirc;me les lois sur la censure de divers pays pourraient avoir un effet global.

source: The Hague treaty is not actually about patents, or about copyrights, or about censorship, but it affects all of them. It is a treaty about jurisdiction, and how one country should treat the court decisions of another country. The basic idea is reasonable enough: if someone hits your car in France or breaks a contract with your French company, you can sue him in France, then bring the judgment to a court in whichever country he lives in (or has assets in) for enforcement.
fr: Le trait&eacute; de la Haye ne concerne pas en fait les brevets, les copyrights ou la censure, mais il les affecte tous. Il s'agit d'un trait&eacute; sur la juridiction et sur la mani&egrave;re dont un pays devrait traiter les d&eacute;cisions de justice d'un autre pays. L'id&eacute;e de base est suffisamment raisonnable&nbsp;: si une personne heurte votre voiture en France ou rompt un contrat avec votre soci&eacute;t&eacute; fran&ccedil;aise, vous pouvez la poursuivre en France et ensuite porter le jugement dans un tribunal du pays dans lequel cette personne vit (ou dans lequel elle a des actifs), quel qu'il soit, pour l'appliquer.

source: The treaty becomes a problem when it is extended to distribution of information &mdash; because information now travels normally and predictably to all countries. (The Internet is one way, but not the only way.) The consequence is that you could be sued about the information you distributed under the laws of <strong>any</strong> Hague country, and the judgment would probably be enforced by your country.
fr: Le trait&eacute; devient un probl&egrave;me quand il est &eacute;tendu &agrave; la distribution de l'information, car l'information voyage aujourd'hui normalement et comme on doit s'y attendre dans tous les pays (l'Internet en est un vecteur mais pas le seul). La cons&eacute;quence est que vous pouvez &ecirc;tre poursuivi pour une information que vous avez distribu&eacute; sous la loi de <strong>n'importe quel</strong> pays du trait&eacute; de la Haye et que le jugement sera probablement appliqu&eacute; par votre pays.

source: For instance, if you release a software package (either free or not) in Germany, and people use it in the U.S., you could be sued for infringing an absurd U.S. software patent. That part does not depend on Hague &mdash; it could happen now. But right now you could ignore the U.S. judgment, safe in Germany, and the patent holder knows this. Under the Hague treaty, any German court would be required to enforce the U.S. judgment against you. In effect, the software patents of any signatory country would apply to all signatory countries. It isn't enough to keep software patents out of Europe, if U.S. or Japanese or Egyptian software patents can reach you there.
fr: Par exemple, si vous publiez un logiciel (qu'il soit libre ou non) en Allemagne et que des gens l'utilisent aux &Eacute;tats-Unis, vous pouvez &ecirc;tre poursuivi pour avoir enfreint un brevet logiciel am&eacute;ricain stupide. Cette partie du probl&egrave;me n'est pas caus&eacute;e par le trait&eacute; de la Haye, cela peut d'ores et d&eacute;j&agrave; se produire. Mais jusqu'&agrave; pr&eacute;sent vous pouviez ignorer le jugement am&eacute;ricain, bien en s&eacute;curit&eacute; en Allemagne&nbsp;; et le d&eacute;tenteur du brevet le sait. &Agrave; cause du trait&eacute; de la Haye, tout tribunal allemand serait oblig&eacute; de faire appliquer le jugement am&eacute;ricain contre vous. Dans les faits, les brevets de tout pays signataire s'appliqueraient &agrave; tous les autres pays signataires. Il ne suffira pas de rejeter les brevets logiciels d'Europe si les brevets am&eacute;ricains, japonais ou &eacute;gyptiens pouvaient vous y atteindre.

source: But patent law is not the only area of law that could wreak havoc if globalized by the Hague treaty. Suppose you publish a statement criticizing a public figure. If copies are read in England, that public figure could sue you under the strict U.K. libel law. The laws of your country may support the right to criticize a public figure, but with the Hague treaty, they won't necessarily protect you any more.
fr: Mais les lois sur les brevets ne sont pas les seules qui pourraient avoir des effets d&eacute;sastreux si elles &eacute;taient globalis&eacute;es par le trait&eacute; de la Haye. Supposez que vous publiiez une d&eacute;claration critiquant une personne publique. Si des copies sont lues en Angleterre, cette personne pourrait vous poursuivre sous la loi anti-diffamation anglaise, qui est tr&egrave;s stricte. Les lois de votre pays peuvent bien d&eacute;fendre votre droit de critiquer une personne publique, mais avec le trait&eacute; de la Haye, elles ne vous prot&eacute;geraient plus n&eacute;cessairement.

source: Or suppose you publish a statement comparing your prices with your competitors' prices. If this is read in Germany, where comparative advertising is illegal, you could be sued in Germany and the judgment brought back to you wherever you are. (Subsequent note: I've received word that this law may have been changed in Germany. The point is the same, though&mdash;any country could have such a law, and some other European countries may still have one.)
fr: Ou supposez que vous publiiez une d&eacute;claration comparant vos prix avec ceux de vos concurrents. Si elle est lue en Allemagne, o&ugrave; la publicit&eacute; comparative est ill&eacute;gale, vous pourriez &ecirc;tre poursuivi en Allemagne et le jugement vous sera retourn&eacute; o&ugrave; que vous soyez. (Note ult&eacute;rieure&nbsp;: J'ai re&ccedil;u un petit mot qui m'informais que cette loi aurait pu &ecirc;tre modifi&eacute;e en Allemagne. Cela ne change rien cependant&nbsp;: n'importe quel pays pourrait avoir une telle loi et d'autres pays europ&eacute;ens peuvent avoir encore une loi similaire).

source: Or suppose you publish a parody. If it is read in Korea, you could be sued there, since Korea does not recognize a right to parody. (Since the publication of this article, the Korean Supreme Court affirmed the right to parody, but the general point remains.)
fr: Ou supposez que vous publiiez une parodie. Si elle est lue en Cor&eacute;e, vous pourriez y &ecirc;tre poursuivi, puisque la Cor&eacute;e ne reconna&icirc;t pas le droit &agrave; laparodie. Depuis la parution de cette article, la Cour suprême de Corée a reconnu le droit à la parodie, mais le point général demeure).

source: Or suppose you have political views that a certain government prohibits. You could be sued in that country, and the judgment against you there would be enforced wherever you live.
fr: Ou supposez que vous ayez des convictions politiques qu'un gouvernement quelconque interdit. Vous pourriez &ecirc;tre poursuivi dans ce pays et le jugement contre vous serait appliqu&eacute; o&ugrave; que vous viviez.

source: Not long ago, Yahoo was sued in France for having links to U.S. sites that auctioned Nazi memorabilia, which is lawful in the U.S. After a French court required Yahoo France to block such links, Yahoo went to court in the U.S., asking for a ruling that the French judgment cannot be applied to the parent company in the U.S.
fr: Il n'y a pas si longtemps, Yahoo a &eacute;t&eacute; poursuivi en France pour avoir fait des liens vers des sites am&eacute;ricains qui mettaient aux ench&egrave;res des souvenirs nazis, ce qui est autoris&eacute; aux &Eacute;tats-Unis. Apr&egrave;s qu'un tribunal Fran&ccedil;ais ait demand&eacute; &agrave; Yahoo France de bloquer de tels liens, Yahoo est all&eacute; en justice aux &Eacute;tats-Unis, demandant un jugement pour que la d&eacute;cision de justice fran&ccedil;aise ne puisse pas s'appliquer &agrave; la maison m&egrave;re aux &Eacute;tats-Unis.

source: It may come as a surprise to learn that exiled Chinese dissidents joined the case in support of Yahoo. But they knew what they were doing &mdash; their democracy movement depends on the outcome.
fr: Il peut sembler surprenant d'apprendre que des dissidents chinois exil&eacute;s se soient joints &agrave; Yahoo dans l'affaire. Mais ils savaient ce qu'ils faisaient&nbsp;: leur mouvement d&eacute;mocratique d&eacute;pend du r&eacute;sultat du proc&egrave;s.

source: You see, Nazism is not the only political view whose expression is prohibited in certain places. Criticism of the Chinese government is also prohibited &mdash; in China. If a French court ruling against Nazi statements is enforceable in the US, or in your country, maybe a Chinese court ruling against anti-Chinese-government statements will be enforceable there too. (This might be why China has joined the Hague treaty negotiations.) The Chinese government can easily adapt its censorship law so that the Hague treaty would apply to it; all it has to do is give private individuals (and government agencies) the right to sue dissident publications.
fr: Voyez-vous, le nazisme n'est pas la seule conviction politique dont l'expression est interdite dans certains lieux. Critiquer le gouvernement chinois est interdit aussi&hellip; en Chine. Si la condamnation d'un tribunal fran&ccedil;ais sur des propos nazis est applicable aux &Eacute;tats-Unis ou dans votre pays, peut-&ecirc;tre qu'une d&eacute;cision de justice chinoise contre des d&eacute;clarations anti-gouvernementales chinoises y seront aussi applicables (ce qui est peut-&ecirc;tre la raison pour laquelle la Chine s'est jointe aux n&eacute;gociations du trait&eacute; de la Haye). Le gouvernement chinois peut facilement adapter sa loi sur la censure de mani&egrave;re &agrave; ce que le trait&eacute; de la Haye s'y applique&nbsp;; tout ce qu'il a &agrave; faire, c'est de donner le droit aux individus (et aux agences gouvernementales) de poursuivre les publications dissidentes.

source: China is not the only country to ban criticism of the government; as of this writing, the government of Victoria (Australia) is suing to suppress a book called Victoria Police Corruption on the grounds that it &ldquo;scandalizes the courts.&rdquo; This book is available on the Internet outside Australia. Australia is a Hague treaty participant; if the treaty applies to such cases, an Australian court judgment against the book could be used to suppress it elsewhere.
fr: La Chine n'est pas le seul pays &agrave; bannir la critique du gouvernement&nbsp;; au moment de l'&eacute;criture de cet article, le gouvernement de Victoria (en Australie) poursuit l'auteur d'un livre appel&eacute; &laquo;&nbsp;la corruption de la police de Victoria&nbsp;&raquo; en vue de la suppression de l'ouvrage sur la base qu'il &laquo;&nbsp;scandalise les tribunaux.&nbsp;&raquo; Ce livre est disponible sur l'Internet en dehors de l'Australie. L'Australie participe au trait&eacute; de la Haye&nbsp;; si le trait&eacute; s'applique &agrave; de tels cas, un jugement australien contre le livre pourrait &ecirc;tre utilis&eacute; pour le supprimer ailleurs.

source: Meanwhile, works that criticize Islam have faced increasing censorship in Egypt, a Hague treaty participant; this too could be globalized by the Hague treaty.
fr: Au m&ecirc;me moment, les travaux qui critiquent l'Islam ont eu &agrave; faire face &agrave; une censure grandissante en &Eacute;gypte, un participant au trait&eacute; de la Haye. Cela aussi pourrait &ecirc;tre globalis&eacute; par le trait&eacute; de la Haye.

source: Americans may turn to the First Amendment to protect them from foreign judgments against their speech. The draft treaty permits a court to ignore a foreign judgment that is &ldquo;manifestly incompatible with public policy.&rdquo; That is a stringent criterion, so you cannot count on it to protect you just because your conduct is legal where you are. Just what it does cover is up to the particular judge. It is unlikely to help you against broad foreign interpretations of copyright, trademarks or software patents, but U.S. courts might use it to reject outright censorship judgments.
fr: Les Am&eacute;ricains pourraient se retourner vers le premier amendement<sup><a href="#TransNote1">1</a></sup> pour se prot&eacute;ger contre les jugements&eacute;trangers contre leurs discours. Le projet detrait&eacute; autorise un tribunal &agrave; ignorer un jugement&eacute;tranger s'il est &laquo;&nbsp;manifestement incompatibleavec les principes publics.&nbsp;&raquo; Il s'agit d'uncrit&egrave;re strict, donc vous ne pouvez pas compter dessus pourvous prot&eacute;ger juste parce que votre conduite estl&eacute;gale l&agrave; o&ugrave; vous &ecirc;tes. Ce qu'il couvreest uniquement &agrave; la discr&eacute;tion d'un jugeparticulier. Il est improbable que ce crit&egrave;re vous aide contre delarges interpr&eacute;tations &eacute;trang&egrave;res ducopyright, du droit des marques ou des brevets logiciels mais lestribunaux am&eacute;ricains pourraient l'utiliser pour rejetercat&eacute;goriquement les jugements sur la censure.

source: However, even that won't help you if you publish on the Internet, because your <abbr title="Internet service provider">ISP</abbr> either has assets in other countries or communicates to the world through larger <abbr>ISP</abbr>s that have them. A censorship judgment against your site, or any other kind, could be enforced against your <abbr>ISP</abbr>, or your <abbr>ISP</abbr>'s <abbr>ISP</abbr>, in any other country where it has assets &mdash; and where there is no Bill of Rights, and freedom of speech does not enjoy the same exalted status as in the U.S. In response, the ISP will shut off your site. The Hague treaty would globalize pretexts for lawsuits, but not the protections for civil liberties, so any local protection could be bypassed.
fr: De toutes fa&ccedil;ons, cela ne vous aidera m&ecirc;me pas si vous publiez sur l'Internet car votre fournisseur d'acc&egrave;s &agrave; des int&eacute;r&ecirc;ts dans d'autres pays ou communique avec le reste du monde par des fournisseurs d'acc&egrave;s plus grands qui en ont. Un jugement censurant votre site (ou tout autre type de jugement) serait appliqu&eacute; contre votre fournisseur d'acc&egrave;s ou contre le fournisseur d'acc&egrave;s de votre fournisseur d'acc&egrave;s dans tout autre pays o&ugrave; il a des int&eacute;r&ecirc;ts et o&ugrave; il n'y a pas de d&eacute;claration des droits de l'homme et o&ugrave; la libert&eacute; d'expression n'a pas de statut aussi &eacute;lev&eacute; qu'aux &Eacute;tats-Unis. En r&eacute;ponse, votre fournisseur d'acc&egrave;s fermera votre site. Le trait&eacute; de la Haye globaliserait les pr&eacute;textes pour les poursuites, mais pas les protections des libert&eacute;s individuelles, ainsi, toute protection locale serait contourn&eacute;e.

source: Does suing your <abbr>ISP</abbr> seem far-fetched? It already happens. When the multinational company Danone announced plans to close factories in France, Olivier Malnuit opened a site, jeboycottedanone.com, to criticize this. (The name is French for &ldquo;I boycott Danone.&rdquo;) Danone sued not only him but his site hosting company and domain name registrar for &ldquo;counterfeiting of goods&rdquo; &mdash; and in April 2001 received a ruling prohibiting Malnuit from mentioning the name &ldquo;Danone&rdquo; either in the domain name or in the text of the site. Even more telling, the registrar removed the domain in fear before the court made a ruling.
fr: Est-ce que la poursuite de votre fournisseur d'acc&egrave;s vous semble tir&eacute;e par les cheveux&nbsp;? C'est d&eacute;j&agrave; arriv&eacute;. Quand la multinationale Danone a annonc&eacute; des plans de fermeture d'usines en France, Olivier Malnuit a ouvert un site, jeboycottedanone.com, pour critiquer cette d&eacute;cision. Danone l'a poursuivi, non seulement lui mais aussi son fournisseur d'acc&egrave;s et son fournisseur de nom de domaine pour &laquo;&nbsp;contrefa&ccedil;on&nbsp;&raquo;. Et en avril 2001, a obtenu un jugement interdisant de mentionner le nom &laquo;&nbsp;Danone&nbsp;&raquo; soit dans le nom de domaine, soit dans le contenu de son site. Et pour tout dire, le fournisseur de nom de domaine a retir&eacute; le domaine par peur avant m&ecirc;me que le tribunal ne rende sa d&eacute;cision.

source: The natural response for French dissidents is to publish their criticism of Danone outside France, just as Chinese dissidents publish their criticism of China outside China. But the Hague treaty would enable Danone to attack them everywhere. Perhaps even this article would be suppressed through its <abbr>ISP</abbr> or its <abbr>ISP</abbr>'s <abbr>ISP</abbr>.
fr: La r&eacute;ponse naturelle des dissidents fran&ccedil;ais est de publier leurs critiques sur Danone en dehors de France, tout comme les dissidents chinois publient leurs critiques sur la Chine en dehors de Chine. Mais le trait&eacute; de la Haye autoriserait Danone &agrave; les attaquer partout. Peut-&ecirc;tre m&ecirc;me cet article serait-il supprim&eacute; par son fournisseur d'acc&egrave;s ou le fournisseur d'acc&egrave;s de son fournisseur d'acc&egrave;s.

source: The potential effects of the treaty are not limited to laws that exist today. When 50 countries know that their court judgments could be enforced throughout North America, Europe and Asia, they would have plenty of temptation to pass laws just for that purpose.
fr: Les effets potentiels du trait&eacute; ne sont pas limit&eacute;s aux lois qui existent aujourd'hui. Quand cinquante pays savent que leurs jugements pourraient &ecirc;tre appliqu&eacute;s en Am&eacute;rique du Nord, en Europe et en Asie, ils seraient tr&egrave;s tent&eacute;s de passer des lois uniquement dans ce but.

source: Suppose, for example, that Microsoft would like to be able to impose copyright on languages and network protocols. They could approach a small, poor country and offer to spend $50 million a year there for 20 years, if only that country will pass a law saying that implementing a Microsoft language or protocol constitutes copyright infringement. They can surely find some country which would take the offer. Then if you implement a compatible program, Microsoft could sue you in that country, and win. When the judge rules in their favor and bans distribution of your program, the courts in your country will enforce the judgment on you, obeying the Hague treaty.
fr: Supposez, par exemple, que Microsoft aimerait pouvoir imposer un copyright sur des langages ou des protocoles r&eacute;seau. Microsoft pourrait se rapprocher d'un petit pays pauvre et lui offrir de d&eacute;penser cinquante millions de dollars par an pendant vingt ans si seulement ce pays faisait passer une loi disant que la mise en &oelig;uvre d'un langage ou d'un protocole de Microsoft constitue une infraction au copyright. Ils trouveraient certainement un pays qui accepterait leur offre. Ainsi, si vous mettez en &oelig;uvre un programme compatible, Microsoft pourrait vous poursuivre dans ce pays et gagner. Quand les juges interc&eacute;deront en leur faveur et interdiront la distribution de votre programme, les tribunaux de votre pays appliqueront le jugement contre vous, comme le veut le trait&eacute; de la Haye.

source: Does this seem implausible? In 2000, Cisco pressured Liechtenstein, a small European country, to legalize software patents. And IBM's chief lobbyist threatened many European governments with a termination of investment if they did not support software patents. Meanwhile, the U.S. trade representative pressured Middle Eastern country Jordan to allow patents on mathematics.
fr: Cela vous semble t'il invraisemblable&nbsp;? En l'an 2000, Cisco a fait pression sur le Liechtenstein, un petit pays europ&eacute;en, pour l&eacute;galiser les brevets logiciels. Et le responsable du lobbying d'IBM a menac&eacute; de nombreux pays europ&eacute;ens d'arr&ecirc;ter leurs investissements s'ils ne soutenaient pas les brevets logiciels. Au m&ecirc;me moment, le repr&eacute;sentant au commerce am&eacute;ricain a fait pression sur la Jordanie pour autoriser les brevets sur les math&eacute;matiques.

source: A meeting of consumer organizations (<a href="http://www.tacd.org">http://www.tacd.org</a>) recommended in May 2001 that patents, copyrights and trademarks (&ldquo;intellectual property&rdquo;) should be excluded from the scope of the Hague treaty, because these laws vary considerably between countries.
fr: Un rassemblement d'associations de consommateurs (<a href="http://www.tacd.org/">http://www.tacd.org/</a>) a recommand&eacute; en mai 2001 que les brevets, les copyrights et les marques (la &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;) soit exclue de l'application du trait&eacute; de la Haye, car les lois qui couvrent ces champs varient consid&eacute;rablement entre les pays.

source: That is a good recommendation, but it only solves part of the problem. Patents and bizarre extensions of copyright are just two of many excuses used for suppression of publication in certain countries. To solve the problem thoroughly, all cases about the legality of distributing or transmitting particular information should be excluded from globalization under the treaty, and only the country where the distributor or transmitter operates should have jurisdiction.
fr: Il s'agit d'une bonne recommandation, mais elle ne r&eacute;soud qu'une partie du probl&egrave;me. Les brevets et les extensions bizarres au copyright sont juste deux des nombreuses excuses pour supprimer la publication dans certains pays. Pour r&eacute;soudre le probl&egrave;me compl&egrave;tement, tous les cas touchant &agrave; la l&eacute;galit&eacute; de la distribution ou de la transmission d'une information particuli&egrave;re devraient &ecirc;tre exclus de la globalisation du trait&eacute; et seul le pays o&ugrave; le distributeur ou le transmetteur op&egrave;re devrait avoir juridiction.
