Repository: gitGNU/gnu_www-fr
Catalog: philosophy/hague.*.po
Languages: fr

source: In Europe, people opposed to software patents will be active in working to change the Hague treaty. In the U.S., the Consumer Project for Technology is taking the lead; for more information, see <a href="http://www.cptech.org/ecom/jurisdiction/hague.html">http://www.cptech.org/ecom/jurisdiction/hague.html</a>.
fr: En Europe, les opposants aux brevets logiciels travailleront activement pour la modification du trait&eacute; de la Haye&nbsp;; pour plus d'informations, voir <a href="http://www.noepatents.org/hague">http://www.noepatents.org/hague</a>. Aux &Eacute;tats-Unis, le Consumer Project for Technology prend la t&ecirc;te des initiatives&nbsp;; pour plus d'informations, voir <a href="http://www.cptech.org/ecom/jurisdiction/hague.html">http://www.cptech.org/ecom/jurisdiction/hague.html</a>.

source: A diplomatic conference is slated to begin today (June 6, 2001) to work on the details of the Hague treaty. We should make ministries and the public aware of the possible dangers as soon as possible.
fr: Une conf&eacute;rence diplomatique commence aujourd'hui (le 6 juin 2001) pour travailler sur les d&eacute;tails du trait&eacute; de la Haye. Nous devrions faire prendre conscience aux ministres et au public des dangers potentiels d&egrave;s que possible.

source: There is more information about the problems with the Hague at <a href="http://web.lemuria.org/DeCSS/hague.html">http://web.lemuria.org/DeCSS/hague.html</a>.
fr: Vous trouverez plus d'informations sur les probl&egrave;mes du trait&eacute; de La Haye sur <a href="http://web.lemuria.org/DeCSS/hague.html">http://web.lemuria.org/DeCSS/hague.html</a>.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;: <ol><li id="TransNote1">Le Premier amendement est l'amendementqui prot&egrave;ge la libert&eacute; d'expression aux &Eacute;tats-Unis.</li></ol>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Benjamin Drieu.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
