Repository: gitGNU/gnu_www-fr
Catalog: philosophy/historical-apsl.*.po
Languages: fr

source: Problems with older versions of the Apple License (APSL) - GNU Project - Free Software Foundation (FSF)
fr: Les probl&egrave;mes avec les anciennes versions de la licence Apple (APSL) - GNU Project - Free Software Foundation (FSF)

source: The Problems with older versions of the Apple Public Source License
fr: Les probl&egrave;mes avec les anciennes versions de la Apple Public Source License

source: FSF Position on the Older Versions of APSL
fr: Position de la FSF sur les anciennes versions de l'APSL

source: The current version of the Apple Public Source License (APSL) does not have any of these problems. <a href="/philosophy/apsl.html">You can read our current position on the APSL elsewhere</a>. This document is kept here for historical purposes only.
fr: La version actuelle de la Apple Public Source License (APSL) n'a aucun de ces probl&egrave;mes. Vous pouvez lire <a href="/philosophy/apsl.fr.html">notre position actuelle sur l'APSL ici</a>. Ce document est conserv&eacute; &agrave; des fins historiques seulement.

source: Apple released an updated version, 1.1, of the APSL but it remained unacceptable. They changed the termination clause into a &ldquo;suspension&rdquo; clause, but it still had the same kind of bad effects.
fr: Apple avait diffus&eacute; pour la premi&egrave;re fois une version mise &agrave; jour, 1.1, de l'APSL mais elle restait inacceptable. Ils avaient chang&eacute; la clause de terminaison en clause de &laquo;&nbsp;suspension&nbsp;&raquo;, mais cette clause avait toujours le m&ecirc;me genre d'effets n&eacute;fastes.

source: In January 2001, Apple released another version, APSL 1.2. This version fixes two of the fatal flaws, but one still remains: any modified version &ldquo;deployed&rdquo; in an organization must be published. The APSL 1.2 has taken two large steps towards a free software license, but still has one more large step to take before it qualifies.
fr: En janvier 2001, Apple a diffus&eacute; une autre version, ASPL 1.2. Cette version corrige deux des imperfections fatales, mais il en reste une&nbsp;: n'importe quelle version modifi&eacute;e &laquo;&nbsp;d&eacute;ploy&eacute;e&nbsp;&raquo; dans une organisation doit &ecirc;tre publi&eacute;e. L'APSL 1.2 a pris deux grandes mesures pour devenirune <a href="/philosophy/free-sw.fr.html">licence de logiciel libre</a>, mais il reste toujours une &eacute;tape plus grande &agrave; prendre avant de la qualifi&eacute; en tant que licence de logiciel libre.

source: Below, is the original commentary on the first version of the APSL, version 1.0.
fr: Ci-dessous se trouve le commentaire initial sur la premi&egrave;re version de l'APSL, la version 1.0.

source: Original APSL Commentary
fr: Commentaire original de l'APSL

source: After studying Apple's new source code license, the APSL, I have concluded that it falls short of being a free software license. It has three fatal flaws, any of which would be sufficient to make the software less than free.
fr: Apr&egrave;s avoir &eacute;tudi&eacute; la nouvelle licence de code source d'Apple, l'APSL, j'en ai conclut qu'elle n'&eacute;tait pas tout &agrave; fait une licence libre. Elle comporte trois d&eacute;fauts &eacute;liminatoires, dont chacun serait suffisant &agrave; rendre un logiciel moins que libre.

source: Disrespect for privacy
fr: Non respect de la vie privée

source: The APSL does not allow you to make a modified version and use it for your own private purposes, without publishing your changes.
fr: L'APSL ne vous permet pas d'apporter des modifications &agrave; un logiciel et de les utiliser pour vos besoins priv&eacute;s, sans publier vos modifications.

source: Central control
fr: Contr&ocirc;le central

source: Anyone who releases (or even uses, other than for R&amp;D) a modified version is required to notify one specific organization, which happens to be Apple.
fr: On demande &agrave; toute personne qui rend public (ou m&ecirc;me utilise, autrement que pour de la recherche et du d&eacute;veloppement) une version modifi&eacute;e de mettre au courant une organisation sp&eacute;cifique, qui est ici Apple.

source: Possibility of revocation at any time
fr: Possibilit&eacute; d'annulation &agrave; tout moment

source: The termination clause says that Apple can revoke this license, and forbid you to keep using all or some part of the software, any time someone makes an accusation of patent or copyright infringement.
fr: La clause de résiliation sp&eacute;cifie qu'Apple peut annuler cette licence et vous interdire de continuer &agrave; utiliser tout ou partie du logiciel, au cas o&ugrave; quelqu'un formulerait une accusation de violation de brevet ou de copyright.

source: In this way, if Apple declines to fight a questionable patent (or one whose applicability to the code at hand is questionable), you will not be able to have your own day in court to fight it, because you would have to fight Apple's copyright as well.
fr: De cette mani&egrave;re, si Apple renonce &agrave; se battre contre un brevet discutable (ou un dont l'application au code du logiciel en question est discutable), vous ne serez pas en mesure de vous battre vous m&ecirc;me en justice, car vous devrez aussi vous battre contre le copyright d'Apple.

source: Such a termination clause is especially bad for users outside the US, since it makes them indirectly vulnerable to the insane US patent system and the incompetent US patent office, which ordinarily could not touch them in their own countries.
fr: Une telle clause de résiliation est tout sp&eacute;cialement n&eacute;faste pour les utilisateurs en dehors des &Eacute;tats-Unis, car cela les rend indirectement vuln&eacute;rables au syst&egrave;me malsain des brevets am&eacute;ricains, et &agrave; l'incomp&eacute;tent bureau des brevets am&eacute;ricain, qui ne peut normalement pas les toucher dans leurs propres pays.

source: Any one of these flaws makes a license unacceptable.
fr: Chacun de ces d&eacute;fauts rend une licence inacceptable.

source: If these three flaws were solved, the APSL would be a free software license with three major practical problems, reminiscent of the NPL:
fr: Si ces trois d&eacute;fauts sont r&eacute;solus, alors l'APSL serait une licence libre, avec trois probl&egrave;mes pratiques majeurs h&eacute;rit&eacute;s de la NPL&nbsp;:

source: It is not a true copyleft, because it allows linking with other files which may be entirely proprietary.
fr: Ce n'est pas un vrai copyleft, car il autorise le lien avec des fichiers qui peuvent &ecirc;tre totalement propri&eacute;taires.

source: It is unfair, since it requires you to give Apple rights to your changes which Apple will not give you for its code.
fr: Il y a une injustice, car elle vous demande de donner des droits &agrave; Apple sur vos modifications, droits qu'Apple ne vous donnera pas sur son code.

source: It is incompatible with the GPL.
fr: Elle est incompatible avec la GPL.

source: Of course, the major difference between the NPL and the APSL is that the NPL <b>is</b> a free software license. These problems are significant in the case of the NPL because the NPL has no fatal flaws. Would that the same were true of the APSL.
fr: Bien s&ucirc;r, la plus grande diff&eacute;rence entre la NPL et l'APSL est que la NPL <b>est</b> une licence libre. Ces probl&egrave;mes sont significatifs dans le cas de la NPL car la NPL n'a pas de d&eacute;fauts &eacute;liminatoires. Ce serait aussi le cas avec l'APSL.

source: At a fundamental level, the APSL makes a claim that, if it became accepted, would stretch copyright powers in a dangerous way: it claims to be able to set conditions for simply <b>running</b> the software. As I understand it, copyright law in the US does not permit this, except when encryption or a license manager is used to enforce the conditions. It would be terribly ironic if a failed attempt at making a free software license resulted in an extension of the effective range of copyright power.
fr: D'un point de vue fondamental, l'APSL, si elle est accept&eacute;e, &eacute;tendrait les pouvoirs du copyright d'une mani&egrave;re dangereuse&nbsp;: elle revendique le droit de poser des conditions &agrave; la simple <b>ex&eacute;cution</b> de programmes. Tel que je le comprends, la loi sur le copyright dans les &Eacute;tats-Unis ne le permet pas, &agrave; part lorsque la cryptographie ou un <i>licence manager</i> est utilis&eacute; pour renforcer des conditions. Ce serait une ironie terrible si un essai rat&eacute; de faire une licence libre aurait pour r&eacute;sultat d'&eacute;tendre la port&eacute;e effective de la puissance du copyright.

source: Aside from this, we must remember that only part of MacOS is being released under the APSL. Even if the fatal flaws and practical problems of the APSL were fixed, even if it were changed into a very good free software license, that would do no good for the other parts of MacOS whose source code is not being released at all. We must not judge all of a company by just part of what they do.
fr: En dehors de cela, nous devons nous rappeler que seule une partie de MacOS est disponible sous l'APSL. M&ecirc;me si les d&eacute;fauts &eacute;liminatoires et les probl&egrave;mes d'application de l'APSL sont r&eacute;solus, m&ecirc;me si elle &eacute;tait modifi&eacute;e en une tr&egrave;s bonne licence libre, cela ne serait pas b&eacute;n&eacute;fique pour les autres parties de MacOS o&ugrave; le code source n'est pas du tout rendu public. Nous ne devons pas juger la totalit&eacute; d'une entreprise en se basant sur une petite partie de ce qu'elle fait.

source: Overall, I think that Apple's action is an example of the effects of the year-old <a href="/philosophy/open-source-misses-the-point.html">&ldquo;open source&rdquo; movement</a>: of its plan to appeal to business with the purely materialistic goal of faster development, while putting aside the deeper issues of freedom, community, cooperation, and what kind of society we want to live in.
fr: Par dessus tout, je pense que l'action d'Apple est une exemple des effets du <a href="/philosophy/open-source-misses-the-point.fr.html">&laquo;&nbsp;open source&nbsp;&raquo; movement</a> mouvement &laquo;&nbsp;open source&nbsp;&raquo; qui f&ecirc;te sa premi&egrave;re ann&eacute;e : de sa volont&eacute; d'en appeler &agrave; l'entreprise dans le but purement mat&eacute;rialiste d'un d&eacute;veloppement plus rapide, tout en mettant de c&ocirc;t&eacute; les probl&egrave;mes plus profonds de libert&eacute;, de communaut&eacute;, de coop&eacute;ration, et de quel type de soci&eacute;t&eacute; nous voulons pour y vivre.

source: Apple has grasped perfectly the concept with which &ldquo;open source&rdquo; is promoted, which is &ldquo;show users the source and they will help you fix bugs&rdquo;. What Apple has not grasped&mdash;or has dismissed&mdash;is the spirit of free software, which is that we form a community to cooperate on the commons of software.
fr: Apple a parfaitement saisi le concept promu par &laquo;&nbsp;open source&nbsp;&raquo;, qui est &laquo;&nbsp;montrez le code source aux utilisateurs et ils vont vous aider &agrave; corriger des bugs&nbsp;&raquo;. Ce qu'Apple n'a pas saisi, ou a &eacute;cart&eacute;, est l'esprit du logiciel libre, qui est que nous formons une communaut&eacute; pour coop&eacute;rer sur le d&eacute;nominateur commun du logiciel.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Benjamin Drieu.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
