Repository: gitGNU/gnu_www-fr
Catalog: philosophy/ICT-for-prosperity.*.po
Languages: fr

source: Instead, a country should arrange matters such that acting in a law abiding manner is without doubt the best action, for legal, moral, and practical reasons. People always hope their neighbors will be law abiding and honest; free software encourages that.
fr: Par contre, un pays devrait faire les choses de fa&ccedil;on &agrave; ce qu'agir dans le respect des lois, soit sans aucun doute la meilleure action, pour des raisons l&eacute;gales, morales et pratiques. On s'attend toujours &agrave; ce que son voisin soit respectueux des lois et honn&ecirc;te&nbsp;; c'est ce qu'encourage le logiciel libre.

source: Free software empowers people who previously were kept out.
fr: Le logiciel libre donne du pouvoir &agrave; ceux qui &eacute;taient laiss&eacute;s pour compte.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Pierre-Yves Enderlin.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
