Repository: gitGNU/gnu_www-fr
Catalog: philosophy/ICT-for-prosperity.*.po
Languages: fr

source: Shaping Collaborative ICT Development and Initiatives for Global Prosperity - GNU Project - Free Software Foundation (FSF)
fr: Fa&ccedil;onner le d&eacute;veloppement collaboratif des TIC et les initiatives pour la prosp&eacute;rit&eacute; globale

source: by <a href="http://www.rattlesnake.com/"><strong>Robert J. Chassell</strong></a>
fr: par <strong><a href="http://www.rattlesnake.com/">par Robert J.Chassell</a></strong>

source: What I want to do today is take one specific technology and talk about the way we have shaped that technology to make it accessible and empowering, how we have placed it in an economic and institutional framework that encourages people to work collaboratively, and how to use the technology for better governance.
fr: Ce que nous nous proposons de faire aujourd'hui, c'est de prendre une technologie sp&eacute;cifique, discuter de la fa&ccedil;on dont nous avons fa&ccedil;onn&eacute; cette technologie pour la rendre accessible et qu'elle soit un outil de pouvoir; discuter de la fa&ccedil;on dont nous l'avons plac&eacute;e dans un cadre &eacute;conomique et institutionnel qui encourage les gens &agrave; travailler en collaboration; puis de la fa&ccedil;on dont nous utilisons la technologie pour mieux gouverner.

source: The technology is software. The shaping has to do with copyright licensing terms &mdash; its legal and institutional framework.
fr: La technologie, c'est du logiciel. Cr&eacute;er, c'est se trouver face aux conditions juridiques du copyright, son cadre l&eacute;gal et institutionnel.

source: As a founder of the Free Software Foundation, I have been working for 16 years with the legal and institutional framework in which we use and develop software. GNU/Linux, a complete software system, is the outcome of these efforts.
fr: &Eacute;tant un des fondateurs de la Free Software Foundation, j'ai travaill&eacute; pendant 16 ans sur le cadre l&eacute;gal et institutionnel dans lequel nous utilisons et d&eacute;veloppons des logiciels. GNU/Linux, un syst&egrave;me logiciel complet, est n&eacute; de ces efforts.

source: When I speak of software, I am speaking both about the programs that run the computer, that is to say, the operating system, and about applications, such as electronic mail and other communications, spreadsheets, electronic commerce, writing tools, sending and receiving FAXes, Web site creation, engineering, research, mathematical computations, modeling, image manipulation, and networking.
fr: Quand je parle de logiciel, je veux parler aussi bien de ce qui fait tourner l'ordinateur,c'est-&agrave;-dire le syst&egrave;me d'exploitation, que des applications, comme le courrier &eacute;lectronique ou d'autres moyens de communication, les tableurs, le commerce &eacute;lectronique, les outils de traitement du texte, l'envoi et la r&eacute;ception de fax, la cr&eacute;ation de sites Web, l'ing&eacute;nierie, la recherche, les calculs math&eacute;matiques, la mod&eacute;lisation, la manipulation d'images et les r&eacute;seaux.

source: Over the last few years, the prices of computer and telecommunications hardware have dropped to the point that many more people are using them. Indeed, our conference organizers estimate that as many as one out of every thirty people in the world have computer-based, online telecommunications access.
fr: Ces derni&egrave;res ann&eacute;es, le prix des ordinateurs et des mat&eacute;riels de communication est tomb&eacute; a tellement baiss&eacute; que de plus en plus personnes les utilisent. En effet, les organisateurs de notre conf&eacute;rence estiment &agrave; un sur trente le nombre de personnes dans le monde ayant un acc&egrave;s informatique aux communications &eacute;lectroniques, qui sont connect&eacute;es.

source: While one out of thirty is still a small portion of the world's population, this technology is popular, growing, and becoming more important in our daily lives. In addition, we expect that computer and telecommunications prices will continue to drop for at least another generation, so many who currently lack resources will eventually benefit.
fr: Bien que le rapport d'un sur trente repr&eacute;sente une faible portion de la population mondiale, cette technologie est populaire, grandissante et commence &agrave; prendre de plus en plus de place dans notre quotidien. De plus, nous nous attendons &agrave; ce que les ordinateurs et les co&ucirc;ts des communications continuent &agrave; baisser, pour au moins une autre g&eacute;n&eacute;ration, ce qui signifie que ceux qui n'y ont pas encore acc&egrave;s vont &eacute;ventuellement en profiter.

source: As with any technology, software can be employed well or badly.
fr: Comme pour toute technologie, le logiciel peut s'utiliser d'une bonne ou d'une mauvaise fa&ccedil;on.

source: At the moment we see both. On the bad side, we see machines that crash unnecessarily, email messages that waste their recipients money, systems that are vulnerable to simple viruses, and programs that do only part of what you want.
fr: En ce moment, c'est les deux que nous voyons. Le mauvais c&ocirc;t&eacute;, ce sont des machines qui plantent sans raison, des courriels qui perdent leurs destinataires (dans les transactions d'argent), des syst&egrave;mes vuln&eacute;rables &agrave; de simples virus et des programmes qui ne font qu'une partie de ce que vous attendez d'eux.

source: The key to good use of software is to ensure freedom. In software, this leads to collaboration, lower prices, reliability, efficiency, security, and fewer barriers to entry and use.
fr: La clef qui permet un bon usage d'un logiciel est d'assurer la libert&eacute;. Dans le cas du logiciel, cela entra&icirc;ne collaboration, prix plus bas, fiabilit&eacute;, efficacit&eacute;, s&eacute;curit&eacute; et moins de barri&egrave;res pour y participer et l'utiliser.

source: For a good use of software technology, people must have the legal right to copy, study, modify, and redistribute it. All else flows from this.
fr: Pour faire bon usage de la technologie logicielle, les gens doivent avoir le droit l&eacute;gal de la copier, l'&eacute;tudier, la modifier et de la redistribuer. Tout le reste d&eacute;coule de cela.

source: GNU/Linux software gives people these rights. Programmers benefit, and more importantly, people who are not programmers benefit.
fr: Le logiciel GNU/Linux donne ces droits aux gens. Les programmeurs en b&eacute;n&eacute;ficient, mais plus important, les non-programmeurs aussi en b&eacute;n&eacute;ficient.

source: People with older machines, even with the very old 80386 chips, can run efficient programs that do as much as programs that require a modern Pentium chip and expensive memory. And they can use these machines as servers for Web pages and as routers &mdash; for communications' infrastructure.
fr: Ceux qui ont de vieilles machines, m&ecirc;me &agrave; base d'un antique 80386, peuvent faire tourner des programmes efficaces qui font aussi bien que ceux qui demandent un Pentium moderne et de la m&eacute;moire co&ucirc;tant tr&egrave;s cher. Ils peuvent tr&egrave;s bien utiliser ces machines comme serveurs de pages Web ou comme routeurs, comme infrastructure pour les communications.

source: People with just one computer can attach one or two additional terminals to it, and provide two or three seats in place of one, for very little extra cost. I have done this: a friend visited and we both wanted to work on my computer at the same time. Email, Web browsing, writing, remote system administration: we did all these at the same time.
fr: Les gens ne poss&eacute;dant qu'un ordinateur peuvent c&acirc;bler un ou deux terminaux suppl&eacute;mentaires, installer deux ou trois chaises devant &agrave; la place d'une seule, tout cela pour un surco&ucirc;t modique. Je l'ai fait&nbsp;: un ami est venu me rendre visite et nous voulions tous les deux travailler en m&ecirc;me temps sur ma machine. Email, surf sur le Web, &eacute;crire, administrer le r&eacute;seau, tout cela nous l'avons fait en m&ecirc;me temps.

source: A community group, or business, can set up its own mailing lists or news groups, private or public. The groupware is there. Two or more people can work on the same document at the same time, even if they are in different countries. The last time I did that, I was working with a fellow on the other side of the Atlantic Ocean.
fr: Une communaut&eacute;, ou une collectivit&eacute;, peut cr&eacute;er sa propre liste de diffusion ou son forum, priv&eacute; ou public. Il est l&agrave;, le collecticiel (groupware). Deux personnes ou plus peuvent travailler sur le m&ecirc;me document au m&ecirc;me moment, m&ecirc;me s'ils habitent des pays diff&eacute;rents. La derni&egrave;re fois qu'il m'est arriv&eacute; de le faire, je travaillais avec un copain qui &eacute;tait de l'autre c&ocirc;t&eacute; de l'oc&eacute;an Atlantique.

source: What script do you want to write in? Hindi, Chinese, Thai? All these are possible, and in the same window as English or Cyrillic.
fr: Vous voulez &eacute;crire un script en hind&icirc;, en chinois, en tha&iuml;&nbsp;? Pas de probl&egrave;me, et dans la m&ecirc;me fen&ecirc;tre, tout comme en anglais ou en cyrillique.

source: Individuals or groups can set up their own Web sites. A publisher can typeset his own books. An accountant can analyze a budget. Blind people can listen to text read out loud to them by the computer.
fr: Que ce soit un individu seul ou un groupe, tout le monde peut construire son site Web. Un &eacute;diteur peut composer ses propres livres. Un comptable peut analyser un budget. Les malvoyants ont la possibilit&eacute; d'entendre &agrave; haute et intelligible voix un texte via leur ordinateur.

source: You can enjoy choosing among several graphic user interfaces, a fancy one, another that looks and behaves rather like Microsoft Windows, or a third, that is simple and practical.
fr: Vous pouvez choisir parmi plusieurs interfaces graphiques, de la plus d&eacute;lirante &agrave; la plus simple et plus pratique en passant par une interface ressemblant et se comportant comme celle de Microsoft Windows.

source: Except for the blind person's speech generation, which requires audio that I never installed in my machine, every application I have just mentioned runs on my home computer. And people I know have installed audio and listen to it.
fr: &Agrave; part le syst&egrave;me vocal pour les malvoyants, qui demande un materiel audio que je n'ai jamais install&eacute; sur ma machine, toutes les applications que je viens de citer tournent sur mon ordinateur personnel. Et je connais des gens qui ont install&eacute; le mat&eacute;riel audio et qui peuvent entendre les textes.

source: All these applications came on a CD-ROM that was, as it happens, given me at no charge. I have also paid for CDs with a different version of the software &mdash; sometimes it is more convenient just to buy. And if you have a fast Internet connection, you can readily download the software, paying only your connection costs.
fr: J'ai re&ccedil;u toutes ces applications sur un c&eacute;d&eacute;rom gratuitement, comme cela peut arriver. J'ai &eacute;galement pay&eacute;, pour d'autres versions de ces programmes&nbsp;; il est parfois plus commode de d&eacute;penser quelques sous. Et si vous avez une connection Internet rapide, vous pouvez instantan&eacute;ment t&eacute;l&eacute;charger le logiciel, il ne vous en co&ucirc;tera que les communications t&eacute;l&eacute;phoniques.

source: This wealth of software is available and can be used anywhere in the world.
fr: Cette richesse logicielle est disponible et peut s'utiliser n'importe o&ugrave; dans le monde.

source: To return to the question of how this technology was shaped: the key, as I said, is freedom, the legal right to copy, study, modify, and redistribute the software.
fr: Pour revenir &agrave; la question&nbsp;: comment cette technologie a &eacute;t&eacute; fa&ccedil;onn&eacute;e, je me r&eacute;p&egrave;te, la clef c'est la libert&eacute;, le droit l&eacute;gal de copier, &eacute;tudier, modifier et redistribuer le logiciel.

source: The specific legal tool we used to create these freedoms and the resulting benefits is a specially drafted copyright license, the GNU General Public License.
fr: L'outil l&eacute;gal sp&eacute;cifique que nous avons utilis&eacute; pour engendrer ces libert&eacute;s et les b&eacute;n&eacute;fices qui en ont d&eacute;coul&eacute;s, est un copyright sp&eacute;cialement con&ccedil;u, la GNU General Public License (la License publique g&eacute;n&eacute;rale GNU).

source: This license gives you more rights than plain copyright does, and more rights than many other kinds of software license. In essence, it forbids you to forbid. It permits you to do everything else.
fr: Cette licence vous donne plus de droits que ce que le copyright vous donne dans sa totalit&eacute; et plus de droits que n'importe quelle autre licence logicielle. Pour aller &agrave; l'essentiel, elle vous interdit d'interdire. Elle vous permet de faire tout le reste.

source: Let me go through this list of rights: copy, study, modify, and redistribute.
fr: J'aimerais approfondir cette liste de droits&nbsp;: copier, &eacute;tudier, modifier et redistribuer.

source: First, the right to copy.
fr: En premier lieu, le droit de copier.

source: Not many people own a factory that would enable them to copy a car. Indeed, to copy a car is so difficult that we use a different word, we speak of &lsquo;manufacturing&rsquo; a car. And there are not many car manufacturers in the world. Far fewer than one in thirty people own or have ready access to a car factory.
fr: Il y a peu de gens &agrave; la t&ecirc;te d'une usine capable de recopier une voiture. De plus, reproduire une voiture est tellement difficile que nous utilisons un autre mot&nbsp;; nous parlons de &laquo;&nbsp;construire&nbsp;&raquo; une voiture. Et il n'y a pas tant que &ccedil;a de constructeurs automobiles dans le monde. Largement moins d'une personne sur trente poss&egrave;de une voiture ou a la possibilit&eacute; d'acc&eacute;der facilement &agrave; une usine automobile.

source: But everyone with a computer owns a software factory, a device for manufacturing software, that is to say, for making new copies. Because copying software is so easy, we don't use the word &lsquo;manufacturing&rsquo;; we usually do not even think of it as a kind of manufacturing, but it is.
fr: Mais quiconque poss&egrave;de un ordinateur poss&egrave;de une usine &agrave; fabriquer des logiciels, un moyen de manufacturer un logiciel, autrement dit, de faire de nouvelles copies. Parce qu'il est tellement facile de copier des logiciels, nous n'employons pas le terme d'&laquo;&nbsp;usiner&nbsp;&raquo;, de &laquo;&nbsp;fabriquer&nbsp;&raquo; ; en g&eacute;n&eacute;ral, on ne le voit m&ecirc;me pas sous cet angle, pourtant il s'agit bien de cela.

source: The right to copy software is the right to use your own means of production (if you will pardon my use of an expression that has gone out of fashion). Millions of people, a few percent of the world's population, own this means of production.
fr: Le droit de copier des logiciels, c'est le droit d'utiliser vos propres moyens de production (si vous me permettez cette expression d&eacute;mod&eacute;e). Des millions de gens, un faible pourcentage de la population mondiale, ont entre leurs mains ces moyens de production.

source: Naturally, there have been efforts to take away your rights to use your own property as a factory that you own.
fr: Naturellement, il y a eu des efforts &agrave; faire pour se d&eacute;barrasser des droits que vous avez d'utiliser votre propri&eacute;t&eacute; &agrave; vous comme d'une usine qui vous appartient.

source: Second, the right to study. This right is of little direct interest to people who are not programmers. It is like the right of a lawyer to read legal text books. Unless you are a lawyer, you probably wish to avoid such books.
fr: En deuxi&egrave;me lieu, le droit d'&eacute;tudier. Ce droit n'est pas d'un int&eacute;r&ecirc;t imm&eacute;diat pour ceux qui ne programment pas. C'est un peu comme le droit, pour un homme de loi, de lire les textes des codes juridiques. Tant que vous n'&ecirc;tes pas homme de loi, c'est le genre de livres que vous &eacute;viterez.

source: However, this right to study has several implications, both for those who program and for everyone else.
fr: Et pourtant, le droit d'&eacute;tudier a plusieurs implications, autant pour le programmeur que pour celui qui ne programme pas.

source: The right to study means that people in places like Mexico, or India, or Malaysia can study the same code that people in Europe or the United States use. It means that these people are not kept from learning how others succeeded.
fr: Le droit &agrave; l'&eacute;tude signifie que les personnes vivant au Mexique, en Inde ou en Malaisie, peuvent &eacute;tudier le m&ecirc;me code que celui utilis&eacute; en Europe ou aux &Eacute;tats-Unis. Ce qui veut dire qu'on ne les emp&ecirc;che pas d'apprendre comment les autres ont r&eacute;ussi.

source: Bear in mind that many programmers work under restrictions that forbid them from seeing others' code. Rather than sit on the shoulders of those who went before, which is the best way to see ahead and to advance, they are thrown into the mud. The right to study is the right to look ahead, to advance, by sitting on the shoulders of giants.
fr: Il faut garder &agrave; l'esprit que beaucoup de programmeurs travaillent avec la contrainte qu'il leur est interdit de voir le code d'autres programmeurs. Plut&ocirc;t que de s'y hisser sur les &eacute;paules de leurs pr&eacute;d&eacute;cesseurs, ce qui reste la meilleure fa&ccedil;on d'avancer et de voir plus loin, ils se retrouvent la t&ecirc;te dans le sac. Le droit d'&eacute;tudier, c'est le droit de voir plus loin, de progresser, du haut des &eacute;paules de g&eacute;ants.

source: Moreover, the right to study means that the software itself must be made available in a manner that humans can read.
fr: Et plus encore, le droit d'&eacute;tudier signifie que le logiciel en lui-m&ecirc;me doit &ecirc;tre disponible de telle sorte qu'il soit lisible par vous et moi.

source: Software comes in two forms, one readable only by computers and the other readable by people. The form that a computer can read is what the computer runs. This form is called a binary or executable. The form that a human can read is called source code. It is what a human programmer creates, and is translated by another computer program into the binary or executable form.
fr: Un logiciel pr&eacute;sente deux aspects, un qui est lisible uniquement par les ordinateurs et un autre qui l'est par les gens. Le premier aspect est ce que la machine peut faire tourner. C'est ce qu'on appelle un ex&eacute;cutable ou un binaire. Quant au deuxi&egrave;me aspect, celui qu'un humain peut lire, on l'appelle code source. C'est ce que cr&eacute;e un programmeur humain, qui est ensuite traduit par une machine en binaire ou en ex&eacute;cutable.

source: The next right, the right to modify, is the right to fix a problem or enhance a program. For most people, this means your right or your organization's right to hire someone to do the job for you, in much the same way you hire an auto mechanic to fix your car or a carpenter to extend your home.
fr: Le droit suivant, celui de modifier, est le droit &agrave; corriger un probl&egrave;me ou d'apporter des am&eacute;liorations. Pour la plupart des gens, cela signifie le droit que vous avez, vous ou votre organisme, de payer quelqu'un pour faire le travail &agrave; votre place, tout &agrave; fait comme vous payez un m&eacute;canicien pour r&eacute;parer votre voiture ou un charpentier pour agrandir votre maison.

source: Modification is helpful. Application developers cannot think of all the ways others will use their software. Developers cannot foresee the new burdens that will be put on their code. They cannot anticipate all the local conditions, whether someone in Malaysia will use a program first written in Finland.
fr: Les modifications sont d'une aide certaine. Les d&eacute;veloppeurs d'applications ne peuvent pas penser &agrave; toutes les fa&ccedil;ons dont les utilisateurs feront usage de leurs logiciels. Les d&eacute;veloppeurs ne peuvent pas pr&eacute;voir les nouvelles charges qui seront appliqu&eacute;es&agrave; leur code. Ils ne peuvent pas anticiper toutes les conditions locales, comment un Malais utilisera un programme qui avait tout d'abord &eacute;t&eacute; &eacute;crit en Finlande.

source: Finally, of these legal rights, comes the right to redistribute.
fr: Et pour terminer, parlons du droit de redistribuer.

source: This means that you, who own a computer, a software factory, have the right to make copies of a program and redistribute it. You can charge for these copies, or give them away. Others may do the same.
fr: Cela signifie que, vous, qui avez un ordinateur, une usine &agrave; logiciels, vous avez le droit de faire des copies d'un programme et de le redistribuer. Vous pouvez faire payer pour ces copies, ou les distribuer. D'autres peuvent faire la m&ecirc;me chose.

source: Of course, several existing, large software manufacturers want to forbid you from using your own property. They cannot win in a free market, so they attack in other ways. In the United States, for example, we see newly proposed laws to take away your freedom.
fr: Bien s&ucirc;r, et il y en a, les gros fabricants de logiciels veulent vous emp&ecirc;cher d'utiliser votre propre propri&eacute;t&eacute;. Ils ne peuvent pas gagner contre un march&eacute; libre, alors ils attaquent autrement. Aux &Eacute;tats Unis, par exemple, on voit de r&eacute;centes propositions de lois qui vous &ocirc;tent votre libert&eacute;.

source: The right to redistribute, so long as it is defended and upheld, means that software is sold in a competitive, free market. This has several consequences. Low price is a consequence. This helps consumers.
fr: Le droit de redistribuer, tant qu'il sera d&eacute;fendu et soutenu, signifie que le logiciel est vendu au sein d'un march&eacute; comp&eacute;titif, libre. Ce qui a plusieurs cons&eacute;quences. Une des cons&eacute;quences, c'est un bas prix. Ce qui est en faveur du consommateur.

source: But first and foremost, these legal and economic rights lead to collaboration, one of themes of this conference.
fr: Mais d'abord et avant tout, ces droits &eacute;conomiques et l&eacute;gaux am&egrave;nent &agrave; collaborer, un des th&egrave;mes de cette conf&eacute;rence.

source: This outcome is contrary to many people's expectations. Few expect that in a competitive, free market, every producer will become more collaborative and that there will be no visible or felt competition among competing businessmen.
fr: Ce r&eacute;sultat est contraire &agrave; de nombreuses attentes, chez les gens. Peu d'entre eux s'attendent &agrave; ce que, dans un march&eacute; comp&eacute;titif, libre, chaque producteur deviendra de plus en plus coop&eacute;ratif et qu'il n'y aura pas de comp&eacute;tition, sensible ou visible au sein des hommes d'affaire en comp&eacute;tition.

source: The more competitive a market, the more cooperation you see. This apparently counter-intuitive implication is both observed and inferred.
fr: Plus un march&eacute; est comp&eacute;titif, plus la coop&eacute;ration est visible. Cette implication, qui va apparemment contre toute intuition, a &eacute;t&eacute; &agrave; la fois observ&eacute;e et infer&eacute;e.

source: This is because people are not harmed by doing what they want to do. People like to help their neighbors.
fr: Cela se peut parce que les gens ne sont pas l&eacute;s&eacute;s dans ce qu'ils ont envie de faire. Les gens aiment aider leurs voisins.
