Repository: gitGNU/gnu_www-fr
Catalog: philosophy/ICT-for-prosperity.*.po
Languages: fr

source: Consider a small farmer, one among a million. My friend George, back in the United States, is one such.
fr: Prenez un petit fermier, un parmi un million. Mon ami Georges, de retour aux &Eacute;tats Unis, est un de ceux-l&agrave;.

source: His harvest is so small, that there is nothing he can do to effect the world price. His neighbor is in a similar situation.
fr: Sa r&eacute;colte est tellement maigre qu'il ne peut rien faire sur les prix au niveau mondial. Son voisin est dans la m&ecirc;me situation.

source: Consequently, if George helps his neighbor, his neighbor benefits, and George himself loses nothing on the price he receives for his harvest.
fr: Du coup, si Georges aide son voisin, cela lui sera profitable et Georges lui, ne perdra rien sur ce que lui rapporte sa r&eacute;colte.

source: Since George will not hurt himself, he has every other reason to help his neighbor. Not only is George kindly, he also recognizes that when he helps his neighbor, his neighbor is likely to return the favor.
fr: &Agrave; partir du moment o&ugrave; Georges ne se l&egrave;se pas, il a plein d'autres raisons d'aider son voisin. Georges n'est pas simplement aimable, il reconna&icirc;t que quand il donne un coup de main &agrave; son voisin, ce dernier s'empresse de lui renvoyer l'ascenseur.

source: This is what you see in a competitive free market: cooperation.
fr: Voil&agrave; ce que vous observez dans un march&eacute; comp&eacute;titif libre : de la coop&eacute;ration.

source: Visible competition indicates that the market is not fully free and competitive. Visible competition means that at most you have a semi-free market.
fr: Une comp&eacute;tition visible indique que le march&eacute; n'est pas compl&egrave;tement libre et comp&eacute;titif. Une comp&eacute;tition visible, cela veut dire qu'&agrave; la limite, vous n'avez qu'un march&eacute; semi-libre.

source: Moreover, and this benefits people who are not programmers, if software is sold in a free market, competition among vendors will lead to a lower price.
fr: Allons plus loin&nbsp;: si un logiciel est vendu sur un march&eacute; libre, la concurrence entre les vendeurs va faire tomber les prix&nbsp;; ce qui va profiter aux non-programmeurs.

source: Put another way, the price of software is determined primarily by legal considerations: by the degree to which customers enjoy freedom. If customers are forbidden to buy a product except at a high price, and that prohibition is successfully enforced, the product will be expensive. This is what occurs with much proprietary software today.
fr: Voyons les choses autrement&nbsp;: le prix d'un logiciel est d&eacute;termin&eacute; en premier lieu par des consid&eacute;rations l&eacute;gales, par le degr&eacute; de libert&eacute; dont profitent les acheteurs. Si ceux-ci ont l'interdiction d'acheter un produit sauf &agrave; prix &eacute;lev&eacute; et que cette prohibition soit renforc&eacute;e avec succ&egrave;s, le produit sera cher. C'est ce qui se produit aujourd'hui avec beaucoup de logiciels propri&eacute;taires.

source: On the other hand, if software is sold in a free market, competition among vendors will lead to a lower price.
fr: D'un autre c&ocirc;t&eacute;, si le produit est mis sur un march&eacute; libre, la comp&eacute;tition entre les vendeurs fera baisser les prix.

source: Indeed, in some circumstances the cost will be so low that companies or other organizations will give away CD-ROMs containing the software; others will make copies for their friends; and yet others will provide downloads over the Internet at no charge.
fr: Et vraiment, il y aura des cas o&ugrave; les prix seront tellement bas que les compagnies ou les organisations donneront les CDROM contenant les logiciels&nbsp;; d'autres feront des copies pour leurs amis&nbsp;; et d'autres encore les mettront en t&eacute;l&eacute;chargement sur Internet, gratuitement.

source: This means that software itself, a necessary supporting part of a business or community project, will be both inexpensive and legal.
fr: Ceci signifie que le logiciel en lui-m&ecirc;me, support n&eacute;cessaire &agrave; un projet communautaire ou marchand, deviendra peu co&ucirc;teux et l&eacute;gal.

source: Think of this from the point of view of a small business or community supported group. The organization can use restricted-distribution, proprietary software, and either pay a lot of money it does not have, or break the law and steal it.
fr: Placez-vous du point de vue d'une petite structure ou d'une association. Elle pourrait utiliser un logiciel propri&eacute;taire diffus&eacute; via une distribution restrictive et alors soit payer une somme qu'elle n'a pas, soit enfreindre la loi et le voler.

source: On the other hand, free software is inexpensive and legal. It is more accessible. It is also customizable in ways that restricted software often is not. This is empowering.
fr: D'un autre c&ocirc;t&eacute;, le logiciel libre est bon march&eacute; et l&eacute;gal. Il est plus accessible. Il est aussi personnalisable, plus que ce que les logiciels restrictifs peuvent l'&ecirc;tre. Il donne du pouvoir.

source: We shape the development of this technology, we create collaboration, through the use of a legal tool, a license, that gives you more rights than you would have otherwise, that forbids you to forbid, that in this case, gives you the right to copy, study, modify, and redistribute the software.
fr: Nous fa&ccedil;onnons le d&eacute;veloppement de cette technologie, nous cr&eacute;ons la collaboration &agrave; travers l'utilisation d'un outil l&eacute;gal, une licence, qui vous donne plus de droits que vous n'auriez autrement, qui vous interdit d'interdire, ce qui, dans ce cas, vous donne le droit de copier, &eacute;tudier, modifier et redistribuer le logiciel.

source: Because of the freedoms associated with it, this software is called &lsquo;free software.&rsquo;
fr: Parce qu'y sont associ&eacute;es des libert&eacute;s, ce logiciel est appel&eacute; &laquo;&nbsp;logiciel libre&nbsp;&raquo; (free software).

source: While I am speaking of this phrase, let me clear up a verbal issue that sometimes confuses English speakers.
fr: En parlant de cela, laissez-moi &eacute;claircir un terme qui parfois induit en erreur les anglophones.

source: The low price of free software leads some English speakers to think that the word &lsquo;free&rsquo; in the phrase &lsquo;free software&rsquo; means they can obtain it without cost. This is not the definition, which is about <a href="/philosophy/open-source-misses-the-point.html">freedom</a>, but it is an easy misunderstanding. After all, I have been talking of frugal use of resources, software that is inexpensive.
fr: Les bas prix des logiciels libres font croire &agrave; certains anglophones que le mot &laquo;&nbsp;free&nbsp;&raquo; (libre, mais veut aussi dire &laquo;&nbsp;gratuit&nbsp;&raquo;, en anglais), dans le terme &laquo;&nbsp;free software&nbsp;&raquo; (logiciel libre), signifie gratuit. Non, &laquo;&nbsp;free&nbsp;&raquo; est pris dans le sens <a href="/philosophy/open-source-misses-the-point.fr.html">libre</a>, mais c'est une confusion courante. Apr&egrave;s tout, j'ai parl&eacute; de consommation modeste des ressources, de logiciel peu co&ucirc;teux.

source: The English word &lsquo;free&rsquo; has several meanings. As a Mexican friend of mine &mdash; and leader, by the way, of a major free software project &mdash; once said to me,
fr: Le mot anglais &laquo;&nbsp;free&nbsp;&raquo; a plusieurs sens. Comme me le disait un jour un ami mexicain &mdash; dirigeant par ailleurs d'un gros projet dans le logiciel libre&nbsp;:

source: English is broken; it does not distinguish between &lsquo;free beer&rsquo; and &lsquo;free speech&rsquo;.
fr: Il y a quelque chose qui ne va pas dans la langue anglaise&nbsp;; elle ne sait pas faire la diff&eacute;rence entre une &laquo;&nbsp;bi&egrave;re gratuite&nbsp;&raquo; et la &laquo;&nbsp;libre expression&nbsp;&raquo;.

source: Spanish, on the other hand, distinguishes between &lsquo;gratis&rsquo; and &lsquo;libre&rsquo;. Free software is &lsquo;libre&rsquo; software.
fr: L'espagnol, au contraire, fait la distinction entre &laquo;&nbsp;gratis&nbsp;&raquo; et &laquo;&nbsp;libre&nbsp;&raquo; (se prononce &agrave; peu pr&egrave;s &laquo;&nbsp;libr&eacute;&nbsp;&raquo;). Le logiciel libre est un logiciel &laquo;&nbsp;libr&eacute;&nbsp;&raquo;.

source: Likewise, the language of our hosts, Bahasa Melayu, distinguishes between &lsquo;pecuma&rsquo; and &lsquo;kebebasa&rsquo;. Free software is &lsquo;kebebasa&rsquo; software.
fr: De m&ecirc;me, la langue de nos h&ocirc;tes, Bahasa Melayu, fait la distinction entre &laquo;&nbsp;pecuma&nbsp;&raquo; et &laquo;&nbsp;kebebasa&nbsp;&raquo;. Un logiciel libre est un logiciel &laquo;&nbsp;kebebasa&nbsp;&raquo;.

source: Incidentally, Eric Raymond and Bruce Perens invented the phrase &lsquo;open source&rsquo; a few years ago as a synonym &lsquo;free software&rsquo;. They wanted to work around the dislike many companies have of free markets. The phrase is popular; Eric and Bruce succeeded in their purpose.
fr: Entre parenth&egrave;ses, &Eacute;ric Raymond et Bruce Perens ont invent&eacute; le terme &laquo;&nbsp;open source&nbsp;&raquo; (sources accessibles, &laquo;&nbsp;ouvertes&nbsp;&raquo;), il y a quelques ann&eacute;es en arri&egrave;re, comme synonyme de &laquo;&nbsp;free software&nbsp;&raquo;. Ils voulaient modifier la mauvaise opinion qu'avaient certaines compagnies sur le march&eacute; du libre. Le terme est devenu courant. &Eacute;ric et Bruce ont atteint leur but.

source: However, I prefer the term &lsquo;free software&rsquo; since it better conveys the goal of freedom; the proposition that every man and woman, even a person who lives in a third world country, has the right to do first rate work, and must not be forbidden from doing so.
fr: Cependant, je pr&eacute;f&egrave;re le terme de &laquo;&nbsp;logiciel libre&nbsp;&raquo;, qui s'accorde plus avec le but de libert&eacute;&nbsp;; cette proposition pour chaque homme, chaque femme, m&ecirc;me vivant dans un pays du tiers-monde, qu'il le droit premier de faire un travail r&eacute;mun&eacute;rateur et qu'on ne leur interdise pas.

source: I mentioned that a business or community can use software that is inexpensive and legal.
fr: J'ai mentionn&eacute; le fait qu'une communaut&eacute; ou une collectivit&eacute; peut utiliser un logiciel bon march&eacute; et l&eacute;gal.

source: Now let me turn to the software industry itself.
fr: Maintenant, laissez-moi vous parler de l'industrie logicielle elle-m&ecirc;me.

source: Because competition in a competitive market forces down the price of free software, no one enters the software industry to sell software as such. Instead, and this is often not understood, a business enters the industry to make money in other ways.
fr: Parce que la concurrence dans un march&eacute; comp&eacute;titif pousse vers le bas le prix des logiciels libres, personne ne veut prendre part &agrave; l'industrie logicielle pour vendre ces logiciels comme tels. Par contre, et cela est souvent m&eacute;connu, il est possible de faire de l'argent par d'autres moyens.

source: Companies and people in the &lsquo;software industry&rsquo; do not sell software itself, but services associated with software or hardware or other solutions.
fr: Les compagnies et le personnel de l'industrie logicielle ne vendent pas les logiciels en eux-m&ecirc;mes, mais plut&ocirc;t les services qui peuvent s'y rapporter, tant au niveau logiciel que mat&eacute;riel, ou d'autres solutions.

source: This is what happens in the medical and legal professions. Both medical knowledge and law are freely redistributable. Physicians and lawyers sell their services to solve problems.
fr: C'est ce qui se passe dans les professions m&eacute;dicales ou juridiques. Aussi bien la connaissance m&eacute;dicale que la loi sont librement redistribuables. M&eacute;decins et hommes de loi vendent leurs services pour r&eacute;soudre des probl&egrave;mes.

source: What services do I mean? Most directly, help in using a computer, or, to take more specific examples, help in setting up a packet radio network where there is no telephone, or help in creating and nurturing a warehouse data base.
fr: De quels services je veux parler&nbsp;? Le plus &eacute;vident&nbsp;: aider &agrave; se servir d'un ordinateur ou, pour prendre un exemple plus pr&eacute;cis, aider &agrave; mettre en place un r&eacute;seau fonctionnant par ondes radio, dans un endroit o&ugrave; il n'y a pas de t&eacute;l&eacute;phone ou encore aider &agrave; la cr&eacute;ation et &agrave; la saisie de donn&eacute;es dans une base de donn&eacute;es pour un magasin.

source: Less directly, and increasingly, hardware companies that sell telephones or desalinization plants, add software to their products to make them more attractive to buyers.
fr: De fa&ccedil;on moins &eacute;vidente, mais en progression, les compagnies qui vendent des t&eacute;l&eacute;phones ou des usines pour la dessalinisation ajoutent des logiciels &agrave; leurs mat&eacute;riels pour les rendre plus attrayants aux yeux des acheteurs.

source: Incidentally, programmers themselves write software for four main reasons: first, because they are hired to solve a problem, just as a lawyer is hired to draw up a contract. Second, as part of another project. Third, because it enhances their reputation. And fourth, because they want to.
fr: Notez que les programmeurs &eacute;crivent eux-m&ecirc;mes des logiciels pour quatre raisons principales&nbsp;: d'abord, ils sont pay&eacute;s pour r&eacute;soudre un probl&egrave;me, tout comme un homme de loi est pay&eacute; pour r&eacute;diger un contrat. Ensuite, il peut s'agir d'une partie d'un autre projet. Troisi&egrave;mement, pour accro&icirc;tre leur r&eacute;putation et finalement, parce qu'ils le veulent.

source: I have spoken about shaping this technology for collaboration. The key is freedom, and creating the legal framework that supports freedom.
fr: J'ai parl&eacute; du fa&ccedil;onnage de cette technologie pour collaborer. La clef, c'est la libert&eacute; et la cr&eacute;ation d'un cadre l&eacute;gal qui soutienne la libert&eacute;.

source: Now let me talk about initiatives that lead to prosperity.
fr: Maintenant, laissez-moi aborder les initiatives qui m&egrave;nent &agrave; la prosp&eacute;rit&eacute;.

source: One issue with development is resources, or rather, the lack thereof.
fr: Les ressources, ou leur absence, sont un d&eacute;bouch&eacute; du d&eacute;veloppement.

source: As I said earlier, free software reduces barriers to entry, both in the software industry itself and in other industries and activities.
fr: Comme je l'ai dit plus haut, les logiciels libres r&eacute;duisent les barri&egrave;res qui bouchent l'entr&eacute;e et de l'industrie logicielle et des autres industries ou activit&eacute;s.

source: Free software, and the culture and ways people tend to think when they collaborate, reduces operational costs.
fr: Le logiciel libre, la collaboration et l'esprit, la culture, qui en anime les gens, permettent de r&eacute;duire les co&ucirc;ts des op&eacute;rations.

source: Let me take an example that comes directly from this conference. First I should tell you that I have correspondents all over the world. They are not all in rich countries. They or their supporting institutions are not always rich.
fr: Laissez-moi prendre un exemple tir&eacute; tout droit de cette conf&eacute;rence. Tout d'abord, je dois vous dire que j'ai des correspondants un peu partout dans le monde. Ils ne vivent pas tous dans des pays riches. Eux-m&ecirc;mes ou leurs institutions ne sont jamais tr&egrave;s riches.

source: The first messages about this conference that I received took up more than four and a half times the resources needed to convey the information. The messages were sent in a bloated form.
fr: Les premiers messages que j'ai re&ccedil;us &agrave; propos de cette conf&eacute;rence, ont utilis&eacute; plus de quatre fois et demie les ressources n&eacute;cessaires &agrave; la circulation de l'information. Ils ont &eacute;t&eacute; envoy&eacute;s avec exag&eacute;ration.

source: Next time you budget for a project, consider paying four and a half times its cost. Then consider whether you would fund it.
fr: La prochaine fois que vous aurez &agrave; budgeter un projet, imaginez le payer quatre fois et demie son prix. R&eacute;fl&eacute;chissez alors &agrave; la mani&egrave;re dont vous allez le financer.

source: Next time you pay at a restaurant, take out four and a half times the money&hellip;
fr: La prochaine fois que vous paierez le restaurant, sortez quatre fois et demi l'argent de votre poche&hellip;

source: For me the resource use was not an issue because I don't pay by the minute for telecommunications, as many do. But I know that my correspondents around the world prefer that I take care in my communications that I do not waste their money or that of their supporting institutions.
fr: Pour moi, les ressources utilis&eacute;es ne me touchent pas, puisque la t&eacute;l&eacute;communication ne m'est pas factur&eacute;e &agrave; la minute, comme beaucoup le sont. Mais je sais que mes correspondants tout autour du monde pr&eacute;f&egrave;rent que je fasse attention &agrave; mes communications, que je ne gaspille pas leur argent ou celui de leurs institutions.

source: A notable feature of free software is that many applications run well on older, less capable machines, as I mentioned earlier. For example, a couple of months ago I ran a window manager, graphical Web browser, and an image manipulation program on my sister's old 486 machine. These worked fine.
fr: Une des caract&eacute;ristiques remarquables des logiciels libres, est qu'ils peuvent tourner sur de vieilles machines, aux capacit&eacute;s modestes, comme je l'ai mentionn&eacute; tout &agrave; l'heure. Par exemple, il y a quelques mois, j'ai lanc&eacute; sur le 486 de ma s&oelig;ur, un gestionnaire de fen&ecirc;tres, un navigateur Web graphique et un programme de manipulation d'images. Tout cela a parfaitement fonctionn&eacute;.

source: Text editors, electronic mail, and spreadsheets require even fewer resources.
fr: Les &eacute;diteurs de texte, les programmes de courrier &eacute;lectronique et les tableurs demandent m&ecirc;me moins de ressources.

source: This frugality means that people can use older equipment that has been tossed out by first world companies. Such equipment is inexpensive and often donated. The computers need to be transported. Sometimes you need to start a local project to refurbish the hardware and load it with inexpensive, customized, free software. These machines cost the end user less than new machines.
fr: Cette frugalit&eacute; signifie que les gens peuvent utiliser ces vieux &eacute;quipements qui ont &eacute;t&eacute; d&eacute;daign&eacute;s par les World Companies. Un tel mat&eacute;riel n'est pas cher ou souvent offert. Les ordinateurs ont besoin d'&ecirc;tre transport&eacute;s. Vous aurez parfois &agrave; pr&eacute;voir localement de retaper le mat&eacute;riel et de le remplir de logiciels libres, peu co&ucirc;teux et personnalis&eacute;s. Pour l'utilisateur final, ces machines co&ucirc;tent moins qu'une machine neuve.

source: At the same time, manufacturers are building modern, low end computers that do as much as the older ones, and are not too expensive.
fr: Alors que pendant ce temps-l&agrave;, les constructeurs fabriquent des ordinateurs modernes, &agrave; courte dur&eacute;e de vie et qui en font autant que les vieux, qui sont moins chers.

source: There is no need to acquire expensive, new hardware to run your software.
fr: Ce n'est pas la peine d'acheter un mat&eacute;riel on&eacute;reux, flambant neuf pour faire tourner vos logiciels.

source: In conclusion &mdash;
fr: En conclusion &mdash;

source: I was asked to speak on
fr: On m'a demand&eacute; de parler sur&nbsp;:

source: Over the past 16 years, I have worked with people who shaped software through a legal tool that gives you many freedoms: the freedoms to copy, study, modify, and redistribute the software.
fr: Ces 16 derni&egrave;res ann&eacute;es, je les ai pass&eacute; &agrave; travailler avec des gens qui ont fa&ccedil;onn&eacute; le logiciel gr&acirc;ce &agrave; un outil l&eacute;gal qui vous donne maintes libert&eacute;s : celles de copier, &eacute;tudier, modifier et redistribuer le logiciel.

source: This tool shapes software technology to make it more accessible and more empowering; it encourages people to work collaboratively, and provides a technology for better governance.
fr: Cet outil fa&ccedil;onne la technologie logicielle pour la rendre plus accessible et lui donner plus de pouvoir ; il encourage les gens &agrave; travailler en collaboration et offre une technologie pour une meilleure fa&ccedil;on de gouverner.

source: This legal tool means that companies in the ICT industry compete not to sell software itself, but to sell services associated with it, or to sell hardware, or other solutions.
fr: Cet outil l&eacute;gal signifie que les soci&eacute;t&eacute;s impliqu&eacute;es dans les TIC sont en comp&eacute;tition non pas pour le logiciel lui-m&ecirc;me, mais pour la vente de services associ&eacute;s au logiciel ou la vente de mat&eacute;riel ou autre.

source: This legal framework means that companies will provide more reliable and efficient services.
fr: Ce cadre l&eacute;gal veut dire que les soci&eacute;t&eacute;s offriront des services plus fiables et plus efficaces.

source: Freedom, ensured by a proper license, means that people who use computers and telecommunications as tools can enter their industry more easily.
fr: La libert&eacute;, soutenue par une licence ad&eacute;quate, signifie que les gens qui utilisent des ordinateurs ou les t&eacute;l&eacute;communications comme outils, peuvent prendre pied dans leur industrie plus facilement.

source: It means that all users can reduce their entry and operational costs. It means that people in poorer countries are not shipping off their money to a rich country, but are keeping their money in the local economy.
fr: Ce qui signifie que tous les usagers peuvent participer plus facilement et r&eacute;duire leurs frais d'exploitation. Ce qui implique que les gens vivant dans des pays plus pauvres n'envoient pas leur argent aux pays riches, mais qu'ils le maintiennent dans leur &eacute;conomie locale.

source: Moreover, as I said above, restricted-distribution software licenses often force people to choose between violating the law and paying money they may not have.
fr: De plus, comme je l'ai dit plus haut, les licences logicielles dans des distributions restrictives forcent souvent les gens &agrave; choisir entre violer la loi ou payer une somme qu'ils n'ont pas.

source: As a matter of good governance, a country should not force people who are trying to do a decent job into making such decisions. Too often an otherwise law-abiding person who lacks resources will choose to violate the law.
fr: Pour bien gouverner, un pays ne devrait pas forcer les personnes qui tentent de travailler d&eacute;cemment &agrave; prendre une telle d&eacute;cision. Trop souvent, une personne respectueuse des lois mais sans grandes ressources, choisira de violer la loi.
