Repository: gitGNU/gnu_www-fr
Catalog: philosophy/javascript-trap.*.po
Languages: fr

source: The JavaScript Trap
fr: Le piège JavaScript

source: by <a href="http://www.stallman.org/">Richard Stallman</a>
fr: par <a href="http://www.stallman.org/">Richard Stallman</a>

source: <strong>You may be running non-free programs on your computer every day without realizing it&mdash;through your web browser.</strong>
fr: <strong>Vous exécutez peut-être des programmes non-libres sur votre ordinateur chaque jour sans même vous en apercevoir &mdash;&nbsp;par l'intermédiaire de votre navigateur Web.</strong>

source: In the free software community, the idea that non-free programs mistreat their users is familiar. Some of us refuse entirely to install proprietary software, and many others consider non-freedom a strike against the program. Many users are aware that this issue applies to the plug-ins that browsers offer to install, since they can be free or non-free.
fr: Dans la communauté du logiciel libre, l'idée que les programmes non-libres maltraitent leurs utilisateurs est familière. Certains d'entre-nous refusent totalement d'installer des logiciels propriétaires, et beaucoup d'autres considèrent que la non-liberté est une attaque contre le programme. Beaucoup d'utilisateurs sont conscients que ce problème s'applique aussi aux plugins que les navigateurs proposent d'installer, car ils peuvent être libres ou non-libres.

source: But browsers run other non-free programs which they don't ask you about or even tell you about&mdash;programs that web pages contain or link to. These programs are most often written in JavaScript, though other languages are also used.
fr: Mais les navigateurs exécutent d'autres programmes non-libres pour lesquels ils ne demandent pas votre avis &mdash;&nbsp;des programmes que contiennent des pages Web ou vers lesquels elle lient. Ces programmes sont très souvent écrit en JavaScript, bien que d'autres langages puissent être utilisés.

source: JavaScript (officially called ECMAscript, but few use that name) was once used for minor frills in web pages, such as cute but inessential navigation and display features. It was acceptable to consider these as mere extensions of HTML markup, rather than as true software; they did not constitute a significant issue.
fr: JavaScript (dont le nom officiel est ECMAscript, mais peu de gens utilisent ce nom) était autrefois utilisé pour faire des effets frivoles, certes jolis mais non-essentiels à la navigation et aux fonctionnalités d'affichage. Il était acceptable de les considérer comme de pures extensions du langage de balises HTML, plutôt que comme de vrais logiciels&nbsp;; ils ne représentaient pas un problème significatif.

source: Many sites still use JavaScript that way, but some use it for major programs that do large jobs. For instance, Google Docs downloads into your machine a JavaScript program which measures half a megabyte, in a compacted form that we could call Obfuscript because it has no comments and hardly any whitespace, and the method names are one letter long. The source code of a program is the preferred form for modifying it; the compacted code is not source code, and the real source code of this program is not available to the user.
fr: Beaucoup de sites utilisent encore JavaScript de cette façon, mais certains l'utilisent pour des programmes conséquents réalisant des travaux importants. Par exemple, Google Docs télécharge sur votre machine un programme JavaScript qui pèse un demi megaoctet, dans une forme compactée que nous pourrions appeler Obscurscript car il n'y a aucun commentaire et très peu d'espaces, et les noms de méthode ne font q'une lettre. Le code source d'un programme est la forme préférée pour le modifier&nbsp;; le code compacté n'est pas du code source, et le vrai code source n'est pas disponible pour l'utilisateur.

source: Browsers don't normally tell you when they load JavaScript programs. Most browsers have a way to turn off JavaScript entirely, but none of them can check for JavaScript programs that are nontrivial and non-free. Even if you're aware of this issue, it would take you considerable trouble to identify and then block those programs. However, even in the free software community most users are not aware of this issue; the browsers' silence tends to conceal it.
fr: Normalement, les navigateurs ne vous disent pas quand ils chargent des programmes JavaScript. La plupart des navigateurs ont un moyen de désactiver JavaScript totalement, masi aucun d'eux ne peut vérifier des programmes JavaScript qui ne sont pas triviaux et non-libres. Même si vous en êtes conscient, cela vous donnerait beaucoup de peine à identifier et bloquer ces programmes. Cependant, même au sein de la communauté du logiciel libre, la plupart des utilisateurs ne sont pas conscients de ce problème&nbsp;; le silence des navigateurs tend à le dissimuler.

source: It is possible to release a JavaScript program as free software, by distributing the source code under a free software license. But even if the program's source is available, there is no easy way to run your modified version instead of the original. Current free browsers do not offer a facility to run your own modified version instead of the one delivered in the page. The effect is comparable to tivoization, although not quite so hard to overcome.
fr: Il est possible de publier un programme JavaScript en tant que logiciel libre, en distribuant le code source sous une licence de logiciel libre. Mais même si le code source du programme est disponible, il n'existe pas de moyen facile d'exécuter votre version modifiée à la place de l'original. Les navigateurs libres actuels ne proposent pas de fonctionnalité permettant d'exécuter votre version modifiée à la place de celle délivrée par la page. L'effet est commparable à la Tivoization bien que moins difficile à outrepasser.

source: JavaScript is not the only language web sites use for programs sent to the user. Flash supports programming through an extended variant of JavaScript. We will need to study the issue of Flash to make suitable recommendations. Silverlight seems likely to create a problem similar to Flash, except worse, since Microsoft uses it as a platform for non-free codecs. A free replacement for Silverlight does not do the job for the free world unless it normally comes with free replacement codecs.
fr: JavaScript n'est pas le seul langage que les sites Web utilisent pour les programmes envoyés aux utilisateurs. Flash supporte la programmation par l'intermédiaire d'une variante étendue de JavaScript. Nous aurons besoin d'étudier le problème de Flash pour faire des recommandations appropriées. Silverlight semble créer un problème similaire à Flash, excepté qu'il est pire, car Microsoft l'utilise comme plateforme pour des codecs non-libres. Un remplacement libre de Silverlight ne ferait pas l'affaire pour le monde du libre, à moins qu'il ne propose des codecs de remplacement libres.

source: Java applets also run in the browser, and raise similar issues. In general, any sort of applet system poses this sort of problem. Having a free execution environment for an applet only brings us far enough to encounter the problem.
fr: Les applets Java s'exécutent aussi dans le navigateur et soulèvent des problèmes similaires. En général, toute sorte d'applet système pose ce genre de problème. Avoir un environnement d'exécution libre pour une applet ne nous amène qu'un peu plus loin pour rencontrer le problème.

source: A strong movement has developed that calls for web sites to communicate only through formats and protocols that are free (some say &quot;open&quot;); that is to say, whose documentation is published and which anyone is free to implement. With the presence of programs in web pages, that criterion is necessary, but not sufficient. JavaScript itself, as a format, is free, and use of JavaScript in a web site is not necessarily bad. However, as we've seen above, it also isn't necessarily ok. When the site transmits a program to the user, it is not enough for the program to be written in a documented and unencumbered language; that program must be free, too. &ldquo;Only free programs transmitted to the user&rdquo; must become part of the criterion for proper behavior by web sites.
fr: Un fort mouvement s'est développé qui appelle les sites Web à ne communiquer qu'avec des formats et des protocoles libres (certains disent «&nbsp;ouverts&nbsp;»)&nbsp;; c'est-à-dire, dont la documentation est publiée et que chacun est libre de mettre en œuvre. avec la présence de programmes dans les pages Web, ce critère est nécessaire mais pas suffisant. JavaScript lui-même, en tant que format, est libre et l'utilisation de JavaScript dans un site Web n'est pas nécessairement mauvais. Cependant, comme nous l'avons vu plus tôt, ce n'est pas nécessairement bon. Quand le site transmet un programme à l'utilisateur, il n'est pas suffisant pour le programme d'être écrit dans un langage documenté et libre d'entraves&nbsp;; ce programme doit être libre aussi. «&nbsp;Seuls des programmes libres transmis aux utilisateurs&nbsp;» doivent faire partie du critère pour un comportement correct des sites Web.

source: Silently loading and running non-free programs is one among several issues raised by &quot;web applications&quot;. The term &quot;web application&quot; was designed to disregard the fundamental distinction between software delivered to users and software running on the server. It can refer to a specialized client program running in a browser; it can refer to specialized server software; it can refer to a specialized client program that works hand in hand with specialized server software. The client and server sides raise different ethical issues, even if they are so closely integrated that they arguably form parts of a single program. This article addresses only the issue of the client-side software. We are addressing the server issue separately.
fr: Le chargement et l'exécution silencieux de programmes non-libres est un des nombreux problèmes soulevés par les «&nbsp;applications Web&nbsp;». Le terme «&nbsp;application Web&nbsp;» a été conçu pour ne pas tenir compte de la distinction fondamentale entre un logiciel délivré aux utilisateurs et un logiciel s'exécutant sur un serveur. Il peut faire référence à un programme client spécialisé qui s'exécute dans un navigateur&nbsp;; il peut faire référence à un logiciel serveur spécialisé&nbsp;; il peut faire référence à un programme client spécialisé qui travaille main dans la main avec un logiciel serveur spécialisé. Les côtés client et serveur soulèvent des problèmes éthiques différents, même s'ils sont si intimement intégrés que l'on pourrait dire qu'ils font partie d'un seul programme. Cet article ne traite que du problème du logiciel du côté client. Nous traiterons le problème du côté serveur séparément.

source: In practical terms, how can we deal with the problem of non-free JavaScript programs in web sites? Here's a plan of action.
fr: Pratiquement, comment pouvons-nous traiter le problème des programmes JavaScript non-libres dans les sites Web&nbsp;? Voici un plan d'action.

source: First, we need a practical criterion for nontrivial JavaScript programs. Since &quot;nontrivial&quot; is a matter of degree, this is a matter of designing a simple criterion that gives good results, rather than determining the one correct answer.
fr: D'abord, nous avons besoin d'un critère pratique pour les programmes JavaScript non-triviaux. Puisque «&nbsp;non-trivial&nbsp;» est une question d'interprétation, il s'agit de concevoir un critère simple qui donne de bons résultats, plutôt que de déterminer la réponse correcte.

source: Our proposal is to consider a JavaScript program nontrivial if it defines methods and either loads an external script or is loaded as one, or if it makes an AJAX request.
fr: Notre proposition est de considérer qu'un programme JavaScript est non-trivial s'il définit des méthodes et s'il charge un script externe ou s'il est chargé en tant que script externe, ou encore s'il fait une requête AJAX.

source: At the end of this article we propose a convention by which a nontrivial JavaScript program in a web page can state the URL where its source code is located, and can state its license too, using stylized comments.
fr: À la fin de cet article, nous proposons une convention dans laquelle un programme JavaScript non-trivial dans une page Web, peut déclarer l'URL de l'emplacement de son code source ainsi que sa licence, en utilisant des commentaires stylés.

source: Finally, we need to change free browsers to support freedom for users of pages with JavaScript. First of all, browsers should be able to tell the user about nontrivial non-free JavaScript programs, rather than running them. Perhaps <a href="https://addons.mozilla.org/en-US/firefox/addon/722">NoScript</a> could be adapted to do this.
fr: Enfin, nous avons besoin de modifier les navigateurs libres pour qu'ils supportent la liberté des utilisateurs de pages avec JavaScript. Tout d'abord, les navigateurs doivent être en mesure de prévenir les utilisateurs au sujet des programmes JavaScript non-libres plutôt que de les exécuter. Peut-être que <a href="https://addons.mozilla.org/fr/firefox/addon/722">NoScript</a> pourrait être adapté pour faire cela.

source: Browser users also need a convenient facility to specify JavaScript code to use <em>instead</em> of the JavaScript in a certain page. (The specified code might be total replacement, or a modified version of the free JavaScript program in that page.) Greasemonkey comes close to being able to do this, but not quite, since it doesn't guarantee to modify the JavaScript code in a page before that program starts to execute. Using a local proxy works, but is too inconvenient now to be a real solution. We need to construct a solution that is reliable and convenient, as well as sites for sharing changes. The GNU Project would like to recommend sites which are dedicated to free changes only.
fr: Les utilisateurs de navigateur ont aussi besoin d'une fonctionnalité pratique pour indiquer le code JavaScript à utiliser <em>à la place</em> du JavaScript dans une page donnée. (Le code spécifié pourrait être un remplacement total, ou une version modifiée du programme JavaScript libre dans cette page). Greasemonkey est très proche d'arriver àa faire cela, mais pas tout à fait, car il ne garantit pas de modifier le code JavaScript dans une page avant que le programme s'exécute. Utiliser un proxy local fonctionne, mais c'est trop peu pratique actuellement pour être une réelle solution. Nous avons besoin de construire une solution fiable et pratique, comme les chagements dans les sites de partage. Le Projet GNU aimerait recommander les sites dédiés aux changements libres seulement.

source: These features will make it possible for a JavaScript program included in a web page to be free in a real and practical sense. JavaScript will no longer be a particular obstacle to our freedom&mdash;no more than C and Java are now. We will be able to reject and even replace the non-free nontrivial JavaScript programs, just as we reject and replace non-free packages that are offered for installation in the usual way. Our campaign for web sites to free their JavaScript can then begin.
fr: Ces fonctionnalités rendront possible pour un programme JavaScript inclus dans une page Web d'être réellement libre. JavaScript ne sera plus un obstacle particulier à notre liberté &mdash;&nbsp;pas plus que C et Java ne le sont maintenant. Nous serons capables de rejeter et même de remplacer les programmes JavaScript non-triviaux non-libres, tout comme nous avons rejeté et remplacé les paquetages non-libres pour les installations classiques. Notre campagne pour libérer le code JavaScript des sites Web peut alors commencer.

source: <strong>Thank you to <a href="/people/people.html#mattlee">Matt Lee</a> and <a href="http://ejohn.org">John Resig</a> for their help in defining our proposed criterion.</strong>
fr: <strong>Merci à <a href="/people/people.html#mattlee">Matt Lee</a> et <a href="http://ejohn.org">John Resig</a> pour leur aide pour la définition de notre proposition de critère.</strong>

source: Appendix: a convention for releasing free JavaScript programs
fr: Appendice : une convention pour publier des des programmes JavaScript libres

source: For references to corresponding source code, we recommend
fr: Pour des références au code source correspondant, nous recommandons

source: followed by the URL.
fr: suivi de l'URL

source: To indicate the license of the JavaScript code embedded in a page, we recommend putting the license notice between two notes of this form:
fr: Pour indiquer la licence du code JavaScript intégré dans la page, nous recommandons de mettre la notice de licence entre deux notes de cette forme&nbsp;:

source: @licstart The following is the entire license notice for the JavaScript code in this page. ... @licend The above is the entire license notice for the JavaScript code in this page.
fr: @licstart The following is the entire license notice for the JavaScript code in this page. ... @licend The above is the entire license notice for the JavaScript code in this page. Traduction : @licstart Ce qui suit est la totalité de la notice de licence pour le code JavaScript de cette page. ... @licend Ce qui précède est la totalité de la notice de licence pour le code JavaScript de cette page.

source: Of course, all of this should be contained in a multiline comment.
fr: Bien sûr, tout ceci doit être contenu dans un commentaire multiligne.

source: The <a href="/licenses/gpl.html">GNU GPL</a>, like many other free software licenses, requires distribution of a copy of the license with both source and binary forms of the program. However, the GNU GPL is long enough that including it in a page with a JavaScript program can be inconvenient. You can remove that requirement, for code that you have the copyright on, with a license notice like this:
fr: La <a href="/licenses/gpl.html">GNU GPL</a>, comme beaucoup de licences de logiciels libres, nécessite la distribution d'une copie de la licence avec les formes binaire et source du programme. Cependant, la GNU GPL est longue et l'inclure dans une page avec un programme JavaScript n'est pas pratique. Vous pouvez oublier ce prérequis, pour du code dont vous êtes le détenteur des droits d'auteur, avec une notice de licence comme ceci&nbsp;:

source: Copyright (C) YYYY Developer The JavaScript code in this page is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License (GNU GPL) as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. The code is distributed WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU GPL for more details. As additional permission under GNU GPL version 3 section 7, you may distribute non-source (e.g., minimized or compacted) forms of that code without the copy of the GNU GPL normally required by section 4, provided you include this license notice and a URL through which recipients can access the Corresponding Source.
fr: Copyright (C) YYYY Developer The JavaScript code in this page is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License (GNU GPL) as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. The code is distributed WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU GPL for more details. As additional permission under GNU GPL version 3 section 7, you may distribute non-source (e.g., minimized or compacted) forms of that code without the copy of the GNU GPL normally required by section 4, provided you include this license notice and a URL through which recipients can access the Corresponding Source. Traduction : Copyright (C) YYYY Développeur Le code JavaScript de cette page est un logiciel libre&nbsp;: vous pouvez le redistribuer et/ou le modifier selon les termes de la licence GNU General Public License (GNU GPL) telle que publiée par la Free Software Foundation, en version 3 de la licence, ou (à votre discrétion) toute version suivante. Le code est distribué SANS AUCUNE GARANTIE&nbsp;; sans même la garantie implicite de MARCHANDABILITÉ ou d'ADÉQUATION À UN BUT PARTICULIER. Consulter la GNU GPL pour plus de détails. En tant que permission supplémentaire selon les termes de la GNU GPL version 3 section 7, vous pouvez distribuer des formes «&nbsp;non-source&nbsp; (par ex., minimisé ou compacté) de ce code sans la copie de la GNU GPL normalement requise section 4, attendu que vous incluez cette notice de licence et une URL par laquelle les destinataires peuvent accéder au code source correspondant.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: This work is licensed under the Creative Commons Attribution-No Derivative Works 3.0 United States License. To view a copy of this license, visit <a href="http://creativecommons.org/licenses/by-nd/3.0/us/">http://creativecommons.org/licenses/by-nd/3.0/us/</a> or send a letter to Creative Commons, 171 Second Street, Suite 300, San Francisco, California, 94105, USA.
fr: Cette œuvre est licenciée sous les termes de la Creative Commons Attribution-No Derivative Works 3.0 United States License. Pour voir une copie de cette licence, visitez <a href="http://creativecommons.org/licenses/by-nd/3.0/us/">http://creativecommons.org/licenses/by-nd/3.0/us/</a> ou envoyez une lettre à Creative Commons, 171 Second Street, Suite 300, San Francisco, California, 94105, USA.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
