Repository: gitGNU/gnu_www-fr
Catalog: philosophy/java-trap.*.po
Languages: fr

source: Free But Shackled - The Java Trap
fr: Libre mais entrav&eacute; - Le Pi&egrave;ge Java

source: by <a href="http://www.stallman.org/">Richard Stallman</a>
fr: par <a href="http://www.stallman.org/">Richard Stallman</a>

source: Headnote
fr: Note

source: As of December 2006, Sun is in the middle of <a href="http://www.fsf.org/news/fsf-welcomes-gpl-java.html">rereleasing its Java platform under the GNU GPL</a>. When this license change is completed, we expect that Java will no longer be a trap. Nonetheless, the general issue described here will remain important, because any non-free library or programming platform can cause a similar problem. We must learn a lesson from the history of Java, so we can avoid other traps in the future.
fr: En d&eacute;cembre 2006, Sun est en train de <a href="http://www.fsf.org/news/fsf-welcomes-gpl-java.html">republier sa plateforme Java sous licence GNU GPL</a>. Quand ce changement de licence sera achev&eacute;, nous nous attendons &agrave; ce que Java ne soit plus un pi&egrave;ge. Cependant, le probl&egrave;me g&eacute;n&eacute;ral d&eacute;crit ici demeure important, car toute biblioth&egrave;que ou plateforme de programmation non-libre peut causer un probl&egrave;me similaire. Nous devons retenir la le&ccedil;on de l'histoire de Java de sorte &agrave; &eacute;viter d'autres pi&egrave;ges &agrave; l'avenir.

source: April 12, 2004
fr: Le 12 avril 2004

source: If your program is free software, it is basically ethical&mdash;but there is a trap you must be on guard for. Your program, though in itself free, may be restricted by non-free software that it depends on. Since the problem is most prominent today for Java programs, we call it the Java Trap.
fr: Si votre programme est un logiciel libre, il est &eacute;thique par nature &mdash; Mais il y a un pi&egrave;ge dont il faut se m&eacute;fier. Bien qu'intrins&egrave;que, la libert&eacute; de votre programme, peut &ecirc;tre restreinte &agrave; cause de logiciels non-libres dont d&eacute;pend votre programme. Comme ce probl&egrave;me est aujourd'hui le plus visible avec les programmes Java, nous l'avons nomm&eacute; le Pi&egrave;ge Java.

source: A program is free software if its users have certain crucial freedoms. Roughly speaking, they are: the freedom to run the program, the freedom to study and change the source, the freedom to redistribute the source and binaries, and the freedom to publish improved versions. (See <a href="/philosophy/free-sw.html">http://www.gnu.org/philosophy/free-sw.html</a>.) Whether any given program is free software depends solely on the meaning of its license.
fr: Un programme est un logiciel libre si ses utilisateurs poss&egrave;dent certaines libert&eacute;s fondamentales. En gros, il s'agit de&nbsp;: la libert&eacute; d'ex&eacute;cuter le programme, la libert&eacute; d'en &eacute;tudier et modifier le code source, la libert&eacute; d'en redistribuer les fichiers source et binaires, et la libert&eacute; d'en publier des versions am&eacute;lior&eacute;es. (Voir <a href="/philosophy/free-sw.fr.html">http://www.gnu.org/philosophy/free-sw.fr.html</a>). Qu'un programme donn&eacute; soit un logiciel libre ne d&eacute;pend que de la signification de sa licence.

source: Whether the program can be used in the Free World, used by people who mean to live in freedom, is a more complex question. This is not determined by the program's own license, because no program works in isolation. Every program depends on other programs. For instance, a program needs to be compiled or interpreted, so it depends on a compiler or interpreter. If compiled into byte code, it depends on a byte code interpreter. Moreover, it needs libraries in order to run, and it may also invoke other separate programs that run in other processes. All of these programs are dependencies. Dependencies may be necessary for the program to run at all, or they may be necessary only for certain features. Either way, all or part of the program cannot operate without the dependencies.
fr: Que le programme puisse &ecirc;tre utilis&eacute; dans le Monde Libre, utilis&eacute; par des personnes qui entendent vivre en toute libert&eacute;, est une question plus compliqu&eacute;e. La seule licence du programme ne d&eacute;termine pas cela, car aucun programme ne fonctionne en isolation totale. Chaque programme d&eacute;pend d'autres programmes. Par exemple, un programme n&eacute;cessite d'&ecirc;tre compil&eacute; ou interpr&eacute;t&eacute;, il d&eacute;pend donc d'un compilateur ou d'un interpr&eacute;teur. S'il est compil&eacute; en pseudo-code binaire, il d&eacute;pend d'un interpr&eacute;teur de pseudo-code. Qui plus est, pour s'ex&eacute;cuter il a besoin de biblioth&egrave;ques, et il peut faire appel &agrave; d'autres programmes qui s'ex&eacute;cutent sous d'autres processus. Tous ces programmes sont des d&eacute;pendances. Les d&eacute;pendances peuvent &ecirc;tre totalement indispensables &agrave; l'ex&eacute;cution du programme, ou juste n&eacute;cessaires &agrave; certaines de ses fonctionnalit&eacute;s. D'une fa&ccedil;on ou d'une autre, tout ou partie du programme ne peut pas fonctionner sans elles.

source: If some of a program's dependencies are non-free, this means that all or part of the program is unable to run in an entirely free system&mdash;it is unusable in the Free World. Sure, we could redistribute the program and have copies on our machines, but that's not much good if it won't run. That program is free software, but it is effectively shackled by its non-free dependencies.
fr: Que certaines des d&eacute;pendances d'un programme ne soient pas libres, signifie que tout ou partie du programme ne peut s'ex&eacute;cuter sur un syst&egrave;me totalement libre &mdash; Il est inutilisable dans le Monde Libre. Bien s&ucirc;r, nous pouvons distribuer le programme et en avoir des copies sur nos machines, mais cela ne sert pas &agrave; grand chose s'il ne s'ex&eacute;cute pas. Ce programme est un logiciel libre, mais il est en fait entrav&eacute; par des d&eacute;pendances non-libres.

source: This problem can occur in any kind of software, in any language. For instance, a free program that only runs on Microsoft Windows is clearly useless in the Free World. But software that runs on GNU/Linux can also be useless if it depends on other non-free software. In the past, Motif (before we had LessTif) and Qt (before its developers made it free software) were major causes of this problem. Most 3D video cards work fully only with non-free drivers, which also cause this problem. But the major source of this problem today is Java, because people who write free software often feel Java is sexy. Blinded by their attraction to the language, they overlook the issue of dependencies, and they fall into the Java Trap.
fr: Ce probl&egrave;me peut se produire avec n'importe quel type de logiciel, n'importe quel langage. Par exemple, un programme libre qui ne fonctionne que sous Microsoft Windows est parfaitement inutilisable dans le Monde Libre. Mais des logiciels qui tourne sous GNU/Linux peuvent aussi &ecirc;tre inutilisable lorsqu'ils d&eacute;pendent d'autres logiciels non-libres. Par le pass&eacute;, Motif (avant que nous ayons LessTif) et Qt (avant que ses d&eacute;veloppeurs n'en fassent un logiciel libre) &eacute;taient les causes principales de ce probl&egrave;me. La plupart des cartes vid&eacute;o 3D ne fonctionnent pleinement qu'avec des pilotes non-libres, ceci pose &eacute;galement un probl&egrave;me. Mais en ce moment, la cause principale de ce probl&egrave;me est Java, parce que certaines personnes qui &eacute;crivent des logiciels libres pense que le langage Java est sexy. Aveugl&eacute;s par leur attrait du langage, ils sous-estiment le probl&egrave;me des d&eacute;pendances et tombent dans le Pi&egrave;ge Java.

source: Sun's implementation of Java is non-free. The standard Java libraries are non-free also. We do have free implementations of Java, such as the <a href="http://gcc.gnu.org/java/">GNU Compiler for Java</a> (GCJ) and <a href="/software/classpath">GNU Classpath</a>, but they don't support all the features yet. We are still catching up.
fr: L'impl&eacute;mentation Java de Sun est non-libre. Les biblioth&egrave;ques Java standard sont aussi non-libres&nbsp;; c'est une adaptation du code propri&eacute;taire de Sun. Les biblioth&egrave;ques de base de Java sont non-libres aussi. Bien s&ucirc;r, nous disposons d'impl&eacute;mentations libres de Java, comme le compilateur GNU pour Java (GCJ) et GNU Classpath, mais ils ne supportent pas encore toutes les fonctionnalit&eacute;s. Nous sommes encore en train de rattraper le retard.

source: If you develop a Java program on Sun's Java platform, you are liable to use Sun-only features without even noticing. By the time you find this out, you may have been using them for months, and redoing the work could take more months. You might say, &ldquo;It's too much work to start over.&rdquo; Then your program will have fallen into the Java Trap; it will be unusable in the Free World.
fr: Si vous d&eacute;veloppez un programme Java sur la plate-forme Java de Sun, vous &ecirc;tes vou&eacute;s &agrave; utiliser des fonctionnalit&eacute;s Sun exclusives sans m&ecirc;me vous en rendre compte. Vous pourriez les avoir utilis&eacute;es pendant des mois avant m&ecirc;me de vous en rendre compte et reprendre la t&acirc;che pourrait prendre plus de mois encore. Vous pourriez vous dire, &laquo;&nbsp;Recommencer demande trop de travail&nbsp;&raquo;. Alors votre programme sera tomb&eacute; dans le Pi&egrave;ge Java; il sera inutilisable dans le Monde Libre.

source: The reliable way to avoid the Java Trap is to have only a free implementation of Java on your system. Then if you use a Java feature or library that free software does not yet support, you will find out straightaway, and you can rewrite that code immediately.
fr: Le truc fiable pour &eacute;viter le Pi&egrave;ge Java est de n'avoir qu'une impl&eacute;mentation libre de Java sur votre syst&egrave;me. Ainsi, si vous utilisez une fonctionnalit&eacute; ou une biblioth&egrave;que que le logiciel libre ne supporte pas encore, vous vous en rendrez compte imm&eacute;diatement, et vous pourrez r&eacute;&eacute;crire ce code tout de suite.

source: Sun continues to develop additional &ldquo;standard&rdquo; Java libraries, and nearly all of them are non-free; in many cases, even a library's specification is a trade secret, and Sun's latest license for these specifications prohibits release of anything less than a full implementation of the specification. (See <a href="http://jcp.org/aboutJava/communityprocess/JSPA2.pdf">http://jcp.org/aboutJava/communityprocess/JSPA2.pdf</a> and <a href="http://jcp.org/aboutJava/communityprocess/final/jsr129/j2me_pb-1_0-fr-spec-license.html">http://jcp.org/aboutJava/communityprocess/final/jsr129/j2me_pb-1_0-fr-spec-license.html</a>, for examples).
fr: Sun continue de cr&eacute;er des biblioth&egrave;ques &laquo;&nbsp;de base&nbsp;&raquo; suppl&eacute;mentaires, et presque toutes celles-ci sont non-libres; dans bien des cas, m&ecirc;me les sp&eacute;cifications de la biblioth&egrave;que sont des secrets commerciaux. De plus la derni&egrave;re licence de Sun concernant ces sp&eacute;cifications interdit la publication d'une mise en &oelig;uvre partielle de ces sp&eacute;cifications. (Voir par exemple <a href="http://jcp.org/aboutJava/communityprocess/JSPA2.pdf">http://jcp.org/aboutJava/communityprocess/JSPA2.pdf</a> et <a href="http://jcp.org/aboutJava/communityprocess/final/jsr129/j2me_pb-1_0-fr-spec-license.html">http://jcp.org/aboutJava/communityprocess/final/jsr129/j2me_pb-1_0-fr-spec-license.html</a>).

source: Fortunately, that specification license does permit releasing an implementation as free software; others who receive the library can be allowed to change it and are not required to adhere to the specification. But the requirement has the effect of prohibiting the use of a collaborative development model to produce the free implementation. Use of that model would entail publishing incomplete versions, which those who have read the spec are not allowed to do.
fr: Heureusement, la licence de ces sp&eacute;cifications permet d'en publier une mise en &oelig;uvre en logiciel libre; ceux qui recevraient une telle biblioth&egrave;que peuvent &ecirc;tre autoris&eacute;s &agrave; la modifier et ne sont pas tenus d'en suivre les sp&eacute;cifications. Mais cette clause a pour effet d'interdire l'utilisation d'un mod&egrave;le de d&eacute;veloppement collaboratif pour produire cette mise en &oelig;uvre libre. L'utilisation d'un tel mod&egrave;le impliquerait la parution de versions incompl&egrave;tes, ce qui est interdit aux personnes ayant lu les sp&eacute;cifications.

source: In the early days of the Free Software Movement, it was impossible to avoid depending on non-free programs. Before we had the GNU C compiler, every C program (free or not) depended on a non-free C compiler. Before we had the GNU C library, every program depended on a non-free C library. Before we had Linux, the first free kernel, every program depended on a non-free kernel. Before we had Bash, every shell script had to be interpreted by a non-free shell. It was inevitable that our first programs would initially be hampered by these dependencies, but we accepted this because our plan included rescuing them subsequently. Our overall goal, a self-hosting GNU operating system, included free replacements for all those dependencies; if we reached the goal, all our programs would be rescued. Thus it happened: with the GNU/Linux system, we can now run these programs on free platforms.
fr: Aux premiers jours du Mouvement du logiciel libre, il &eacute;tait impossible de ne pas d&eacute;pendre de programme non-libres. Avant que nous ne disposions du compilateur GNU C, tous les programmes C (qu'il fussent libres ou non) d&eacute;pendaient d'un compilateur C non-libre. Avant que nous ne disposions de la biblioth&egrave;que GNU C, tous les programmes d&eacute;pendaient d'une biblioth&egrave;que C non-libre. Avant que nous ne disposions de Linux, le premier noyau libre, tous les programmes d&eacute;pendaient d'un noyau non-libre. Avant que nous ne disposions de Bash, chaque script shell devait &ecirc;tre ex&eacute;cut&eacute; par un interpr&eacute;teur non-libre. Il &eacute;tait in&eacute;vitable que nos premiers programmes soient initialement sous le joug de ces d&eacute;pendances, mais ceci &eacute;tait acceptable car leur sauvetage ult&eacute;rieur faisait partie de notre plan. Notre objectif global, un syst&egrave;me d'exploitation autonome, comprenait des remplacements libres &agrave; toutes ces d&eacute;pendances; si nous atteignions ce but, tous nos programmes seraient sauv&eacute;s. Et c'est ce qui se produisit&nbsp;: avec le syst&egrave;me GNU/Linux, nous pouvons &agrave; pr&eacute;sent ex&eacute;cuter ces programmes sur des plates-formes libres.

source: The situation is different today. We now have powerful free operating systems and many free programming tools. Whatever job you want to do, you can do it on a free platform; there is no need to accept a non-free dependency even temporarily. The main reason people fall into the trap today is because they are not thinking about it. The easiest solution to the problem of the Java Trap is to teach people not to fall into it.
fr: La situation est diff&eacute;rente aujourd'hui. Nous disposons &agrave; pr&eacute;sent de syst&egrave;mes d'exploitation puissant et de nombreux d'outils de programmation libres. Quelle que soit la t&acirc;che que vous ayez &agrave; ex&eacute;cuter, vous pouvez le faire sur une plate-forme libre; il n'est plus n&eacute;cessaire, m&ecirc;me temporairement, d'accepter des d&eacute;pendances non-libres. &Agrave; ce jour, la raison principale pour laquelle les gens tombent dans le pi&egrave;ge, est que cela ne leur vient pas &agrave; l'esprit. La plus simple des solutions concernant le Pi&egrave;ge Java est d'apprendre au gens &agrave; ne pas tomber dedans.

source: To keep your Java code safe from the Java Trap, install a free Java development environment and use it. More generally, whatever language you use, keep your eyes open, and check the free status of programs your code depends on. The easiest way to verify that a program is free is by looking for it in the Free Software Directory (<a href="http://www.fsf.org/directory">http://www.fsf.org/directory</a>). If a program is not in the directory, you can check its license(s) against the list of free software licenses (<a href="/licenses/license-list.html">http://www.gnu.org/licenses/license-list.html</a>).
fr: Afin de prot&eacute;ger votre code Java du Pi&egrave;ge Java, installez un environnement de d&eacute;veloppement Java libre et utilisez-le. De fa&ccedil;on g&eacute;n&eacute;rale, quel que soit le langage que vous utilisiez, ouvrez l'&oelig;il, et assurez-vous du statut libre des programmes dont d&eacute;pend le code de vos programmes. La fa&ccedil;on la plus simple de v&eacute;rifier si ce programme est libre est de s'assurer qu'il poss&egrave;de une entr&eacute;e dans le R&eacute;pertoire des logiciels libres (<a href="http://www.fsf.org/directory">http://www.fsf.org/directory</a>). Si un programme n'est pas dans ce r&eacute;pertoire, vous pouvez v&eacute;rifier si la licence qui l'accompagne est dans la liste des licences de logiciels libres (<a href="/licenses/license-list.fr.html">http://www.gnu.org/licenses/license-list.fr.html</a>).

source: We are trying to rescue the trapped Java programs, so if you like the Java language, we invite you to help in developing GNU Classpath. Trying your programs with the the GCJ Compiler and GNU Classpath, and reporting any problems you encounter in classes already implemented, is also useful. However, finishing GNU Classpath will take time; if more non-free libraries continue to be added, we may never have all the latest ones. So please don't put your free software in shackles. When you write an application program today, write it to run on free facilities from the start.
fr: Nous sommes en train d'essayer de sauver les programmes Java pi&eacute;g&eacute;s, alors si vous aimez le langage Java, nous vous invitons &agrave; nous aider &agrave; d&eacute;velopper GNU Classpath. Vous pouvez aussi aider en essayant vos programmes avec le compilateur GCJ et GNU Classpath. Toutefois, cela prendra du temps pour terminer GNU Classpath; si d'autres biblioth&egrave;ques non-libres continuent &agrave; y &ecirc;tre ajout&eacute;es, il se peut que nous n'ayons jamais les plus r&eacute;centes. Alors s'il vous pla&icirc;t, ne placez pas d'entraves sur vos logiciels libres. Faites en sorte que l'application que vous &eacute;crivez en ce moment soit con&ccedil;ue pour fonctionner dans un environnement libre d&egrave;s le d&eacute;part.

source: See also:
fr: Voir également&nbsp;:

source: <a href="/philosophy/sun-in-night-time.html">The Curious Incident of Sun in the Night-Time</a>
fr: <a href="/philosophy/sun-in-night-time.fr.html">Le curieux non-événement de Sun dans la pénombre</a>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Francis Pied.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
