Repository: gitGNU/gnu_www-fr
Catalog: philosophy/kragen-software.*.po
Languages: fr

source: People, places, things and ideas - GNU Project - Free Software Foundation (FSF)
fr: Les gens, les lieux, les choses et les id&eacute;es - GNU Project - Free Software Foundation (FSF)

source: People, places, things and ideas
fr: Les gens, les lieux, les choses et les id&eacute;es

source: by <strong>Kragen Sitaker <a href="mailto:kragen@pobox.com">&lt;kragen@pobox.com&gt;</a></strong>
fr: par <strong>Kragen Sitaker <a href="mailto:kragen&#64;pobox.com">&lt;kragen&#64;pobox.com&gt;</a></strong>

source: Software
fr: Les logiciels

source: Software is ideas. Information. It's different from people, places, and things; it's infinitely reduplicable like fire, at almost no cost. This is a truism, even a cliche. But it seems that there are particular consequences that aren't well-explored.
fr: Les logiciels sont des id&eacute;es, des informations. Ils diff&egrave;rent en fonction des gens, des lieux, des choses; ils peuvent &ecirc;tre reproduits &agrave; l'infini comme le feu, pour pratiquement rien. C'est un truisme, et m&ecirc;me un clich&eacute;. Mais il semble qu'il y ait des cons&eacute;quences particuli&egrave;res qui n'ont pas &eacute;t&eacute; bien explor&eacute;es.

source: One is that it doesn't work well to sell it the way you sell slaves, places, and things; any of your customers can make an unbounded number of copies at cost, or less. Market friction currently makes selling software a viable business model. Perhaps branding does, too; there's a question as to whether Red Hat sells CDs for $50 because people like Red Hat's brand, or just because they don't know they can buy essentially the same CD from CheapBytes for $2.
fr: L'une d'elles est la suivante&nbsp;: cela ne fonctionne pas bien de les vendre de la m&ecirc;me mani&egrave;re que vous vendriez des esclaves, des lieux ou des choses&nbsp;; n'importe lequel de vos clients peut faire un nombre illimit&eacute; de copies &agrave; prix co&ucirc;tant, ou moins. Les conditions actuelles du march&eacute; font de la vente de logiciels un mod&egrave;le commercial viable. Peut-&ecirc;tre que les marques &eacute;galement; il y a une question que l'on se pose&nbsp;: Red Hat vend-il ses CD &agrave; 50&nbsp;$ parce que les gens aiment la marque Red Hat, ou seulement parce qu'ils ne savent pas qu'ils peuvent acheter pratiquement le m&ecirc;me CD de CheapBytes pour 2&nbsp;$&nbsp;?

source: The past and the present
fr: Le pass&eacute; et le pr&eacute;sent

source: The traditional way to deal with this is to lock ideas up inside people, places, and things. A lawyer can get quite a bit of money simply for spitting out the appropriate ideas, not doing any actual creative work, or simply for applying rote procedures &mdash; most wills reportedly fall in this category. I have to go to the Georgia O'Keeffe Museum to see old Georgia's paintings, because they don't allow photography. Then they can charge me admission. (Great museum, by the way. If you go there, don't get the four-day pass; their collection is rather small.) A book can be sold for more than the cost of printing it because the ideas are difficult to separate from their physical manifestation.
fr: La mani&egrave;re habituelle de traiter avec cela est de verrouiller les id&eacute;es dans l'esprit des gens, dans les lieux et dans les choses. Un avocat peut tout &agrave; fait obtenir pas mal d'argent en recrachant les id&eacute;es appropri&eacute;es, sans faire preuve de cr&eacute;ativit&eacute; particuli&egrave;re, ou en d&eacute;bitant simplement des proc&eacute;dures apprises par c&oelig;ur &mdash; la plupart des souhaits tomberaient dans cette cat&eacute;gorie. J'ai du me rendre au mus&eacute;e Georgia O'Keeffe pour voir d'anciennes peintures de Georgia, car les photos ne sont pas autoris&eacute;es. C'est pourquoi ils ont pu me faire payer un billet d'entr&eacute;e. (Un tr&egrave;s beau mus&eacute;e d'ailleurs. Si vous y allez, ne prenez pas le pass quatre-jours; leur collection est plut&ocirc;t r&eacute;duite). Un livre peut &ecirc;tre vendu plus cher que le co&ucirc;t de son impression car les id&eacute;es sont difficiles &agrave; s&eacute;parer de leur manifestation physique.

source: Software makes it much easier to separate ideas from people, places, and things. If I buy my computer to send email with, and I want to make fractals, I don't have to buy a new fractal machine. I just have to download some fractal software. If I want to calculate the yield force of a strut, I don't have to hire a structural engineer; I can download some <abbr title="Finite element analysis">FEA</abbr> software and simulate stressing it until it yields. I don't have to go to a museum to look at my neighbor's fractals; I can just pull them up on my screen. (Once I download them, of course.)
fr: Les logiciels rendent plus faciles &agrave; s&eacute;parer les id&eacute;es des gens, des lieux et des objets. Si j'ach&egrave;te un ordinateur pour envoyer des courriels et que je veuille faire des fractales, je n'ai pas besoin d'acheter une nouvelle machine pour faire des fractales. J'ai seulement besoin de t&eacute;l&eacute;charger un logiciel pour faire des fractales. Si je veux calculer le point de rupture d'une traverse, je n'ai pas besoin d'engager un ing&eacute;nieur en calcul de structures; je peux t&eacute;l&eacute;charger un logiciel de <abbr title="Finite element analysis">FEA</abbr> (MEF)<sup><a href="#TransNote1">1</a></sup> et simuler le stress de la structure jusqu'&agrave; ce qu'elle c&egrave;de. Je n'ai pas besoin d'aller au mus&eacute;e pour voir les fractales de mon voisin; je peux les mettre tout simplement sur mon &eacute;cran &mdash; apr&egrave;s les avoir t&eacute;l&eacute;charg&eacute;es, bien s&ucirc;r.

source: This is a spectacular change.
fr: C'est un changement spectaculaire.

source: Software locked up: the future?
fr: Des logiciels verrouill&eacute;s&nbsp;: l'avenir&nbsp;?

source: And it was the nature of computer applications, in general, until recently. But now we have the Web, and people are talking a lot about application-specific embedded computers. Suddenly people can deliver applications like the ones they used to deliver as computer software, but they can lock up the software &mdash; the ideas &mdash; inside places and things.
fr: Et c'&eacute;tait la nature des applications informatiques, en g&eacute;n&eacute;ral, jusqu'&agrave; r&eacute;cemment. Mais maintenant, nous avons le Web, et les gens parlent beaucoup d'applications sp&eacute;cifiques int&eacute;gr&eacute;es sur ordinateurs. Soudain, les gens peuvent d&eacute;livrer des applications comme ils le faisaient auparavant, mais ils peuvent verrouiller le logiciel &mdash; les id&eacute;es &mdash; dans des lieux et des objets.

source: As an example, I have a CD-ROM containing aggregated US phone listings. Given sufficient time and expertise, I can extract these phone listings and put them up on a web site. (I need to reverse-engineer the database structure they're stored in first.) I can run correlation tests to see if people with certain last names tend to have more biased exchange distributions within a city. (Which would indicate that they lived close to their families, perhaps, or that the city was ethnically segregated.) I can find out which spelling of Cathy is most popular (Kathy? Cathi?), and I can see if people's choices of spellings of Cathy are correlated with their last names.
fr: Par exemple, j'ai un c&eacute;d&eacute;rom qui contient l'ensemble des listings t&eacute;l&eacute;phoniques am&eacute;ricains. Avec suffisamment de temps et d'expertise, je peux extraire ces listings et les mettre sur un site Web (j'ai besoin de faire de la r&eacute;tro-ing&eacute;nierie sur la structure de la base de donn&eacute;es dans laquelle ils sont stock&eacute;s d'abord). Je peux ex&eacute;cuter des tests de corr&eacute;lation pour voir si des personnes avec un certain nom ont une distribution spatiale plus syst&eacute;matique que les autres &agrave; l'int&eacute;rieur d'une ville (ce qui indiquerait qu'ils vivent pr&egrave;s de leur famille, peut-&ecirc;tre, ou que la ville est partag&eacute;e en communaut&eacute;s). Je peux trouver l'orthographe du pr&eacute;nom Cathy qui est la plus populaire (Kathy? Cathi?), et je peux voir si le choix de l'orthographe est corr&eacute;l&eacute; avec leur nom.

source: There are also several web sites containing the same set of phone listings, or newer versions. I can't do any of these things with these web sites, because the phone listings &mdash; an idea &mdash; are locked up in the web site &mdash; a place or a thing, depending on how you look at it.
fr: Il y a &eacute;galement plusieurs sites Web qui recensent les m&ecirc;mes listings t&eacute;l&eacute;phoniques, ou des versions plus r&eacute;centes. Je ne peux faire aucune de ces choses avec ces sites Web car les listings t&eacute;l&eacute;phoniques &mdash; une id&eacute;e &mdash; sont verrouill&eacute;s dans un site Web &mdash; un lieu, ou une chose, cela d&eacute;pend du point de vue.

source: Another tack is to lock information up in things. The <abbr title="National Security Agency">NSA</abbr>'s Skipjack algorithm was classified for several years; implementations were widely available, but only in special hardened devices. This allowed them to deploy it widely behind the iron curtain that surrounds classified research, and they intended to deploy it widely in the outside world, too. (So far, I'm outside that curtain.) Recently, circumstances forced them to distribute software implementations of Skipjack, and so they declassified it. (See <a href="http://www.counterpane.com/crypto-gram-9807.html#skip">http://www.counterpane.com/crypto-gram-9807.html#skip</a> for more.)
fr: Un autre des blocages est de verrouiller l'information dans les objets. L'algorithme Skipjack de la <abbr title="National Security Agency">NSA</abbr> a &eacute;t&eacute; class&eacute; secret il y a plusieurs ann&eacute;es; des mises en &oelig;uvre sont largement disponibles, mais seulement sur des &eacute;quipements sp&eacute;ciaux prot&eacute;g&eacute;s. Ceci a permis de les d&eacute;ployer largement derri&egrave;re le rideau de fer qui entoure la recherche secr&egrave;te, et ils comptaient le d&eacute;ployer largement dans le monde ext&eacute;rieur aussi (jusqu'ici, je suis de l'autre c&ocirc;t&eacute; du rideau). R&eacute;cemment, des &eacute;v&eacute;nements les ont forc&eacute;s &agrave; distribuer des mises en &oelig;uvre logicielles de Skipjack, et ils l'ont donc d&eacute;classifi&eacute;. Voir <a href="http://www.counterpane.com/crypto-gram-9807.html#skip">http://www.counterpane.com/crypto-gram-9807.html#skip</a> pour plus de d&eacute;tails.

source: Why I don't like this
fr: Pourquoi je n'aime pas cela

source: Having the phone book myself gives me more freedom. On the other hand, it also requires me to install software on my machine, giving that software some degree of control over my machine. In this particular case, the software runs under Win95, so it demands complete control over my machine. So it's actually considerably more convenient for me to just visit the web page and fill out a form to look up someone's phone number.
fr: Avoir l'annuaire t&eacute;l&eacute;phonique personnellement me donne plus de libert&eacute;. D'un autre c&ocirc;t&eacute;, cela n&eacute;cessite que j'installe un logiciel sur ma machine, donnant alors au logiciel une part de contr&ocirc;le sur mon ordinateur. Dans ce cas particulier, le logiciel fonctionne sous Windows 95, c'est pourquoi il demande le contr&ocirc;le total sur ma machine. Donc, c'est en fait beaucoup plus pratique pour moi de seulement me rendre sur la page Web et de remplir le formulaire pour trouver le num&eacute;ro de t&eacute;l&eacute;phone de quelqu'un.

source: Information in things is also considerably more convenient than information in software; a special-purpose thing is often considerably easier to use for that purpose than a general-purpose computer is. Because of this, many industry pundits have been forecasting that general-purpose computers will fall out of use in favor of special-purpose devices.
fr: L'information stock&eacute;e dans les objets est &eacute;galement beaucoup plus pratique que de l'information stock&eacute;e dans du logiciel; un &eacute;quipement d&eacute;di&eacute; est souvent beaucoup plus facile &agrave; utiliser qu'un ordinateur &agrave; usage g&eacute;n&eacute;ral. C'est pourquoi, beaucoup d'analystes ont pr&eacute;vu une diminution dans l'utilisation d'ordinateurs universels en faveur d'&eacute;quipements d&eacute;di&eacute;s.

source: I'm somewhat worried about this trend. I like using general-purpose computers &mdash; though admittedly they are often difficult to use. I like the freedom it gives me. The computer is just an extension of my mind.
fr: Je suis quelque peu inquiet de cette tendance. J'aime utiliser des ordinateurs &agrave; usage g&eacute;n&eacute;ral &mdash; bien que j'admette qu'ils soient souvent plus difficiles &agrave; utiliser. J'aime la libert&eacute; qu'ils me donnent. L'ordinateur est juste une extension de mon esprit.

source: Web sites and special-purpose hardware are not like this. They do not give me the same freedoms general-purpose computers do. If the trend were to continue to the extent the pundits project, more and more of what I do today with my computer will be done by special-purpose things and remote servers.
fr: Les sites Web et les &eacute;quipements d&eacute;di&eacute;s ne sont pas comme cela. Ils ne me donnent pas les m&ecirc;mes libert&eacute;s que les ordinateurs. Si la tendance se confirme, de plus en plus de choses que j'effectue aujourd'hui avec mon ordinateur seront faites par des &eacute;quipements d&eacute;di&eacute;s et des serveurs distants.

source: What does freedom of software mean in such an environment? Surely it's not wrong to run a Web site without offering my software and databases for download. (Even if it were, it might not be feasible for most people to download them. IBM's patent server has a many-terabyte database behind it.)
fr: Que signifie la libert&eacute; logicielle dans un tel environnement&nbsp;? Il n'est certainement pas mauvais en soi de tenir un serveur Web sans permettre de t&eacute;l&eacute;charger mon logiciel et mes bases de donn&eacute;es (quand bien m&ecirc;me, il ne serait pas possible pour la plupart des gens de les t&eacute;l&eacute;charger. Le serveur de brevets IBM qui est derri&egrave;re a une base de donn&eacute;es de plusieurs tera-octets).

source: I believe that software &mdash; open-source software, in particular &mdash; has the potential to give individuals significantly more control over their own lives, because it consists of ideas, not people, places, or things. The trend toward special-purpose devices and remote servers could reverse that.
fr: Je crois que les logiciels &mdash; et particuli&egrave;rement les logiciels libres &mdash; ont la capacit&eacute; de donner aux particuliers un contr&ocirc;le significativement plus important sur leur propre vie, car ils conf&egrave;rent aux id&eacute;es, pas aux gens, aux lieux ou aux objets. La tendance &agrave; l'utilisation d'&eacute;quipements d&eacute;di&eacute;s et de serveurs distants pourrait renverser la situation.

source: What does it mean to have free software burned into a ROM? Is the software still free if I have to desolder the ROM to read the source code and burn a new ROM to run a modified version? What does it mean to have free software running a remotely-accessible application on a Web server? Even with the best of intentions, these technologies seem make it difficult to give people the same kind of freedom they enjoy with PCs.
fr: Quel est l'int&eacute;r&ecirc;t d'avoir un logiciel libre grav&eacute; dans une ROM&nbsp;? Un logiciel est-il encore libre si je dois d&eacute;cortiquer une ROM pour lire le code source et le graver dans une nouvelle ROM pour faire fonctionner une version modifi&eacute;e&nbsp;? Qu'est-ce que cela signifie d'avoir un logiciel libre ex&eacute;cutant une application accessible &agrave; distance sur un serveur Web&nbsp;? M&ecirc;me avec les meilleures intentions, ces technologies semblent rendre difficile la possibilit&eacute; de donner aux utilisateurs la m&ecirc;me libert&eacute; dont ils b&eacute;n&eacute;ficient avec les PC.

source: How to fight it
fr: Comment le combattre

source: It's more expensive to buy a new device than it is to download software and install it on my machine. So people won't use special-purpose devices if they provide no advantages.
fr: Il est plus cher d'acheter un nouvel &eacute;quipement que de t&eacute;l&eacute;charger un logiciel et de l'installer sur ma machine. C'est pourquoi les gens n'utiliseront pas d'&eacute;quipements d&eacute;di&eacute;s s'ils ne donnent pas d'avantages.

source: But they do provide advantages. They're *much* easier to use than current general-purpose computers. A button for every function; no funny modes in which the buttons do something else, or nothing. A display for every state variable; you don't have to click on things to make them visible. I suspect that this is not an inherent limitation of general-purpose computers, but a limitation of their current state.
fr: Mais ils donnent vraiment des avantages. Ils sont <strong>vraiment</strong> plus faciles &agrave; utiliser que les ordinateurs universels. Un bouton pour chaque fonction; pas de modes sp&eacute;ciaux dans lesquels les boutons font d'autres choses, ou rien du tout. Un affichage pour chaque variable d'&eacute;tat; vous n'avez pas &agrave; cliquer sur des objets pour les rendre visibles. Je ne pense pas que ce soit une limitation inh&eacute;rente aux ordinateurs universels, mais plut&ocirc;t une limitation de leur &eacute;tat actuel.

source: Another big issue is that they just work. General-purpose computers often don't, particularly when running Microsoft OSes. Even in the best case, you still have to do a couple of seconds of irrelevant stuff before getting to work on what you want to work on &mdash; typing a letter or whatever. More typically, you have to click around for ten seconds or so. At worst, you have to reinstall Windows and the application, reconfigure some peripherals, and reinstall their drivers before you can get anything done.
fr: Et autre chose, ils fonctionnent, tout simplement. Souvent, ce n'est pas le cas des ordinateurs universels, particuli&egrave;rement quand ils fonctionnent avec des syst&egrave;mes d'exploitation de Microsoft. M&ecirc;me dans le meilleur des cas, vous devez toujours perdre du temps &agrave; faire des choses qui n'ont rien &agrave; voir avec ce que vous voulez faire &mdash; taper une lettre ou autre. Plus g&eacute;n&eacute;ralement, vous devez cliquer ici ou l&agrave; pendant une dizaine de secondes. Au pire, vous devez r&eacute;installer Windows et l'application, reconfigurer des p&eacute;riph&eacute;riques, et r&eacute;installer leurs pilotes avant de faire quoi que ce soit d'autre.

source: A third big issue is that they require software installation. If I want to start using my machine for writing email different, I have to install email software on it. While this is considerably less expensive than buying a special-purpose email machine, it's considerably less uncomfortable, intimidating, and confusing. (Or so I'm told.) It also takes longer.
fr: Un troisi&egrave;me gros probl&egrave;me, c'est qu'ils n&eacute;cessitent l'installation de logiciels. Si je veux commencer &agrave; utiliser ma machine pour &eacute;crire des courriels d'une autre mani&egrave;re, je dois installer un logiciel de messagerie. Bien que ce soit sensiblement moins cher que d'acheter un &eacute;quipement d&eacute;di&eacute; pour les courriers &eacute;lectroniques, c'est consid&eacute;rablement moins pratique, plus intimidant, et plus d&eacute;routant (c'est ce que je me suis laiss&eacute; dire). Et cela prend &eacute;galement plus de temps.

source: If general-purpose computers are to survive the onslaught of tiny, cheap special-purpose boxes, they must become as easy to use, reliable, and easy to install software on as those special-purpose boxes. This requires a totally different operating environment than anything we're using on the desktop today; not surprisingly, GNU/Linux is closer than anything else I've used. (Squeak might be even better, but I haven't tried it yet.) But GNU/Linux is an incredibly long way away. This will require different hardware as well as different software.
fr: Si les ordinateurs universels veulent survivre &agrave; l'assaut des petits bo&icirc;tiers bon march&eacute;, ils devront devenir aussi faciles &agrave; utiliser, &agrave; installer des logiciels et aussi fiables que ces &eacute;quipements d&eacute;di&eacute;s. Cela n&eacute;cessite un environnement totalement diff&eacute;rent de celui dont nous disposons sur nos bureaux aujourd'hui; sans surprise, GNU/Linux est le syst&egrave;me qui s'en rapproche le plus&nbsp;; plus que toute autre chose que j'ai essay&eacute;e (Squeak pourrait m&ecirc;me &ecirc;tre mieux, mais je ne l'ai pas encore essay&eacute;). Mais GNU/Linux a une avance incroyable. Cela n&eacute;cessitera des &eacute;quipements et des logiciels diff&eacute;rents.

source: The forces behind remote servers are similar &mdash; ease of use because of uniform interfaces through a web browser, &ldquo;just working&rdquo;, and no installation &mdash; just using. But they have a couple of other advantages as well: they can provide services that require massive storage or computational resources that can't reasonably be provided on your own machine, unless you want to spend wads of cash. (Downloading AltaVista's database every day would be a very inefficient way to search the Web.)
fr: Les avantages des serveurs distants sont similaires &mdash; facilit&eacute; d'utilisation gr&acirc;ce aux interfaces uniformes par un navigateur Web, &laquo;&nbsp;&ccedil;a marche, c'est tout&nbsp;&raquo;, et pas d'installation. Mais ils ont aussi d'autres avantages&nbsp;: ils peuvent fournir des services qui n&eacute;cessitent d'importantes capacit&eacute;s de stockage ou de puissance de calcul, qui ne peuvent raisonnablement pas &ecirc;tre fournies par votre machine, &agrave; moins de d&eacute;penser des fortunes (t&eacute;l&eacute;charger la base de donn&eacute;es de AltaVista chaque jour serait un moyen vraiment inefficace pour faire des recherches sur le Web).

source: I think these extra advantages are probably impossible to overcome at the moment &mdash; although I'm interested in research on distributing big computational jobs over many machines.
fr: Je pense que ces avantages suppl&eacute;mentaires sont probablement impossibles &agrave; surmonter pour le moment &mdash; bien que je sois int&eacute;ress&eacute; par la recherche sur la distribution de travaux n&eacute;cessitant une grande capacit&eacute; de calcul, sur beaucoup de machines.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
