Repository: gitGNU/gnu_www-fr
Catalog: philosophy/lessig-fsfs-intro.*.po
Languages: fr

source: Introduction to Free Software, Free Society - GNU Project - Free Software Foundation (FSF)
fr: Introduction au Logiciel libre, &agrave; la Soci&eacute;t&eacute; libre - GNU Project - Free Software Foundation (FSF)

source: Introduction to <a href="http://shop.fsf.org/product/free-software-free-society/"><i>Free Software, Free Society: The Selected Essays of Richard M. Stallman</i></a>
fr: Introduction au <a href="http://shop.fsf.org/product/free-software-free-society/"><i>Logiciel libre, &agrave; la Soci&eacute;t&eacute; libre&nbsp;: Essais choisis de Richard M. Stallman</i></a>

source: by Lawrence Lessig, Professor of Law, Stanford Law School
fr: par Lawrence Lessig, Professeur de droit, &Eacute;cole de droit de Stanford

source: Every generation has its philosopher &mdash; a writer or an artist who captures the imagination of a time. Sometimes these philosophers are recognized as such; often it takes generations before the connection is made real. But recognized or not, a time gets marked by the people who speak its ideals, whether in the whisper of a poem, or the blast of a political movement.
fr: Chaque g&eacute;n&eacute;ration a son philosophe, un &eacute;crivain ou un artiste qui capte l'air du temps. Quelquefois, ces philosophes sont reconnus comme tels; souvent cela prend des g&eacute;n&eacute;rations avant qu'ils soient reconnus. Mais reconnus ou pas, un temps reste marqu&eacute; par les gens qui parlent de leurs id&eacute;aux, dans le murmure d'un po&egrave;me, ou l'explosion d'un mouvement politique.

source: Our generation has a philosopher. He is not an artist, or a professional writer. He is a programmer. Richard Stallman began his work in the labs of <abbr title="Massachusetts Institute of Technology">MIT</abbr>, as a programmer and architect building operating system software. He has built his career on a stage of public life, as a programmer and an architect founding a movement for freedom in a world increasingly defined by &ldquo;code.&rdquo;
fr: Notre g&eacute;n&eacute;ration a un philosophe. Il n'est ni artiste, ni &eacute;crivain professionnel. Il est programmeur. Richard Stallman a commenc&eacute; son travail dans les laboratoires du <abbr title="Massachusetts Institute of Technology">MIT</abbr>, en tant que programmeur et architecte concevant les logiciels de syst&egrave;me d'exploitation. Il a b&acirc;ti sa carri&egrave;re publique, comme programmeur et architecte en fondant un mouvement pour la libert&eacute; dans un monde de plus en plus d&eacute;fini par le &laquo;&nbsp;code&nbsp;&raquo;.

source: &ldquo;Code&rdquo; is the technology that makes computers run. Whether inscribed in software or burned in hardware, it is the collection of instructions, first written in words, that directs the functionality of machines. These machines &mdash; computers &mdash; increasingly define and control our life. They determine how phones connect, and what runs on TV. They decide whether video can be streamed across a broadband link to a computer. They control what a computer reports back to its manufacturer. These machines run us. Code runs these machines.
fr: Le &laquo;&nbsp;code&nbsp;&raquo; est la technologie qui fait fonctionner les ordinateurs. Qu'il soit inscrit dans le logiciel ou grav&eacute; dans le mat&eacute;riel, c'est un ensemble d'instructions, d'abord &eacute;crit en mots, qui dirige la fonctionnalit&eacute; des machines. Ces machines &mdash; ordinateurs &mdash; d&eacute;finissent et contr&ocirc;lent de plus en plus notre vie. Elles d&eacute;terminent la mani&egrave;re dont se connectent les t&eacute;l&eacute;phones, et ce qui passe &agrave; la t&eacute;l&eacute;. Elles d&eacute;cident si la vid&eacute;o peut-&ecirc;tre diffus&eacute;e &agrave; travers une liaison large bande vers un ordinateur. Elles contr&ocirc;lent ce qu'un ordinateur rapporte &agrave; son constructeur. Ces machines nous gouvernent. Le code gouverne ces machines.

source: What control should we have over this code? What understanding? What freedom should there be to match the control it enables? What power?
fr: Quel contr&ocirc;le devrions-nous avoir sur ce code&nbsp;? Quel discernement? Quelle libert&eacute; devrait-il y avoir pour rivaliser avec le contr&ocirc;le qu'il autorise&nbsp;? Quel pouvoir&nbsp;?

source: These questions have been the challenge of Stallman's life. Through his works and his words, he has pushed us to see the importance of keeping code &ldquo;free.&rdquo; Not free in the sense that code writers don't get paid, but free in the sense that the control coders build be transparent to all, and that anyone have the right to take that control, and modify it as he or she sees fit. This is &ldquo;free software&rdquo;; &ldquo;free software&rdquo; is one answer to a world built in code.
fr: Ces questions ont &eacute;t&eacute; le d&eacute;fi de la vie de Stallman. Par ses travaux et ses paroles, il nous a pouss&eacute; &agrave; voir l'importance de garder le code &laquo;&nbsp;libre&nbsp;&raquo;. Non pas libre au sens o&ugrave; les &laquo;&nbsp;pisseurs de code&nbsp;&raquo; ne doivent pas &ecirc;tre r&eacute;tribu&eacute;s, mais libre au sens o&ugrave; la construction et le contr&ocirc;le du code doivent &ecirc;tre accessibles &agrave; tous, et que tout un chacun a le droit d'en prendre le contr&ocirc;le, comme il ou elle l'entend. Voici ce qu'est le &laquo;&nbsp;logiciel libre&nbsp;&raquo;; le &laquo;&nbsp;logiciel libre&nbsp;&raquo; est une r&eacute;ponse pour un monde fond&eacute; sur le code.

source: &ldquo;Free.&rdquo; Stallman laments the ambiguity in his own term. There's nothing to lament. Puzzles force people to think, and this term &ldquo;free&rdquo; does this puzzling work quite well. To modern American ears, &ldquo;free software&rdquo; sounds utopian, impossible. Nothing, not even lunch, is free. How could the most important words running the most critical machines running the world be &ldquo;free.&rdquo; How could a sane society aspire to such an ideal?
fr: &laquo;&nbsp;Libre&nbsp;&raquo;. Stallman se plaint de l'ambigu&iuml;t&eacute; dans ses propres termes. Il n'y a pas de quoi se plaindre. La perplexit&eacute; force les gens &agrave; r&eacute;fl&eacute;chir, et ce mot &laquo;&nbsp;libre&nbsp;&raquo; fait que &ccedil;a marche plut&ocirc;t bien. Pour l'acception am&eacute;ricaine moderne du terme, &laquo;&nbsp;logiciel libre&nbsp;&raquo; para&icirc;t utopique, impossible. Rien, pas m&ecirc;me le d&eacute;je&ucirc;ner n'est libre (gratuit). Comment les &laquo;&nbsp;mots&nbsp;&raquo; les plus importants faisant fonctionner les machines les plus critiques qui gouvernent le monde pourraient-ils &ecirc;tre &laquo;&nbsp;libres&nbsp;&raquo;. Comment une soci&eacute;t&eacute; saine pourrait-elle aspirer &agrave; un tel id&eacute;al&nbsp;?

source: Yet the odd clink of the word &ldquo;free&rdquo; is a function of us, not of the term. &ldquo;Free&rdquo; has different senses, only one of which refers to &ldquo;price.&rdquo; A much more fundamental sense of &ldquo;free&rdquo; is the &ldquo;free,&rdquo; Stallman says, in the term &ldquo;free speech,&rdquo; or perhaps better in the term &ldquo;free labor.&rdquo; Not free as in costless, but free as in limited in its control by others. Free software is control that is transparent, and open to change, just as free laws, or the laws of a &ldquo;free society,&rdquo; are free when they make their control knowable, and open to change. The aim of Stallman's &ldquo;free software movement&rdquo; is to make as much code as it can transparent, and subject to change, by rendering it &ldquo;free.&rdquo;
fr: Cependant, la dr&ocirc;le de consonnance du mot &laquo;&nbsp;libre&nbsp;&raquo; vient de nous, pas du mot lui-m&ecirc;me. &laquo;&nbsp;Libre&nbsp;&raquo; a diff&eacute;rents sens, seuls l'un d'entre eux se r&eacute;f&egrave;re au &laquo;&nbsp;prix&nbsp;&raquo;. Un sens beaucoup plus fondamental de &laquo;&nbsp;libre&nbsp;&raquo; est &laquo;&nbsp;libre&nbsp;&raquo; que Stallman emploie dans l'expression &laquo;&nbsp;discours libre&nbsp;&raquo;, ou peut-&ecirc;tre mieux dans l'expression &laquo;&nbsp;travail libre&nbsp;&raquo;. Pas libre au sens de gratuit, mais libre au sens de contr&ocirc;le par d'autres limit&eacute;. Le logiciel libre est le contr&ocirc;le transparent, et ouvert au changement, comme les lois sur la libert&eacute;, ou les lois d'une &laquo;&nbsp;soci&eacute;t&eacute; libre&nbsp;&raquo;, elles sont libres quand elles rendent leur contr&ocirc;le accessible et ouvert au changement. Le but du &laquo;&nbsp;Mouvement du logiciel libre&nbsp;&raquo; de Stallman est de faire le plus de code transparent possible, et sujet au changement en le rendant &laquo;&nbsp;libre&nbsp;&raquo;.

source: The mechanism of this rendering is an extraordinarily clever device called &ldquo;copyleft&rdquo; implemented through a license called GPL. Using the power of copyright law, &ldquo;free software&rdquo; not only assures that it remains open, and subject to change, but that other software that takes and uses &ldquo;free software&rdquo; (and that technically counts as a &ldquo;derivative work&rdquo;) must also itself be free. If you use and adapt a free software program, and then release that adapted version to the public, the released version must be as free as the version it was adapted from. It must, or the law of copyright will be violated.
fr: Le r&eacute;sultat de cette interpr&eacute;tation est un outil extraordinairement malin nomm&eacute; &laquo;&nbsp;copyleft&nbsp;&raquo; mis en oeuvre au moyen d'une licence nomm&eacute;e GPL. Utilisant la puissance de la loi sur le droit d'auteur, le &laquo;&nbsp;logiciel libre&nbsp;&raquo; n'assure pas seulement l'ouverture, et la possibilit&eacute; de changement, mais &eacute;galement que les autres logiciels qui prennent et utilisent des &laquo;&nbsp;logiciels libres&nbsp;&raquo; (et qui techniquement sont pris en compte en tant que &laquo;&nbsp;travail d&eacute;riv&eacute;&nbsp;&raquo;) doivent &ecirc;tre &eacute;galement libres eux-m&ecirc;mes. Si vous utilisez et adaptez un programme libre, et diffusez alors cette version adapt&eacute;e au public, la version diffus&eacute;e doit &ecirc;tre ausssi libre que la version de laquelle elle a &eacute;t&eacute; adapt&eacute;e. Elle le doit, ou le droit d'auteur serait viol&eacute;.

source: &ldquo;Free software,&rdquo; like free societies, has its enemies. Microsoft has waged a war against the GPL, warning whoever will listen that the GPL is a &ldquo;dangerous&rdquo; license. The dangers it names, however, are largely illusory. Others object to the &ldquo;coercion&rdquo; in GPL's insistence that modified versions are also free. But a condition is not coercion. If it is not coercion for Microsoft to refuse to permit users to distribute modified versions of its product Office without paying it (presumably) millions, then it is not coercion when the GPL insists that modified versions of free software be free too.
fr: Le &laquo;&nbsp;logiciel libre&nbsp;&raquo;, comme les d&eacute;mocraties, a ses ennemis. Microsoft est entr&eacute; en guerre contre la GPL, avertissant, &agrave; qui veut l'entendre, que la GPL est une licence &laquo;&nbsp;dangereuse&nbsp;&raquo;. Les dangers qu'il nomme cependant, sont grandement illusoires. D'autres s'opposent &agrave; la &laquo;&nbsp;coercition&nbsp;&raquo; dans l'insistence de la GPL pour que les versions modifi&eacute;es soient &eacute;galement libres. Mais une condition n'est pas une coercition. S'il ne s'agit pas de coercition pour Microsoft de refuser la permission aux utilisateurs de distribuer les versions modifi&eacute;es de son produit Office sans le payer (vraisemblablement) des millions, alors, il ne s'agit pas de coercition quand la GPL insiste pour que les versions modifi&eacute;es de logiciels libres le soient aussi.

source: And then there are those who call Stallman's message too extreme. But extreme it is not. Indeed, in an obvious sense, Stallman's work is a simple translation of the freedoms that our tradition crafted in the world before code. &ldquo;Free software&rdquo; would assure that the world governed by code is as &ldquo;free&rdquo; as our tradition that built the world before code.
fr: Et puis, il y a ceux pour qui le message de Stallman est trop extr&eacute;miste. Mais il n'est pas extr&eacute;miste. En effet, il tombe sous le sens que le travail de Stallman est une simple traduction des libert&eacute;s que notre tradition a model&eacute; dans le monde d'avant le code. Le &laquo;&nbsp;logiciel libre&nbsp;&raquo; assurerait que le monde gouvern&eacute; par le code soit aussi &laquo;&nbsp;libre&nbsp;&raquo; que notre tradition qui a b&acirc;ti le monde d'avant le code.

source: For example: A &ldquo;free society&rdquo; is regulated by law. But there are limits that any free society places on this regulation through law: No society that kept its laws secret could ever be called free. No government that hid its regulations from the regulated could ever stand in our tradition. Law controls. But it does so justly only when visibly. And law is visible only when its terms are knowable and controllable by those it regulates, or by the agents of those it regulates (lawyers, legislatures).
fr: Par exemple&nbsp;: une &laquo;&nbsp;soci&eacute;t&eacute; libre&nbsp;&raquo; est r&eacute;glement&eacute;e par la loi. Mais il y a des limites que toute soci&eacute;t&eacute; libre place dans cette r&eacute;glementation par la loi&nbsp;: aucune soci&eacute;t&eacute; qui garderait ses lois secr&egrave;tes ne pourrait &ecirc;tre qualifi&eacute;e de libre. Aucun gouvernement qui cacherait &agrave; ses citoyens ses r&egrave;glements ne pourrait se maintenir dans notre tradition. La loi contr&ocirc;le. Mais elle le fait avec justice, seulement quand elle est visible. Et la loi est visible quand ses termes sont connus et contr&ocirc;lables par ceux auxquels elle s'applique, ou par les repr&eacute;sentants de ceux auxquels elle s'applique (avocats, corps l&eacute;gislatif).

source: This condition on law extends beyond the work of a legislature. Think about the practice of law in American courts. Lawyers are hired by their clients to advance their clients' interests. Sometimes that interest is advanced through litigation. In the course of this litigation, lawyers write briefs. These briefs in turn affect opinions written by judges. These opinions decide who wins a particular case, or whether a certain law can stand consistently with a constitution.
fr: Cette condition sur le droit s'&eacute;tend au-del&agrave; du travail du corps l&eacute;gislatif. Pensez &agrave; la pratique du droit dans les tribunaux am&eacute;ricains. Les avocats sont engag&eacute;s par leurs clients pour faire avancer les int&eacute;r&ecirc;ts de leurs clients. Quelquefois, cet int&eacute;r&ecirc;t est r&eacute;alis&eacute; au moyen d'un proc&egrave;s. Dans le cheminement de ce litige, les avocats r&eacute;digent des conclusions. Ces conclusions en retour affectent les avis rendus par les juges. Ces avis d&eacute;cident de qui gagne une affaire en particulier, ou si une certaine loi est conforme &agrave; la constitution.

source: All the material in this process is free in the sense that Stallman means. Legal briefs are open and free for others to use. The arguments are transparent (which is different from saying they are good) and the reasoning can be taken without the permission of the original lawyers. The opinions they produce can be quoted in later briefs. They can be copied and integrated into another brief or opinion. The &ldquo;source code&rdquo; for American law is by design, and by principle, open and free for anyone to take. And take lawyers do &mdash; for it is a measure of a great brief that it achieves its creativity through the reuse of what happened before. The source is free; creativity and an economy is built upon it.
fr: Toute la mati&egrave;re dans ce processus est libre au sens o&ugrave; l'entend Stallman. Les conclusions juridiques sont ouvertes et libres d'acc&egrave;s pour tous. Les arguments sont transparents (ce qui est diff&eacute;rent de dire qu'ils sont bons) et le raisonnement peut &ecirc;tre repris sans la permission des avocats d'origine. Les avis qu'ils produisent peuvent &ecirc;tre cit&eacute;s dans de futures conclusions. Ils peuvent &ecirc;tre copi&eacute;s et int&eacute;gr&eacute;s dans une autre conclusion ou avis. Le &laquo;&nbsp;code source&nbsp;&raquo; du droit am&eacute;ricain est par conception, et par principe, ouvert et libre pour tout un chacun. Et les avocats le font &mdash; car c'est &agrave; cette aune que se mesure la cr&eacute;ativit&eacute; d'une grande conclusion, par la r&eacute;utilisation de ce qui a &eacute;t&eacute; produit auparavant. Le source est libre; la cr&eacute;ativit&eacute; et une &eacute;conomie sont b&acirc;tis sur ce mod&egrave;le.

source: This economy of free code (and here I mean free legal code) doesn't starve lawyers. Law firms have enough incentive to produce great briefs even though the stuff they build can be taken and copied by anyone else. The lawyer is a craftsman; his or her product is public. Yet the crafting is not charity. Lawyers get paid; the public doesn't demand such work without price. Instead this economy flourishes, with later work added to the earlier.
fr: Cette &eacute;conomie du code libre (et ici j'entends le code libre juridique) n'affame pas les avocats. Les firmes d'avocats ont suffisamment de motivation pour produire de bonnes conclusions m&ecirc;me si ce qu'elles produisent peut &ecirc;tre pris et copi&eacute; par n'importe qui. L'avocat est un artisan; son produit est public. Cependant, l'artisanat n'est pas de la charit&eacute;. Les avocats sont pay&eacute;s; le public ne demande pas un tel travail sans payer. Pourtant cette &eacute;conomie prosp&egrave;re, avec du neuf ajout&eacute; &agrave; du vieux.

source: We could imagine a legal practice that was different &mdash; briefs and arguments that were kept secret; rulings that announced a result but not the reasoning. Laws that were kept by the police but published to no one else. Regulation that operated without explaining its rule.
fr: Nous pourrions imaginer une pratique juridique qui soit diff&eacute;rente &mdash; les conclusions et les argumentaires seraient gard&eacute;s secrets; des d&eacute;cisions qui annonceraient un r&eacute;sultat mais pas le raisonnement. Des lois qui seraient conserv&eacute;es par la police mais qui ne seraient connues de personne d'autre. Une r&egrave;glementation qui fonctionnerait sans expliquer les r&egrave;gles.

source: We could imagine this society, but we could not imagine calling it &ldquo;free.&rdquo; Whether or not the incentives in such a society would be better or more efficiently allocated, such a society could not be known as free. The ideals of freedom, of life within a free society, demand more than efficient application. Instead, openness and transparency are the constraints within which a legal system gets built, not options to be added if convenient to the leaders. Life governed by software code should be no less.
fr: Nous pourrions nous repr&eacute;senter cette soci&eacute;t&eacute;, mais nous ne pourrions imaginer la qualifier de &laquo;&nbsp;libre&nbsp;&raquo;. Que les primes dans une telle soci&eacute;t&eacute; soient mieux ou plus efficacement allou&eacute;es, une telle soci&eacute;t&eacute; ne pourrait &ecirc;tre connue comme libre. Les id&eacute;aux de la libert&eacute;, de la vie dans une soci&eacute;t&eacute; libre, demande plus qu'une application efficace. Au contraire, l'ouverture et la transparence sont les contraintes &agrave; l'int&eacute;rieur desquelles un syst&egrave;me de droit se construit, et non gr&acirc;ce &agrave; des options ajout&eacute;es par commodit&eacute; pour les dirigeants. La vie r&eacute;gent&eacute;e par le code logiciel ne devrait pas &ecirc;tre autrement.

source: Code writing is not litigation. It is better, richer, more productive. But the law is an obvious instance of how creativity and incentives do not depend upon perfect control over the products created. Like jazz, or novels, or architecture, the law gets built upon the work that went before. This adding and changing is what creativity always is. And a free society is one that assures that its most important resources remain free in just this sense.
fr: &Eacute;crire du code n'est pas du litige. Il est meilleur, plus riche, plus productif. Le droit est un exemple &eacute;vident qui montre que la cr&eacute;ativit&eacute; et les primes ne d&eacute;pendent pas du contr&ocirc;le total sur les produits cr&eacute;&eacute;s. Tout comme le jazz, les romans, ou l'architecture, le droit se construit sur ce qui a &eacute;t&eacute; construit auparavant. Ces ajouts et changements sont ce qu'a toujours &eacute;t&eacute; la cr&eacute;ativit&eacute;. Et une soci&eacute;t&eacute; libre fait partie de celles qui assurent que ces ressources les plus importantes demeurent libres en ce sens.

source: For the first time, this book collects the writing and lectures of Richard Stallman in a manner that will make their subtlety and power clear. The essays span a wide range, from copyright to the history of the free software movement. They include many arguments not well known, and among these, an especially insightful account of the changed circumstances that render copyright in the digital world suspect. They will serve as a resource for those who seek to understand the thought of this most powerful man &mdash; powerful in his ideas, his passion, and his integrity, even if powerless in every other way. They will inspire others who would take these ideas, and build upon them.
fr: Pour la premi&egrave;re fois, ce livre recueille les &eacute;crits et les conf&eacute;rences de Richard Stallman dans un style qui rend leur subtilit&eacute; et leur force &eacute;videntes. Les essais couvrent un large panorama, du droit d'auteur &agrave; l'histoire du mouvement du logiciel libre. Ils rec&egrave;lent beaucoup d'arguments peu connus, et parmi ceux-ci, une explication particuli&egrave;rement perspicace sur les changements de situation qui ont rendu suspect le droit d'auteur aux yeux du monde num&eacute;rique. Ils serviront de ressource pour ceux qui cherchent &agrave; comprendre la pens&eacute;e de cet homme puissant &mdash; puissant dans ses id&eacute;es, dans sa passion, et dans son int&eacute;grit&eacute;, m&ecirc;me s'il est impuissant dans toute autre voie. Ils en inspireront d'autres qui prendront ces id&eacute;es, et en construiront de nouvelles.

source: I don't know Stallman well. I know him well enough to know he is a hard man to like. He is driven, often impatient. His anger can flare at friend as easily as foe. He is uncompromising and persistent; patient in both.
fr: Je ne connais pas bien Stallman. Je le connais suffisamment pour savoir qu'il est difficile &agrave; appr&eacute;cier. Il est autoritaire, souvent impatient. Sa col&egrave;re peut &eacute;clater &agrave; l'encontre de ses amis aussi facilement que de ses adversaires. Il est intransigeant et obstin&eacute;; patient dans ces deux travers.
