Repository: gitGNU/gnu_www-fr
Catalog: philosophy/lessig-fsfs-intro.*.po
Languages: fr

source: Yet when our world finally comes to understand the power and danger of code &mdash; when it finally sees that code, like laws, or like government, must be transparent to be free &mdash; then we will look back at this uncompromising and persistent programmer and recognize the vision he has fought to make real: the vision of a world where freedom and knowledge survives the compiler. And we will come to see that no man, through his deeds or words, has done as much to make possible the freedom that this next society could have.
fr: Cependant, quand notre monde comprendra enfin la puissance et le danger du code &mdash; quand il comprendra finalement que le code, comme les lois ou comme les gouvernements, doivent &ecirc;tre transparents pour &ecirc;tre libres &mdash; alors il regardera retrospectivement ce programmeur intransigeant et obstin&eacute; et reconna&icirc;tra la vision pour laquelle il s'est battu pour la rendre tangible&nbsp;: la vision d'un monde o&ugrave; la libert&eacute; et le savoir survivent au compilateur. Et nous nous rendrons compte qu'aucun homme, de par ses actes et ses paroles, n'en aura fait autant pour rendre possible la libert&eacute; que cette future soci&eacute;t&eacute; pourra avoir.

source: We have not earned that freedom yet. We may well fail in securing it. But whether we succeed or fail, in these essays is a picture of what that freedom could be. And in the life that produced these words and works, there is inspiration for anyone who would, like Stallman, fight to create this freedom.
fr: Nous n'avons pas encore gagn&eacute; cette libert&eacute;. Nous pouvons tr&egrave;s bien &eacute;chouer &agrave; l'atteindre. Mais que nous y arrivions ou que nous y &eacute;chouions, dans ces essais est bross&eacute; un tableau de ce que la libert&eacute; pourrait &ecirc;tre. Et dans le monde qui a produit ces actes et ces paroles, il y a l'inspiration pour qui veut, comme Stallman, de se battre pour cr&eacute;er cette libert&eacute;.

source: <strong>Lawrence Lessig</strong><br /> <strong>Professor of Law, Stanford Law School.</strong>
fr: <strong>Lawrence Lessig</strong><br /><strong>Professeur de droit, &Eacute;cole de droit de Stanford</strong>.

source: <a href="http://shop.fsf.org/product/free-software-free-society/">Learn more about <i>Free Software, Free Society: The Selected Essays of Richard M. Stallman</i></a>
fr: <a href="http://shop.fsf.org/product/free-software-free-society/">Apprenez-en plus sur <i>le logiciel libre, la soci&eacute;t&eacute; libre&nbsp;: Essais choisis de Richard M. Stallman</i></a>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted without royalty in any medium provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
