Repository: gitGNU/gnu_www-fr
Catalog: philosophy/linux-gnu-freedom.*.po
Languages: fr

source: The Linux developers have a plan to move these firmware programs into separate files; it will take a few years to mature, but when completed it will solve the secondary problem; we could make a &ldquo;free Linux&rdquo; version that doesn't have the non-free firmware files. That by itself won't do much good if most people use the non-free &ldquo;official&rdquo; version of Linux. That may well occur, because on many platforms the free version won't run without the non-free firmware. The &ldquo;free Linux&rdquo; project will have to figure out what the firmware does and write source code for it, perhaps in assembler language for whatever embedded processor it runs on. It's a daunting job. It would be less daunting if we had done it little by little over the years, rather than letting it mount up. In recruiting people to do this job, we will have to overcome the idea, spread by some Linux developers, that the job is not necessary.
fr: Les d&eacute;veloppeurs de Linux ont pr&eacute;vu de placer ces programmes de firmware dans des fichiers s&eacute;par&eacute;s; cela prendra des ann&eacute;es avant d'y arriver, mais quand ce sera accompli, cela r&eacute;soudra le deuxi&egrave;me probl&egrave;me; nous pourrions faire une version &laquo;&nbsp;Linux libre&nbsp;&raquo; qui ne contiendrait pas les fichiers de firmware non-libres. Ce ne sera pas tr&egrave;s b&eacute;n&eacute;fique en soi si la plupart des gens utilise la version &laquo;&nbsp;officielle&nbsp;&raquo; non-libre de Linux. Cela pourrait tr&egrave;s bien arriver, car la version libre ne fonctionne pas sur bien des plateformes sans les programmes firmware non-libres. Le Projet &laquo;&nbsp;Linux libre&nbsp;&raquo; devra d&eacute;couvrir ce que font les programmes firmware et &eacute;crire le code source, peut-&ecirc;tre en langage assembleur, sur un quelconque processeur int&eacute;gr&eacute; sur lequel il est ex&eacute;cut&eacute;. C'est un travail d&eacute;courageant. Cela aurait &eacute;t&eacute; moins d&eacute;courageant si nous l'avions fait petit &agrave; petit, au fil des ann&eacute;es, plut&ocirc;t que de le laisser s'accumuler. En recrutant des gens pour faire ce travail, nous devrons surmonter l'id&eacute;e, r&eacute;pandue par quelques d&eacute;veloppeurs de Linux, que ce travail n'est pas n&eacute;cessaire.

source: Linux, the kernel, is often thought of as the flagship of free software, yet its current version is partially non-free. How did this happen? This problem, like the decision to use Bitkeeper, reflects the attitude of the original developer of Linux, a person who thinks that &ldquo;technically better&rdquo; is more important than freedom.
fr: Linux, le noyau, est souvent vu comme le porte-drapeau du logiciel libre, cependant, il est en partie non-libre. Comment est-ce arriv&eacute;&nbsp;? Ce probl&egrave;me, tout comme la d&eacute;cision d'utiliser Bitkeeper, refl&egrave;te l'attitude du d&eacute;veloppeur &agrave; l'origine de Linux, une personne qui pense que &laquo;&nbsp;techniquement mieux&nbsp;&raquo; est plus important que libert&eacute;.

source: Value your freedom, or you will lose it, teaches history. &ldquo;Don't bother us with politics,&rdquo; respond those who don't want to learn.
fr: Appr&eacute;ciez votre libert&eacute;, ou vous la perdrez, nous apprend l'histoire. &laquo;&nbsp;Ne nous ennuyez pas avec la politique&nbsp;&raquo;, r&eacute;pondent ceux qui ne veulent pas apprendre.

source: <strong><a name="update">Update:</a></strong> Since 2005, BitKeeper is no longer used to manage the Linux kernel source tree. See the article, <a href="/philosophy/mcvoy.html">Thank You, Larry McVoy</a>. The Linux sources still contain non-free firmware blobs, but as of January 2008, a <a href="http://directory.fsf.org/project/linux"> free version of Linux</a> is now maintained for use in free GNU/Linux distributions.
fr: <strong><a name="update">Mise &agrave; jour&nbsp;:</a></strong> Depuis 2005, BitKeeper n'est plus utilis&eacute; pour g&eacute;rer l'arbre des sources du noyau Linux. Voir l'article <a href="/philosophy/mcvoy.fr.html">Merci, Larry McVoy</a>. Les sources de Linux contiennent encore des parties de firmware non-libres, mais depuis janvier 2008, <a href="http://directory.fsf.org/project/linux">une version libre de Linux</a> est maintenant utilis&eacute;e pour son utilisation dans les distributions GNU/Linux libres.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2002 Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2002 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
