Repository: gitGNU/gnu_www-fr
Catalog: philosophy/luispo-rms-interview.*.po
Languages: fr

source: Stallman did not respond to this query for clarification, but as it happened, a <a href="/events/rms-nyu-2001-transcript.txt">speech</a> he recently presented at New York University responded to Microsoft's propaganda. The Free Software Foundation has presented a <a href="/press/2001-05-04-GPL.html">defense</a>, of free software, as well.
fr: Stallman n'a pas r&eacute;pondu &agrave; cette requ&ecirc;te de clarification, mais il a fait r&eacute;cemment un <a href="/events/rms-nyu-2001-transcript.fr.html">discours</a> &agrave; l'Universit&eacute; de New York r&eacute;pondant &agrave; la propagande de Microsoft. La Free Software Foundation a &eacute;galement pr&eacute;sent&eacute; une <a href="/press/2001-05-04-GPL.html">d&eacute;fense</a> du logiciel libre.

source: [To return to the interview&hellip;]
fr: [Revenons &agrave; l'entretien&hellip;]

source: On a more individual level, how would you address the criticism of person who would like to follow your ethical standards but feels she cannot because she wants also to make money from her intellectual work?
fr: Sur un plan plus individuel, que r&eacute;pondriez-vous &agrave; la critique d'une personne qui voudrait suivre vos standards &eacute;thiques mais qui sent qu'elle ne pourra pas car elle veut gagner de l'argent de son travail intellectuel&nbsp;?

source: This hypothetical person appears to believe that developing free software is incompatible with being paid. If so, she is misinformed&mdash;hundreds of people are now paid to develop free software. Some of them work for Sun. She is challenging us to solve a problem that doesn't really exist.
fr: Cette personne hypoth&eacute;tique semble croire que le d&eacute;veloppement de logiciels libres est incompatible avec une r&eacute;mun&eacute;ration. Si c'est le cas, elle est mal renseign&eacute;e &hellip; des centaines de personnes sont maintenant pay&eacute;es pour d&eacute;velopper des logiciels libres. Certaines d'entre elles travaillent pour Sun. Elle nous d&eacute;fie de r&eacute;soudre un probl&egrave;me qui n'existe pas r&eacute;ellement.

source: But what if she can't get one of these free software jobs? That could happen&mdash;not everybody can get them today. But it doesn't excuse developing proprietary software. A desire for profit is not wrong in itself, but it isn't the sort of urgent overriding cause that could excuse mistreating others. Proprietary software divides the users and keeps them helpless, and that is wrong. Nobody should do that.
fr: Mais que dire si elle n'obtient pas un de ces postes dans le logiciel libre&nbsp;? Cela pourrait arriver &hellip; tout le monde ne peut pas les obtenir aujourd'hui. Mais cela n'est pas une excuse pour d&eacute;velopper des logiciels propri&eacute;taires. Une volont&eacute; de profit n'est pas mauvaise en soi, mais ce n'est pas une raison qui pourrait excuser de maltraiter les autres. Les logiciels propri&eacute;taires divisent les utilisateurs et les laissent sans aide, et ce n'est pas bien. Personne ne devrait faire cela.

source: So what should she do instead? Anything else. She could get a job in another field. But she doesn't have to go that far&mdash;most software development is custom software, not meant to be published either as free software or as proprietary software. In most cases, she can do that without raising an ethical issue. It isn't heroism, but it isn't villainy either.
fr: Alors, que devrait-elle faire &agrave; la place&nbsp;? N'importe quoi d'autre. Elle pourrait obtenir un travail dans un autre domaine. Mais elle n'a pas besoin d'aller jusque l&agrave; &hellip; la plupart des d&eacute;veloppements de logiciels concernent les logiciels personnalis&eacute;s, qui ne sont pas destin&eacute;s &agrave; &ecirc;tre publi&eacute;s, comme le sont les logiciels propri&eacute;taires et les logiciels libres. Dans la plupart des cas, elle peut faire cela sans que cela soul&egrave;ve de probl&egrave;me &eacute;thique. Ce n'est pas de l'h&eacute;ro&iuml;sme, mais ce n'est pas une infamie non plus.

source: But copyright can be thought of as an author's friend.
fr: Mais le copyright peut &ecirc;tre vu comme un ami de l'auteur.

source: In the age of the printing press, that was true: <a href="http://www.intellectual-property.gov.uk/std/resources/copyright/history.htm">copyright</a> was an industrial restriction on publishers, requiring them to pay the author of a book. It did not restrict the readers, because the actions it restricted were things only a publisher could do.
fr: &Agrave; l'&acirc;ge de la presse imprim&eacute;e, c'&eacute;tait vrai&nbsp;: le <a href="http://www.intellectual-property.gov.uk/std/resources/copyright/history.htm">copyright</a> &eacute;tait une restriction industrielle pour les &eacute;diteurs, leur imposant de payer l'auteur d'un livre. Il ne restreignait pas les lecteurs, car les actions qu'il restreignait &eacute;tait des choses qui ne pouvaient &ecirc;tre r&eacute;alis&eacute;es que par les &eacute;diteurs.

source: But this is not true any more. Now copyright is a restriction on the public, for the sake of the publishers, who give the authors a small handout to buy their support against the public.
fr: Mais cela n'est plus vrai &agrave; pr&eacute;sent. Maintenant, le copyright est une restriction pour le public, au b&eacute;n&eacute;fice des &eacute;diteurs, qui donnent aux auteurs une petite aum&ocirc;ne pour acheter leur soutien contre le public.

source: In the current situation, then, who benefits most from copyright?
fr: Dans la situation actuelle alors, qui b&eacute;n&eacute;ficie le plus des droits d'auteurs&nbsp;?

source: The publishers.
fr: Les &eacute;diteurs.

source: Were I freelancing again, I would not want to release my works without the minimal security of payment for my labor copyright affords.
fr: Si je travaillais de nouveau en ind&eacute;pendant, je ne voudrais pas publier mes travaux sans une s&eacute;curit&eacute; minimale de r&eacute;mun&eacute;ration pour mon travail, ce que le copyright permet d'avoir.

source: You could do that without copyright. It is part of your business dealings with the magazine you are writing for.
fr: Vous pourriez le faire sans copyright. Cela fait partie des tractations commerciales que vous faites avec le magazine pour lequel vous &eacute;crivez.

source: But please note that I don't say copyright should be entirely abolished. You can disagree with what I said, but it makes no sense to attack me for things I did not say. What I said in my speech was that software which is published should be free.
fr: Mais veuillez noter que je ne dis pas que le copyright devrait &ecirc;tre totalement aboli. Vous pouvez &ecirc;tre en d&eacute;saccord avec ce que je dis, mais cela n'a pas de sens de m'attaquer pour des choses que je n'ai pas dites. Ce que j'ai dit dans mon discours, c'est que les logiciels qui sont publi&eacute;s devraient &ecirc;tre libres.

source: For a more detailed accounting of Stallman's views regarding copyright as extended to fields outside of software, readers are urged to go to the <a href="/home.html">GNU web site</a>, and to Stallman's <a href="http://www.stallman.org">personal site</a>. In particular, readers might want to look at &ldquo;<a href="http://media-in-transition.mit.edu/forums/copyright/index_transcript.html">Copyright and Globalization in the Age of Computer Networks</a>&rdquo; presented at the Massachusetts Institute of Technology in Cambridge, Massachusetts on 19 April 2001. Discussing his views on copyright as extended to non-software fields, Stallman mentioned, in the interview, &ldquo;Those are ideas that I came to after some years of working on free software. People asked me the question, &lsquo;How do these ideas extend to other kinds of information,&rsquo; so in the 90s I started thinking about the question. This speech gives my thought on the question.&rdquo;
fr: Pour un compte-rendu plus d&eacute;taill&eacute; de l'avis de Stallman concernant le copyright appliqu&eacute; &agrave; d'autres domaines que le logiciel, les lecteurs sont invit&eacute;s &agrave; se rendre sur le <a href="/home.fr.html">site Web de GNU</a> et sur le <a href="http://www.stallman.org">site personnel</a> de Stallman. En particulier, les lecteurs pourraient vouloir consulter &laquo;&nbsp;<a href="/philosophy/copyright-and-globalization.fr.html">Copyright et mondialisation &agrave; l'&acirc;ge des r&eacute;seaux informatiques</a>&nbsp;&raquo; pr&eacute;sent&eacute; &agrave; l'Institut de technologie du Massachusetts (MIT) &agrave; Cambridge, le 19 avril 2001. En discutant de ces id&eacute;es sur le copyright appliqu&eacute; &agrave; d'autres domaines que le logiciel, Stallman a mentionn&eacute; dans l'entretien&nbsp;: &laquo;&nbsp;Ce sont des id&eacute;es qui me sont venues apr&egrave;s avoir travaill&eacute; quelques ann&eacute;es dans le logiciel libre. Des gens m'ont demand&eacute; &laquo;&nbsp;Comment appliquer ces id&eacute;es &agrave; d'autres types d'information&nbsp;?&nbsp;&raquo;, alors dans les ann&eacute;es 90, j'ai commenc&eacute; &agrave; r&eacute;fl&eacute;chir &agrave; la question. Ce discours donne mon avis sur la question&nbsp;&raquo;.

source: On another point: recently, Argentina became the first country to consider requiring all government offices to use free software (see, for instance, <a href="http://www.wired.com/news/business/0,1367,43529,00.html">http://www.wired.com/news/business/0,1367,43529,00.html</a>).
fr: Un autre point&nbsp;: r&eacute;cemment, l'Argentine est devenu le premier pays &agrave; consid&eacute;rer que toutes les instances gouvernementales doivent utiliser des logiciels libres (voir par exemple&nbsp;: <a href="http://www.wired.com/news/business/0,1367,43529,00.html">http://www.wired.com/news/business/0,1367,43529,00.html</a>).

source: I think the regulation is still being discussed&mdash;not adopted yet.
fr: Je pense que la mise en application est toujours en cours de discussion. Elle n'est pas encore vot&eacute;e.

source: As far as I know, that is still the case&hellip; However, whether the legislation has been implemented or not, the news is still encouraging, as at least free software is being considered seriously as a legitimate option. What does this (and other news) suggest regarding your future efforts? That is, are you going to pitch the cause more strongly to developing nations?
fr: Pour autant que je sache c'est encore le cas&hellip; Cependant, que la l&eacute;gislation ait &eacute;t&eacute; mise en &oelig;uvre ou non, les nouvelles sont toujours encourageantes, car au moins, le logiciel libre est consid&eacute;r&eacute; s&eacute;rieusement comme une option l&eacute;gitime. Qu'est-ce que cette information (et d'autres) sugg&egrave;re concernant vos futurs efforts? C'est-&agrave;-dire, allez-vous appuyer la cause plus fortement en direction des pays en voie de d&eacute;veloppement&nbsp;?

source: Yes. I am on my way to South Africa in two weeks [from the time of this writing, mid-May], and a Free Software Foundation is being started in India. There is also great interest in Brazil.
fr: Oui. Je vais partir en Afrique du Sud dans deux semaines [au moment du texte, mi-mai], et une Fondation pour le logiciel libre se lance en Inde. Il y a &eacute;galement un grand int&eacute;r&ecirc;t au Br&eacute;sil.

source: A last point. The so-called &ldquo;Open Source&rdquo; movement is by and large devoid of humor. Not so the &ldquo;Free Software&rdquo; movement. You, in your lectures and in your song, provide a gratifying humorousness. I'd like to finish by asking, What do you accomplish by this?
fr: Un dernier point. Le mouvement &laquo;&nbsp;Open Source&nbsp;&raquo; est dans l'ensemble d&eacute;nu&eacute; d'humour. Ce n'est pas le cas du mouvement du &laquo;&nbsp;logiciel libre&nbsp;&raquo;. Dans vos conf&eacute;rences et dans votre discours, vous &ecirc;tes humoristique. J'aimerais finir en vous demandant&nbsp;:&laquo;&nbsp;Qu'accomplissez-vous en cela&nbsp;?&nbsp;&raquo;

source: I accomplish mirth. That's the hacker spirit&mdash;Ha Ha, Only Serious.
fr: De la bonne humeur. C'est l'esprit du hacker. Ha ha, s&eacute;rieusement.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;: <ol><li id="TransNote1">FUD&nbsp;: Fear Uncertainty and Doubt (peur, incertitude et doute). Sorte de rumeur destin&eacute;e &agrave; semer la confusion dans les esprits.</li></ol>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
