Repository: gitGNU/gnu_www-fr
Catalog: philosophy/luispo-rms-interview.*.po
Languages: fr

source: Interview: Richard M. Stallman - GNU Project - Free Software Foundation (FSF)
fr: Entretien&nbsp;: Richard M. Stallman - GNU Project - Free Software Foundation (FSF)

source: Interview: Richard M. Stallman
fr: Entretien&nbsp;: Richard M. Stallman

source: <i>[ This is an interview between Louis Suarez-Potts and Richard M. Stallman. ]</i>
fr: <i>[Ceci est un entretien entre Louis Suarez-Potts et Richard M. Stallman.]</i>

source: Richard M. Stallman is the most forceful and famous practitioner/theorist of <a href="http://www.salon.com/tech/fsp/glossary/index.html">free software</a>, a termed he coined. &ldquo;Free&rdquo; here means free as in &ldquo;free speech,&rdquo; not free as in &ldquo;free beer.&rdquo; Stallman's most famous intervention in the &ldquo;free software&rdquo; movement has surely been the GNU General Public License (<a href="/philosophy/license-list.html">GPL</a>), which Stallman created around 1985 as a general license that could be applied to any program. The license codifies the concept of &ldquo;<a href="http://www.gnu.org/gnu/thegnuproject.html">copyleft</a>,&rdquo; the &ldquo;central idea&rdquo; of which Stallman has described as giving &ldquo;everyone permission to run the program, copy the program, modify the program, and distribute modified versions, but not permission to add restrictions of their own. Thus, the crucial freedoms that define &lsquo;free software&rsquo; are guaranteed to everyone who has a copy; they become inalienable rights&rdquo; (Stallman, &ldquo;The GNU Operating System and the Free Software Movement,&rdquo; in DiBona, <cite>Open Sources: Voices from the Open Source Revolution</cite>)
fr: Richard M. Stallman est le praticien/th&eacute;oricien le plus &eacute;nergique et le plus c&eacute;l&egrave;bre du <a href="http://www.salon.com/tech/fsp/glossary/index.html">logiciel libre</a> (&laquo;&nbsp;free software&nbsp;&raquo;), un terme qu'il a cr&eacute;&eacute;. &laquo;&nbsp;Free&nbsp;&raquo; ici signifie libre comme dans &laquo;&nbsp;libert&eacute; d'expression&nbsp;&raquo; et non gratuit comme dans &laquo;&nbsp;entr&eacute;e libre&nbsp;&raquo;. La contribution la plus c&eacute;l&egrave;bre de Stallman dans le mouvement du &laquo;&nbsp;logiciel libre&nbsp;&raquo; a s&ucirc;rement &eacute;t&eacute; la GNU General Public License (la licence publique g&eacute;n&eacute;rale GNU) (<a href="/philosophy/license-list.fr.html">GPL</a>), que Stallman a cr&eacute;&eacute; aux alentours de 1985 comme une licence g&eacute;n&eacute;rale qui pourrait &ecirc;tre appliqu&eacute;e &agrave; n'importe quel programme. La licence codifie le concept de <a href="/gnu/thegnuproject.fr.html">&laquo;&nbsp;copyleft&nbsp;&raquo;</a> (NdT&nbsp;: &laquo;&nbsp;copyleft&nbsp;&raquo; peut se traduire par &laquo;&nbsp;gauche d'auteur&nbsp;&raquo; par opposition au &laquo;&nbsp;copyright&nbsp;&raquo; qui se traduit en &laquo;&nbsp;droit d'auteur&nbsp;&raquo;), l'&laquo;&nbsp;id&eacute;e centrale&nbsp;&raquo; que Stallman a d&eacute;crite en donnant &agrave; &laquo;&nbsp;tout le monde le droit d'ex&eacute;cuter un programme, de copier le programme, de modifier le programme et de distribuer des versions modifi&eacute;es, mais pas le droit d'ajouter des restrictions de son cru. Par cons&eacute;quent, les libert&eacute;s cruciales qui d&eacute;finissent le &laquo;&nbsp;logiciel libre&nbsp;&raquo; sont garanties &agrave; quiconque d&eacute;tient une copie&nbsp;; elles deviennent des droits inali&eacute;nables&nbsp;&raquo; (Stallman, &laquo;&nbsp;The GNU Operating System and the Free Software Movement&nbsp;&raquo;, in DiBona, <cite>Open Sources&nbsp;: Voices from the Open Source Revolution</cite>).

source: Every free-software license since probably owes its existence to Stallman's vision, including those licenses by which OpenOffice.org code is governed. Stallman's work is of course resolutely practical. A short list of his coding accomplishments would include Emacs as well as most of the components of the GNU/Linux system, which he either wrote or helped write. In 1990, Stallman received a <a href="http://www.macfound.org/programs/fel/fel_overview.htm">McArthur Foundation</a> fellowship; he has used the funds given him to further his free software work. (See Moody, <cite>Rebel Code</cite> for a good account of Stallman's mission.)
fr: Toute licence de logiciel libre publi&eacute;e depuis doit probablement son existence &agrave; la vision de Stallman, y compris les licences qui r&eacute;gissent le code de OpenOffice.org. Le travail de Stallman est bien s&ucirc;r, r&eacute;solument pratique. Une courte liste des programmes qu'il a cod&eacute;s inclurait Emacs aussi bien que la plupart des composants du syst&egrave;me GNU/Linux, qu'il a soit &eacute;crit, soit aid&eacute; &agrave; &eacute;crire. En 1990, Stallman a re&ccedil;u une bourse de la <a href="http://www.macfound.org/programs/fel/fel_overview.htm">Fondation McArthur</a>&nbsp;; il a utilis&eacute; les fonds qui lui ont &eacute;t&eacute; donn&eacute;s pour parfaire son travail dans le logiciel libre. (Voir Moody, <cite>Rebel Code</cite> pour avoir une bonne id&eacute;e de la mission de Stallman).

source: The opportunity for this interview arose when I saw Stallman lecture at Sun's Cupertino campus in May. At that time, I requested an email interview with Stallman. He assented, and shortly after, I submitted the series of questions below, to which he responded, often at length. However, my efforts for a follow-up failed, so this interview is only the first pass. As a consequence, I was unable to extend (and challenge) some interesting avenues; I have also provided as much context as possible for Stallman's politics in the links. It goes without saying that Stallman's views are his own and do not necessarily represent mine or those of OpenOffice.org.
fr: L'opportunit&eacute; de cet entretien m'est venue quand j'ai assist&eacute; &agrave; la conf&eacute;rence de Stallman sur le campus de Sun, &agrave; Cupertino en mai. &Agrave; ce moment-l&agrave;, j'ai demand&eacute; un entretien avec Stallman par email. Il fut d'accord et peu de temps apr&egrave;s, je lui soumettais la s&eacute;rie de questions ci-dessous, auxquelles il r&eacute;pondit, souvent largement. Quoi qu'il en soit, mes efforts pour poursuivre cet entretien &eacute;chou&egrave;rent, aussi, cet entretien n'est qu'une premi&egrave;re s&eacute;rie. Par cons&eacute;quent, je n'ai pas &eacute;t&eacute; en mesure d'&eacute;tendre et de me confronter &agrave; certaines notions int&eacute;ressantes&nbsp;; j'ai &eacute;galement fourni autant de liens que possible concernant la politique de Stallman. Il va sans dire que les vues de Stallman lui sont propres et ne refl&egrave;tent pas n&eacute;cessairement les miennes ou celles de OpenOffice.org.

source: For more information, readers are encouraged to visit the <a href="/home.html">GNU website</a>, as well as <a href="http://www.stallman.org">Stallman's personal site</a>.
fr: Pour plus d'informations, les lecteurs sont invit&eacute;s &agrave; visiter le site Web de <a href="/home.fr.html">GNU</a>, ainsi que le site personnel de <a href="http://www.stallman.org/">Stallman</a>.

source: I would like, in this interview, to focus on your current work, and on the problematic of what kind of society we should like to live in. Your focus now&mdash;and for at least the last seventeen years&mdash;has been on working to make the social arrangements for using software more ethical.
fr: J'aimerais dans cet entretien que nous nous concentrions sur votre travail actuel et sur la probl&eacute;matique du genre de soci&eacute;t&eacute; dans laquelle nous aimerions vivre. Votre priorit&eacute; actuelle (et au moins lors des dix-sept derni&egrave;res ann&eacute;es) a &eacute;t&eacute; de travailler pour fonder des dispositions sociales qui rendent l'utilisation des logiciels plus &eacute;thique.

source: But, [briefly,] what do you mean by the notion of a what I call here a more ethical society?
fr: Mais (bri&egrave;vement), qu'entendez-vous dans la notion de ce que j'appelle ici une soci&eacute;t&eacute; plus &eacute;thique&nbsp;?

source: We need to encourage the spirit of cooperation, by respecting other people's freedom to cooperate and not advancing schemes to divide and dominate them.
fr: Nous avons besoin d'encourager l'esprit de coop&eacute;ration, en respectant la libert&eacute; des autres &agrave; coop&eacute;rer et ne pas mettre en place des syst&egrave;mes pour les diviser et les dominer.

source: This takes us to a point that is quite important and that I am hoping you can clarify for our readers. The term you prefer for your ethic is &ldquo;free software,&rdquo; where the word &ldquo;free&rdquo; means freedom from constraints and not free to take. But the term that more and more people are using is &ldquo;Open Source,&rdquo; a term of quite recent vintage (1998), and, from your perspective, filled with significant problems. Of the two, free software is a term that implies an ethic of living and holds out the promise of a more just society; the other, &ldquo;open source,&rdquo; does not.
fr: Ceci nous am&egrave;ne &agrave; un point qui est tr&egrave;s important et que j'esp&egrave;re vous pourrez clarifier pour nos lecteurs. Le terme que vous pr&eacute;f&eacute;rez pour votre &eacute;thique est &laquo;&nbsp;free software&nbsp;&raquo; (logiciel libre), o&ugrave; le mot &laquo;&nbsp;free&nbsp;&raquo; signifie libre des contraintes et pas libre de prendre. Mais le terme que de plus en plus de gens utilisent est &laquo;&nbsp;Open Source&nbsp;&raquo; (code source ouvert), un terme tr&egrave;s r&eacute;cent (1998) et qui, selon vous, est charg&eacute; de probl&egrave;mes importants. Des deux, logiciel libre est un terme qui implique une &eacute;thique de vie et qui porte la promesse d'une soci&eacute;t&eacute; plus juste; l'autre, &laquo;&nbsp;open source&nbsp;&raquo;, n'est pas porteur de ce message.

source: Is that a fair statement? Would you address that issue, and clarify the distinctions for our readers?
fr: Est-ce une d&eacute;claration correcte? Pourriez-vous traiter cette question et clarifier les distinctions pour nos lecteurs&nbsp;?

source: That is exactly right. Someone once said it this way: open source is a development methodology; free software is a political philosophy (or a social movement).
fr: C'est tout &agrave; fait exact. Quelqu'un l'a dit un jour de cette fa&ccedil;on&nbsp;: &laquo;&nbsp;l'open source est une m&eacute;thodologie de d&eacute;veloppement; le logiciel libre est une philosophie politique (ou un mouvement social)&nbsp;&raquo;.

source: The <a href="http://www.opensource.org">open source movement</a> focuses on convincing business that it can profit by respecting the users' freedom to share and change software. We in the <a href="http://www.fsf.org/">free software movement</a> appreciate those efforts, but we believe that there is a more important issue at stake: all programmers [owe] an ethical obligation to respect those freedoms for other people. Profit is not wrong in itself, but it can't justify mistreating other people.
fr: Le <a href="http://www.opensource.org">mouvement open source</a> se concentre &agrave; convaincre les soci&eacute;t&eacute;s qu'il peut &ecirc;tre profitable de respecter la libert&eacute; des utilisateurs de partager et de modifier les logiciels. Nous, dans le <a href="http://www.fsf.org/">mouvement du logiciel libre</a>, nous appr&eacute;cions ces efforts, mais nous pensons qu'il y a une question plus importante en jeu&nbsp;: tous les programmeurs ont l'obligation &eacute;thique de respecter ces libert&eacute;s pour les autres personnes. Le profit n'est pas une mauvaise chose en soi, mais il ne peut justifier de maltraiter les autres.

source: Along these lines, there has been considerable confusion over how to name your idea of an ethical society. Mistakenly, many would assert that you are suggesting a <a href="http://www.marxists.org/archive/marx/works/1840/prin-com.htm">communism</a>.
fr: Au travers de ces lignes, il y a eu une confusion consid&eacute;rable sur la fa&ccedil;on de nommer votre id&eacute;e d'une soci&eacute;t&eacute; &eacute;thique. Par erreur, certains affirmeraient que vous sugg&eacute;rez un <a href="http://www.marxists.org/archive/marx/works/1840/prin-com.htm">communisme</a>.

source: Anyone who criticizes certain business practices can expect to be called &ldquo;communist&rdquo; from time to time. This is a way of changing the subject and evading the issue. If people believe the charges, they don't listen to what the critics really say. (It is much easier to attack communism than to attack the views of the free software movement.)
fr: Quiconque critique certaines pratiques commerciales peut s'attendre &agrave; &ecirc;tre trait&eacute; de &laquo;&nbsp;communiste&nbsp;&raquo; de temps en temps. C'est une mani&egrave;re de changer de sujet et d'&eacute;luder la question. Si des gens croient &agrave; ces accusations, c'est qu'il n'ont pas &eacute;cout&eacute; vraiment ce sur quoi portaient les critiques. (Il est bien plus facile d'attaquer le communisme que d'attaquer les vues du mouvement du logiciel libre).

source: Pekka Himanen, in his recent work, the <cite>Hacker Ethic</cite>, has rightly countered these claims. I would go further: that what you suggest is close to what political theorists such as <a href="http://www.gwu.edu/~ccps/etzioni/index.html">Amitai Etzioni</a> would describe as a communitarianism (see, for instance, <a href="http://www.gwu.edu/~icps/about.html">http://www.gwu.edu/~icps/about.html</a>). And communitariannism is by no means hostile to the market economy that most people associate with capitalism. Quite the opposite. Would you speak to what could be called the politics of your ethical system?
fr: Pekka Himanen, dans son r&eacute;cent ouvrage, <ins>Hacker Ethic</ins> (l'&eacute;thique du hacker), a justement contr&eacute; ces assertions. J'irais m&ecirc;me plus loin&nbsp;: que ce que vous sugg&eacute;rez est proche de ce que des th&eacute;oriciens politiques, tel que <a href="http://www.gwu.edu/~ccps/etzioni/index.html">Amitai Etzioni</a>, d&eacute;criraient comme un communitarisme (voir par exemple&nbsp; <a href="http://www.gwu.edu/~icps/about.html">http://www.gwu.edu/~icps/about.html</a>). Et le communitarisme n'est en aucun cas hostile &agrave; l'&eacute;conomie de march&eacute; que la plupart des gens associent au capitalisme. C'est m&ecirc;me tout l'oppos&eacute;. Parleriez-vous, &agrave; ce que nous pourrions appeler les politiques, de votre syst&egrave;me &eacute;thique&nbsp;?

source: There is a place in life for business, but business should not be allowed dominate everyone's life. The original idea of democracy was to give the many a way to check the power of the wealthy few.
fr: Il y a une place dans la vie pour le commerce, mais le commerce ne devrait pas &ecirc;tre autoris&eacute; &agrave; dominer la vie de chacun. L'id&eacute;e originale de la d&eacute;mocratie &eacute;tait de donner au plus grand nombre un moyen de contr&ocirc;ler le pouvoir de la minorit&eacute; nantie.

source: Today business (and its owners) has far too much political power, and this undermines democracy in the US and abroad. Candidates face an effective veto by business, so they dare not disobey its orders.
fr: Aujourd'hui, les entreprises (et leurs propri&eacute;taires) ont beaucoup trop de pouvoir politique, et cela mine la d&eacute;mocratie aux &Eacute;tats-Unis et &agrave; l'&eacute;tranger. Les candidats font face &agrave; un v&eacute;to efficace des entreprises (voir <a href="http://www.billionairesforbushorgore.com">http://www.billionairesforbushorgore.com</a>), aussi, ils n'osent pas leur d&eacute;sob&eacute;ir.

source: The power to make laws is being transferred from elected legislatures to nondemocratic bodies such as the <a href="http://www.foreignpolicy-infocus.org/briefs/vol2/v2n14wto.html">World Trade Organization</a>, which was designed to subordinate public health, environmental protection, labor standards, and the general standard of living to the <a href="http://www.citizen.org/pctrade/gattwto/gatthome.html">http://www.citizen.org/pctrade/gattwto/gatthome.html</a> interests of business. Under <a href="http://www.tradewatch.org/nafta/reports/5years.htm">NAFTA [North American Free Trade Associtation]</a>, a Canadian company which was convicted in Mississippi of anticompetitive practices is <a href="http://www.citizen.org/pctrade/nafta/cases/Loewen.htm">suing</a> for Federal compensation for its lost business due to the conviction. They claim that NAFTA takes away states' right to make laws against anticompetitive practices.
fr: Le pouvoir de l&eacute;gif&eacute;rer est transf&eacute;r&eacute; des l&eacute;gislateurs, &eacute;lus, &agrave; des entit&eacute;s non d&eacute;mocratiquement &eacute;lues telle que <a href="http://www.foreignpolicy-infocus.org/briefs/vol2/v2n14wto.html">l'Organisation mondiale du commerce</a>, qui a &eacute;t&eacute; con&ccedil;ue pour subordonner la sant&eacute; publique, la protection de l'environnement, les conditions de travail, et les conditions de vie en g&eacute;n&eacute;ral aux <a href="http://www.citizen.org/pctrade/gattwto/gatthome.html">http://www.citizen.org/pctrade/gattwto/gatthome.html</a>int&eacute;r&ecirc;ts des entreprises. Avec l'<a href="http://www.tradewatch.org/nafta/reports/5years.htm">AL&Eacute;NA [Association de libre &eacute;change nord-am&eacute;ricain]</a>, une soci&eacute;t&eacute; canadienne condamn&eacute;e au Mississippi pour pratiques anti-concurrentielles <a href="http://www.citizen.org/pctrade/nafta/cases/Loewen.htm">fait un proc&egrave;s</a> pour obtenir une compensation f&eacute;d&eacute;rale pour ses pertes dues &agrave; cette condamnation. Ils revendiquent que l'AL&Eacute;NA retire aux &Eacute;tats le droit de l&eacute;gif&eacute;rer sur les pratiques anti-concurrentielles.

source: But business is not satisfied yet. The proposed <a href="http://www.ftaa-alca.org/">FTAA [Free Trade Area of the Americas]</a> would require all governments to privatize their [public facilities] such as schools, water supply, record keeping, even social security. This is what Bush wants &ldquo;fast track&rdquo; authority to push through.
fr: Mais les entreprises ne sont pas encore satisfaites. La <a href="http://www.ftaa-alca.org/">ZLEA [Zone de libre-&eacute;change des Am&eacute;riques]</a> propos&eacute;e voudrait que tous les gouvernements privatisent leurs [services publics] telles que les &eacute;coles, la distribution d'eau, les archives et m&ecirc;me la s&eacute;curit&eacute; sociale. C'est ce que Bush veut que l'autorit&eacute; <a href="http://www.fasttrack.org/">&laquo;&nbsp;fast track&nbsp;&raquo;</a> fasse passer.

source: Peaceful protestors against the FTAA in Quebec were violently <a href="http://www.web.amnesty.org/web/news.nsf/WebAll/A781217116BC45BB80256A3F005AA069?OpenDocument">attacked</a> by police, who then blamed the fighting on the protestors. One protestor standing on the street was shot in the throat with a plastic bullet at a range of 20 feet. He is maimed for life, and seeks to press charges of attempted murder&mdash;if the cops will reveal who shot him.
fr: Les manifestants pacifiques contre la ZLEA au Qu&eacute;bec ont &eacute;t&eacute; violemment attaqu&eacute;s <a href="http://www.web.amnesty.org/web/news.nsf/WebAll/A781217116BC45BB80256A3F005AA069?OpenDocument">attaqu&eacute;s</a> par la police, qui ont alors rejet&eacute; la faute sur les manifestants. Un manifestant qui se tenait dans la rue, a &eacute;t&eacute; atteint d'un tir dans la gorge d'un balle en caoutchouc &agrave; une distance de 6 m&egrave;tres. Il a &eacute;t&eacute; estropi&eacute; &agrave; vie, et cherche &agrave; porter plainte pour tentative de meurtre &hellip; si la police r&eacute;v&egrave;le qui lui a tir&eacute; dessus.

source: One protest organizer was attacked on the street by a gang that got out of a van, knocked him down, and beat him up. When his friends came to the rescue, the gang revealed itself as undercover police and took him away.
fr: Un organisateur de la manifestation a &eacute;t&eacute; attaqu&eacute; dans la rue par un groupe sorti d'une camionnette, qui l'a mis &agrave; terre, et l'a tabass&eacute;. Quand ses amis sont venus &agrave; son secours, le groupe s'est r&eacute;v&eacute;l&eacute; &ecirc;tre des policiers sous couverture qui l'ont emmen&eacute; avec eux.

source: Whatever democracy survives the globalization treaties is likely to be crushed by the efforts to suppress <a href="http://www.stopftaa.org/">opposition to them</a>.
fr: Si la d&eacute;mocratie survit aux trait&eacute;s de la mondialisation, elle sera probablement &eacute;cras&eacute;e par les efforts pour supprimer <a href="http://www.stopftaa.org/">toute opposition &agrave; ceux-ci</a>.

source: The most immediate criticism of your insistence on ethics would be that the ethic of free software is fine, but not relevant to the real world of business.
fr: La critique la plus imm&eacute;diate &agrave; votre insistance sur l'&eacute;thique, serait que l'&eacute;thique du logiciel libre est bonne mais inad&eacute;quate pour le vrai monde des affaires.

source: With over half the world's Web sites running on GNU/Linux and <a href="http://www.apache.org">Apache</a>, that is evidently just FUD. You should not give such falsehoods credibility by appearing to take them seriously yourself.
fr: Avec plus de la moiti&eacute; des sites Web dans le monde ex&eacute;cutant GNU/Linux et <a href="http://www.apache.org">Apache</a>, il s'agit &eacute;videmment de FUD<sup><a href="#TransNote1">1</a></sup>. Vous ne devriez pas donner &agrave; de tels mensonges de la cr&eacute;dibilit&eacute; en paraissant les prendre au s&eacute;rieux vous-m&ecirc;me.

source: I think it is worse to leave implicit lies unanswered than to address them directly. The thrust of my argument was that Microsoft, for instance, would and does claim that free software does not make money and rather loses money. They argue it's a bad idea all around. I don't think that Microsoft is to be ignored, just as the WTO should not be ignored. But: my question was to suggest a rebuttal this self-evident FUD, not to credit the errors of others.
fr: Je pense qu'il est pire de ne pas r&eacute;pondre &agrave; des mensonges implicites que de s'attaquer &agrave; eux directement. L'id&eacute;e g&eacute;n&eacute;rale de mon argument &eacute;tait que Microsoft, par exemple, affirme que le logiciel libre ne rapporte pas d'argent et qu'il en fait perdre plut&ocirc;t. Ils soutiennent que c'est une mauvaise id&eacute;e autour d'eux. Je ne pense pas qu'il faille ignorer Microsoft, tout comme l'<abbr title="Organisation mondiale du commerce">OMC</abbr> ne doit pas &ecirc;tre ignor&eacute;e. Mais&nbsp;: ma question &eacute;tait de sugg&eacute;rer une r&eacute;futation &agrave; ce FUD paraissant &eacute;vident, pas de souligner les erreurs des autres.

source: So, I'll rephrase my question: Microsoft has attacked the GPL as business foolishness that is also bad for &ldquo;America&rdquo; (whatever that means). They don't care about community ethics. How do you then counter their FUD, or for that matter, the FUD of those who share Microsoft's views?
fr: Soit, je reformule ma question&nbsp;: Microsoft a tax&eacute; la <abbr title="General Public License">GPL</abbr> de folie commerciale qui est &eacute;galement mauvaise pour l'&laquo;&nbsp;Am&eacute;rique&nbsp;&raquo; (quoi que cela puisse signifier). Ils ne se pr&eacute;occupent pas d'&eacute;thique communautaire. Comment dans ce cas contrez-vous leur FUD ou d'ailleurs, le FUD de ceux qui partagent les vues de Microsoft&nbsp;?
