Repository: gitGNU/gnu_www-fr
Catalog: philosophy/mcvoy.*.po
Languages: fr

source: Thank You, Larry McVoy
fr: Merci, Larry McVoy

source: by <strong>Richard M. Stallman</strong>
fr: par <strong>Richard M. Stallman</strong>

source: My gratitude is limited, since it was McVoy that created the problem in the first place. But I still appreciate his decision to clear it up.
fr: Ma gratitude est limit&eacute;e, puisque c'&eacute;tait McVoy qui avait cr&eacute;&eacute; le probl&egrave;me en premier lieu. Mais j'appr&eacute;cie toutefois sa d&eacute;cision de clarifier les choses.

source: McVoy made the program available gratis to free software developers. This did not mean it was free software for them: they were privileged not to part with their money, but they still had to part with their freedom. They gave up the fundamental freedoms that define free software: freedom to run the program as you wish for any purpose, freedom to study and change the source code as you wish, freedom to make and redistribute copies, and freedom to publish modified versions.
fr: McVoy a rendu le programme disponible gratuitement pour les d&eacute;veloppeurs de logiciels libres. Cela ne signifiait pas qu'il s'agissait d'un logiciel libre pour eux&nbsp;: ils avaient le privil&egrave;ge d'&ecirc;tre dispens&eacute;s de payer, mais ils devaient se dispenser de leur libert&eacute;. Ils avaient abandonn&eacute; les libert&eacute;s fondamentales qui d&eacute;finissent le logiciel libre&nbsp;: la libert&eacute; d'utiliser le programme comme vous le souhaitez et pour l'usage que vous voulez, la libert&eacute; d'&eacute;tudier et de modifier le code source &agrave; votre convenance, la libert&eacute; de r&eacute;aliser et de redistribuer des copies et la libert&eacute; de publier des versions modifi&eacute;es.

source: McVoy's great triumph was the adoption of this program for Linux development. No free software project is more visible than Linux. It is the kernel of the GNU/Linux operating system, an essential component, and users often mistake it for the entire system. As McVoy surely planned, the use of his program in Linux development was powerful publicity for it.
fr: Le grand triomphe de McVoy fut l'adoption de ce programme pour le d&eacute;veloppement de Linux. Aucun autre projet de logiciel libre n'est plus visible que Linux. C'est le noyau du syst&egrave;me d'exploitation GNU/Linux, un composant essentiel, et les utilisateurs l'assimilent souvent par erreur au syst&egrave;me tout entier. Comme McVoy l'avait s&ucirc;rement pr&eacute;vu, l'utilisation de son programme pour le d&eacute;veloppement de Linux fit une &eacute;norme publicit&eacute; pour son logiciel.

source: It was also, whether intentionally or not, a powerful political PR campaign, telling the free software community that freedom-denying software is acceptable as long as it's convenient. If we had taken that attitude towards Unix in 1984, where would we be today? Nowhere. If we had accepted using Unix, instead of setting out to replace it, nothing like the GNU/Linux system would exist.
fr: Ce fut, intentionnellement ou non, une puissante campagne de propagande politique, disant &agrave; la communaut&eacute; du libre que les logiciels refusant la libert&eacute; sont acceptables aussi longtemps qu'ils sont pratiques. Si nous avions adopt&eacute; cette attitude &agrave; l'&eacute;gard d'Unix en 1984, o&ugrave; en serions nous aujourd'hui&nbsp;? Nulle part. Si nous avions accept&eacute; d'utiliser Unix au lieu de nous atteler &agrave; le remplacer, rien de tel que le syst&egrave;me GNU/Linux n'existerait.

source: Of course, the Linux developers had practical reasons for what they did. I won't argue with those reasons; they surely know what's convenient for them. But they did not count, or did not value, how this would affect their freedom&mdash;or the rest of the community's efforts.
fr: Bien s&ucirc;r, les d&eacute;veloppeurs de Linux avaient des raisons pratiques pour avoir fait ce choix. Je ne d&eacute;battrai pas de ces raisons, ils savent s&ucirc;rement ce qui est pratique pour eux. Mais ils n'ont pas pris en compte, ou pas accord&eacute; d'importance, &agrave; la fa&ccedil;on dont cela affecterait leur libert&eacute;&hellip; ou les efforts du reste de la communaut&eacute;.

source: A free kernel, even a whole free operating system, is not sufficient to use your computer in freedom; we need free software for everything else, too. Free applications, free drivers, free <abbr title="Basic Input/Output System">BIOS</abbr>: some of those projects face large obstacles&mdash;the need to reverse engineer formats or protocols or pressure companies to document them, or to work around or face down patent threats, or to compete with a network effect. Success will require firmness and determination. A better kernel is desirable, to be sure, but not at the expense of weakening the impetus to liberate the rest of the software world.
fr: Un noyau libre, m&ecirc;me un syst&egrave;me d'exploitation enti&egrave;rement libre, n'est pas suffisant pour utiliser votre ordinateur en toute libert&eacute;; nous avons besoin de logiciels libres pour tout le reste aussi. Des applications libres, des pilotes libres, des <abbr title="Basic Input/Output System">BIOS</abbr> libres&nbsp;: certains de ces projets affrontent de gros obstacles &mdash; le besoin de faire de l'ing&eacute;nierie inverse pour les formats ou les protocoles&nbsp;; faire pression sur les soci&eacute;t&eacute;s pour qu'elles les documentent&nbsp;; contourner ou &eacute;liminer les menaces des brevets&nbsp;; ou encore rentrer en concurrence avec un effet r&eacute;seau. Le succ&egrave;s demandera de la fermet&eacute; et de la d&eacute;termination. Un meilleur noyau est souhaitable, sans aucun doute, mais pas aux d&eacute;pens de l'affaiblissement de l'&eacute;lan pour lib&eacute;rer le reste du monde du logiciel.

source: When the use of his program became controversial, McVoy responded with distraction. For instance, he promised to release it as free software if the company went out of business. Alas, that does no good as long as the company remains in business. Linux developers responded by saying, &ldquo;We'll switch to a free program when you develop a better one.&rdquo; This was an indirect way of saying, &ldquo;We made the mess, but we won't clean it up.&rdquo;
fr: Quand l'utilisation de son programme est devenu controvers&eacute;e, McVoy répondit avec d&eacute;tachement. Par exemple, il promit de rendre son logiciel libre si la soci&eacute;t&eacute; devait fermer. H&eacute;las, cela ne changera rien tant que la soci&eacute;t&eacute; existe. Les d&eacute;veloppeurs de Linux r&eacute;pondirent par&nbsp;: &laquo;&nbsp;Nous basculerons vers un programme libre quand vous en d&eacute;velopperez un meilleur&nbsp;&raquo;. C'&eacute;tait une fa&ccedil;on indirecte de dire&nbsp;: &laquo;&nbsp;Nous avons mis le bazar, mais nous ne ferons pas le m&eacute;nage&nbsp;&raquo;.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2005 Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted worldwide without royalty in any medium provided this notice is preserved.
fr: Copyright &copy; 2005 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
