Repository: gitGNU/gnu_www-fr
Catalog: philosophy/microsoft-new-monopoly.*.po
Languages: fr

source: Microsoft's New Monopoly - GNU Project - Free Software Foundation (FSF)
fr: Le Nouveau Monopole de Microsoft - GNU Project - Free Software Foundation (FSF)

source: Microsoft's New Monopoly (July 2005)
fr: Le Nouveau Monopole de Microsoft

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: <i>Note: Microsoft adopted a different policy in 2006, so the details discussed on this page are now only of historical significance. That doesn't mean the patent problem for OOXML is gone. <a href="http://www.grokdoc.net/index.php/EOOXML_objections#Patent_rights_to_implement_the_Ecma_376_specification_have_not_been_granted"> Microsoft's cunningly-worded new policy does give anyone clear permission to implement OOXML.</a> </i>
fr: <i>Note&nbsp;: Microsoft a adopté une politique différente en 2006, donc les détails discutés sur cette page n'ont maintenant qu'une signification historique. Cela ne signifie pas que le problème du brevet sur OOXML a disparu. <a href="http://www.grokdoc.net/index.php/EOOXML_objections#Patent_rights_to_implement_the_Ecma_376_specification_have_not_been_granted"> La nouvelle politique astucieusement formulée de Microsoft donne à tout le monde la permission claire de mettre en œuvre OOXML.</a> </i>

source: European legislators who endorse software patents frequently claim that those wouldn't affect free software (or &ldquo;open source&rdquo;). Microsoft's lawyers are determined to prove they are mistaken.
fr: Les l&eacute;gislateurs europ&eacute;ens qui soutiennent les brevets logiciels affirment souvent que ceux-ci ne nuiraient pas aux logiciels libres (ou &laquo;&nbsp;open source&nbsp;&raquo;). Les avocats de Microsoft ont bien l'intention de prouver qu'ils se trompent.

source: Leaked internal documents in 1998 said that Microsoft considered the free software GNU/Linux operating system (referred to therein as &ldquo;Linux&rdquo;) as the principal competitor to Windows, and spoke of using patents and secret file formats to hold us back.
fr: En 1998, des documents internes ayant fait l'objet de fuites indiquaient que Microsoft consid&eacute;rait le syst&egrave;me d'exploitation libre GNU/Linux (d&eacute;sign&eacute; dans ces documents par &laquo;&nbsp;Linux&nbsp;&raquo;) comme le principal concurrent de Windows, et envisageait d'utiliser des brevets et des formats de fichiers secrets pour freiner notre progression.

source: Because Microsoft has so much market power, it can often impose new standards at will. It need only patent some minor idea, design a file format, programming language, or communication protocol based on it, and then pressure users to adopt it. Then we in the free software community will be forbidden to provide software that does what these users want; they will be locked in to Microsoft, and we will be locked out from serving them.
fr: Microsoft a une telle position sur le march&eacute;, qu'il peut souvent imposer de nouvelles normes &agrave; sa guise. Il lui suffit de faire breveter une id&eacute;e mineure, de concevoir un format de fichier, un langage de programmation, ou un protocole de communication bas&eacute; dessus, puis de faire pression sur les utilisateurs pour qu'ils l'adoptent. Alors nous dans la communaut&eacute; du libre n'avons plus le droit de fournir un logiciel qui fasse ce que veulent ces utilisateurs&nbsp;; ils ont les mains li&eacute;es par Microsoft et nous avons les mains li&eacute;es pour leur proposer nos services.

source: Previously Microsoft tried to get its patented scheme for spam-blocking adopted as an Internet standard, so as to exclude free software from handling email. The standards committee in charge rejected the proposal, but Microsoft said it would try to convince large <abbr title="Internet service provider">ISP</abbr>s to use the scheme anyway.
fr: Auparavant Microsoft avait essay&eacute; de faire adopter son syst&egrave;me anti-spam brevet&eacute; comme une norme Internet, afin d'emp&ecirc;cher les logiciels libres de g&eacute;rer le courrier &eacute;lectronique. La commission concern&eacute;e a rejet&eacute; cette proposition, mais Microsoft a d&eacute;clar&eacute; qu'il allait essayer de convaincre les grands fournisseurs d'acc&egrave;s d'utiliser ce syst&egrave;me malgr&eacute; tout.

source: Now Microsoft is planning to try something similar for Word files.
fr: Maintenant Microsoft essaie de faire la m&ecirc;me chose avec les fichiers Word.

source: Several years ago, Microsoft abandoned its documented format for saving documents, and switched to a new format which was secret. However, the developers of free software word processors such as AbiWord and OpenOffice.org experimented assiduously for years to figure out the format, and now those programs can read most Word files. But Microsoft isn't licked yet.
fr: Il y a quelques ann&eacute;es, Microsoft a abandonn&eacute; son format document&eacute; de sauvegarde des documents et a adopt&eacute; un nouveau format secret. Cependant, les d&eacute;veloppeurs de traitement de textes libres tels que Abiword et OpenOffice.org ont exp&eacute;riment&eacute; assid&ucirc;ment pendant des ann&eacute;es pour &eacute;tudier ce format, et maintenant ces programmes peuvent lire la plupart des fichiers Word. Mais Microsoft n'a pas dit son dernier mot.

source: The next version of Microsoft Word will use formats that involve a technique that Microsoft claims to hold a patent on. Microsoft offers a royalty-free patent license for certain limited purposes, but it is so limited that it does not allow free software. You can see the license here: <a href="http://www.microsoft.com/whdc/xps/xpspatentlic.mspx"> http://www.microsoft.com/whdc/xps/xpspatentlic.mspx</a>.
fr: La prochaine version de Microsoft Word utilisera des formats qui mettent en &oelig;uvre une technique sur laquelle Microsoft pr&eacute;tend d&eacute;tenir un brevet. Microsoft offre une licence gratuite pour certaines conditions d'utilisation, mais elle est tellement limit&eacute;e qu'elle n'autorise pas les logiciels libres. On peut voir cette licence sur&nbsp;: <a href="http://www.microsoft.com/mscorp/ip/format/xmlpatentlicense.asp">http://www.microsoft.com/mscorp/ip/format/xmlpatentlicense.asp</a>.

source: Free software is defined as software that respects four fundamental freedoms: (0) freedom to run the software as you wish, (1) freedom to study the source code and modify it to do what you wish, (2) freedom to make and redistribute copies, and (3) freedom to publish modified versions. Only programmers can directly exercise freedoms 1 and 3, but all users can exercise freedoms 0 and 2, and all users benefit from the modifications that programmers write and publish.
fr: Les logiciels libres sont d&eacute;finis comme des logiciels qui respectent quatre libert&eacute;s fondamentales&nbsp;: (0) la libert&eacute; d'utiliser le logiciel comme bon vous semble, (1) la libert&eacute; d'&eacute;tudier le code source et de le modifier pour faire ce que vous voulez, (2) la libert&eacute; de faire et de redistribuer des copies, (3) la libert&eacute; de publier les versions modifi&eacute;es. Seuls les programmeurs peuvent exercer directement les libert&eacute;s 1 et 3, mais tous les utilisateurs peuvent exercer les libert&eacute;s 0 et 2, et tous les utilisateurs b&eacute;n&eacute;ficient des modifications que les programmeurs &eacute;crivent et publient.

source: Distributing an application under Microsoft's patent license applies license terms that prohibit most possible modifications of the software. Lacking freedom 3, the freedom to publish modified versions, it would not be free software. (I think it could not be &ldquo;open source&rdquo; software either, since that definition is similar; but it is not identical, and I cannot speak for the advocates of open source.)
fr: Le fait de distribuer une application sous licence de Microsoft interdit la plupart des modifications possibles du logiciel. La libert&eacute; 3 qui permet la publication des versions modifi&eacute;es n'&eacute;tant pas respect&eacute;e, ce ne serait pas un logiciel libre. (Je pense que ce ne serait pas &laquo;&nbsp;open source&nbsp;&raquo; non plus, puisque cette d&eacute;finition est similaire; mais elle n'est pas identique et je ne peux pas parler pour les d&eacute;fenseurs de l'open source).

source: The Microsoft license also requires inclusion of a specific statement. That requirement would not in itself prevent the program from being free. It is normal for free software to carry license notices that cannot be changed, and this statement could be included in one of them. The statement is biased and confusing, since it uses the term &ldquo;intellectual property&rdquo;, but one is not required to endorse the statement as true or even meaningful&mdash;only to include it. The software developer could cancel its misleading effect with a disclaimer like this: &ldquo;The following misleading statement has been imposed on us by Microsoft; please be advised that it is propaganda. See <a href="/philosophy/not-ipr.html"> http://www.gnu.org/philosophy/not-ipr.html</a> for more explanation.&rdquo;
fr: La licence Microsoft impose &eacute;galement d'inclure une mention bien pr&eacute;cise. Cette exigence en elle-m&ecirc;me n'emp&ecirc;cherait pas le programme d'&ecirc;tre libre. Il est normal que les logiciels libres affichent des termes de licence qui ne peuvent &ecirc;tre modifi&eacute;s, et cette mention pourrait &ecirc;tre incluse dans l'un d'entre eux. Cette mention est orient&eacute;e et ambigu&euml; puisqu'elle utilise les termes &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;, mais on n'est pas oblig&eacute; d'approuver cette mention ni m&ecirc;me d'en tenir compte, on doit seulement l'inclure. Le d&eacute;veloppeur du logiciel pourrait annuler son effet trompeur avec un avertissement du genre&nbsp;: &laquo;&nbsp;La mention suivante est fallacieuse et nous est impos&eacute;e par Microsoft; attention il s'agit de propagande. Voir <a href="/philosophy/not-ipr.fr.html">http://www.gnu.org/philosophy/not-ipr.fr.html</a> pour en savoir plus&nbsp;&raquo;.

source: However, the requirement to include a fixed piece of text is actually quite cunning, because anyone who does so has explicitly accepted and applied the restrictions of the Microsoft patent license. The resulting program is clearly not free software.
fr: Cependant, l'obligation d'inclure un texte pr&eacute;cis est vraiment astucieuse, parce que toute personne qui le fait accepte explicitement les restrictions impos&eacute;es par la licence Microsoft. Le programme qui en r&eacute;sulte n'est de toute &eacute;vidence pas un logiciel libre.

source: Some free software licenses, such as the most popular GNU General Public License, forbid publication of a modified version if it isn't free software in the same way. (We call that the &ldquo;liberty or death&rdquo; clause, since it ensures the program will remain free or die.) To apply Microsoft's license to a program under the GNU GPL would violate the program's license; it would be illegal. Many other free software licenses permit non-free modified versions. It wouldn't be illegal to modify such a program and publish the modified version under Microsoft's patent license. But that modified version, with its modified license, wouldn't be free software.
fr: Certaines licences de logiciels libres, comme la tr&egrave;s populaire GNU GPL (General Public Licence), interdisent la publication d'une version modifi&eacute;e si celle-ci ne constitue pas &agrave; son tour un logiciel libre. (Nous appelons cela la clause de &laquo;&nbsp;libert&eacute; ou la mort&nbsp;&raquo;, puisqu'elle garantit que le programme restera libre ou dispara&icirc;tra). L'application de la licence Microsoft &agrave; un programme sous licence GNU GPL violerait la licence de ce programme&nbsp;; ce serait ill&eacute;gal. De nombreuses autres licences de logiciels libres autorisent les versions modifi&eacute;es non-libres. Il ne serait pas ill&eacute;gal de modifier un tel programme et de publier la version modifi&eacute;e sous licence Microsoft. Mais cette version modifi&eacute;e, avec sa licence modifi&eacute;e, ne serait pas un logiciel libre.

source: Microsoft's patent covering the new Word format is a US patent. It doesn't restrict anyone in Europe; Europeans are free to make and use software that can read this format. Europeans that develop or use software currently enjoy an advantage over Americans: the Americans can be sued for patent infringement for their software activities in the US, but the Europeans cannot be sued for their activities in Europe. Europeans can already get US software patents and sue Americans, but Americans cannot get European software patents if Europe doesn't allow them.
fr: Le brevet Microsoft qui couvre le nouveau format Word est un brevet am&eacute;ricain. Il ne contraint personne en Europe; les Europ&eacute;ens sont libres de cr&eacute;er et d'utiliser des logiciels qui peuvent lire ce format. Les Europ&eacute;ens qui d&eacute;veloppent ou utilisent des logiciels b&eacute;n&eacute;ficient aujourd'hui d'un avantage sur les Am&eacute;ricains&nbsp;: les Am&eacute;ricains peuvent &ecirc;tre poursuivis pour viol de brevet en raison de leurs activit&eacute;s logicielles aux USA, mais les Europ&eacute;ens ne peuvent pas &ecirc;tre poursuivis pour leurs activit&eacute;s en Europe. Les Europ&eacute;ens peuvent d&eacute;j&agrave; obtenir des brevets am&eacute;ricains sur les logiciels et poursuivre des Am&eacute;ricains, mais les Am&eacute;ricains ne peuvent pas obtenir de brevets europ&eacute;ens sur les logiciels si l'Europe ne les autorise pas.

source: All that will change if the European Parliament authorizes software patents. Microsoft will be one of thousands of foreign software patent holders that will bring their patents over to Europe to sue the software developers and computer users there. Of the 50,000-odd putatively invalid software patents issued by the European Patent Office, around 80% do not belong to Europeans. The European Parliament should vote to keep these patents invalid, and keep Europeans safe.
fr: Tout cela changera si le Parlement Europ&eacute;en autorise les brevets logiciels. Microsoft sera l'un des milliers de titulaires de brevets logiciels qui feront valoir leurs brevets en Europe pour y poursuivre les d&eacute;veloppeurs de logiciels et les utilisateurs d'ordinateurs. Sur environ 50.000 brevets logiciels r&eacute;put&eacute;s ill&eacute;gaux d&eacute;livr&eacute;s par l'Office Europ&eacute;en des Brevets, environ 80% n'appartiennent pas &agrave; des Europ&eacute;ens. Il faut que le vote du Parlement Europ&eacute;en confirme l'ill&eacute;galit&eacute; de ces brevets, et garantisse la protection des Europ&eacute;ens.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2005 Richard Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2005 Richard Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Bruno Menan.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
