Repository: gitGNU/gnu_www-fr
Catalog: philosophy/microsoft-verdict.*.po
Languages: fr

source: On the Microsoft Verdict - GNU Project - Free Software Foundation (FSF)
fr: Du verdict Microsoft - GNU Project - Free Software Foundation (FSF)

source: On the Microsoft Verdict
fr: Du verdict Microsoft

source: Many <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> users think of the system as competition for Microsoft. But the Free Software Movement aims to solve a problem that is much bigger than Microsoft: proprietary, non-free software, designed to keep users helpless and prohibit cooperation. Microsoft is the largest developer of such software, but many other companies treat the users' freedom just as badly; if they have not shackled as many users as Microsoft, it is not for lack of trying.
fr: Beaucoup d'utilisateurs consid&egrave;rent le syst&egrave;me <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a> comme un concurrent &agrave; Microsoft. Mais le Mouvement du logiciel libre vise &agrave; r&eacute;soudre un probl&egrave;me qui est bien plus grand que Microsoft&nbsp;: les logiciels propri&eacute;taires, non libres, con&ccedil;us pour laisser les utilisateurs impuissants et interdire la coop&eacute;ration. Microsoft en est le plus grand d&eacute;veloppeur, mais beaucoup d'autres soci&eacute;t&eacute;s traitent aussi mal la libert&eacute; des utilisateurs&nbsp;; si elles n'ont pas entrav&eacute; autant d'utilisateurs que Microsoft, ce n'est pas faute d'avoir essay&eacute;.

source: Since Microsoft is just a part of the problem, its defeat in the anti-trust lawsuit is not necessarily a victory for free software. Whether the outcome of this suit helps free software and promotes users' freedom depends of the specific remedies imposed on Microsoft by the judge.
fr: Puisque Microsoft n'est qu'une partie du probl&egrave;me, sa d&eacute;faite dans le proc&egrave;s anti-cartel n'est pas n&eacute;cessairement une victoire pour le logiciel libre. Que l'issue de ce proc&egrave;s aide le logiciel libre et serve la libert&eacute; des utilisateurs ne d&eacute;pendra que des rem&egrave;des sp&eacute;cifiques impos&eacute;s &agrave; Microsoft par le juge.

source: If the remedies are designed to enable other companies compete in offering proprietary, non-free software, that will do the Free World no particular good. Alternative possible masters is not freedom. And competition could lead them to do a &ldquo;better&rdquo; job, better in a narrow technical sense; then it could be harder for us to &ldquo;compete&rdquo; with them technically. We will continue to offer the user one thing those companies do not&mdash;freedom&mdash;and users who value freedom will continue to choose free software for that reason. But users who do not value freedom, and choose a system based on mere convenience, might be enticed away to &ldquo;improved&rdquo; proprietary systems.
fr: Si ces rem&egrave;des sont con&ccedil;us pour permettre &agrave; d'autres soci&eacute;t&eacute;s d'entrer en concurrence en offrant des logiciels propri&eacute;taires, non libres, le Monde Libre n'y gagnera pas particuli&egrave;rement. Choisir ses ma&icirc;tres n'est pas la libert&eacute;. Et la concurrence peut les conduire &agrave; faire un &laquo;&nbsp;meilleur&nbsp;&raquo; travail, meilleur au sens technique du terme&nbsp;; alors il pourrait &ecirc;tre plus difficile pour nous d'&ecirc;tre &laquo;&nbsp;concurrentiels&nbsp;&raquo; techniquement. Nous continuerons &agrave; offrir &agrave; l'utilisateur une chose que ces soci&eacute;t&eacute;s n'offrent pas, la libert&eacute;, et les utilisateurs qui attachent de l'importance &agrave; la libert&eacute; continueront &agrave; choisir le logiciel libre pour cette raison. Mais les utilisateurs quin'attachent pas d'importance &agrave; la libert&eacute; et choisissent un syst&egrave;me fond&eacute; sur la seule commodit&eacute;, pourraient &ecirc;tre s&eacute;duits par des syst&egrave;mes propri&eacute;taires &laquo;&nbsp;am&eacute;lior&eacute;s&nbsp;&raquo;.

source: Splitting Microsoft into separate companies could also endanger free software, because these smaller companies, no longer held in check by the public readiness to condemn Microsoft, might see fit to attack free software more harshly than the present unified Microsoft does.
fr: Diviser Microsoft en deux soci&eacute;t&eacute;s s&eacute;par&eacute;es pourrait aussi mettre en danger le logiciel libre, car ces soci&eacute;t&eacute;s plus petites, n'&eacute;tant plus tenues en &eacute;chec par la promptitude naturelle du public &agrave; condamner Microsoft, pourraient &ecirc;tre capables d'attaquer le logiciel libre plusrudement que ne le fait le Microsoft unifi&eacute; actuel.

source: I've <a href="/philosophy/microsoft-antitrust.html">proposed remedies</a> for this case that would help free software compete with Microsoft: for example, requiring Microsoft to publish documentation for all interfaces, and to use patents only for defense, not for aggression. These remedies would block the use of the weapons that Microsoft plans to use against us (according to the &ldquo;Halloween documents&rdquo; leaked from within Microsoft which spelled out how they plan to impede development of the GNU/Linux system).
fr: J'ai <a href="/philosophy/microsoft-antitrust.fr.html">propos&eacute; des rem&egrave;des</a> pour cette affaire qui aideraient le logiciel libre &agrave; &ecirc;tre concurrentiel envers Microsoft&nbsp;: par exemple, demander &agrave; Microsoft de publier la documentation pour toutes ses interfaces et d'utiliser les brevets uniquement pour se d&eacute;fendre et non pour agresser. Ces rem&egrave;des bloqueraient l'usage des armes que Microsoft envisage d'utiliser contre nous (d'apr&egrave;s les &laquo;&nbsp;Documents de Halloween&nbsp;&raquo; qui ont filtr&eacute;s de chez Microsoft et qui d&eacute;crivaient en d&eacute;tail comment Microsoft envisage d'entraver le d&eacute;veloppement du syst&egrave;me GNU/Linux).

source: When we see what remedies the judge chooses, we will get an idea of whether the case has been helpful or harmful to the Free Software Movement.
fr: Quand nous verrons les rem&egrave;des que le juge choisira, nous aurons une id&eacute;e sur l'utilit&eacute; ou la nocivit&eacute; de cette affaire pour le Mouvement du logiciel libre.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
