Repository: gitGNU/gnu_www-fr
Catalog: philosophy/microsoft-antitrust.*.po
Languages: fr

source: The Microsoft Antitrust Trial and Free Software - GNU Project - Free Software Foundation (FSF)
fr: Le proc&egrave;s antitrust Microsoft et le logiciel libre - GNU Project - Free Software Foundation (FSF)

source: The Microsoft Antitrust Trial and Free Software
fr: Le proc&egrave;s antitrust Microsoft et le logiciel libre

source: With the Microsoft antitrust trial moving toward a conclusion, the question of what to demand of Microsoft if it loses is coming to the fore. Ralph Nader is even [when this was written, in March 1999] organizing a conference about the question (see <a href="http://www.appraising-microsoft.org/">http://www.appraising-microsoft.org/</a>).
fr: Avec le d&eacute;nouement proche du proc&egrave;s antitrust contre Microsoft, se pose la question de ce qu'on doit demander &agrave; Microsoft, s'il perd. Ralph Nader est m&ecirc;me sur le point d'organiser une conf&eacute;rence &agrave; ce sujet [&agrave; la date o&ugrave; cet article a &eacute;t&eacute; &eacute;crit, en mars 1999] (voir <a href="http://www.appraising-microsoft.org/">http://www.appraising-microsoft.org/</a>).

source: The obvious answers&mdash;to restrict contracts between Microsoft and computer manufacturers, or to break up the company&mdash;will not make a crucial difference. The former might encourage the availability of computers with the GNU/Linux system preinstalled, but that is happening anyway. The latter would mainly help other proprietary application developers compete, which would only offer users alternative ways to let go of their freedom.
fr: Les r&eacute;ponses &eacute;videntes (restreindre les contrats entre Microsoft et la constructeurs d'ordinateurs ou d&eacute;membrer la soci&eacute;t&eacute;) ne feront pas une diff&eacute;rence cruciale. La premi&egrave;re r&eacute;ponse pourrait encourager la disponibilit&eacute; de machines avec un syst&egrave;me GNU/Linux pr&eacute;-install&eacute;, mais c'est ce qui se produit de toutes fa&ccedil;ons. L'autre encouragerait principalement d'autres d&eacute;veloppeurs d'applications propri&eacute;taires &agrave; s'affirmer, ce qui ne ferait que proposer &agrave; l'utilisateur final d'autres alternatives pour renoncer &agrave; leur libert&eacute;.

source: So I propose three remedies that would help enable <a href="/philosophy/free-sw.html">free software</a> operating systems such as GNU/Linux compete technically while respecting users' freedom. These three remedies directly address the three biggest obstacles to development of free operating systems, and to giving them the capability of running programs written for Windows. They also directly address the methods Microsoft has said (in the &ldquo;Halloween documents&rdquo;) it will use to obstruct free software. It would be most effective to use all three of these remedies together.
fr: Je propose donc trois rem&egrave;des qui permettraient aux syst&egrave;mes d'exploitation <a href="/philosophy/free-sw.fr.html">logiciels libres</a> comme GNU/Linux de s'affirmer comme alternative technique, tout en respectant la libert&eacute; des utilisateurs. Ces trois rem&egrave;des sont directement destin&eacute;s &agrave; r&eacute;gler les trois plus gros obstacles au d&eacute;veloppement de syst&egrave;mes d'exploitation libres et &agrave; leur donner la capacit&eacute; de faire tourner des programmes &eacute;crits pour Windows. Ils s'occupent aussi directement des m&eacute;thodes &eacute;nonc&eacute;es par Microsoft (dans les &laquo;&nbsp;Halloween documents&nbsp;&raquo;) pour faire obstacle au logiciel libre. Il serait des plus efficace d'utiliser les trois rem&egrave;des ensemble.

source: Require Microsoft to publish complete documentation of all interfaces between software components, all communications protocols, and all file formats. This would block one of Microsoft's favorite tactics: secret and incompatible interfaces.
fr: Exiger de Microsoft qu'il publie une documentation compl&egrave;te sur toutes les interfaces entre les composants logiciels, sur tous les protocoles de communication et les formats de fichiers. Cela bloquerait une des tactiques favorites de Microsoft&nbsp;: des interfaces secr&egrave;tes et incompatibles.

source: To make this requirement really stick, Microsoft should not be allowed to use a nondisclosure agreement with some other organization to excuse implementing a secret interface. The rule must be: if they cannot publish the interface, they cannot release an implementation of it.
fr: Pour que cette exigence soit r&eacute;ellement incontournable, il ne devrait pas &ecirc;tre permis &agrave; Microsoft d'utiliser un accord de non divulgation avec d'autres organisations pour excuser le d&eacute;veloppement d'une interface secr&egrave;te. La r&egrave;gle serait que, s'ils ne peuvent publier l'interface, ils ne peuvent en mettre une sur le march&eacute;.

source: It would, however, be acceptable to permit Microsoft to begin implementation of an interface before the publication of the interface specifications, provided that they release the specifications simultaneously with the implementation.
fr: Cependant, il serait acceptable de permettre &agrave; Microsoft de commencer l'impl&eacute;mentation d'une interface avant la publication des sp&eacute;cifications de celle-ci, pourvu qu'ils mettent &agrave; disposition les sp&eacute;cifications en m&ecirc;me temps que l'impl&eacute;mentation.

source: Enforcement of this requirement would not be difficult. If other software developers complain that the published documentation fails to describe some aspect of the interface, or how to do a certain job, the court would direct Microsoft to answer questions about it. Any questions about interfaces (as distinguished from implementation techniques) would have to be answered.
fr: S'assurer du respect de ces exigences ne serait pas difficile. Si d'autres d&eacute;veloppeurs se plaignent qu'il manque la description de certains aspects de l'interface, ou qu'ils demandent comment faire un certain travail, le tribunal sommerait Microsoft de r&eacute;pondre &agrave; ces questions. Toute question &agrave; propos d'interfaces (qu'il faut distinguer des impl&eacute;mentations techniques), devrait recevoir une r&eacute;ponse.

source: Similar terms were included in an agreement between IBM and the European Community in 1984, settling another antitrust dispute. See <a href="http://www.cptech.org/at/ibm/ibm1984ec.html"> http://www.cptech.org/at/ibm/ibm1984ec.html</a>.
fr: En 1984, des conditions similaires avaient &eacute;t&eacute; incluses dans un accord pass&eacute; entre IBM et la Communaut&eacute; europ&eacute;enne, r&eacute;glant un autre conflit antitrust. Voir&nbsp;: <a href="http://www.cptech.org/at/ibm/ibm1984ec.html">http://www.cptech.org/at/ibm/ibm1984ec.html</a>.

source: Require Microsoft to use its patents for defense only, in the field of software. (If they happen to own patents that apply to other fields, those other fields could be included in this requirement, or they could be exempt.) This would block the other tactic Microsoft mentioned in the Halloween documents: using patents to block development of free software.
fr: Exiger de Microsoft qu'il n'use de ses brevets qu'en cas de d&eacute;fense seulement, dans le domaine du logiciel. (S'il appara&icirc;t qu'un de leurs brevets s'applique &agrave; d'autres domaines, ces derniers pourraient entrer, ou non, dans cette exigence). Ceci bloquerait une autre tactique de Microsoft mentionn&eacute;e dans les &laquo;&nbsp;Halloween Documents&nbsp;&raquo;&nbsp;: utiliser les brevets pour stopper le d&eacute;veloppement du logiciel libre.

source: We should give Microsoft the option of using either self-defense or mutual defense. Self defense means offering to cross-license all patents at no charge with anyone who wishes to do so. Mutual defense means licensing all patents to a pool which anyone can join&mdash;even people who have no patents of their own. The pool would license all members' patents to all members.
fr: Nous devrions donner &agrave; Microsoft l'option d'user soit de l'auto-d&eacute;fense, soit de la d&eacute;fense mutuelle. L'auto-d&eacute;fense consiste &agrave; proposer des licences crois&eacute;es de tous les brevets gratuitement avec quiconque voudrait le faire. La d&eacute;fense mutuelle consiste &agrave; proposer une licence sur tous les brevets au sein d'un groupement auquel tout le monde peut se joindre (m&ecirc;me ceux qui n'ont pas de brevets en propre). Le groupe offrirait une licence sur tous les brevets des membres &agrave; tous les membres.

source: It is crucial to address the issue of patents, because it does no good to have Microsoft publish an interface, if they have managed to work some patented wrinkle into it (or into the functionality it gives access to), such that the rest of us are not allowed to implement it.
fr: Il est crucial de s'attaquer au probl&egrave;me des brevets, car ce n'est pas bon que Microsoft publie les sp&eacute;cifications d'une interface, s'ils ont pr&eacute;vu d'y int&eacute;grer un &eacute;l&eacute;ment brevet&eacute; (ou dans la fonctionnalit&eacute; &agrave; laquelle elle donne acc&egrave;s), ce qui ferait que nous autres, nous n'aurions pas le droit de le mettre en &oelig;uvre.

source: Require Microsoft not to certify any hardware as working with Microsoft software, unless the hardware's complete specifications have been published, so that any programmer can implement software to support the same hardware.
fr: Exiger de Microsoft de ne plus certifier qu'un mat&eacute;riel fonctionne avec les logiciels Microsoft, &agrave; moins que des sp&eacute;cifications compl&egrave;tes du mat&eacute;riel n'aient &eacute;t&eacute; publi&eacute;es, ce qui permettrait &agrave; n'importe quel programmeur d'impl&eacute;menter un logiciel pour qu'il tourne sur ce m&ecirc;me mat&eacute;riel.

source: Secret hardware specifications are not in general Microsoft's doing, but they are a significant obstacle for the development of the free operating systems that can provide competition for Windows. To remove this obstacle would be a great help. If a settlement is negotiated with Microsoft, including this sort of provision in it is not impossible&mdash;it would be a matter of negotiation.
fr: Le secret sur les sp&eacute;cifications mat&eacute;rielles n'est pas en g&eacute;n&eacute;ral une pratique de Microsoft, mais il repr&eacute;sente un obstacle significatif au d&eacute;veloppement de syst&egrave;mes d'exploitation libres qui peuvent participer &agrave; une comp&eacute;tition avec Windows. &Ocirc;ter cet obstacle serait une aide pr&eacute;cieuse. Si un arrangement est n&eacute;goci&eacute; avec Windows, y inscrire ce genre de mesure n'est pas impossible (ce serait une question de n&eacute;gociation).

source: This April, Microsoft's Ballmer announced a possible plan to release source code for some part of Windows. It is not clear whether that would imply making it free software, or which part of Windows it might be. But if Microsoft does make some important part of Windows free software, it could solve these problems as regards that part. (It could also be a contribution to the free software community, if the software in question could be useful for purposes other than running other proprietary Microsoft software.)
fr: En avril de cette ann&eacute;e, Ballmer, de Microsoft, a annonc&eacute; un projet possible de publication du code source de certaines parties de Windows. Il n'est pas clair si cela implique d'en faire un logiciel libre ou de quelle portion de Windows il s'agirait. Mais si Microsoft rend d'importantes portions de Windows libres, cela pourrait r&eacute;soudre ces probl&egrave;mes concernant ces portions. (Ce qui serait aussi une contribution &agrave; la communaut&eacute; du logiciel libre, si le logiciel en question peut &ecirc;tre utile &agrave; d'autres buts que celui de faire tourner d'autres programmes propri&eacute;taires de Microsoft).

source: However, having the use as free software of a part of Windows is less crucial than being <em>permitted</em> to implement all parts. The remedies proposed above are what we really need. They will clear the way for us to develop a truly superior alternative to Microsoft Windows, in whatever area Microsoft does not make Windows free software.
fr: Par contre, qu'on puisse utiliser comme logiciel libre une partie de Windows est moins crucial que d'&ecirc;tre <em>autoris&eacute;</em> &agrave; impl&eacute;menter toutes ses parties. Les rem&egrave;des propos&eacute;s ci-dessus sont vraiment ceux dont on a besoin. Ils vont lib&eacute;rer la voie au d&eacute;veloppement d'une alternative vraiment sup&eacute;rieure &agrave; Microsoft Windows, quelque soit le champ dans lequel Microsoft ne fait pas de Windows un logiciel libre.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Pierre-Yves Enderlin.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
