Repository: gitGNU/gnu_www-fr
Catalog: philosophy/microsoft.*.po
Languages: fr

source: Is Microsoft the Great Satan? - GNU Project - Free Software Foundation (FSF)
fr: Microsoft est-il le Grand Satan&nbsp;? - GNU Project - Free Software Foundation (FSF)

source: Is Microsoft the Great Satan?
fr: Microsoft est-il le Grand Satan&nbsp;?

source: This article was given a major rewrite in 2009. The <a href="/philosophy/microsoft-old.html">old version</a> is also available.
fr: Cet article a été foncièrement modifié en 2009. L'<a href="/philosophy/microsoft-old.fr.html">ancienne version</a> est également disponible.

source: Many people think of Microsoft as the monster menace of the software industry. There is even a specific campaign to boycott Microsoft. This feeling has intensified since Microsoft expressed active hostility towards free software.
fr: De nombreuses personnes voient en Microsoft la menace monstrueuse de l'industrie du logiciel. Il y a même une campagne pour boycotter Microsoft. Ce sentiment s'est accru depuis que Microsoft a exprimé une forte hostilité à l'encontre du logiciel libre.

source: In the free software movement, our perspective is different. We see that Microsoft is doing something that mistreats software users: making software <a href="/philosophy/categories.html#ProprietarySoftware"> proprietary</a> and thus denying users their rightful freedom. But Microsoft is not alone in this; many other companies do the same thing to the users. If other companies manage to dominate fewer users than Microsoft, that is not for lack of trying.
fr: Dans le mouvement du logiciel libre, notre point de vue est différent. Nous estimons que Microsoft pratique une politique néfaste pour les utilisateurs de logiciels&nbsp;: créer des logiciels <a href="/philosophy/categories.fr.html#ProprietarySoftware">propriétaires</a>, et refuser de ce fait aux utilisateurs leur liberté légitime. Mais Microsoft n'est pas seul à faire ceci&nbsp;; beaucoup d'autres sociétés font la même chose à leurs utilisateurs. Si les autres sociétés n'ont réussi qu'à dominer moins d'utilisateurs que Microsoft, ce n'est pas faute d'avoir essayé.

source: This is not meant to excuse Microsoft. Rather, it is meant as a reminder that Microsoft is the natural development of a software industry based on <a href="/philosophy/shouldbefree.html">keeping users divided and subjugating them</a>. When criticizing Microsoft, we should not focus so narrowly on Microsoft that we let other proprietary software developers off the hook.
fr: Ce n'est pas une excuse pour Microsoft. Mieux, ceci est là pour rappeler que Microsoft est le développement naturel d'une industrie du logiciel basée sur <a href="/philosophy/shouldbefree.fr.html">la division des utilisateurs et le refus de leur liberté</a>. Quand nous critiquons Microsoft, nous ne devons pas absoudre pour autant les autres compagnies qui font du logiciel propriétaire.

source: When we reject Microsoft's proprietary software, that is not a boycott. The word &ldquo;boycott&rdquo; means rejection, as a protest, of products that are otherwise acceptable. Rejecting a product because it hurts you is not a boycott, just ordinary rationality. To maintain your freedom, you need to reject <em>all</em> proprietary software, regardless of who developed it or who distributes it.
fr: Quand nous rejettons les logiciels propriétaires de Microsoft, il ne s'agit pas d'un boycott. Le terme «&nbsp;Boycott&nbsp;» signifie un rejet, une protestation, de produits qui seraient autrement acceptables. Rejeter un produit parce qu'il vous fait du mal n'est pas un boycott, c'est juste de la rationalité. Pour conserver votre liberté, vous devez rejeter <em>tous</em> les logiciels propriétaires, peu importe qui les a développés ou les distribue.

source: In the &ldquo;Halloween documents&rdquo;, leaked in October 1998, Microsoft executives stated an intention to use various methods to obstruct the development of free software: specifically, designing secret protocols and file formats, and patenting algorithms and software features.
fr: Dans les «&nbsp;documents Halloween&nbsp;», diffusés à la fin du mois d'octobre 1998, les cadres de Microsoft énonçaient leur intention d'utiliser diverses méthodes pour limiter le développement du logiciel libre&nbsp;: spécifiquement, en concevant des protocoles et des formats de fichiers secrets, et en faisant breveter les algorithmes et les caractéristiques des logiciels.

source: But Microsoft's patents are not the only patents that threaten us (and software developers and users generally)&mdash;consider the harm that the MP3 patent has done. Thus, defending against specific attacks is necessary but not sufficient. The only full solution is to <a href="http://endsoftpatents.org/">eliminate software patents</a>.
fr: Mais les brevets de Microsoft ne sont pas les seuls qui nous menacent (ainsi que les développeurs et les utilisateurs plus généralement) &mdash;&nbsp;regardez le mal qu'a fait le brevet sur le MP3. Par conséquent, se défendre contre des attaques spécifiques est nécessaire, mais n'est pas suffisant. La seule solution est d'<a href="http://endsoftpatents.org/">éliminer les brevets logiciels</a>.

source: Each Windows &ldquo;upgrade&rdquo; augments Microsoft's power over the users; Microsoft plans it that way. And each one is a step forward in malicious features, which include <a href="http://DefectiveByDesign.org">Digital Restrictions Management</a> and back doors. So the FSF runs campaigns to warn users against &ldquo;upgrading&rdquo; to <a href="http://BadVista.org/">Windows Vista</a> and <a href="http://Windows7Sins.org">Windows 7</a>. We aim to reduce the amount of inertia they will create.
fr: Chaque «&nbsp;mise à jour&nbsp;» de Windows augmente le pouvoir de Microsoft sur les utilisateurs&nbsp;; Microsoft le planifie ainsi. Et chacune d'elle est une étape supplémentaire dans les fonctionnalités malicieuses, ce qui comprend la <a href="http://DefectiveByDesign.org">Gestion des restrictions numériques (DRM)</a> et les portes dérobées. Donc la FSF fait des campagnes pour alerter les utilisateurs sur ces «&nbsp;mises à jour&nbsp;» de <a href="http://BadVista.org/">Windows Vista</a> vers <a href="http://Windows7Sins.org">Windows 7</a>. Nous visons à réduire la capacité d'inertie sociale qu'elles créeront.

source: We don't hate Microsoft, and we don't consider it the Great Satan. But we do recognize it as the company that has separated more users from their freedom than any other, and a powerful avowed enemy of computer users' freedom. We act accordingly.
fr: Nous ne haïssons pas Microsoft, et nous ne le considérons pas comme le Grand Satan. Mais nous voyons en elle une société qui a écarté d'utilisateurs de leurs libertés que toute autre, et un puissant ennemi avoué des libertés des utilisateurs d'ordinateur. Nous agissons en conséquence.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.<br />Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
