Repository: gitGNU/gnu_www-fr
Catalog: philosophy/misinterpreting-copyright.*.po
Languages: fr

source: When we purchase something, we do not generally buy the whole quantity in stock or the most expensive model. Instead we conserve funds for other purchases, by buying only what we need of any particular good, and choosing a model of sufficient rather than highest quality. The principle of diminishing returns suggests that spending all our money on one particular good is likely to be an inefficient allocation of resources; we generally choose to keep some money for another use.
fr: Quand nous achetons quelque chose, nous n'achetons g&eacute;n&eacute;ralement pas toute la quantit&eacute; en stock ou le mod&egrave;le le plus cher. Au lieu de cela, nous conservons des fonds pour d'autres achats, en achetant seulement ce dont nous avons besoin pour chaque bien particulier, en choisissant un mod&egrave;le de qualit&eacute; suffisante plut&ocirc;t que de la meilleure qualit&eacute;. Le principe des rendements d&eacute;croissants sugg&egrave;re que d&eacute;penser tout notre argent pour un bien particulier est vraisemblablement une r&eacute;partition des ressources inefficace; nous choisissons g&eacute;n&eacute;ralement de garder de l'argent pour une autre utilisation.

source: Diminishing returns applies to copyright just as to any other purchase. The first freedoms we should trade away are those we miss the least, and whose sacrifice gives the largest encouragement to publication. As we trade additional freedoms that cut closer to home, we find that each trade is a bigger sacrifice than the last, while bringing a smaller increment in literary activity. Well before the increment becomes zero, we may well say it is not worth its incremental price; we would then settle on a bargain whose overall result is to increase the amount of publication, but not to the utmost possible extent.
fr: Les rendements d&eacute;croissants s'appliquent au droit d'auteur comme &agrave; n'importe quel autre achat. Les premi&egrave;res libert&eacute;s que nous devrions n&eacute;gocier sont celles qui nous manquerons le moins, tout en donnant le plus grand encouragement &agrave; la publication. &Agrave; mesure que nous n&eacute;gocions des libert&eacute;s additionnelles qui touchent notre vie quotidienne, nous trouvons que chaque n&eacute;gociation est un plus grand sacrifice que le pr&eacute;c&eacute;dent, alors qu'elle apporte un plus petit accroissement de l'activit&eacute; litt&eacute;raire. Bien avant que l'accroissement ne devienne nul, nous pouvons tout &agrave; fait&nbsp; dire que cela ne vaut pas le prix de cet accroissement; nous pourrions alors &eacute;tablir un marchandage dont le r&eacute;sultat global serait d'augmenter le nombre de publications,mais pas en le poussant &agrave; l'extr&ecirc;me.

source: Accepting the goal of maximizing publication rejects all these wiser, more advantageous bargains in advance&mdash;it dictates that the public must cede nearly all of its freedom to use published works, for just a little more publication.
fr: Accepter l'objectif de maximiser la publication rejette par avance toutes ces n&eacute;gociations plus sages et plus avantageuses &mdash; il dicte que le public doit c&eacute;der presque toutes ses libert&eacute;s pour utiliser des &oelig;uvres publi&eacute;es, seulement pour un petit peu plus de publication.

source: The rhetoric of maximization
fr: La rh&eacute;torique de la maximisation

source: In practice, the goal of maximizing publication regardless of the cost to freedom is supported by widespread rhetoric which asserts that public copying is illegitimate, unfair, and intrinsically wrong. For instance, the publishers call people who copy &ldquo;pirates,&rdquo; a smear term designed to equate sharing information with your neighbor with attacking a ship. (This smear term was formerly used by authors to describe publishers who found lawful ways to publish unauthorized editions; its modern use by the publishers is almost the reverse.) This rhetoric directly rejects the constitutional basis for copyright, but presents itself as representing the unquestioned tradition of the American legal system.
fr: En pratique, l'objectif de maximiser la publication sans tenir compte de ce que cela co&ucirc;te pour la libert&eacute; est soutenu par une rh&eacute;torique tr&egrave;s r&eacute;pandue qui affirme que la copie publique est ill&eacute;gitime, injuste et mauvaise intrins&egrave;quement. Par exemple, les &eacute;diteurs appellent les gens qui copient &laquo;&nbsp;pirates&nbsp;&raquo;, un terme diffamatoire con&ccedil;u pour assimiler le partage de l'information avec votre voisin &agrave; l'attaque d'un bateau. (Ce terme diffamatoire &eacute;tait autrefois utilis&eacute; par les auteurs pour d&eacute;crire les &eacute;diteurs qui avaient trouv&eacute; des voies l&eacute;gales pour publier des &eacute;ditions non autoris&eacute;es; son usage moderne par les &eacute;diteurs est presque tout le contraire). Cette rh&eacute;torique rejette directement la base constitutionnelle du droit d'auteur, mais se pr&eacute;sente elle-m&ecirc;me comme repr&eacute;sentante de la tradition incontest&eacute;e du syst&egrave;me l&eacute;gal am&eacute;ricain.

source: The &ldquo;pirate&rdquo; rhetoric is typically accepted because it so pervades the media that few people realize how radical it is. It is effective because if copying by the public is fundamentally illegitimate, we can never object to the publishers' demand that we surrender our freedom to do so. In other words, when the public is challenged to show why publishers should not receive some additional power, the most important reason of all&mdash;&ldquo;We want to copy&rdquo;&mdash;is disqualified in advance.
fr: La rh&eacute;torique du &laquo;&nbsp;pirate&nbsp;&raquo; est typiquement accept&eacute;e car elle inonde les m&eacute;dias de sorte que peu de gens r&eacute;alisent qu'elle est radicale. C'est efficace car, si la copie par le public est fondamentalement ill&eacute;gitime, nous ne pouvons pas objecter &agrave; la demande des &eacute;diteurs que nous abdiquions notre libert&eacute; pour ce faire. En d'autres termes, quand le public est d&eacute;fi&eacute; de montrer pourquoi les &eacute;diteurs ne devraient pas recevoir de pouvoir suppl&eacute;mentaire, la raison la plus importante de toutes &mdash; &laquo;&nbsp;Nous voulons copier&nbsp;&raquo; &mdash; est disqualifi&eacute;e d'avance.

source: This leaves no way to argue against increasing copyright power except using side issues. Hence, opposition to stronger copyright powers today almost exclusively cites side issues, and never dares cite the freedom to distribute copies as a legitimate public value.
fr: Cela ne laisse aucun moyen d'argumenter contre l'augmentation de pouvoir du droit d'auteur except&eacute; l'utilisation d'enjeux secondaires. De ce fait, l'opposition &agrave; des pouvoirs de droits d'auteur plus forts aujourd'hui, ne cite presque exclusivement que des enjeux secondaires, et n'ose jamais citer la libert&eacute; de distribuer des copies comme une valeur publique l&eacute;gitime.

source: As a practical matter, the goal of maximization enables publishers to argue that &ldquo;A certain practice is reducing our sales&mdash;or we think it might&mdash;so we presume it diminishes publication by some unknown amount, and therefore it should be prohibited.&rdquo; We are led to the outrageous conclusion that the public good is measured by publishers' sales: What's good for General Media is good for the USA.
fr: En pratique, le principe de maximisation permet aux &eacute;diteurs pour argumenter que &laquo;&nbsp;Une certaine pratique r&eacute;duit nos ventes &mdash; ou nous pensons que cela pourrait &ecirc;tre le cas &mdash; aussi, nous supposons que cela diminue la publication en proportion inconnue, et par cons&eacute;quent, cette pratique doit &ecirc;tre interdite&nbsp;&raquo;. Nous sommes amen&eacute;s &agrave; la conclusion inadmissible que le bien public se mesure &agrave; l'aune des ventes des &eacute;diteurs&nbsp;: Ce qui est bon pour General Media est bon pour les &Eacute;tats-Unis.

source: The third error: maximizing publishers' power
fr: La troisi&egrave;me erreur&nbsp;: maximiser le pouvoir des &eacute;diteurs

source: Once the publishers have obtained assent to the policy goal of maximizing publication output at any cost, their next step is to infer that this requires giving them the maximum possible powers&mdash;making copyright cover every imaginable use of a work, or applying some other legal tool such as &ldquo;shrink wrap&rdquo; licenses to equivalent effect. This goal, which entails the abolition of &ldquo;fair use&rdquo; and the &ldquo;right of first sale,&rdquo; is being pressed at every available level of government, from states of the US to international bodies.
fr: Une fois que les &eacute;diteurs auront obtenu l'assentiment &agrave; l'objectif politique de maximiser le rendement de la publication &agrave; n'importe quel co&ucirc;t, leur prochaine &eacute;tape sera de conclure que cela requiert de leur donner le maximum de pouvoirs possible &mdash; en faisant couvrir par le droit d'auteur chaque utilisation imaginable d'une &oelig;uvre, ou en appliquant quelque autre instrument juridique tel que les licences &laquo;&nbsp;sous plastique&nbsp;&raquo; &agrave; l'effet &eacute;quivalent. Cet objectif, qui entra&icirc;ne l'abolition de &laquo;&nbsp;l'usage raisonnable&nbsp;&raquo; et le &laquo;&nbsp;le droit de la premi&egrave;re vente&nbsp;&raquo;, est martel&eacute; &agrave; tous les niveaux possibles du gouvernement, des &Eacute;tats-Unis aux instances internationales.

source: This step is erroneous because strict copyright rules obstruct the creation of useful new works. For instance, Shakespeare borrowed the plots of some of his plays from works others had published a few decades before, so if today's copyright law had been in effect, his plays would have been illegal.
fr: Cette d&eacute;marche est erron&eacute;e car des r&egrave;gles strictes sur le droit d'auteur emp&ecirc;chent le cr&eacute;ation de nouvelles &oelig;uvres utiles. Par exemple, Shakespeare empruntait les intrigues de quelques unes&nbsp; de ses pi&egrave;ces d'autres pi&egrave;ces publi&eacute;es quelques dizaines d'ann&eacute;es auparavant, aussi, si la loi actuelle sur le droit d'auteur avait &eacute;t&eacute; en application, ses pi&egrave;ces auraient &eacute;t&eacute; ill&eacute;gales.

source: Even if we wanted the highest possible rate of publication, regardless of cost to the public, maximizing publishers' power is the wrong way to get it. As a means of promoting progress, it is self-defeating.
fr: M&ecirc;me si nous voulions le plus grand taux de publication possible, sans tenir compte de ce que cela co&ucirc;terait au public, maximiser le pouvoir des &eacute;diteurs serait un mauvais moyen d'y parvenir. Comme moyen de promouvoir le progr&egrave;s, ce serait auto-destructeur.

source: The results of the three errors
fr: Les cons&eacute;quences de ces trois erreurs

source: The current trend in copyright legislation is to hand publishers broader powers for longer periods of time. The conceptual basis of copyright, as it emerges distorted from the series of errors, rarely offers a basis for saying no. Legislators give lip service to the idea that copyright serves the public, while in fact giving publishers whatever they ask for.
fr: La tendance actuelle dans la l&eacute;gislation sur le droit d'auteur est de donner aux &eacute;diteurs des pouvoirs plus &eacute;tendus sur des p&eacute;riodes plus longues. Le concept de base du droit d'auteur, tel qu'il ressort d&eacute;form&eacute; de la suite des erreurs commises, offre rarement une base pour dire non. Les l&eacute;gislateurs font semblant de s'interesser &agrave; l'id&eacute;e que le droit d'auteur doive servir le public, alors qu'en fait, il donne aux &eacute;diteurs tout ce qu'ils demandent.

source: For example, here is what Senator Hatch said when introducing S. 483, a 1995 bill to increase the term of copyright by 20 years:
fr: Par exemple, voici ce que dit le s&eacute;nateur Hatch en pr&eacute;sentant S. 483, un projet de loi de 1995 pour augmenter le bail du droit d'auteur de vingt ans&nbsp;:

source: I believe we are now at such a point with respect to the question of whether the current term of copyright adequately protects the interests of authors and the related question of whether the term of protection continues to provide a sufficient incentive for the creation of new works of authorship.
fr: Je crois que nous en sommes arriv&eacute;s maintenant au point sur la question de savoir si la p&eacute;riode actuelle du droit d'auteur prot&egrave;ge de fa&ccedil;on ad&eacute;quate les int&eacute;r&ecirc;ts des auteurs et sur sa question relative de savoir si la dur&eacute;e de protection fournit une motivation suffisante pour la cr&eacute;ation de nouvelles &oelig;uvres d'auteurs.

source: This bill extended the copyright on already published works written since the 1920s. This change was a giveaway to publishers with no possible benefit to the public, since there is no way to retroactively increase now the number of books published back then. Yet it cost the public a freedom that is meaningful today&mdash;the freedom to redistribute books from that era.
fr: Ce projet de loi &eacute;tendait le droit d'auteur sur les &oelig;uvres d&eacute;j&agrave; publi&eacute;es &eacute;crites depuis les ann&eacute;es 1920. Cette modification &eacute;tait un cadeau aux &eacute;diteurs sans b&eacute;n&eacute;fice possible pour le public, puisqu'il y a aucun moyen d'augmenter r&eacute;troactivement le nombre de livres publi&eacute;s jusqu'&agrave; lors. Cependant, cela vaut au public une libert&eacute; qui est significative aujourd'hui &mdash; la libert&eacute; de redistribuer des livres de cette p&eacute;riode.

source: The bill also extended the copyrights of works yet to be written. For works made for hire, copyright would last 95 years instead of the present 75 years. Theoretically this would increase the incentive to write new works; but any publisher that claims to need this extra incentive should be required substantiate the claim with projected balance sheets for 75 years in the future.
fr: Le projet de loi &eacute;tendait aussi les droits d'auteur d'&oelig;uvres &agrave; venir. Pour les &oelig;uvres destin&eacute;es &agrave; la location, le droit d'auteur durerait quatre-vingt-quinze ans au lieu des soixante-quinze ans actuels. Th&eacute;oriquement, cela aurait augment&eacute; l'incitation &agrave; &eacute;crire de nouvelles &oelig;uvres; mais tout &eacute;diteur qui aurait r&eacute;clam&eacute; le besoin de cette surprime, devrait justifier la revendication avec des projections de bilans dans 75.

source: The Supreme Court later heard a case that sought to overturn the law on the grounds that the retroactive extension fails to serve the Constitution's goal of promoting progress. The court responded by abdicating its responsibility to judge the question; on copyright, the Constitution requires only lip service.
fr: La Cour supr&ecirc;me a consenti &agrave; auditionner une affaire qui cherchait &agrave; renverser la loi sur le fondement que l'extension r&eacute;troactive &eacute;chouait &agrave; servir le but de la Constitution sur la promotion du progr&egrave;s.

source: Another law, passed in 1997, made it a felony to make sufficiently many copies of any published work, even if you give them away to friends just to be nice. Previously this was not a crime in the US at all.
fr: Une autre loi, pass&eacute;e en 1997, a rendu criminel de faire plusieurs copies de n'importe quelle &oelig;uvre publi&eacute;e, m&ecirc;me si c'est pour faire plaisir &agrave; vos amis. Auparavant, ce n'&eacute;tait pas du tout un crime aux &Eacute;tats-Unis.

source: An even worse law, the Digital Millennium Copyright Act (DMCA), was designed to bring back copy protection (which computer users detest) by making it a crime to break copy protection, or even publish information about how to break it. This law ought to be called the &ldquo;Domination by Media Corporations Act&rdquo; because it effectively offers publishers the chance to write their own copyright law. It says they can impose any restrictions whatsoever on the use of a work, and these restrictions take the force of law provided the work contains some sort of encryption or license manager to enforce them.
fr: Une loi encore pire, la Digital Millennium Copyright Act (DMCA) (loi sur le droit d'auteur du mill&eacute;naire num&eacute;rique), a &eacute;t&eacute; con&ccedil;ue pour ranimer la protection contre la copie (ce que d&eacute;testent les utilisateurs d'ordinateurs) en rendant criminel de casser la protection contre la copie, ou m&ecirc;me de publier toute information sur le moyen de casser cette protection. Cette loi devrait s'appeler &laquo;&nbsp;Domination by Media Corporations Act&nbsp;&raquo; (la loi sur la domination par les compagnies de m&eacute;dias) parce qu'elle offre effectivement aux &eacute;diteurs la chance d'&eacute;crire leur propre loi sur le droit d'auteur. Elle dit qu'ils peuvent imposer toute restriction quelle que soit sur l'utilisation de l'&oelig;uvre, et ces restrictions prennent force de loi pour peu que l'&oelig;uvre contienne un moyen d'encryptage ou de gestionnaire de licence pour les faire respecter.

source: One of the arguments offered for this bill was that it would implement a recent treaty to increase copyright powers. The treaty was promulgated by the World <a href="not-ipr.html">Intellectual Property</a> Organization, an organization dominated by copyright- and patent-holding interests, with the aid of pressure from the Clinton administration; since the treaty only increases copyright power, whether it serves the public interest in any country is doubtful. In any case, the bill went far beyond what the treaty required.
fr: Un des arguments propos&eacute;s pour ce projet de loi &eacute;tait que cela mettrait en &oelig;uvre un r&eacute;cent trait&eacute; pour augmenter les pouvoirs du droit d'auteur. Le trait&eacute; fut promulgu&eacute; par l'Organisation mondiale de la <a href="not-ipr.fr.html">propri&eacute;t&eacute; intellectuelle</a> (OMPI), un organisme domin&eacute; par les int&eacute;r&ecirc;ts des d&eacute;tenteurs de droits d'auteurs et de brevets, avec l'aide de la pression exerc&eacute;e par l'administration Clinton; puisque le trait&eacute; n'augmente que le pouvoir du droit d'auteur, qu'il serve l'int&eacute;r&ecirc;t du public dans n'importe quel pays semble douteux. En tout cas, le projet de loi allait bien au-del&agrave; de ce que requ&eacute;rait le trait&eacute;.

source: Congressman Barney Frank, in a meeting with me and others who opposed this bill, showed how far the US Constitution's view of copyright has been disregarded. He said that new powers, backed by criminal penalties, were needed urgently because the &ldquo;movie industry is worried,&rdquo; as well as the &ldquo;music industry&rdquo; and other &ldquo;industries.&rdquo; I asked him, &ldquo;But is this in the public interest?&rdquo; His response was telling: &ldquo;Why are you talking about the public interest? These creative people don't have to give up their rights for the public interest!&rdquo; The &ldquo;industry&rdquo; has been identified with the &ldquo;creative people&rdquo; it hires, copyright has been treated as its entitlement, and the Constitution has been turned upside down.
fr: Le membre du Congr&egrave;s Barney Frank, lors d'une rencontre avec moi et d'autres oppos&eacute;s &agrave; ce projet de loi, montra combien la vision du droit d'auteur de la Constitution am&eacute;ricaine avait &eacute;t&eacute; d&eacute;daign&eacute;e. Il dit que ces nouveaux pouvoirs, appuy&eacute;s par des peines criminelles, &eacute;taient n&eacute;cessaires et urgents car &laquo;&nbsp;l'industrie du film &eacute;tait inqui&egrave;te&nbsp;&raquo;, tout autant que &laquo;&nbsp;l'industrie de la musique&nbsp;&raquo; et d'autres &laquo;&nbsp;industries&nbsp;&raquo;.&nbsp; Je lui demandais, &laquo;&nbsp;Mais est-ce dans l'int&eacute;r&ecirc;t du public&nbsp;?&nbsp;&raquo; Sa r&eacute;ponse fut&nbsp;: &laquo;&nbsp;Pourquoi parlez-vous de l'int&eacute;r&ecirc;t du public&nbsp;? Ces gens cr&eacute;atifs n'ont pas &agrave; abandonner leurs droits dans l'int&eacute;r&ecirc;t du public&nbsp;!&nbsp;&raquo;. &laquo;&nbsp;L'industrie&raquo; a &eacute;t&eacute; assimil&eacute;e aux &laquo;gens cr&eacute;atifs&nbsp;&raquo; qu'elle emploie, le droit d'auteur a &eacute;t&eacute; trait&eacute; comme lui revenant de droit, et la Constitution a &eacute;t&eacute; mise sens dessus dessous.

source: The DMCA was enacted in 1998. As enacted, it says that fair use remains nominally legitimate, but allows publishers to prohibit all software or hardware that you could practice it with. Effectively, fair use is prohibited.
fr: La DMCA a &eacute;t&eacute; promulgu&eacute;e en 1998. Elle dit que l'usage raisonnable demeure pour la forme l&eacute;gitime, mais autorise les &eacute;diteurs &agrave; interdire tout logiciel ou mat&eacute;riel avec lesquels vous pourriez le faire. En fait, l'usage raisonnable est interdit.

source: Based on this law, the movie industry has imposed censorship on free software for reading and playing DVDs, and even on the information about how to read them. In April 2001, Professor Edward Felten of Princeton University was intimidated by lawsuit threats from the Recording Industry Association of America (RIAA) into withdrawing a scientific paper stating what he had learned about a proposed encryption system for restricting access to recorded music.
fr: En se fondant sur cette loi, l'industrie du film a impos&eacute; une censure sur le logiciel libre pour la lecture des DVD, et m&ecirc;me sur l'information de la fa&ccedil;on dont on les lit. En avril 2001, le professeur Edward Felten de l'universit&eacute; de Princeton fut intimid&eacute; par des poursuites judiciaires par la Recording Industry Association of America (RIAA) (Association de l'industrie de&nbsp; l'enregistrement d'Am&eacute;rique) pour retirer un document scientifique exposant ce qu'il avait appris au sujet d'une proposition de syst&egrave;me d'encryptage pour restreindre l'acc&egrave;s &agrave; de la musique enregistr&eacute;e.

source: We are also beginning to see e-books that take away many of readers' traditional freedoms&mdash;for instance, the freedom to lend a book to your friend, to sell it to a used book store, to borrow it from a library, to buy it without giving your name to a corporate data bank, even the freedom to read it twice. Encrypted e-books generally restrict all these activities&mdash;you can read them only with special secret software designed to restrict you.
fr: Nous commen&ccedil;ons aussi &agrave; voir des livres &eacute;lectroniques qui retirent aux lecteurs beaucoup de leurs libert&eacute;s traditionnelles &mdash; par exemple, la libert&eacute; de pr&ecirc;ter un livre &agrave; un ami, de le vendre &agrave; un bouquiniste, de l'emprunter &agrave; une biblioth&egrave;que, de l'acheter sans donner son nom &agrave; une banque de donn&eacute;es d'une soci&eacute;t&eacute;, et m&ecirc;me la libert&eacute; de le lire deux fois. Les livres crypt&eacute;s limitent g&eacute;n&eacute;ralement toutes ces activit&eacute;s &mdash; vous ne pouvez les lire qu'avec un logiciel de d&eacute;cryptage sp&eacute;cial con&ccedil;u pour vous enfermer.
