Repository: gitGNU/gnu_www-fr
Catalog: philosophy/misinterpreting-copyright.*.po
Languages: fr

source: I will never buy one of these encrypted, restricted e-books, and I hope you will reject them too. If an e-book doesn't give you the same freedoms as a traditional paper book, don't accept it!
fr: Je n'ach&egrave;terai jamais un de ces livres crypt&eacute;s et verrouill&eacute;s, et j'esp&egrave;re que vous les rejetterez aussi. Si un livre &eacute;lectronique ne vous donne pas les m&ecirc;mes libert&eacute;s qu'un livre papier traditionnel, ne l'acceptez pas&nbsp;!

source: Anyone independently releasing software that can read restricted e-books risks prosecution. A Russian programmer, Dmitry Sklyarov, was arrested in 2001 while visiting the US to speak at a conference, because he had written such a program in Russia, where it was lawful to do so. Now Russia is preparing a law to prohibit it too, and the European Union recently adopted one.
fr: Quiconque r&eacute;alise ind&eacute;pendamment un logiciel qui peut lire des livres &eacute;lectroniques crypt&eacute;s risque des poursuites. Un programmeur russe, Dmitry Sklyarov, a &eacute;t&eacute; arr&ecirc;t&eacute; en 2001 alors qu'il visitait les &Eacute;tats-Unis pour parler &agrave; une conf&eacute;rence, car il avait &eacute;crit un tel programme en Russie, o&ugrave; il &eacute;tait l&eacute;gal de le faire. Maintenant la Russie pr&eacute;pare &eacute;galement une loi pour l'interdire, et l'Union europ&eacute;enne en a adopt&eacute; une r&eacute;cemment.

source: Mass-market e-books have been a commercial failure so far, but not because readers chose to defend their freedom; they were unattractive for other reasons, such as that computer display screens are not easy surfaces to read from. We can't rely on this happy accident to protect us in the long term; the next attempt to promote e-books will use &ldquo;electronic paper&rdquo;&mdash;book-like objects into which an encrypted, restricted e-book can be downloaded. If this paper-like surface proves more appealing than today's display screens, we will have to defend our freedom in order to keep it. Meanwhile, e-books are making inroads in niches: NYU and other dental schools require students to buy their textbooks in the form of restricted e-books.
fr: Le march&eacute; de masse des livres &eacute;lectroniques a &eacute;t&eacute; jusqu'&agrave; pr&eacute;sent un &eacute;chec commercial, pas parce que les lecteurs ont choisi de d&eacute;fendre leurs libert&eacute;s; ils ne sont pas attrayants pour d'autres raisons, comme le fait que les &eacute;crans d'ordinateurs ne sont pas des surfaces agr&eacute;ables pour lire. Nous ne pouvons pas compter sur cet heureux accident pour nous prot&eacute;ger sur le long terme; la prochaine tentative pour promouvoir les livres &eacute;lectroniques utilisera le &laquo;&nbsp;papier &eacute;lectronique&nbsp;&raquo; &mdash; des objets ressemblant &agrave; des livres dans lesquels des livres &eacute;lectroniques crypt&eacute;s et restrictifs peuvent &ecirc;tre t&eacute;l&eacute;charg&eacute;s. Si cette surface &agrave; l'apparence du papier se r&eacute;v&egrave;le plus attrayantes que les &eacute;crans d'affichage, nous auront &agrave; d&eacute;fendre notre libert&eacute; afin de la conserver. Pendant ce temps, les livres &eacute;lectroniques font des incursions dans certains cr&eacute;neaux : l'universit&eacute; de New York et d'autres &eacute;coles dentaires demandent &agrave; leurs &eacute;tudiants d'acheter leur manuels sous la forme de livres &eacute;lectroniques restrictifs.

source: The media companies are not satisfied yet. In 2001, Disney-funded Senator Hollings proposed a bill called the &ldquo;Security Systems Standards and Certification Act&rdquo; (SSSCA)<a href="#footnote1">[1]</a>, which would require all computers (and other digital recording and playback devices) to have government-mandated copy-restriction systems. That is their ultimate goal, but the first item on their agenda is to prohibit any equipment that can tune digital HDTV unless it is designed to be impossible for the public to &ldquo;tamper with&rdquo; (i.e., modify for their own purposes). Since free software is software that users can modify, we face here for the first time a proposed law that explicitly prohibits free software for a certain job. Prohibition of other jobs will surely follow. If the FCC adopts this rule, existing free software such as GNU Radio would be censored.
fr: Les soci&eacute;t&eacute;s de m&eacute;dias ne sont pas satisfaites cependant. En 2001, le s&eacute;nateur Hollings (investi par Disney) a propos&eacute; un projet de loi appel&eacute; &laquo;&nbsp;Security Systems Standards and Certification Act&nbsp;&raquo; (SSSCA)<a href="#footnote1">[1]</a> (loi sur les standards des syst&egrave;mes de s&eacute;curit&eacute; et certification), qui voudrait que tous les ordinateurs (et les autres appareils d'enregistrement num&eacute;rique et de lecture) aient des syst&egrave;mes de restrictions de copie rendus obligatoires par le gouvernement. Ceci est leur but ultime, mais la premi&egrave;re &eacute;tape de leur plan est d'interdire tout &eacute;quipement qui puisse mettre au point la t&eacute;l&eacute;vision haute d&eacute;finition (HDTV) num&eacute;rique &agrave; moins que celui-ci soit con&ccedil;u pour qu'il soit impossible au public de le &laquo;&nbsp;fausser&nbsp;&raquo; (c'est-&agrave;-dire, de le modifier pour son propre usage). Puisque le logiciel libre est du logiciel que les utilisateurs peuvent modifier, nous sommes l&agrave; en face, pour la premi&egrave;re fois, d'un projet de loi qui interdit explicitement le logiciel libre pour certains travaux. L'interdiction d'autres travaux suivra s&ucirc;rement. Si la FCC adopte cette r&eacute;glementation, des logiciels libres existants tels que GNU Radio seraient censur&eacute;s.

source: To block these bills and rules requires political action.<a href="#footnote2">[2]</a>
fr: Bloquer ces projets de lois et r&eacute;glementations requiert une action politique.<a href="#footnote2">[2]</a>

source: Finding the right bargain
fr: Trouver le bon marchandage

source: What is the proper way to decide copyright policy? If copyright is a bargain made on behalf of the public, it should serve the public interest above all. The government's duty when selling the public's freedom is to sell only what it must, and sell it as dearly as possible. At the very least, we should pare back the extent of copyright as much as possible while maintaining a comparable level of publication.
fr: Quelle est la m&eacute;thode appropri&eacute;e pour d&eacute;cider de la politique du droit d'auteur&nbsp;? Si le droit d'auteur est un marchandage fait pour le compte du public, il devrait servir l'int&eacute;r&ecirc;t du public avant tout. Le devoir du gouvernement en vendant la libert&eacute; du public est de vendre seulement ce qui doit l'&ecirc;tre, et de le vendre le plus ch&egrave;rement possible. &Agrave; tout le moins, nous devrions r&eacute;duire autant que possible l'extension de droit d'auteur tout en maintenant un niveau comparable de publication.

source: Since we cannot find this minimum price in freedom through competitive bidding, as we do for construction projects, how can we find it?
fr: Puisque nous ne pouvons pas trouver ce prix minimum &agrave; la libert&eacute; par des appels d'offres, comme nous le faisons pour des projets de construction, comment pouvons-nous le trouver&nbsp;?

source: One possible method is to reduce copyright privileges in stages, and observe the results. By seeing if and when measurable diminutions in publication occur, we will learn how much copyright power is really necessary to achieve the public's purposes. We must judge this by actual observation, not by what publishers say will happen, because they have every incentive to make exaggerated predictions of doom if their powers are reduced in any way.
fr: Une des m&eacute;thodes possibles est de r&eacute;duire les privil&egrave;ges du droit d'auteur par paliers, et d'observer les r&eacute;sultats. En voyant si et dans quelles mesures les diminutions de publication surviennent, nous apprendrons quel pouvoir de droit d'auteur est r&eacute;ellement n&eacute;cessaire pour r&eacute;aliser les objectifs du public. Nous devons juger cela par une observation factuelle, pas par ce&nbsp; que nous pr&eacute;disent les &eacute;diteurs, car ils ont toutes les motivations pour faire des pr&eacute;dictions exag&eacute;r&eacute;es de ruine si leurs pouvoirs sont r&eacute;duits d'une quelconque fa&ccedil;on.

source: Copyright policy includes several independent dimensions, which can be adjusted separately. After we find the necessary minimum for one policy dimension, it may still be possible to reduce other dimensions of copyright while maintaining the desired publication level.
fr: La politique du droit d'auteur inclut plusieurs aspects ind&eacute;pendants, qui peuvent &ecirc;tre ajust&eacute;s s&eacute;par&eacute;ment. Apr&egrave;s avoir trouv&eacute; le minimum n&eacute;cessaire pour un aspect politique, il est encore possible de r&eacute;duire d'autres aspects du droit d'auteur tout en maintenant le niveau de publication d&eacute;sir&eacute;.

source: One important dimension of copyright is its duration, which is now typically on the order of a century. Reducing the monopoly on copying to ten years, starting from the date when a work is published, would be a good first step. Another aspect of copyright, which covers the making of derivative works, could continue for a longer period.
fr: Un aspect important du droit d'auteur est sa dur&eacute;e, laquelle est maintenant typiquement de l'ordre du si&egrave;cle. R&eacute;duire le monopole de la copie &agrave; dix ans, en partant de la date &agrave; laquelle l'&oelig;uvre est publi&eacute;e, serait une bonne premi&egrave;re &eacute;tape. Un autre aspect du droit d'auteur, qui couvre la fabrication des &oelig;uvres d&eacute;riv&eacute;es, pourrait continuer sur une p&eacute;riode plus longue.

source: Why count from the date of publication? Because copyright on unpublished works does not directly limit readers' freedom; whether we are free to copy a work is moot when we do not have copies. So giving authors a longer time to get a work published does no harm. Authors (who generally do own the copyright prior to publication) will rarely choose to delay publication just to push back the end of the copyright term.
fr: Pourquoi partir de la date de publication ? Parce que le droit d'auteur sur les &oelig;uvres non publi&eacute;es ne limitent pas directement la libert&eacute; des lecteurs; que nous soyons libres de copier une&nbsp; &oelig;uvre est discutable quand nous n'avons pas de copies. Aussi, donner une plus longue p&eacute;riode pour faire publier une &oelig;uvre n'est pas pr&eacute;judiciable. Les auteurs (qui poss&egrave;dent g&eacute;n&eacute;ralement le droit d'auteur avant publication) choisissent rarement de retarder la publication seulement pour repousser le terme de leur droit d'auteur.

source: Why ten years? Because that is a safe proposal; we can be confident on practical grounds that this reduction would have little impact on the overall viability of publishing today. In most media and genres, successful works are very profitable in just a few years, and even successful works are usually out of print well before ten. Even for reference works, whose useful life may be many decades, ten-year copyright should suffice: updated editions are issued regularly, and many readers will buy the copyrighted current edition rather than copy a ten-year-old public domain version.
fr: Pourquoi dix ans&nbsp;? Parce que c'est une proposition s&ucirc;re; nous pouvons &ecirc;tre assur&eacute;s pour des raisons pratiques que cette r&eacute;duction aurait un impact minime sur la viabilit&eacute; globale de la publication aujourd'hui. Dans la plupart des m&eacute;dias et des genres, les &oelig;uvres qui ont du succ&egrave;s sont tr&egrave;s rentables en seulement quelques ann&eacute;es, et m&ecirc;me les &oelig;uvres &agrave; succ&egrave;s ne sont habituellement plus publi&eacute;es bien avant dix ans. M&ecirc;me pour les &oelig;uvres de r&eacute;f&eacute;rence, dont l'utilit&eacute; peut aller jusqu'&agrave; plusieurs d&eacute;cennies, dix ans de droit d'auteur suffiraient&nbsp;: des &eacute;ditions mises &agrave; jour sont publi&eacute;es r&eacute;guli&egrave;rement, et beaucoup de lecteurs ach&egrave;teront la publication sous droit d'auteur plut&ocirc;t qu'une copie vieille de dix ans du domaine public.

source: Ten years may still be longer than necessary; once things settle down, we could try a further reduction to tune the system. At a panel on copyright at a literary convention, where I proposed the ten-year term, a noted fantasy author sitting beside me objected vehemently, saying that anything beyond five years was intolerable.
fr: Dix ans peuvent &ecirc;tre encore plus longs que n&eacute;cessaire; une fois les choses &eacute;tablies, nous pourrions essayer une autre r&eacute;duction pour ajuster le syst&egrave;me. &Agrave; une table ronde sur le droit d'auteur lors d'une convention litt&eacute;raire, o&ugrave; je proposais le bail de dix ans, un c&eacute;l&egrave;bre auteur de fiction assis &agrave; c&ocirc;t&eacute; de moi objecta avec v&eacute;h&eacute;mence, disant que toute proposition au-del&agrave; de cinq ans &eacute;tait intol&eacute;rable.

source: But we don't have to apply the same time span to all kinds of works. Maintaining the utmost uniformity of copyright policy is not crucial to the public interest, and copyright law already has many exceptions for specific uses and media. It would be foolish to pay for every highway project at the rates necessary for the most difficult projects in the most expensive regions of the country; it is equally foolish to &ldquo;pay&rdquo; for all kinds of art with the greatest price in freedom that we find necessary for any one kind.
fr: Mais nous n'avons pas &agrave; appliquer la m&ecirc;me dur&eacute;e &agrave; toutes les sortes d'&oelig;uvres. Maintenir la plus grande uniformit&eacute; dans la politique du droit d'auteur n'est pas crucial pour l'int&eacute;r&ecirc;t public, et la loi sur le droit d'auteur a d&eacute;j&agrave; beaucoup d'exceptions pour des usages et des m&eacute;dias sp&eacute;cifiques. Il serait absurde de payer pour chaque projet d'autoroute le taux n&eacute;cessaire pour les projets les plus difficiles dans les r&eacute;gions les plus ch&egrave;res du pays; il serait &eacute;galement absurde de &laquo;&nbsp;payer&nbsp;&raquo; le plus grand prix en terme de libert&eacute; pour toutes les sortes d'art, que nous trouvons n&eacute;cessaire pour un art en particulier.

source: So perhaps novels, dictionaries, computer programs, songs, symphonies, and movies should have different durations of copyright, so that we can reduce the duration for each kind of work to what is necessary for many such works to be published. Perhaps movies over one hour long could have a twenty-year copyright, because of the expense of producing them. In my own field, computer programming, three years should suffice, because product cycles are even shorter than that.
fr: Aussi, peut-&ecirc;tre que les romans, les dictionnaires, les logiciels, les chansons, les symphonies et les films devraient avoir des dur&eacute;es de droit d'auteur diff&eacute;rentes, de sorte que nous puissions r&eacute;duire la dur&eacute;e pour chaque type d'&oelig;uvre &agrave; ce qui est n&eacute;cessaire pour tant d'&oelig;uvres &agrave; publier. Peut-&ecirc;tre que les films de plus d'une heure pourraient avoir un droit d'auteur de vingt ans, &agrave; cause des d&eacute;penses pour les produire. Dans mon propre domaine, la programmation de logiciels, trois ans devraient suffire, car les cycles de production, sont m&ecirc;me plus courts que cela.

source: Another dimension of copyright policy is the extent of fair use: some ways of reproducing all or part of a published work that are legally permitted even though it is copyrighted. The natural first step in reducing this dimension of copyright power is to permit occasional private small-quantity noncommercial copying and distribution among individuals. This would eliminate the intrusion of the copyright police into people's private lives, but would probably have little effect on the sales of published works. (It may be necessary to take other legal steps to ensure that shrink-wrap licenses cannot be used to substitute for copyright in restricting such copying.) The experience of Napster shows that we should also permit noncommercial verbatim redistribution to the general public&mdash;when so many of the public want to copy and share, and find it so useful, only draconian measures will stop them, and the public deserves to get what it wants.
fr: Un autre aspect du droit d'auteur est l'extension de l'usage raisonnable&nbsp;: la reproduction de tout ou partie d'une &oelig;uvre publi&eacute;e qui est l&eacute;galement permise m&ecirc;me si elle est couverte par le droit d'auteur. La premi&egrave;re &eacute;tape naturelle en r&eacute;duisant cet aspect du pouvoir du droit d'auteur, est de permettre la copie et la distribution priv&eacute;e et occasionnelle, &agrave; but non commercial, en petite quantit&eacute; pour les particuliers. Ceci &eacute;liminerait l'intrusion de la police de droit d'auteur dans la vie priv&eacute;e des gens, mais aurait probablement peu d'effet sur les ventes d'&oelig;uvres publi&eacute;es. (Il peut &ecirc;tre n&eacute;cessaire de prendre d'autres dispositions juridiques pour s'assurer que les licences sous plastique ne puissent pas &ecirc;tre utilis&eacute;es pour se substituer au droit d'auteur en restreignant de telles copies). L'exp&eacute;rience de Napster montre que nous devrions aussi permettre la reproduction et la distribution non commerciale au public &nbsp; quand tant de gens veulent copier et partager, et trouvent cela utile, seules des mesures draconiennes les arr&ecirc;teront, et le public m&eacute;rite ce qu'il veut.

source: For novels, and in general for works that are used for entertainment, noncommercial verbatim redistribution may be sufficient freedom for the readers. Computer programs, being used for functional purposes (to get jobs done), call for additional freedoms beyond that, including the freedom to publish an improved version. See &ldquo;Free Software Definition,&rdquo; in this book, for an explanation of the freedoms that software users should have. But it may be an acceptable compromise for these freedoms to be universally available only after a delay of two or three years from the program's publication.
fr: Pour les romans, et en g&eacute;n&eacute;ral pour les &oelig;uvres destin&eacute;es au divertissement, la redistribution non commerciale peut &ecirc;tre une libert&eacute; suffisante pour les lecteurs. Les logiciels &eacute;tant utilis&eacute;s &agrave; des fins fonctionnelles (pour effectuer des t&acirc;ches), appellent &agrave; des libert&eacute;s suppl&eacute;mentaires, y compris celle de publier une version am&eacute;lior&eacute;e. Voir &laquo;&nbsp;D&eacute;finition du logiciel libre&nbsp;&raquo;, dans ce livre, pour une explication des libert&eacute;s que les utilisateurs de logiciels devraient avoir. Mais ce peut &ecirc;tre un compromis acceptable que d'avoir ces libert&eacute;s universellement disponibles apr&egrave;s un d&eacute;lai de deux &agrave; trois ans &agrave; compter de la date de publication du logiciel.

source: Changes like these could bring copyright into line with the public's wish to use digital technology to copy. Publishers will no doubt find these proposals &ldquo;unbalanced&rdquo;; they may threaten to take their marbles and go home, but they won't really do it, because the game will remain profitable and it will be the only game in town.
fr: Des changements comme ceux-ci pourraient amener le droit d'auteur &agrave; &ecirc;tre en phase avec les souhaits du public pour utiliser la technologie num&eacute;rique pour copier. Les &eacute;diteurs trouveront ces propositions sans aucun doute &laquo;&nbsp;d&eacute;s&eacute;quilibr&eacute;es&nbsp;&raquo;; ils pourront menacer de retirer leurs billes du jeu et de rentrer chez eux, mais ils ne le feront s&ucirc;rement pas, car le jeu restera profitable et qu'il n'y aura pas d'autres choix.

source: As we consider reductions in copyright power, we must make sure media companies do not simply replace it with end-user license agreements. It would be necessary to prohibit the use of contracts to apply restrictions on copying that go beyond those of copyright. Such limitations on what mass-market nonnegotiated contracts can require are a standard part of the US legal system.
fr: Consid&eacute;rant les r&eacute;ductions de pouvoir du droit d'auteur, nous devons nous assurer que les soci&eacute;t&eacute;s de m&eacute;dias ne les remplaceront pas tout simplement par un contrat de licence utilisateur. Il serait n&eacute;cessaire d'interdire l'utilisation de contrats qui appliquent des restrictions sur la copie qui vont au-del&agrave; de celles comprises dans le droit d'auteur. De telles limitations sur ce que&nbsp; peuvent demander des contrats non n&eacute;goci&eacute;s de march&eacute; de masse sont pr&eacute;vues dans une partie standard du syst&egrave;me l&eacute;gal am&eacute;ricain.

source: A personal note
fr: Remarque personnelle

source: Most of this article consists of facts and reasoning that you can check, and proposals on which you can form your own opinions. But I ask you to accept one thing on my word alone: that authors like me don't deserve special power over you. If you wish to reward me further for the software or books I have written, I would gratefully accept a check&mdash;but please don't surrender your freedom in my name.
fr: En grande partie, cet article repose sur des faits et des arguments que vous pouvez v&eacute;rifier, et des propositions sur lesquelles vous pouvez vous faire votre propre opinion. Mais je vous demande d'accepter un seule chose de mon discours&nbsp;: que les auteurs comme moi ne m&eacute;ritent pas de pouvoirs sp&eacute;ciaux &agrave; votre d&eacute;triment. Si vous voulez me r&eacute;compenser plus tard, pour des logiciels ou des livres que j'aurais &eacute;crits, j'accepterai volontiers un ch&egrave;que &mdash; mais s'il vous pla&icirc;t, n'abandonnez pas votre libert&eacute; en mon nom.

source: Footnotes
fr: Notes de bas de page

source: <a id="footnote2"></a>If you would like to help, I recommend the Web sites <a href="http://defectivebydesign.org">DefectiveByDesign.org</a>, <a href="http://publicknowledge.org">publicknowledge.org</a> and <a href="http://www.eff.org">www.eff.org</a>.
fr: <a name="footnote2"></a> Si vous voulez aider, je vous recommande les sites web <a href="http://defectivebydesign.org">DefectiveByDesign.org</a>, <a href="http://publicknowledge.org/">publicknowledge.org</a> et <a href="http://www.eff.org">www.eff.org</a>.

source: This essay is published in <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>
fr: Cet essai est disponible dans <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Logiciel libre, soci&eacute;t&eacute; libre&nbsp;: les essais choisis de Richard M. Stallman</cite></a>.
