Repository: gitGNU/gnu_www-fr
Catalog: philosophy/misinterpreting-copyright.*.po
Languages: fr

source: Misinterpreting Copyright - GNU Project - Free Software Foundation (FSF)
fr: Mauvaise interpr&eacute;tation du droit d'auteur - GNU Project - Free Software Foundation (FSF)

source: Misinterpreting Copyright&mdash;A Series of Errors
fr: Mauvaise interpr&eacute;tation du droit d'auteur &mdash; Une série d'erreurs

source: by <a href="http://stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: Something strange and dangerous is happening in copyright law. Under the US Constitution, copyright exists to benefit users&mdash;those who read books, listen to music, watch movies, or run software&mdash;not for the sake of publishers or authors. Yet even as people tend increasingly to reject and disobey the copyright restrictions imposed on them &ldquo;for their own benefit,&rdquo; the US government is adding more restrictions, and trying to frighten the public into obedience with harsh new penalties.
fr: Quelque chose d'&eacute;trange et de dangereux est en train d'arriver dans la loi sur le droit d'auteur. Dans la Constitution am&eacute;ricaine, le droit d'auteur existe au b&eacute;n&eacute;fice des utilisateurs &mdash; ceux qui lisent les livres, &eacute;coutent de la musique, regardent des films ou utilisent des logiciels &mdash; non pour l'int&eacute;r&ecirc;t des &eacute;diteurs ou des auteurs. Cependant, alors que les gens tendent de plus en plus &agrave; rejeter et transgresser le droit d'auteur qui leur est impos&eacute; &laquo;&nbsp;pour leur propre b&eacute;n&eacute;fice&nbsp;&raquo;, le gouvernement ajoute plus de restrictions, et essaie d'effrayer le public pour qu'il rentre dans le rang, avec de nouvelles sanctions s&eacute;v&egrave;res.

source: How did copyright policies come to be diametrically opposed to their stated purpose? And how can we bring them back into alignment with that purpose? To understand, we should start by looking at the root of United States copyright law: the US Constitution.
fr: Comment la politique de droit d'auteur en est-elle arriv&eacute;e &agrave; &ecirc;tre diam&eacute;tralement oppos&eacute;e &agrave; son intention d&eacute;clar&eacute;e&nbsp;? Et comment pouvons-nous la ramener en phase avec cette intention&nbsp;? Pour comprendre, nous devons commencer par regarder aux sources de la loi sur le droit d'auteur des &Eacute;tats-Unis&nbsp;: la Constitution am&eacute;ricaine.

source: Copyright in the US Constitution
fr: Le droit d'auteur dans la Constitution am&eacute;ricaine

source: When the US Constitution was drafted, the idea that authors were entitled to a copyright monopoly was proposed&mdash;and rejected. The founders of our country adopted a different premise, that copyright is not a natural right of authors, but an artificial concession made to them for the sake of progress. The Constitution gives permission for a copyright system with this paragraph (Article I, Section 8):
fr: Quand la Constitution am&eacute;ricaine fut r&eacute;dig&eacute;e, l'id&eacute;e que les auteurs seraient autoris&eacute;s &agrave; un monopole sur le droit d'auteur fut propos&eacute;e &mdash; et rejet&eacute;e. Les fondateurs de notre pays adopt&egrave;rent un principe diff&eacute;rent, que le droit d'auteur n'est pas un droit naturel des auteurs, mais une concession artificielle qui leur est faite dans l'int&eacute;r&ecirc;t du progr&egrave;s. La Constitution&nbsp; donne la permission d'un syst&egrave;me de droit d'auteur avec ce paragraphe (Article I, Section 8)&nbsp;:

source: The Supreme Court has repeatedly affirmed that promoting progress means benefit for the users of copyrighted works. For example, in <em>Fox Film v. Doyal</em>, the court said,
fr: La Cour Supr&ecirc;me a affirm&eacute; &agrave; maintes reprises que la promotion du progr&egrave;s signifie que les travaux couverts par le droit d'auteur b&eacute;n&eacute;ficient aux utilisateurs. Par exemple, dans <em>Fox Film contre Doyal</em>, la cour a statu&eacute;&nbsp;:

source: The sole interest of the United States and the primary object in conferring the [copyright] monopoly lie in the general benefits derived by the public from the labors of authors.
fr: Le seul int&eacute;r&ecirc;t des &Eacute;tats-Unis et l'objet premier de conf&eacute;rer le monopole [du droit d'auteur] reposent sur les b&eacute;n&eacute;fices g&eacute;n&eacute;raux tir&eacute;s du travail des auteurs par le public.

source: This fundamental decision explains why copyright is not <b>required</b> by the Constitution, only <b>permitted</b> as an option&mdash;and why it is supposed to last for &ldquo;limited times.&rdquo; If copyright were a natural right, something that authors have because they deserve it, nothing could justify terminating this right after a certain period of time, any more than everyone's house should become public property after a certain lapse of time from its construction.
fr: Cette d&eacute;cision fondamentale explique pourquoi le droit d'auteur n'est pas <b>requis</b> par la Constitution, seulement <b>permis</b> comme une option &mdash; et pourquoi il est suppos&eacute; durer un &laquo;&nbsp;temps limit&eacute;&nbsp;&raquo;. Si le droit d'auteur &eacute;tait un droit naturel, quelque chose que les auteurs ont parce qu'ils le m&eacute;ritent, rien ne pourrait justifier que ce droit se termine apr&egrave;s un certain temps, pas plus que la maison de quiconque deviendrait propri&eacute;t&eacute; publique apr&egrave;s un certain laps de temps apr&egrave;s sa construction.

source: The &ldquo;copyright bargain&rdquo;
fr: Le &laquo;&nbsp;marchandage du droit d'auteur&nbsp;&raquo;

source: The copyright system works by providing privileges and thus benefits to publishers and authors; but it does not do this for their sake. Rather, it does this to modify their behavior: to provide an incentive for authors to write more and publish more. In effect, the government spends the public's natural rights, on the public's behalf, as part of a deal to bring the public more published works. Legal scholars call this concept the &ldquo;copyright bargain.&rdquo; It is like a government purchase of a highway or an airplane using taxpayers' money, except that the government spends our freedom instead of our money.
fr: Le syst&egrave;me du droit d'auteur fonctionne en fournissant des privil&egrave;ges et donc b&eacute;n&eacute;ficie aux &eacute;diteurs et aux auteurs; mais il ne le fait pas pour leur int&eacute;r&ecirc;t. Il le fait plut&ocirc;t pour modifier leur comportement&nbsp;: pour donner une motivation aux auteurs d'&eacute;crire plus et de publier plus. En fait, le gouvernement utilise les droits naturels du public, en son nom, comme contrepartie d'un march&eacute; pour apporter au public plus d'&oelig;uvres publi&eacute;es. Les &eacute;rudits en droit appelle ce concept &laquo;&nbsp;le marchandage du droit d'auteur&nbsp;&raquo;. C'est comme l'achat par le gouvernement d'une autoroute ou d'un avion en utilisant l'argent du contribuable, except&eacute; que le gouvernement utilise notre libert&eacute; au lieu de notre argent.

source: But is the bargain as it exists actually a good deal for the public? Many alternative bargains are possible; which one is best? Every issue of copyright policy is part of this question. If we misunderstand the nature of the question, we will tend to decide the issues badly.
fr: Mais le marchandage tel qu'il existe effectivement, est-il une bonne tractation pour le public&nbsp;? Beaucoup d'autres alternatives de n&eacute;gociation sont possibles&nbsp;; laquelle est la meilleure&nbsp;? Chaque probl&egrave;me de la politique du droit d'auteur r&eacute;side dans cette question. Si nous interpr&eacute;tons mal la nature de la question, nous aurons tendance &agrave; d&eacute;cider des solutions de fa&ccedil;on incorrecte.

source: The Constitution authorizes granting copyright powers to authors. In practice, authors typically cede them to publishers; it is usually the publishers, not the authors, who exercise these powers and get most of the benefits, though authors may get a small portion. Thus it is usually the publishers that lobby to increase copyright powers. To better reflect the reality of copyright rather than the myth, this article refers to publishers rather than authors as the holders of copyright powers. It also refers to the users of copyrighted works as &ldquo;readers,&rdquo; even though using them does not always mean reading, because &ldquo;the users&rdquo; is remote and abstract.
fr: La Constitution autorise l'octroi du pouvoir du droit d'auteur aux auteurs. En pratique, les auteurs c&egrave;dent, en g&eacute;n&eacute;ral, leurs droits aux &eacute;diteurs&nbsp;; habituellement, ce sont les &eacute;diteurs, pas les auteurs, qui exercent ce pouvoir et obtiennent la plupart des b&eacute;n&eacute;fices, bien que les auteurs en obtiennent une petite part. Par cons&eacute;quent, ce sont g&eacute;n&eacute;ralement les &eacute;diteurs qui font du lobbying pour augmenter le pouvoir du droit d'auteur. Pour refl&eacute;ter au mieux la r&eacute;alit&eacute; du droit d'auteur plut&ocirc;t que son mythe, cet article se r&eacute;f&egrave;re aux &eacute;diteurs plut&ocirc;t qu'aux auteurs comme les d&eacute;tenteurs de droits d'auteur. Il fait aussi r&eacute;f&eacute;rence aux utilisateurs d'&oelig;uvres couvertes par droits d'auteur comme &laquo;&nbsp;lecteurs&nbsp;&raquo;, m&ecirc;me si leur utilisation ne signifie pas forc&eacute;ment une lecture, car &laquo;&nbsp;les utilisateurs&nbsp;&raquo; est un terme vague et abstrait.

source: The first error: &ldquo;striking a balance&rdquo;
fr: a premi&egrave;re erreur&nbsp;: &laquo;&nbsp;&eacute;tablir l'&eacute;quilibre&nbsp;&raquo;

source: The copyright bargain places the public first: benefit for the reading public is an end in itself; benefits (if any) for publishers are just a means toward that end. Readers' interests and publishers' interests are thus qualitatively unequal in priority. The first step in misinterpreting the purpose of copyright is the elevation of the publishers to the same level of importance as the readers.
fr: Le marchandage du droit d'auteur place le public d'abord&nbsp;: le b&eacute;n&eacute;fice pour les lecteurs est une fin en soi; les b&eacute;n&eacute;fices (s'il y en a) pour les &eacute;diteurs sont seulement un moyen pour arriver &agrave; cette fin. Les int&eacute;r&ecirc;ts des lecteurs et les int&eacute;r&ecirc;ts des &eacute;diteurs sont qualitativement in&eacute;gaux en priorit&eacute;. La premi&egrave;re &eacute;tape dans la mauvaise interpr&eacute;tation au sujet du droit d'auteur est l'&eacute;l&eacute;vation des &eacute;diteurs au m&ecirc;me rang d'importance que les lecteurs.

source: It is often said that US copyright law is meant to &ldquo;strike a balance&rdquo; between the interests of publishers and readers. Those who cite this interpretation present it as a restatement of the basic position stated in the Constitution; in other words, it is supposed to be equivalent to the copyright bargain.
fr: Il est souvent dit que la loi am&eacute;ricaine sur le droit d'auteur entend &laquo;&nbsp;&eacute;tablir l'&eacute;quilibre&nbsp;&raquo; entre les int&eacute;r&ecirc;ts des &eacute;diteurs et des lecteurs. Ceux qui citent cette interpr&eacute;tation la pr&eacute;sente comme une reformulation de la position de base fix&eacute;e dans la&nbsp; Constitution; en d'autres termes, elle est suppos&eacute;e &ecirc;tre &eacute;quivalente au marchandage du droit d'auteur.

source: But the two interpretations are far from equivalent; they are different conceptually, and different in their implications. The balance concept assumes that the readers' and publishers' interests differ in importance only quantitatively, in <em>how much weight</em> we should give them, and in what actions they apply to. The term &ldquo;stakeholders&rdquo; is often used to frame the issue in this way; it assumes that all kinds of interest in a policy decision are equally important. This view rejects the qualitative distinction between the readers' and publishers' interests which is at the root of the government's participation in the copyright bargain.
fr: Mais les deux interpr&eacute;tations sont loin d'&ecirc;tre &eacute;quivalentes; elles sont diff&eacute;rentes conceptuellement ainsi que dans leurs implications. Le concept de l'&eacute;quilibre suppose que les int&eacute;r&ecirc;ts des lecteurs et des &eacute;diteurs se diff&eacute;rencient en importance seulement quantitativement, dans le <em>poids</em> que nous leur donnons, et dans les cas auxquels ils s'appliquent. Le terme &laquo;&nbsp;parties prenantes&nbsp;&raquo; est souvent utilis&eacute; pour formuler le probl&egrave;me de cette fa&ccedil;on; il suppose que toutes sortes d'int&eacute;r&ecirc;ts dans une d&eacute;cision politique sont d'&eacute;gale importance. Cette vision des choses rejette la distinction qualitative entre les int&eacute;r&ecirc;ts des lecteurs et des &eacute;diteurs qui est &agrave; l'origine de la participation du gouvernement au marchandage du droit d'auteur.

source: The consequences of this alteration are far-reaching, because the great protection for the public in the copyright bargain&mdash;the idea that copyright privileges can be justified only in the name of the readers, never in the name of the publishers&mdash;is discarded by the &ldquo;balance&rdquo; interpretation. Since the interest of the publishers is regarded as an end in itself, it can justify copyright privileges; in other words, the &ldquo;balance&rdquo; concept says that privileges can be justified in the name of someone other than the public.
fr: Les cons&eacute;quences de cette alt&eacute;ration ne sont pas n&eacute;gligeables, car la grande protection du public dans le marchandage du droit d'auteur &mdash; l'id&eacute;e que les privil&egrave;ges de droit d'auteur ne se justifient qu'au nom des lecteurs, jamais au nom des &eacute;diteurs &mdash; est abandonn&eacute;e par l'interpr&eacute;tation de &laquo;&nbsp;l'&eacute;quilibre&nbsp;&raquo;. Puisque l'int&eacute;r&ecirc;t des &eacute;diteurs est consid&eacute;r&eacute; comme une fin en soi, il peut justifier des privil&egrave;ges de droit d'auteur; en d'autres termes, le concept de &laquo;&nbsp;l'&eacute;quilibre&nbsp;&raquo; dit que les privil&egrave;ges peuvent &ecirc;tre justifi&eacute;s en d'autre nom que celui du public.

source: As a practical matter, the consequence of the &ldquo;balance&rdquo; concept is to reverse the burden of justification for changes in copyright law. The copyright bargain places the burden on the publishers to convince the readers to cede certain freedoms. The concept of balance reverses this burden, practically speaking, because there is generally no doubt that publishers will benefit from additional privilege. Unless harm to the readers can be proved, sufficient to &ldquo;outweigh&rdquo; this benefit, we are led to conclude that the publishers are entitled to almost any privilege they request.
fr: En pratique, la cons&eacute;quence du concept de &laquo;&nbsp;l'&eacute;quilibre&nbsp;&raquo; est d'outrepasser la charge de la justification pour les changements dans la loi sur le droit d'auteur. Le marchandage du droit d'auteur met &agrave; la charge des &eacute;diteurs de convaincre les lecteurs de c&eacute;der certaines libert&eacute;s. Le concept de l'&eacute;quilibre r&eacute;voque cette charge, pour ainsi dire, car il n'y a g&eacute;n&eacute;ralement pas de doute que les &eacute;diteurs profiteraient de privil&egrave;ges suppl&eacute;mentaires. Aussi, &agrave; moins que le pr&eacute;judice pour les lecteurs ne soit av&eacute;r&eacute;, suffisant pour &laquo;&nbsp;compenser&nbsp;&raquo; ce b&eacute;n&eacute;fice, nous sommes amen&eacute;s &agrave; conclure que les &eacute;diteurs sont autoris&eacute;s &agrave; obtenir presque tous les privil&egrave;ges qu'ils r&eacute;clament.

source: Since the idea of &ldquo;striking a balance&rdquo; between publishers and readers denies the readers the primacy they are entitled to, we must reject it.
fr: Puisque l'id&eacute;e &laquo;&nbsp;d'&eacute;tablir l'&eacute;quilibre&nbsp;&raquo; entre les &eacute;diteurs et les lecteurs d&eacute;nie la primaut&eacute; des lecteurs &agrave; laquelle ils sont habilit&eacute;s, nous devons la rejeter.

source: Balancing against what?
fr: &Eacute;quilibrer contre quoi&nbsp;?

source: When the government buys something for the public, it acts on behalf of the public; its responsibility is to obtain the best possible deal&mdash;best for the public, not for the other party in the agreement.
fr: Quand le gouvernement ach&egrave;te quelque chose pour le public, il agit pour le compte du public; sa responsabilit&eacute; est d'obtenir la meilleure n&eacute;gociation possible &mdash; meilleure pour le public, pas pour l'autre partie prenante du contrat.

source: For example, when signing contracts with construction companies to build highways, the government aims to spend as little as possible of the public's money. Government agencies use competitive bidding to push the price down.
fr: Par exemple, lorsqu'il signe des contrats avec des soci&eacute;t&eacute;s de construction pour construire des autoroutes, le gouvernement vise &agrave; d&eacute;penser le moins possible de l'argent public. Les agences du gouvernement font des appels d'offres pour faire baisser le prix.

source: As a practical matter, the price cannot be zero, because contractors will not bid that low. Although not entitled to special consideration, they have the usual rights of citizens in a free society, including the right to refuse disadvantageous contracts; even the lowest bid will be high enough for some contractor to make money. So there is indeed a balance, of a kind. But it is not a deliberate balancing of two interests each with claim to special consideration. It is a balance between a public goal and market forces. The government tries to obtain for the taxpaying motorists the best deal they can get in the context of a free society and a free market.
fr: En pratique, le prix ne peut &ecirc;tre nul, car les entrepreneurs ne feront pas d'offres si basses. Bien qu'ils ne soient pas assujettis &agrave; une consid&eacute;ration particuli&egrave;re, Ils ont les m&ecirc;mes droits que les citoyens dans une soci&eacute;t&eacute; libre, y compris celui de refuser des contrats d&eacute;savantageux; m&ecirc;me l'offre la plus basse sera largement suffisante pour un entrepreneur pour faire de l'argent. Donc, il y a en effet un &eacute;quilibre, en quelque sorte. Mais il ne s'agit pas d'un &eacute;quilibre d&eacute;lib&eacute;r&eacute; de deux int&eacute;r&ecirc;ts, chacun revendiquant une consid&eacute;ration sp&eacute;ciale. Il s'agit d'un &eacute;quilibre entre un objectif public et les forces du march&eacute;. Le gouvernement essaie d'obtenir pour les contribuables automobilistes la meilleure transaction qu'il peut dans le contexte d'une soci&eacute;t&eacute; libre et d'un march&eacute; libre.

source: In the copyright bargain, the government spends our freedom instead of our money. Freedom is more precious than money, so government's responsibility to spend our freedom wisely and frugally is even greater than its responsibility to spend our money thus. Governments must never put the publishers' interests on a par with the public's freedom.
fr: Dans le marchandage du droit d'auteur, le gouvernement d&eacute;pense notre libert&eacute; au lieu de notre argent. La libert&eacute; est plus pr&eacute;cieuse que l'argent, aussi, la responsabilit&eacute; du gouvernement pour d&eacute;penser notre libert&eacute; avec sagesse et parcimonie est par cons&eacute;quent m&ecirc;me plus grande que sa responsabilit&eacute; pour d&eacute;penser notre argent. Les gouvernements ne doivent jamais mettre&nbsp; les int&eacute;r&ecirc;ts des &eacute;diteurs sur le m&ecirc;me pied d'&eacute;galit&eacute; que la libert&eacute; publique.

source: Not &ldquo;balance&rdquo; but &ldquo;trade-off&rdquo;
fr: Pas &laquo;&nbsp;&eacute;quilibre&nbsp;&raquo; mais &laquo;&nbsp;compromis&nbsp;&raquo;

source: The idea of balancing the readers' interests against the publishers' is the wrong way to judge copyright policy, but there are indeed two interests to be weighed: two interests <b>of the readers</b>. Readers have an interest in their own freedom in using published works; depending on circumstances, they may also have an interest in encouraging publication through some kind of incentive system.
fr: L'id&eacute;e d'&eacute;quilibre des int&eacute;r&ecirc;ts des lecteurs contre les int&eacute;r&ecirc;ts des &eacute;diteurs est la mauvaise voie pour juger de la politique du droit d'auteur, mais il y a en effet deux int&eacute;r&ecirc;t &agrave; soupeser&nbsp;: deux int&eacute;r&ecirc;ts<b> des lecteurs</b>. Les lecteurs ont un int&eacute;r&ecirc;t dans leur propre libert&eacute; en utilisant des &oelig;uvres publi&eacute;es; selon les circonstances, ils peuvent aussi avoir un int&eacute;r&ecirc;t en encourageant la publication par un syst&egrave;me d'incitation.

source: The word &ldquo;balance,&rdquo; in discussions of copyright, has come to stand as shorthand for the idea of &ldquo;striking a balance&rdquo; between the readers and the publishers. Therefore, to use the word &ldquo;balance&rdquo; in regard to the readers' two interests would be confusing. We need another term.
fr: Le mot &laquo;&nbsp;&eacute;quilibre&nbsp;&raquo;, dans les discussions sur les droits d'auteur, est devenu un raccourci pour l'id&eacute;e &laquo;&nbsp;d'&eacute;tablir un &eacute;quilibre&nbsp;&raquo; entre les lecteurs et les &eacute;diteurs. Pour cette raison, utiliser le mot &laquo;&nbsp;&eacute;quilibre&nbsp;&raquo; en ce qui concerne les deux int&eacute;r&ecirc;ts des lecteurs s&egrave;merait la confusion &mdash; nous avons besoin d'un autre terme.

source: In general, when one party has two goals that partly conflict, and cannot completely achieve both of them, we call this a &ldquo;trade-off.&rdquo; Therefore, rather than speaking of &ldquo;striking the right balance&rdquo; between parties, we should speak of &ldquo;finding the right trade-off between spending our freedom and keeping it.&rdquo;
fr: En g&eacute;n&eacute;ral, quand une partie a deux buts en conflit partiellement, et ne peut atteindre compl&egrave;tement aucun d'eux, nous appelons cela un &laquo;&nbsp;compromis&nbsp;&raquo;. Par cons&eacute;quent, plut&ocirc;t que de parler &laquo;&nbsp;d'&eacute;tablir le bon &eacute;quilibre&nbsp;&raquo; entre parties, nous parlerons de &laquo;&nbsp;trouver le bon compromis entre d&eacute;penser notre libert&eacute; et la garder&nbsp;&raquo;.

source: The second error: maximizing one output
fr: La seconde erreur&nbsp;: maximiser le rendement

source: The second mistake in copyright policy consists of adopting the goal of maximizing&mdash;not just increasing&mdash;the number of published works. The erroneous concept of &ldquo;striking a balance&rdquo; elevated the publishers to parity with the readers; this second error places them far above the readers.
fr: La seconde erreur dans la politique du droit d'auteur consiste &agrave; adopter l'objectif de maximiser &mdash; pas seulement d'augmenter &mdash; le nombre d'&oelig;uvres publi&eacute;es. Le concept erron&eacute; &laquo;&nbsp;d'&eacute;tablir l'&eacute;quilibre&nbsp;&raquo; &eacute;levaient les &eacute;diteurs &agrave; parit&eacute; avec les lecteurs; cette seconde erreur les place bien au-dessus des lecteurs.
