Repository: gitGNU/gnu_www-fr
Catalog: philosophy/moglen-harvard-speech-2004.*.po
Languages: fr

source: When they distribute that program called Linux, they are distributing the work of thousands of people, and they are doing so without a license, because they burned their license down when they tried to add terms to it, by charging additional license fees in violation of Sections 2 and 6 of the GPL.
fr: Quand ils distribuent le programme appel&eacute; Linux, ils distribuent le travail de milliers de personnes, et ils le font sans licence, puisqu'ils ont d&eacute;truit leur licence en essayant d'y rajouter des termes, en ajoutant des frais de licence suppl&eacute;mentaires en violation des sections 2 et 6 de la GPL.

source: Under Section 4 of the GPL, when they violated it, they lost their right to distribute, and IBM has said as a counterclaim in its lawsuit, &ldquo;Judge, they're distributing our copyrighted work, and they don't have any permission. Make them stop.&rdquo;
fr: Selon la section 4 de la GPL, quand elle est viol&eacute;e, ils ont perdu leur droit de le distribuer, et IBM a dit dans une contre-revendication dans son proc&egrave;s, &laquo;&nbsp;M. le Juge, ils distribuent notre travail plac&eacute; sous copyright, et ils n'ont aucune permission, faites-les cesser&nbsp;&raquo;.

source: If SCO played smart, they would have said, &ldquo;But your Honor, we do have a license. It's the GNU GPL.&rdquo; Now for reasons that we could get into but needn't, they didn't want to do that, possibly because it would have affected adversely their other claims in their lawsuit, or possibly because they had taken a 10 million dollar investment from Microsoft, but we'll talk about that a little further, I'm sure, in the question period.
fr: Si SCO avait &eacute;t&eacute; malin, ils auraient dit, &laquo;&nbsp;Mais votre Honneur, nous avons une licence. C'est la GNU GPL&nbsp;&raquo;. Maintenant pour des raisons que nous pourrions expliquer mais ce n'est pas n&eacute;cessaire, ils n'ont pas voulu dire cela, peut-&ecirc;tre parce que cela aurait pos&eacute; probl&egrave;me aux autres revendications de leur proc&egrave;s, ou peut-&ecirc;tre parce qu'ils avaient re&ccedil;u un investissement de 10 millions de dollars de Microsoft, mais nous reparlerons de cela plus tard j'en suis sûr, pendant la phase des questions.

source: At any rate, they didn't say that. What they said back is, &ldquo;But Judge, the GNU GPL is a violation of the United States Constitution, the Copyright Law, the Export Control Law&rdquo;, and I have now forgotten whether or not they also said the United Nations Charter of the Rights of Man. [laughter]
fr: En tout cas, ils n'ont pas dit cela. Ce qu'ils ont r&eacute;pliqu&eacute; est, &laquo;&nbsp;Mais M. le Juge, la GNU GPL est en violation avec la Constitution des &Eacute;tats-Unis, la Copyright Law, la Export Control Law&nbsp;&raquo;, et je commence &agrave; oublier s'ils ont ajout&eacute; ou non la charte des Nations Unies et les Droits de L'Homme. [rires]

source: At the moment, we confine ourselves solely to the question whether the GPL violates the United States Constitution. I am coming back to Eldred against Ashcroft along the way.
fr: Pour le moment, contentons-nous uniquement de la question de savoir si la GPL viole la Constitution des &Eacute;tats-Unis. Je reviendrais sur Eldred contre Ashcroft plus tard.

source: In Eldred against Ashcroft, 435 Congressmen and a hundred Senators had been bribed to make copyright eternal in a tricky way. The bribe, which of course was perfectly legal and went by the name of campaign contributions, was presented to the Congress for a copyright term extension.
fr: Dans Eldred contre Ashcroft, 435 membres du Congr&egrave;s et une centaine de s&eacute;nateurs ont &eacute;t&eacute; achet&eacute;s pour rendre le copyright &eacute;ternel d'une mani&egrave;re fourbe. Cette manœuvre de corruption, qui bien s&ucirc;r &eacute;tait parfaitement l&eacute;gale et s'est effectu&eacute;e sous le nom d'une campagne de contribution, a permis d'amener au Congr&egrave;s une extension de dur&eacute;e des copyrights.

source: In 1929, &ldquo;Steamboat Willy&rdquo; first brought before the public a creature called Mickey Mouse. The corporate authorship term under copyright being then, as almost now, 75 years, had it not been for action by Congress in the year 2004, Mickey Mouse would have escaped control of ownership, at least under the Copyright Law. This, of course, necessitated major legal reform to prevent the escape of Mickey Mouse into the public domain.
fr: En 1929, &laquo;&nbsp;Steamboat Willy&nbsp;&raquo; a pour la premi&egrave;re fois montr&eacute; au public une cr&eacute;ature appel&eacute;e Mickey Mouse. Les termes de droits d'auteur plac&eacute; sous copyright &eacute;tant &agrave; l'&eacute;poque, quasiment comme aujourd'hui, de 75 ans, s'il n'y avait pas eu cette action au Congr&egrave;s en 2004, Mickey Mouse aurait &eacute;chapp&eacute; au contr&ocirc;le de son propri&eacute;taire, du moins sous la Copyright Law. Cela, bien &eacute;videmment, rendait n&eacute;cessaire une r&eacute;forme l&eacute;gale majeure pour emp&ecirc;cher l'&eacute;chapp&eacute;e de Mickey Mouse dans le domaine public.

source: Copyright term extension now provides that, whether or not a Sonny Bono skis into a tree again in the next ten years or so, every once in a while Congress will extend the term of copyrights a little while longer. And then, as the ball approaches midnight in Times Square, they'll extend it a little longer. And so on and so on. Nothing need ever escape into the public domain again, least of all Mickey Mouse.
fr: L'extension de dur&eacute;e de copyright rend aujourd'hui possible que, qu'un Sonny Bono percute un arbre en ski dans les 10 prochaines ann&eacute;es ou non, de temps en temps le Congr&egrave;s &eacute;tendra la dur&eacute;e des copyrights un petit peu plus. Et ensuite, chaque fois que viendra le moment d&eacute;cisif, ils l'allongeront un peu plus. Et ainsi de suite. Rien ne pourra plus jamais s'&eacute;chapper vers le domaine public, et Mickey Mouse encore moins.

source: Professor Lessig, Eric Eldred, I and lots of other otherwise sensible people in the United States thought that this did not actually conform to the grand idea of the perfectability of human beings through the sharing of information. We doubted that securing perpetual ownership a slice at a time was actually a form of encouraging the diffusion of science and the useful arts, and we suggested to the Supreme Court that on this basis alone, the Copyright Term Extension Act should fall. We were, as Mr. McBride rightly points out, soundly repudiated.
fr: Le professeur Lessig, Eric Eldred, moi-m&ecirc;me et de nombreuses autres personnes aussi sens&eacute;es aux &Eacute;tats-Unis ont pens&eacute; que cela ne se conformait pas &agrave; la grande id&eacute;e de perfectibilit&eacute; de l'&ecirc;tre humain par le partage de l'information. Nous avons dout&eacute; qu'assurer petit &agrave; petit une propri&eacute;t&eacute; illimit&eacute;e dans la dur&eacute;e &eacute;tait r&eacute;ellement une forme d'encouragement pour la diffusion de la science, et nous avons sugg&eacute;r&eacute; &agrave; la Cour Supr&ecirc;me sur cette base uniquement, que le Copyright Term Extension Act devrait &ecirc;tre annul&eacute;. Nous avons &eacute;t&eacute;, comme l'a remarqu&eacute; M. McBride, refoul&eacute;s avec pertes et fracas.

source: It turns out that there's no such thing as an unconstitutional copyright rule, if Congress passes it, and if it observes the distinction between expression and idea, which the Supreme Court says is the constitutional guarantee that copyright does not violate the freedom of expression, and provided that fair use rights are adequately maintained.
fr: Il s'av&egrave;re qu'il n'existe rien de tel qu'une loi inconstitutionnelle sur les copyrights, si le Congr&egrave;s l'a vot&eacute;e, et si elle observe la distinction entre l'expression et l'id&eacute;e, ce que le Congr&egrave;s indique comme garantie constitutionnelle que le copyright ne viole pas la libert&eacute; d'expression, et dans le cas o&ugrave; des droits d'&laquo;&nbsp;usage raisonnable&nbsp;&raquo; (fair use) sont maintenus de mani&egrave;re ad&eacute;quate.

source: In short, the actual holding of Eldred against Ashcroft is, Congress can make such copyright law as it wants, and all licenses issued under the presumptively constitutional copyright law are beyond constitutional challenge.
fr: En bref, la conclusion de Eldred contre Ashcroft est que le Congr&egrave;s peut faire les lois de copyright comme il le souhaite, et que toutes les licences issues de cette loi sur les copyrights pr&eacute;tendument constitutionnelle sont gard&eacute;es de toute question constitutionnelle.

source: I have news for Mr. McBride. The existing copyright law is constitutional and our license, which fully observes all the requirements that the copyright law places upon it, are also presumptively constitutional. Only in the world in which we succeeded in Eldred against Ashcroft, in which if you like there would be substantive due process review of copyright licenses to see whether they met the form of copyright called for in Article 1 Section 8, could Mr. McBride and friends even stand in a United States courtroom and argue that a copyrights license is unconstitutional.
fr: J'ai des nouvelles pour M. McBride. La loi sur les copyrights existante est constitutionnelle, et notre licence, qui observe scrupuleusement toutes les conditions que cette loi lui demande, a &eacute;galement la pr&eacute;somption d'&ecirc;tre constitutionnelle. Uniquement dans un monde dans lequel nous aurions succ&eacute;d&eacute; dans l'affaire Eldred contre Ashcroft, dans lequel, si vous me permettez, il y aurait un devoir substantiel de revue des licences de copyright pour v&eacute;rifier si oui ou non elles se conforment avec la forme de copyright nomm&eacute;e dans la Section 8 de l'Article 1, uniquement l&agrave; M. McBride et ses amis pourraient se tenir dans un tribunal des &Eacute;tats-Unis et affirmer qu'une licence de copyright est inconstitutionnelle.

source: Regrettably for Mr. McBride, in other words, we lost Eldred against Ashcroft, and the very claim he now wishes to make perished, along with some more worthwhile claims, at that moment, at least until such time as the Supreme Court changes the holding in Eldred against Ashcroft.
fr: Malheureusement pour M. McBride, en d'autre termes, nous avons perdu dans Eldred contre Ashcroft, et la revendication m&ecirc;me qu'il d&eacute;fend a p&eacute;ri, ainsi que d'autres revendications beaucoup plus valables, au moins jusqu'au moment o&ugrave; la Cour Supr&ecirc;me change son verdict dans l'affaire Eldred contre Ashcroft.

source: Mr. McBride takes a great deal of cold comfort from the pro-capitalist rhetoric in which Justice Ginsberg announced the decision of the Supreme Court. And, as yet another disgruntled observer of Eldred against Ashcroft, I wish him luck with his cold comfort, but he and I were on the same side of that case, little as he knows it, and the legal arguments that he would now like to present unfortunately failed. Mind you, even if he were allowed to present to the court the idea that copyright licenses should be judged for their squareness with constitutional policy, we would triumphantly prevail.
fr: M. McBride tente de se consoler de la rh&eacute;torique pro-capitaliste avec laquelle Justice Ginsberg a annonc&eacute; la d&eacute;cision de la Cour Supr&ecirc;me. Et, en tant qu'observateur &eacute;galement m&eacute;content du verdict de Eldred contre Ashcroft, je lui souhaite bonne chance dans sa consolation, mais lui et moi &eacute;tions dans le m&ecirc;me camp sur cette affaire, m&ecirc;me s'il ne le savait pas, et la question l&eacute;gale qu'il souhaite maintenant aborder a malheureusement &eacute;chou&eacute;. Notez bien, m&ecirc;me s'il &eacute;tait autoris&eacute; &agrave; pr&eacute;senter &agrave; la cour l'id&eacute;e que les licences de copyright devraient &ecirc;tre jug&eacute;es pour leur ad&eacute;quation avec la Constitution, nous vaincrions triomphalement.

source: There is no copyright license in the United States today, I will lay this down without further demonstration but we can talk about it if you like, there is no copyright license in the United States today more fitting to Thomas Jefferson's idea of copyright or indeed to the conception of copyright contained in Article 1 Section 8, than ours. For we are pursuing an attempt at the diffusion of knowledge and the useful arts which is already proving far more effective at diffusing knowledge than all of the profit-motivated proprietary software distribution being conducted by the grandest and best funded monopoly in the history of the world.
fr: Il n'y a aucune licence de copyright aux &Eacute;tats-Unis aujourd'hui, j'affirme cela sans l'expliquer plus avant mais nous pouvons en parler si vous le souhaitez, il n'y a aucune licence de copyright aux &Eacute;tats-Unis aujourd'hui qui colle mieux &agrave; l'id&eacute;e de copyright de Thomas Jefferson ou m&ecirc;me &agrave; la conception de copyright contenue dans la Section 8 de l'Article 1, que la n&ocirc;tre. Car nous poursuivons une tentative de diffusion du savoir qui est d&eacute;j&agrave; largement plus efficace &agrave; la diffusion du savoir que toutes les distributions logicielles propri&eacute;taires motiv&eacute;es par le profit conduites actuellement par les plus grands et mieux fond&eacute;s monopoles du monde.

source: But, sorrily for us all, Mr. McBride will not get us to the stage where we are allowed to tell that to the United States Supreme Court, where we would prevail gloriously, because the United States Supreme Court's already decided that copyright law is presumptively constitutional as soon as Congressmen have taken the campaign contributions, held the vote, and passed the resulting gumball-like statute to the White House for the obligatory stamping. But I welcome Mr. McBride to the campaign for a less restrictive copyright in the United States, as soon as he actually figures out, from the legal point of view, which side his bread is buttered. Unfortunately, as you all realize, we cannot hold our breaths waiting for enlightenment to strike. If only Mr. McBride attended Harvard Law School.
fr: Mais, malheureusement pour nous tous, M. McBride ne nous am&egrave;nera pas au stade nous autorisant &agrave; dire cela &agrave; la Cour Supr&ecirc;me des &Eacute;tats-Unis, dans laquelle nous vaincrions glorieusement, car cette Cour Supr&ecirc;me des &Eacute;tats-Unis a d&eacute;j&agrave; d&eacute;cid&eacute; que les licences de copyright sont constitutionnelles pour peu que les membres du Congr&egrave;s aient effectu&eacute; une campagne de contribution, tenu le vote, et pass&eacute; le statut-&laquo;&nbsp;chewing-gum&nbsp;&raquo; (mall&eacute;able) r&eacute;sultant &agrave; la Maison Blanche pour recevoir le tampon obligatoire. Mais j'accueillerai volontiers M. McBride dans une campagne pour un copyright moins restrictif aux &Eacute;tats-Unis, d&egrave;s qu'il se sera rendu compte, l&eacute;galement parlant, dans quel camp il se trouve. Malheureusement, comme vous le r&eacute;alisez tous, nous ne pouvons pas retenir notre respiration en attendant que l'illumination ne frappe. Si seulement M. McBride suivait la Harvard Law School.

source: That's, I think, enough about SCO, truly, though I am delighted to answer your questions in due course about it. It's actually a copyright lawsuit desert. There aren't any copyright claims in it. There are some contract claims between IBM and SCO, and those will, in due course, be adjusted by the courts, and I look forward with a moderate degree of interest to the outcome. A threat to the freedom of free software, it ain't. One hell of a nuisance it most certainly is. And I, unfortunately, expect to continue to spend a good deal of my time abating the nuisance, but without much sense of the presence of a hovering threat to the things I really care about, of which this is not a very good one.
fr: C'est suffisant, je pense, &agrave; propos de SCO, vraiment, bien que je sois enchant&eacute; de r&eacute;pondre &agrave; vos questions au moment venu &agrave; ce sujet. C'est en fait un proc&egrave;s sur les copyrights d&eacute;sert. Il ne contient aucune revendication sur les copyrights. Il y a certaines revendications sur des contrats pass&eacute;s entre IBM et SCO, et elles seront, au moment voulu, r&eacute;gl&eacute;es par la cour, et j'attends avec un int&eacute;r&ecirc;t mod&eacute;r&eacute; leur conclusions. Ce n'est en aucun cas une menace pour le logiciel libre. Mais une sacr&eacute;e nuisance certainement. Et je pense, malheureusement, continuer &agrave; passer une bonne partie de mon temps &agrave; &eacute;liminer cette nuisance, mais sans beaucoup de sentiment d'une menace planant sur les choses auquelles je tiens vraiment, dont tout ceci ne fait pas partie.

source: So instead I want to talk about the legal future of free software as it actually is, rather than as Mr. McBride sees it, some titanic clash between the American way of life and whatever it is we're supposed to be. I should say about that titanic clash between the American way of life and whoever we are that it rings familiar to me. Increasingly I listen to Mr. McBride and I hear Mr. Ballmer, as perhaps you do as well. That is to say, I treat SCO now as press agentry for the Microsoft monopoly, which has deeper pockets and a longer-term concern with what we are doing.
fr: Donc &agrave; la place je voudrais vous parler sur l'actuel futur l&eacute;gal du logiciel libre, et non pas comme le voit M. McBride, un combat titanesque entre l'&laquo;&nbsp;American way of life&nbsp;&raquo; et ce que nous sommes suppos&eacute;s &ecirc;tre. J'aimerais dire &agrave; propos de ce combat qu'il me semble familier. De plus en plus, j'&eacute;coute M. McBride et j'entends M. Ballmer, ainsi que peut-&ecirc;tre vous aussi. C'est &agrave; dire que je consid&egrave;re maintenant SCO comme outil de presse du monopole de Microsoft, qui a des fonds plus importants et un probl&egrave;me &agrave; plus long terme avec ce que nous faisons.

source: Microsoft's a very wealthy corporation, and it could succeed on a business model of software-as-a-public utility surrounded by services in the 21st century. But for all the profound depth of Mr. Gates' mind, the idea of human freedom is one of those things which doesn't register very well with him. And the idea of transforming his business into a service business, for reasons that are, I think, accessible to us all, doesn't appeal. Therefore, for the survival of the Microsoft monopoly, and I do actually mean its survival, the theory being presented by Mr. McBride that we are doing something horrid to the American way of life must prevail. Regrettably for Microsoft, it won't, because what we are actually doing is more apparent to the world than that propagandistic view will allow for. We at any rate have to go on about our business, which is encouraging the freedom of knowledge and in particular the freedom of technical knowledge, and in doing that, we have to confront the actual challenges presented to us by the world in which we live (which aren't SCO), and so for just a few more moments I want to talk about those.
fr: Microsoft est une soci&eacute;t&eacute; tr&egrave;s riche, et elle pourrait r&eacute;ussir sur le mod&egrave;le &eacute;conomique de logiciel-en-tant-que-service-public au XXI&egrave;me si&egrave;cle. Mais malgr&eacute; toute la profondeur d'esprit de M. Gates, l'id&eacute;e de libert&eacute; de l'&ecirc;tre humain n'est pas quelque chose qu'il enregistre facilement. Et l'id&eacute;e de transformer son affaire en affaire de service, pour des raisons qui je pense, nous sont accessibles &agrave; tous, ne lui pla&icirc;t pas. Donc, pour la survie du monopole de Microsoft, et je veux effectivement parler de survie, la th&eacute;orie de M. McBride que nous sommes en train d'effectuer quelque chose d'horrible &agrave; l'&laquo;&nbsp;American way of life&nbsp;&raquo; doit pr&eacute;valoir. Malheureusement pour Microsoft, ce ne sera pas, parce que ce que nous faisons actuellement est plus visible au monde que ce que sa vision de propagande ne pr&eacute;voit. Nous devons &agrave; tout prix continuer notre travail, qui encourage la libert&eacute; du savoir et en particulier la libert&eacute; du savoir technique, et en faisant cela, nous devons surmonter le d&eacute;fis (qui ne sont pas SCO) que le monde dans lequel nous vivons nous pr&eacute;sente, et donc je voudrais parler juste un petit peu plus de ceux-ci.

source: Software is, in our phrase, free, libre. That is to say, we now have a body of software accessible to everybody on earth so robust and so profound in its possibilities that we are a few man months away from doing whatever it is that anybody wants to do with computers all the time. And of course new things are constantly coming up that people would like to do and they are doing them. In this respect &mdash; I say this with enormous satisfaction &mdash; in this respect the Free Software Movement has taken hold and is now ineradicably part of the 21st century. But there are challenges to the freedom of free software which we need to deal with.
fr: Le logiciel est, selon notre phras&eacute;ologie, free, libre. C'est &agrave; dire que nous avons maintenant un ensemble de logiciels accessibles &agrave; n'importe qui sur terre, si robustes et si puissants dans leurs possibilit&eacute;s que nous sommes capables en quelques homme-mois de r&eacute;aliser quoi que ce soit que n'importe qui souhaite faire faire &agrave; un ordinateur. Et bien s&ucirc;r de nouvelles choses surgissent constamment que les gens ont envie de faire, et qu'ils font. Dans ce sens, et je le dis avec une &eacute;norme satisfaction, dans ce sens le mouvement pour le logiciel libre a pris place et est d&eacute;finitivement part du XXI&egrave;me si&egrave;cle. Mais il y a des d&eacute;fis pour le logiciel libre que nous devons remporter.
