Repository: gitGNU/gnu_www-fr
Catalog: philosophy/moglen-harvard-speech-2004.*.po
Languages: fr

source: <b>Moglen:</b> The 21st century political economy is different from the past economic history of the human beings because the economy is full of goods that have zero marginal cost. Traditional microeconomic reasoning depends upon the fact that goods in general have non-zero marginal cost. It takes money to make, move, and sell each one. The availability of freedom for all in the world of bitstreams hinges on that non, on that zero marginal cost characteristic of digital information. It is because the marginal cost of computer software is zero that all we have to do is cover the fixed costs of its making in order to make it free to everybody, free not just in the sense of freedom, but also in the sense of beer.
fr: <b>Moglen&nbsp;:</b> L'&eacute;conomie politique du XXI&egrave;me si&egrave;cle est diff&eacute;rente de l'histoire de l'&eacute;conomie pass&eacute;e car cette &eacute;conomie est remplie de biens qui ont un co&ucirc;t marginal nul. Le raisonnement traditionnel de la micro&eacute;conomie d&eacute;pend du fait que les biens en g&eacute;n&eacute;ral ont des co&ucirc;ts marginaux non nuls. Cela co&ucirc;te de l'argent de faire, d&eacute;placer et vendre ces biens. La possibilit&eacute; de libert&eacute; pour tous les flux de bits du monde se base sur cette diff&eacute;rence, sur ce co&ucirc;t marginal nul caract&eacute;ristique de l'information num&eacute;rique. C'est parce que les co&ucirc;ts marginaux du logiciel sont nuls que tout ce que nous avons &agrave; faire est de couvrir les frais fixes de sa fabrication pour le rendre libre pour tout le monde, libre mais aussi gratuit.

source: Hardware, that is computers and, you know PDAs, as well as shoes and tables and bricks in the wall and even seats in a Harvard Law School classroom, has non-zero marginal cost. And the traditional microeconomic reasoning still continues to apply to it in pretty much the way that it did for Adam Smith, David Ricardo, or Karl Marx. Reasoning about hardware is, in that sense, like reasoning about the economy we grew up in and presents all of those questions of how you actually cover the costs of each new unit that the market is designed to help us solve. It's precisely because so much of human knowledge and culture in the 21st century no longer participates in the traditional microeconomics of price, asymptotically reaching towards a non-zero marginal cost, that we experience so much opportunity to give people what they never had before. And when I speak to you about the difference between hardware and software I'm implicitly observing the distinction between the traditional non-zero marginal cost economy and the wonderful and weird economics of bitstreams, in which the traditional microeconomic theory gives the right answers, but traditional microeconomic theorists don't like what they see when they do the chalk work.
fr: Le mat&eacute;riel, c'est-&agrave;-dire les ordinateurs et, vous savez, les PDA, ainsi que les chaussures, les tables, les briques dans les murs et m&ecirc;me les si&egrave;ges dans une salle de cours de la Harvard Law school, ont des co&ucirc;ts marginaux non nuls. Et la micro&eacute;conomie traditionnelle continue de s'y appliquer de la m&ecirc;me mani&egrave;re qu'elle le faisait pour Adam Smith, David Ricardo ou Karl Marx. Raisonner sur le mat&eacute;riel est, dans ce sens, comme raisonner sur l'&eacute;conomie dans laquelle nous avons grandi et qui pr&eacute;sente toutes ces questions de comment effectivement couvrir les co&ucirc;ts de chaque nouvelle unit&eacute;, que le march&eacute; est l&agrave; pour nous aider &agrave; r&eacute;soudre. C'est pr&eacute;cis&eacute;ment parce que tellement de savoir et de culture humaine ne participent plus au XXI&egrave;me si&egrave;cle dans cette &eacute;conomie traditionnelle de prix, tendant de mani&egrave;re asymptotique vers un co&ucirc;t marginal non nul, que nous avons tant de possibilit&eacute;s pour donner aux gens ce qu'ils n'ont jamais eu auparavant. Et quand je vous parle des diff&eacute;rences entre le logiciel et le mat&eacute;riel j'observe implicitement la distinction entre l'&eacute;conomie traditionnelle des co&ucirc;ts marginaux non nuls et la merveilleuse et bizarre &eacute;conomie des flux de bits, dans laquelle la th&eacute;orie traditionnelle de l'&eacute;conomie donne bien la bonne r&eacute;ponse, mais que les th&eacute;oriciens de l'&eacute;conomie traditionnelle n'aiment pas voir quand ils font leur travail.

source: <b>Q:</b> Would you then advocate to, in other words, because knowledge can be contained in hardware, and also hardware has this additional marginal cost, would you advocate every, that for instance, for every computer to come with chip diagrams so that the knowledge in the hardware is free while you can still collect on the marginal cost?
fr: <b>Q&nbsp;:</b> D&eacute;fendriez-vous dans ce cas, en d'autre termes, parce que le savoir ne peux &ecirc;tre contenu dans le mat&eacute;riel, et aussi puisque le mat&eacute;riel a ces co&ucirc;ts marginaux suppl&eacute;mentaires, d&eacute;fendriez-vous que par exemple, que chaque ordinateur soit fourni avec les diagrammes des puces de telle sorte que le savoir dans le mat&eacute;riel soit libre, tout en continuant &agrave; faire du b&eacute;n&eacute;fice sur les co&ucirc;ts marginaux&nbsp;?

source: <b>Moglen:</b> Sure, it would be a very good idea, and if you watch and see what happens in the 21st century you'll see more and more manufacturers deciding to do precisely that, because of the value of empowered user innovation, which will drive down their costs of making new and better products all the time. Indeed for reasons which are as obvious to manufacturers as they are to us, the softwarization of hardware in the 21st century is good for everybody. I'm writing a little bit about that now. I don't mean to plug a book, but wait a little bit and I'll try and show you what I actually think about all of that in a disciplined sort of way.
fr: <b>Moglen&nbsp;:</b> Certainement, ce serait une tr&egrave;s bonne id&eacute;e, et si vous observez ce qui se passe durant le XXI&egrave;me si&egrave;cle vous verrez de plus en plus de fabricants faire pr&eacute;cis&eacute;ment cela, gr&acirc;ce &agrave; la valeur de l'innovation parl'utilisateur, qui ne va cesser de faire diminuer leurs co&ucirc;ts de fabrication de nouveaux et meilleurs produits. C'est effectivement pour ces raisons qui sont aussi &eacute;videntes aux fabricants qu'&agrave; nous, que la logiciellisation du mat&eacute;riel au XXI&egrave;me si&egrave;cle est bonne pour tout le monde. Je suis en train d'&eacute;crire quelque chose &agrave; ce sujet. Je ne veux pas faire la r&eacute;clame de mon livre, mais attendez un peu et j'essayerai de vous montrer ce que je pense r&eacute;ellement &agrave; propos de tout ceci d'une mani&egrave;re disciplin&eacute;e.

source: <b>Q:</b> I was wondering if the SCO lawsuit might be the first of what could become a series of lawsuits filed ad seriatim and in parallel against free software? And wanted to get your view on two possible types of lawsuits that could follow on the heels of SCO, regardless of whether SCO won or lost. The first would be a lawsuit filed by a company that to its shock and amazement found that instead of its programmers hoping for their first house, working on the stuff they were supposed to work on by day, they were in fact spending most of their time Slashdot and the rest of their time coding free software, and then occasionally staying up late to do something for the old man. If those programmers have signed, which is typical, agreements with their company that says any software they write actually is property of the company, maybe even a work for hire, what is the prospect that a company could then say, Our code through that coder has been worked in to something like Linux, and it is now infringing unless we are paid damages? The second possible way in which you could see this kind of lawsuit come up would be, oddly enough, through the thirty-five year termination rule, something that normally would be heralded by people in your position, to say copyright law allows musicians and artists who stupidly signed agreements when they were but small peons, without legal assistance with big companies, thirty-five years later can take it all back, no matter what. They can reset the clock to zero and re- negotiate. I call this the Rod Stewart Salvation Act. [laughter] And while that might be helpful for the artists, much as the music industry hates it, couldn't that also mean that free software coders, who willingly contributed, weren't even blocked by their employers, to contribute to Free Software Movement, could &mdash; down the line &mdash; and thirty-five years isn't that long in the history of Unix, say, &ldquo;We take it all back?&rdquo;
fr: <b>Q&nbsp;:</b> Je me demandais si le proc&egrave;s SCO pourrait devenir le premier d'une longue s&eacute;rie de proc&egrave;s intent&eacute;s en s&eacute;rie (ad seriatim) et en parall&egrave;le contre le logiciel libre&nbsp;? Et je voudrais conna&icirc;tre votre point de vue sur deux types possibles de proc&egrave;s qui pourraient suivre le chemin trac&eacute; par SCO, que SCO gagne ou non. Le premier serait un proc&egrave;s intent&eacute; par une compagnie qui se rendrait soudainement compte qu'au lieu d'esp&eacute;rer pour l'achat de leur premi&egrave;re maison, en r&eacute;alisant le travail qu'ils sont suppos&eacute;s faire, ses d&eacute;veloppeurs passeraient en r&eacute;alit&eacute; la moiti&eacute; de leur temps sur Slashdot et le reste de leur temps codant des logiciels libres, et seulement occasionnellement restant tard le soir pour satisfaire le patron. Si ces programmeurs ont sign&eacute;, ce qui est habituel, un accord avec leur compagnie qui stipule que n'importe quel logiciel qu'ils &eacute;crivent est en fait propri&eacute;t&eacute; de leur compagnie, quelle est la perspective que cette compagnie puisse dire&nbsp;: notre code a &eacute;t&eacute; retravaill&eacute; par notre programmeur dans quelque chose comme Linux, et c'est maintenant ill&eacute;gal &agrave; moins que vous ne nous payez des dommages&nbsp;? La deuxi&egrave;me possibilit&eacute; pour monter ces proc&egrave;s serait, quoique cela paraisse &eacute;trange, gr&acirc;ce &agrave; la &laquo;&nbsp;thirty-five year termination rule&nbsp;&raquo; (loi de prescriptoin des 35 ans), c'est-&agrave;-dire quelque chose qui normalement serait proclam&eacute;e par des gens dans votre position, qui dit que la loi sur les copyrights autorise les musiciens et artistes ayant stupidement sign&eacute; des accords quand ils n'&eacute;taient encore rien et sans assistance l&eacute;gale avec de grosses compagnies &agrave; l'annuler trente-cinq ans plus tard, quelle que soit les conditions. Ils peuvent remettre les pendules &agrave; z&eacute;ro et ren&eacute;gocier. Je l'appelle le Rod Stewart Salvation Act (loi pour la sauvegarde de Rod Stewart). [rires] Et bien que cela puisse &ecirc;tre utile pour les artistes, bien que l'industrie musicale le d&eacute;teste, ne pourrait-ce pas signifier &eacute;galement que les programmeurs de logiciel libre, ayant volontairement contribu&eacute;, sans m&ecirc;me &ecirc;tre bloqu&eacute;s par leurs employeurs, ayant contribu&eacute; au mouvement pour le logiciel libre, pourraient dire, &agrave; l'&eacute;ch&eacute;ance, et trente-cinq ans ne sont pas si longs dans l'histoire d'Unix, &laquo;&nbsp;Nous reprenons tout&nbsp;&raquo;&nbsp;?

source: <b>Moglen:</b> So, those are two very good questions. If I answer each one of them fully, I'm going to take too long. Let me concentrate on the first one, because I think it's really quite important. What Jonathan's question does is point out to you that the great legal issues in the freedom of free software have less to do with the license than with the process of assembly by which the original product is put together. One of the legal consequences of the SCO affair is that people are going to start to pay closer attention all the time to how free software products are put together. They are going to discover that what really matters is how you deal with the questions of, for example, possible lurking work-for-hire claims against free software. They're going to discover that in this respect, too, Mr. Stallman was quite prescient, because they are going to recognize that the way they want their free software put together is the way the Free Software Foundation put it together since now more than twenty years. The way we're going, they're going to discover that they really would like to have it, is for each individual contribution of code to a free software project, if the guy who contributed the code was working in the industry, they would really like to have a work-for-hire disclaimer from the guy's employer, executed at the same time that the contribution was made. And the filing cabinets at the Free Software Foundation are going to look to them like an oasis in a desert of possible problems. We saw that problem coming. We have tried in our act as stewards over a large part of the free software in the world to deal with it. People are going to want to have that up front for everything that they can possibly, and they're going to be much more reluctant to rely on software that wasn't assembled in those ways.
fr: <b>Moglen&nbsp;:</b> Bon, ce sont deux tr&egrave;s bonnes questions. Si je r&eacute;ponds compl&egrave;tement &agrave; chacune, je vais prendre trop de temps. Laissez-moi donc me concentrer sur la premi&egrave;re, qui &agrave; mon avis est vraiment importante. La question de Jonathan vous montre que le grand probl&egrave;me l&eacute;gal dans la libert&eacute; du logiciel libre a moins &agrave; voir avec la licence qu'avec le proc&eacute;d&eacute; d'assemblage par lequel le produit original est mis en place. Une des cons&eacute;quences l&eacute;gales du proc&egrave;s SCO est que les gens vont commencer &agrave; tout le temps faire plus attention &agrave; la mani&egrave;re dont les logiciels libres sont mis en place. Ils vont s'apercevoir que ce qui importe vraiment est comment r&eacute;glez-vous la question, par exemple, de possible attraction de revendication de &laquo;&nbsp;work-for-hire&nbsp;&raquo; contre le logiciel libre. Ils vont s'apercevoir que dans cet aspect-l&agrave; &eacute;galement, M. Stallman a &eacute;t&eacute; plut&ocirc;t pr&eacute;voyant, puisqu'ils vont reconna&icirc;tre que la mani&egrave;re dont ils veulent que leurs logiciels libres soient mis en place est la mani&egrave;re utilis&eacute;e par la Fondation pour le logiciel libre depuis plus de vingt ans. La mani&egrave;re dont nous proc&eacute;dons, ils vont d&eacute;couvrir qu'ils aimeraient vraiment l'avoir, est que pour chaque contribution individuelle de code &agrave; un projet de logiciel libre, si cette personne ayant fourni le code travaillait dans l'industrie, ils voudraient vraiment avoir une d&eacute;charge &laquo;&nbsp;work-for-hire&nbsp;&raquo; de la part de l'employeur de cette personne, &eacute;tabli en m&ecirc;me temps que la contribution a &eacute;t&eacute; effectu&eacute;e. Et les bureaux (filing cabinets) &agrave; la Fondation pour le logiciel libre vont leur appara&icirc;tre comme une oasis au milieu d'un d&eacute;sert de probl&egrave;mes possibles. Nous avons vu venir ce probl&egrave;me. Nous avons essay&eacute; dans nos actions de stewards pour une grande part du logiciel libre dans le monde de g&eacute;rer ce probl&egrave;me. Les gens vont vouloir avoir ceci pour ce pour quoi ce sera possible, et ils seront bien plus r&eacute;fractaires &agrave; s'appuyer sur du logiciel qui n'aura pas &eacute;t&eacute; assembl&eacute; de cette fa&ccedil;on-l&agrave;.

source: If you are thinking about working in the law of free software, and gosh, I hope you are, one of the things you might want to be thinking about working on is the software conservation trusts that are going to be growing up around this economy in the next five years. I'll help you make one, or you can come to work in one of mine. We're going to need to spend a lot of time doing work which is associated with trustees. We're going to be spending a lot of time making sure that things are put together and they are built well. And we are going to be doing that on behalf of a third-party insurance industry which is going to be growing up, is growing up before our very eyes now, which is learning that it really cares how the free software is assembled.
fr: Si vous envisagez de travailler dans le domaine l&eacute;gal du logiciel libre, et j'esp&egrave;re bien que c'est le cas, une des choses sur lesquelles vous pourriez vouloir travailler sont les trusts de conservation du logiciel qui vont &eacute;clore dans ce domaine dans les cinq prochaines ann&eacute;es. Je vous aiderai &agrave; en faire un, ou vous pouvez venir travailler dans un des miens. Nous allons avoir besoin de passer beaucoup de temps &agrave; faire du travail en lien avec les &laquo;&nbsp;trustees&nbsp;&raquo;. Nous allons passez beaucoup de temps &agrave; nous assurer que les choses soient assembl&eacute;es et bien b&acirc;ties. Et nous allons faire cela pour le compte d'une industrie d'assurance qui va bient&ocirc;t grandir, qui grandit d&eacute;ja m&ecirc;me sous nos yeux, et qui apprend qu'elle s'int&eacute;resse vraiment &agrave; la mani&egrave;re dont le logiciel libre est assembl&eacute;.

source: When you go to an insurance company and ask for fire insurance on your house, they don't want to know how your house is licensed. They want to know how your house is built. And the questions you are asking about how the free software is built are about to become really important questions. What will abate those lawsuits is that we did our work well or that we are doing our work well as lawyers, assisting programmers to put projects together in defensible ways that protect freedom.
fr: Quand vous allez dans une compagnie d'assurance et demandez une assurance contre l'incendie pour votre maison, ils ne cherchent pas &agrave; savoir sous quelle licence est plac&eacute;e votre maison. Ils veulent savoir comment elle a &eacute;t&eacute; construite. Et les questions que vous posez sur comment est-ce que le logiciel libre est construit vont devenir vraiment importantes. Ce qui va briser ces proc&egrave;s est que nous avons bien fait notre travail ou que nous faisons bien notre travail d'avocats, en aidant les programmeurs &agrave; mettre en place leurs projets de mani&egrave;re d&eacute;fensive et qui prot&egrave;ge la libert&eacute;.

source: Up until the day before yesterday, there were probably three lawyers on earth who cared a lot about that, and two of them are in this room. There will be more in the near future. I will say quickly about your second question, Jonathan, that the problem presented is a serious problem, but, at least from my point of view, a manageable one, and I'm willing to talk more about why, but I think we ought to get more voices into the conversation.
fr: Jusqu'&agrave; il n'y a pas si longtemps, il y avait probablement trois avocats sur Terre qui s'int&eacute;ressaient &agrave; ce sujet, et deux d'entre eux sont dans cette pi&egrave;ce. Il y en aura plus dans un futur proche. Je dirai rapidement &agrave; propos de votre seconde question Jonathan, que le probl&egrave;me pr&eacute;sent&eacute; est s&eacute;rieux, mais au moins &agrave; mon point de vue, qu'il est g&eacute;rable, et je voudrais bien en parler plus, mais je pense que nous devrions entendre plus de voix dans cette discussion.

source: <b>Q:</b> Without disputing the importance or difficulty of the spectrum battle, or the &hellip; clearly the copyright battle and progress is very immediate, but it seems to me that most worrisome right now is the patent battle that I expect to come next. Compared to that, the whole thing with SCO, well, SCO is a paper dragon, a hollow threat. Can you say anything about what you expect that battle to look like? And how it will be fought? How it can be?
fr: <b>Q&nbsp;:</b> Sans contester l'importance ou la difficult&eacute; de la bataille pour la bande passante, ou le&hellip; clairement la bataille sur le copyright et ses progr&egrave;s sont vraiment imm&eacute;diats, mais il me semble que ce qui nous donnera vraiment du souci est la bataille sur les brevets qui je pense va arriver bient&ocirc;t. Compar&eacute; &agrave; cela, toute l'histoire du SCO, eh bien, SCO est un dragon de papier, une menace fant&ocirc;me. Pouvez-vous nous dire quoi que ce soit sur ce que vous attendez de cette prochaine bataille&nbsp;? Et comment sera-elle combattue&nbsp;? Comment cela va-t-il se passer&nbsp;?

source: <b>Moglen:</b> Sure. Patents are about politics. I thought that the pharmaceuticals companies did my side a favor by buying us 12 trillion dollars in free publicity in the last half decade by teaching every literate twelve year old on earth that &ldquo;intellectual property&rdquo; means people dying of preventable diseases because the drugs are too expensive because patents cover them.
fr: <b>Moglen&nbsp;:</b> Bien s&ucirc;r. Les brevets sont un probl&egrave;me politique. Je pensais que les compagnies pharmaceutiques m'avaient rendu service en nous achetant 12 milliards de dollars de publicit&eacute; libre dans la derni&egrave;re d&eacute;cennie en apprenant &agrave; chaque enfant de douze ans scolaris&eacute; sur terre que &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; signifiait des gens mourant &agrave; cause de maladies curables parce que les m&eacute;dicaments &eacute;taient trop chers &agrave; cause des brevets les prot&eacute;geant.

source: Patents are politics. Patents are about how we distribute wealth over very long periods of time, in quite absolute ways. We're not going to have an answer to our patent problem which lies in courtrooms or in laboratories. We're going to have an answer to our patent problems which lies in the actual conduct of politics.
fr: Les brevets sont politiques. Les brevets dirigent comment nous distribuons les richesses sur de tr&egrave;s longues p&eacute;riodes, d'une fa&ccedil;on plut&ocirc;t absolue. Nous n'allons pas trouver de r&eacute;ponse &agrave; notre probl&egrave;me de brevets dans nos salles de justice ou nos laboratoires. Nous allons devoir r&eacute;pondre &agrave; notre probl&egrave;me de brevets qui se situe dans la conduite actuelle de la politique.

source: You saw the beginning of it this past summer when the European Parliament decided, in a very unusual move, to refuse, and to refuse promulgation to the European Commission's preferences with respect to changes in patent law in Europe regarding inventions practiceable in software.
fr: Vous en avez vu le d&eacute;but l'&eacute;t&eacute; dernier quand le Parlement Europ&eacute;en a d&eacute;cid&eacute; de refuser, dans un mouvement tout &agrave; fait inhabituel, de refuser la publication des pr&eacute;f&eacute;rences de la Commission Europ&eacute;enne en ce qui concerne les changements des lois concernant les brevets en Europe &agrave; propos des inventions praticables dans le domaine logiciel.
