Repository: gitGNU/gnu_www-fr
Catalog: philosophy/moglen-harvard-speech-2004.*.po
Languages: fr

source: Patent law, unlike copyright law, presents certain features which are egregious for the freedom of technical knowledge. If the copyright law presents a workable form of the great 18th century ambition of the perfectability of human kind, the patent law regrettably does not. This is not surprising, 18th century thinkers were a little dubious about the patent law as well. They had a concern for statutory monopolies and a deep history of English law that made them worry about them very much. Patent law in the 21st century is a collection of evil nuisances. There's no question about it. And in the world of software where we exist, there are some particularly unfortunate characteristics of the way that the patent law works. We are going to have to work hard to make sure that the legitimate scope of patent, which is present, but which is small, is not expanded by careless administrators any further in the course of the 21st century to cover the ownership of ideas merely because those ideas are expressed in computer programming languages rather than in, say, English or mathematics.
fr: La loi sur les brevets, contrairement &agrave; celle sur les copyrights, contient certains aspects effrayants pour la libert&eacute; du savoir technique. Si la loi sur les copyrights pr&eacute;sente une forme utilisable de la grande ambition du XVIII&egrave;me si&egrave;cle de la perfectibilit&eacute; de l'&ecirc;tre humain, la loi sur les brevets ne le fait malheureusement pas. Ce n'est pas surprenant, les penseurs du XVIII&egrave;me si&egrave;cle &eacute;taient &eacute;galement quelque peu sceptiques &agrave; propos de la loi sur les brevets. Ils s'interrogeaient &agrave; propos du statut de monopole et l'histoire de la justice anglaise leur faisait beaucoup s'inqui&eacute;ter &agrave; ce sujet. La loi sur les brevets au XXI&egrave;me si&egrave;cle est un ramassis de nuisances. Cela ne pose aucune question. Et dans le monde de logiciel dans lequel nous nous trouvons, il y a certaines caract&eacute;ristiques particuli&egrave;rement malheureuses selon lesquelles cette loi fonctionne. Nous allons devoir travailler dur pour nous assurer que la port&eacute;e l&eacute;gitime du brevet, qui existe, mais est restreinte, ne soit pas &eacute;tendue par des administrateurs peu scrupuleux au cours du XXI&egrave;me si&egrave;cle pour couvrir la paternit&eacute; d'id&eacute;es principalement parce que ces id&eacute;es sont exprim&eacute;es en langage de programmation informatique plut&ocirc;t que, par exemple, en anglais ou en termes math&eacute;matiques.

source: This is work for us, and it is work for us which a lot of smart lawyers are doing, but they are doing it around the world in various licenses and other legal structures connected with software in inconsistent ways. And the inconsistency among the ways in which lawyers are attempting to cope with the threats posed to software by patents are a serious difficulty for us. We need to conduct a very high-level seminar in the next five years around the world over the relationship between patentability and free software ideas and get square for ourselves what license terms and ways of working minimize the risks posed by patents. There is what I would characterize at the moment as a constructive diversity of views on that subject. But the diversity will have to be thinned a little bit through an improvement of our thought processes if we are by the end of this decade to have done what we need to do in subduing the growth of inappropriate patenting and its effect on our particular form of human knowledge enhancement.
fr: C'est du travail pour nous, et c'est un travail que de nombreux avocats intelligents sont en train de faire, mais ils le font partout dans le monde sur des licences vari&eacute;es et d'autres structures l&eacute;gales connect&eacute;es au logiciel de mani&egrave;re inconsistante. Et l'inconsistance parmi les mani&egrave;res dont les avocats essayent de lutter contre les menaces pos&eacute;es au logiciel par les brevets et une difficult&eacute; s&eacute;rieuse pour nous. Nous avons besoin de conduire un s&eacute;minaire de haut-niveau dans les cinq prochaines ann&eacute;es partout dans le monde sur les relations entre la brevetabilit&eacute; et l'id&eacute;e du logiciel libre, et rendre clair pour nous-m&ecirc;mes quels termes de licence et mani&egrave;re de travailler minimise les risques pos&eacute;s par les brevets. Il y a ce que je caract&eacute;riserais pour le moment comme une diversit&eacute; de point de vue sur le sujet. Mais cette diversit&eacute; devra &ecirc;tre r&eacute;duite un petit peu par une am&eacute;lioration de notre fa&ccedil;on de penser si nous voulons &agrave; la fin de cette d&eacute;cade achever ce que nous avons &agrave; faire en diminuant le volume de brevets inappropri&eacute;s et leurs effets sur notre forme particuli&egrave;re d'am&eacute;lioration du savoir humain.

source: As you are aware, and as I am spending a year writing a book about, there are lots of other things going on in the Net about ownership. Music and movies and various other forms of culture are being distributed better by children than by people that are being paid to do the work. Artists are beginning to discover that if they allow children to distribute art in a freehanded sort of way, they will do better than they do in the current slavery in which they are kept by the culture vultures, who do, it is true, make a good deal of money out of music, but they do so primarily by keeping ninety-four cents out of every dollar and rendering six to the musicians, which isn't very good for the musicians.
fr: Comme vous le savez, et comme j'ai pass&eacute; un an &agrave; &eacute;crire un livre sur le sujet, il se passe de nombreuses autres choses en ce moment sur Internet au sujet de la propri&eacute;t&eacute;. La musique, les films et d'autres formes vari&eacute;es de culture sont mieux distribu&eacute;es par des enfants que par des personnes pay&eacute;es pour le faire. Les artistes commencent &agrave; d&eacute;couvrir que s'ils autorisent des enfants &agrave; distribuer leurs &oelig;uvres d'une mani&egrave;re libre, ils s'en sortiront mieux que dans leur esclavage actuel dans lequel ils sont maintenus par les vautours de la culture, qui, c'est vrai, se font un paquet d'argent gr&acirc;ce &agrave; la musique, mais qui le font tellement primairement en gardant 94 cents de chaque dollar et en en rendant uniquement 6 aux musiciens, ce qui n'est pas tr&egrave;s bon pour les musiciens.

source: So there is a great deal of fuss going on about ownership in the Net, and since I care about more than just free software, I care about that fuss. I have a side over there too. But the important thing for us in the conversation we're presently having is that the owners of culture now recognize that if they are going to prop up their own methods of distribution, a method of distribution in which distribution is bought and sold and treated as property &mdash; and you can't distribute unless you pay for the right to do so &mdash; unless they can prop up that structure, they are done in their business models. And for them that requires something which I truly believe amounts to the military occupation of the Net. They have to control all the nodes in the Net and make sure that the bitstreams that pass through those nodes check in before they go some place that the right of distribution hasn't been bought or sold in order to permit that bitstream to go.
fr: Donc il y a beaucoup de bruit en ce moment sur Internet &agrave; propos de la propri&eacute;t&eacute;, et puisque je m'int&eacute;resse &agrave; d'autres choses que le logiciel libre, je m'int&eacute;resse &agrave; ce bruit. J'ai un parti-pris l&agrave;-dessus &eacute;galement. Mais la chose importante pour la discussion que nous avons maintenant est que les propri&eacute;taires de la culture reconnaissent maintenant que s'ils vont devoir mettre en place leurs propres m&eacute;thodes de distribution, une m&eacute;thode de distribution dans laquelle la distribution est achet&eacute;e et vendue et trait&eacute;e comme un bien &mdash;et dans lequel vous ne pouvez distribuer si vous ne payez pas les droits pour le faire&mdash; s'ils ne peuvent mettre en place cette structure, ils sont fichus dans leur mod&egrave;le &eacute;conomique. Et cela exige d'eux ce que je crois vraiment &ecirc;tre comparable &agrave; une occupation militaire d'Internet. Ils doivent contr&ocirc;ler tous les n&oelig;uds d'Internet et s'assurer de chaque flux de bits qui transite &agrave; travers ces n&oelig;uds, avant qu'ils n'aillent ailleurs, que les droits de distribution n'aient pas &eacute;t&eacute; achet&eacute;s ou vendus afin de laisser passer ce flux.

source: It is precisely because software is free, that the owners of culture have to occupy the hardware of the Net in order to make good their business model. Free software, like, for example, Ian Clark's Freenet or other forms of free software that engages in peer-to-peer sharing of data, or for that matter just free software like TCP/IP which is meant for sharing data, presents overwhelming obstacles to people who want every single bitstream to bear requirements of ownership and distribution inside it and to go only to the places that have paid to receive it. The result is an increasing movement to create what is in truly Orwellian fashion referred to as trusted computing, which means computers that users can't trust. In order to continue to move for the freedom of knowledge in 21st century society, we have to prevent trusted computing and its various ancillary details from constituting the occupation of the hardware of the Net, to prevent the hardware from running free software that shares information freely with people who want to share. Beating the trusted computing challenge is a difficult legal problem, more difficult for the lawyer in dealing with licensing and the putting together of software products than the original problem presented by freeing free software in the first place. This, more than the improvement of the free software distribution structure as we currently know it, is the problem most before my mind these days.
fr: C'est pr&eacute;cis&eacute;ment parce que le logiciel est libre, que les propri&eacute;taires de la culture ont besoin d'occuper le mat&eacute;riel d'Internet pour faire marcher leur mod&egrave;le &eacute;conomique. Le logiciel libre, comme par exemple Freenet de Ian Clark, ou d'autres exemples de logiciels libres, qui s'occupe de partage de donn&eacute;es pair-&agrave;-pair, ou simplement du logiciel libre comme TCP/IP qui est utilis&eacute; pour partager des donn&eacute;es, pr&eacute;sente d'insurmontables obstacles aux personnes qui veulent que chaque flux de bits porte en lui les authentifications de propri&eacute;t&eacute; et de distribution et veulent le faire aller uniquement aux endroits qui ont pay&eacute; pour le recevoir. Le r&eacute;sultat est un mouvement croissant pour cr&eacute;er ce qui est r&eacute;ellement une mode &agrave; la Orwell nomm&eacute;e informatique de confiance, ce qui signifie des ordinateurs en lesquels les utilisateurs ne peuvent avoir confiance. Afin de continuer &agrave; avancer pour la lib&eacute;ration du savoir dans notre soci&eacute;t&eacute; du XXI&egrave;me si&egrave;cle, nous devons emp&ecirc;cher l'informatique de confiance et ses variantes de constituer une occupation du mat&eacute;riel d'Internet dans le but d'emp&ecirc;cher ce mat&eacute;riel de faire fonctionner des logiciels libres qui partagent l'information librement avec les personnes d&eacute;sireuses de la partager. Remporter le d&eacute;fi pos&eacute; par l'informatique de confiance est un probl&egrave;me l&eacute;gal difficile, plus difficile pour l'avocat dans sa gestion des licences et dans la mise en place de produits logiciels que le probl&egrave;me d'origine pr&eacute;sent&eacute; par la lib&eacute;ration de logiciel vers le libre en premier lieu. Ceci, plus que l'am&eacute;lioration de la structure de distribution du logiciel libre comme nous la connaissons actuellement, est le probl&egrave;me que j'ai &agrave; l'esprit en ce moment.

source: But I would take one more step with you to discuss the problem that lies behind the problem of free hardware. We are living now in a world in which hardware is cheap and software is free, and if all the hardware continues to work pretty much the way it works now, our major problem will be that bandwidth is now treated in the world also as a product, rather than a public utility. And you are allowed to have, in general, as much bandwidth as you can pay for. So then in the world in which we now exist, though hardware is cheap and software is free, there are major difficulties in disseminating knowledge and encouraging the diffusion of science and the useful arts, because people are too poor to pay for the bandwidth that they require in order to learn.
fr: Mais j'irai un peu plus loin avec vous pour discuter du probl&egrave;me qui se trouve derri&egrave;re le probl&egrave;me du mat&eacute;riel libre. Nous vivons actuellement dans un monde dans lequel le mat&eacute;riel est bon march&eacute; et le logiciel gratuit, et si tout le mat&eacute;riel continue de marcher de la mani&egrave;re actuelle, notre probl&egrave;me majeur sera que la bande passante est maintenant trait&eacute;e dans le monde comme un produit, plut&ocirc;t qu'un service public. Et vous &ecirc;tes en g&eacute;n&eacute;ral autoris&eacute; &agrave; recevoir autant de bande passante que ce que vous pouvez en acheter. Donc dans le monde actuel, bien que le mat&eacute;riel est bon march&eacute; et que le logiciel est gratuit, il y a des difficult&eacute;s majeures &agrave; la diss&eacute;mination du savoir et &agrave; l'encouragement de la diffusion des sciences, parce que les gens sont trop pauvres pour payer la bande passante dont ils ont besoin pour apprendre.

source: This arises from the fact that the electromagnetic spectrum too has been treated as property since the second quarter of the 20th century. That was said to be technically necessary as a result of technical problems with interference that are no longer relevant in the world of intelligent devices. The single greatest free software problem in the 21st century is how to return the electromagnetic spectrum to use by sharing rather than use-by-propertization. Here again, as you will notice, free software itself, free executable software, has a major role to play. Because it is software-controlled radios, that is to say devices whose operating characteristics are contained in software and can be modified by their users, that reclaim the spectrum for shared rather than propertarian use. Here is the central problem that we will be dealing with, not at the end of this decade, but for the two or three decades that follow, as we seek to improve access to knowledge around the world for every human mind. We will be dealing with the question of how to make the technical and legal tools under our control free the spectrum.
fr: Cela provient du fait que le spectre &eacute;lectromagn&eacute;tique a &eacute;t&eacute; trait&eacute; comme une propri&eacute;t&eacute; depuis le second quart du XX&egrave;me si&egrave;cle. Il a &eacute;t&eacute; dit que c'&eacute;tait techniquement n&eacute;cessaire, d&ucirc; &agrave; des probl&egrave;mes techniques d'interf&eacute;rences qui ne sont plus d'actualit&eacute; dans le monde actuel des appareils intelligents.L'unique probl&egrave;me majeur du logiciel libre au XXI&egrave;me si&egrave;cle est comment rendre le spectre &eacute;lectromagn&eacute;tique &agrave; l'utilisation partag&eacute;e plut&ocirc;t qu'&agrave; l'utilisation par appropriation. Ici encore, comme vous l'aurez remarqu&eacute;, le logiciel libre lui-m&ecirc;me, logiciel librement ex&eacute;cutable, a un r&ocirc;le majeur &agrave; jouer. Parce que ce sont les radios contr&ocirc;l&eacute;es par du logiciel, c'est-&agrave;-dire les appareils dont les caract&eacute;ristiques fonctionnelles sont contenues dans le logiciel et peuvent &ecirc;tre modifi&eacute;es par leurs utilisateurs, qui r&eacute;clament le spectre partag&eacute; plut&ocirc;t qu'appropri&eacute;. C'est le probl&egrave;me central auquel nous devrons faire face, non pas &agrave; la fin de cette d&eacute;cade, mais pour les deux ou trois prochaines d&eacute;cades suivantes, dans notre effort pour am&eacute;liorer l'acc&egrave;s au savoir partout dans le monde pour tous les esprits humains. Nous aurons &agrave; r&eacute;gler la question de comment lib&eacute;rer le spectre gr&acirc;ce aux outils techniques et l&eacute;gaux sous notre contr&ocirc;le.

source: In attempting that trick, we will be confronting a series of owners far more powerful than Microsoft and Disney. You need only consider the actual embedded power of the telecommunications oligopolists in the society around you to recognize just what an uphill battle that one will be. That's the one that we must win if we are to approach the middle of the 21st century in a world in which knowledge is freely available to be shared by everybody. We must see to it that everyone has a birthright in bandwidth, a sufficient opportunity to communicate, to be able to learn on the basis of access to all the knowledge that is there. This is our greatest legal challenge. The freedom of the software layer in the Net is an essential component in that crusade. Our ability to prevent the devices that we use from being controlled by other people is an essential element in that campaign.
fr: Dans cet effort, nous allons affronter une s&eacute;rie de propri&eacute;taires bienplus puissants que Microsoft et Disney. Vous avez simplement &agrave; consid&eacute;rer l'actuel pouvoir des oligopoles de t&eacute;l&eacute;communications implant&eacute;es dans notre soci&eacute;t&eacute; pour reconna&icirc;tre le type d'affrontement que celui-ci sera. C'est celui que nous devons remporter si nous voulons atteindre le milieu du XXI&egrave;me si&egrave;cle dans un monde au sein duquel le savoir sera librement disponible pour &ecirc;tre partag&eacute; par tout le monde. Nous devons faire en sorte que chacun ait un droit &agrave; la bande passante, une opportunit&eacute; suffisante pour communiquer, pour &ecirc;tre capable d'apprendre sur la base de l'acc&egrave;s &agrave; tout le savoir disponible.C'est notre plus grand d&eacute;fi l&eacute;gal. La libert&eacute; de la couche logicielle d'Internet est un composant essentiel de cette croisade. Notre capacit&eacute; &agrave; emp&ecirc;cher les appareils que nous utilisons d'&ecirc;tre contr&ocirc;l&eacute;s par d'autres personnes est un &eacute;l&eacute;ment essentiel de cette campagne.

source: But in the end, it is our ability to unify all of the elements of the information society &mdash; software, hardware, and bandwidth &mdash; in shared hands, that is in our own hands, that determines whether we can succeed in carrying out the great 18th century dream, the one that is found in Article 1 Section 8 of the United States Constitution, the one that says that human beings and human society are infinitely improvable if only we take the necessary steps to set the mind free. That's where we are really going. Mr. McBride's company's fate, whether it succeeds or fails, even the fate of the International Business Machine corporation, is small compared to that. We are running a civil rights movement. We're not trying to compete everybody out of business, or anybody out of business. We don't care who succeeds or fails in the marketplace. We have our eyes on the prize. We know where we are going: Freedom. Now.
fr: Mais au final, c'est notre capacit&eacute; &agrave; unifier tous les &eacute;l&eacute;ments de la soci&eacute;t&eacute; de l'information &mdash;logiciel, mat&eacute;riel, bande passante&mdash; entre des mains partag&eacute;es, c'est-&agrave;-dire entre nos propres mains, qui d&eacute;termine si nous pouvons r&eacute;ussir dans la r&eacute;alisation du grand r&ecirc;ve du XVIII&egrave;me si&egrave;cle, celui qui se trouve dans l'Article 1, Section 8 de la Constitution des &Eacute;tats-Unis, celui qui dit que les &ecirc;tres humains et la soci&eacute;t&eacute; humaine sont am&eacute;liorables infiniment pour peu que nous achevions les &eacute;tapes n&eacute;cessaires &agrave; la lib&eacute;ration de l'esprit. C'est l&agrave; ce &agrave; quoi nous tendons r&eacute;ellement. Le destin de la compagnie de M. McBride, qu'elle r&eacute;ussisse ou &eacute;choue, m&ecirc;me le destin de la corporation International Business Machine, est n&eacute;gligeable compar&eacute; &agrave; cela. Nous menons un mouvement de droits civiques. Nous n'essayons pas de concurrencer quiconque dans les affaires ni de faire tomber quiconque. Qui r&eacute;ussit ou &eacute;choue en bourse ne nous int&eacute;resse pas. Nous avons le regard fix&eacute; sur l'objectif. Nous savons o&ugrave; nous allons&nbsp;: Libert&eacute;. Maintenant.

source: Thank you very much.
fr: Merci beaucoup.

source: I'm delighted to take your questions:
fr: Je suis ravi de pouvoir r&eacute;pondre &agrave; vos questions&nbsp;:

source: <b>Zarren:</b> So, I've been asked by the media services people to make sure that when people ask their questions, if they could speak into the microphone, that would be good. There's a little button that turns it on.
fr: <b>Zarren&nbsp;:</b> Donc, les personnes du service des m&eacute;dias m'ont demand&eacute; de m'assurer que quand les gens posent leurs questions, ce serait bien qu'elles puissent parler dans le micro. Il y a un petit bouton pour l'allumer.

source: <b>Q:</b> I just wanted to ask a question clarifying and, well, anyway&hellip; You seem to, or not, have expressed a dichotomy between software and hardware, in the sense that software needs to be free, software is a utility, a public good. Hardware you don't talk about so much. And by hardware, initially I mean related to software but then generalizable to machines, just any kind of machine. How do you distinguish why should software be free and hardware not?
fr: <b>Q&nbsp;:</b> Je voulais simplement poser une question de clarification et, enfin bref&hellip; Vous semblez, ou non, avoir exprim&eacute; une dichotomie entre le mat&eacute;riel et le logiciel, dans le sens que le logiciel a besoin d'&ecirc;tre libre, que c'est un service, un bien public. Vous n'avez que peu parl&eacute; du mat&eacute;riel. Et par mat&eacute;riel, je pense initialement &agrave; celui reli&eacute; au logiciel mais ensuite g&eacute;n&eacute;ralisable aux machines, n'importe quelle sorte de machine. Comment distinguez-vous pourquoi le logiciel devrait &ecirc;tre libre et pas le mat&eacute;riel&nbsp;?
