Repository: gitGNU/gnu_www-fr
Catalog: philosophy/moglen-harvard-speech-2004.*.po
Languages: fr

source: You, as a lawyer, will either engage in assisting to protect the commons or not protect the commons. This is a form of natural resources law for the 21st century. It is about the recognition that no machine will go of itself, that it will require assistance to achieve its goals precisely in the way that you have in mind.
fr: Vous, en tant qu'avocat, vous vous engagerez soit pour la protection du bien commun, soit pour sa non-protection. C'est une forme de loi pour les ressources naturelles du XXI&egrave;me si&egrave;cle. C'est au sujet de la prise de conscience qu'aucune machine ne peut se lancer elle-m&ecirc;me, qu'elle n&eacute;cessitera de l'aide pour pouvoir achever ses buts pr&eacute;cis&eacute;ment de la fa&ccedil;on que vous avez en t&ecirc;te.

source: The best National Park Law on earth won't prevent the poaching of the park if there are not committed people willing to defend it. So you offer a general theory of the possibility of commons destruction and I agree with you. I say two things. We can design a better commons, and we can work our tails off to keep that commons in being healthy, strong and well. That's what I'm up to. That's what I hope you'll be up to as well.
fr: La meilleure loi au monde sur les parcs nationaux n'emp&ecirc;chera par le braconnage s'il n'y a personne volontairement engag&eacute; &agrave; sa d&eacute;fense. Donc vous offrez une th&eacute;orie g&eacute;n&eacute;rale de la possibilit&eacute; de destruction du bien commun et je suis d'accord avec vous. Je dirai deux choses. Nous pouvons &eacute;tablir un meilleur bien commun, et nous pouvons combattre pour pr&eacute;server ce bien commun fort et en bonne sant&eacute;. C'est ce &agrave; quoi je m'emploie. C'est ce &agrave; quoi j'esp&egrave;re, vous vous emploierez &eacute;galement.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;: <ol><li id="TransNote1">&laquo;&nbsp;free as in freedom, not free as in beer&nbsp;&raquo; signifie&nbsp;: libre, pas gratuit.</li></ol>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2004 Eben Moglen <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2004 Eben Moglen <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Marc de Maillard.<br />Révision&nbsp;: <a href="mailto:trad-gnu@april.org">trad-gnu@april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
