Repository: gitGNU/gnu_www-fr
Catalog: philosophy/moglen-harvard-speech-2004.*.po
Languages: fr

source: Eben Moglen Speech - Harvard - 2004
fr: Discours de Eben Moglen - Harvard - 2004

source: Eben Moglen - Speech for Harvard Journal of Law &amp; Technology
fr: Eben Moglen - Discours pour le Harvard Journal of Law and Technology

source: February 23, 2004 - Cambridge, MA, USA
fr: 23 F&eacute;vrier 2004 - Cambridge, Massachusetts, USA.

source: <i>Eben Moglen is a Professor of Law &amp; Legal History at Columbia Law School, and General Counsel for the Free Software Foundation</i>
fr: <i>Eben Moglen est professeur de droit et d'histoire l&eacute;gale &agrave; la Columbia Law School (universit&eacute; de droit de Columbia), et Conseiller G&eacute;n&eacute;ral pour la Fondation pour le logiciel Libre.</i>

source: Thank you. It's a great pleasure to be here. I want to thank the Journal of Law and Technology and Jonathan Zittrain for combining to set things up for me in this delightful way. It is true that I feel somewhat overwhelmed at the prospect of trying to talk for any substantial length of time about a lawsuit that isn't going anywhere very much. I am, however, going to mention the SCO lawsuit from time to time in my remarks.
fr: Merci. C'est un grand plaisir d'&ecirc;tre ici. Je voudrais remercier le Journal of Law and Technology et Jonathan Zittrain de leurs efforts conjoints pour ce parfait accueil. C'est vrai que je me sens quelque peu d&eacute;pass&eacute; &agrave; la perspective d'essayer de parler pour une dur&eacute;e substantielle d'un proc&egrave;s qui n'avance pas vraiment. Je vais cependant mentionner le proc&egrave;s SCO de temps en temps dans mes remarques.

source: Mr. McBride, when he was here, was kind enough to mention me once or twice, and I am going to do him the same favor. I hope you will feel, those of you who followed the conversation, that I am responsive to his remarks, though I don't think that doing it in the form of he said, I say, would lead, as Jonathan suggests, to a particularly intellectually challenging evening.
fr: M. McBride, quand il &eacute;tait ici, &agrave; eu l'amabilit&eacute; de me mentionner une ou deux fois, et je vais lui retourner cette faveur. J'esp&egrave;re que vous remarquerez, pour ceux d'entre vous qui ont suivi cette conversation, que je suis prompt &agrave; r&eacute;pondre &agrave; ses remarques, bien que je ne pense pas que le faire sous cette forme pourrait mener, comme Jonathan le sugg&egrave;re, &agrave; une soir&eacute;e particuli&egrave;rement int&eacute;ressante intellectuellement parlant.

source: Free software, you will know, I am sure, that I didn't make this up, is free as in freedom, not free as in beer. One of the primary problems with the conversation we have been having about this lawsuit, in your distinguished speaker series this year, is that at least so far it had apparently been suggested that the goal of those of us who believe in the free software movement was primarily to prevent people from earning a profit in the computer industry.
fr: Le logiciel libre, vous savez, j'en suis s&ucirc;r, que je ne l'ai pas invent&eacute;, qu'il est &laquo;&nbsp;free as in freedom, not free as in beer&nbsp;&raquo; <sup><a href="#TransNote1">1</a></sup>. Un desprincipaux probl&egrave;mes de la conversation que nous avons eu au sujet de ce proc&egrave;s avec votre s&eacute;rie d'invit&eacute;s distingu&eacute;s cette ann&eacute;e est qu'au moins jusqu'ici, il a apparemment &eacute;t&eacute; sugg&eacute;r&eacute; que le but de ceux d'entre nous qui croient dans le mouvement pour le logiciel libre serait principalement d'emp&ecirc;cher des personnes de d&eacute;gager un profit dans l'industrie informatique.

source: This results, it is sometimes suggested, from some wild antipathy to the idea of economic benefit or some particular antipathy to the idea that people ought to have incentives to do what they do. I shall along the way suggest that we believe very strongly in incentives, though we see the problem of incentive perhaps a little bit differently than Mr. McBride. But it isn't, after all, and we need to begin there, it isn't, after all, about making things free as in beer. It is about making things free as in freedom.
fr: Il est parfois sugg&eacute;r&eacute; que cela r&eacute;sulte d'une antipathie sauvage envers l'id&eacute;e d'un b&eacute;n&eacute;fice &eacute;conomique ou une antipathie particuli&egrave;re envers l'id&eacute;e que les personnes devraient avoir des encouragements pour faire ce qu'ils font. Je m'autorise au passage &agrave; pr&eacute;ciser que nous croyons fortement &agrave; la valeur des encouragements, bien que nous abordons ce probl&egrave;me des encouragements d'une mani&egrave;re l&eacute;g&egrave;rement diff&eacute;rente de celle de M. McBride. Mais au final ce n'est pas, et nous devons d&eacute;buter par l&agrave;, au final il ne s'agit pas de rendre les chose gratuites. Il s'agit de rendre les choses libres.

source: The goal of the Free Software Movement is to enable people to understand, to learn from, to improve, to adapt, and to share the technology that increasingly runs every human life.
fr: Le but du mouvement pour le logiciel libre est de rendre les personnes capables de comprendre, d'apprendre, d'am&eacute;liorer, d'adapter et de partager la technologie qui domine de plus en plus toute vie humaine.

source: The fundamental belief in fairness here is not that it is fair that things should be free. It is that it is fair that we should be free and that our thoughts should be free, that we should be able to know as much about the world in which we live as possible, and that we should be as little as possible captive to other people's knowledge, beyond the appeal to our own understanding and initiative.
fr: La croyance fondamentale dans l'&eacute;quit&eacute; ici pr&eacute;sente n'est pas qu'il est &eacute;quitable que les choses soient libres. C'est qu'il est &eacute;quitable que nous devrions &ecirc;tre libres et que nos pens&eacute;es devraient &ecirc;tre libres, que nous devrions &ecirc;tre capables d'en savoir le plus possible &agrave; propos du monde dans lequel nous vivons, et que nous devrions &ecirc;tre le moins possible prisonnier du savoir d'autre personnes, au-del&agrave; de la satisfaction de notre propre compr&eacute;hension et initiative.

source: This idea lay behind my dear friend and colleague, Richard Stallman's, intense desire, beginning in the early 1980's, to bring about a world in which all the computer software needed by anybody to do anything would be available on terms which permitted free access to the knowledge that that software contained and a free opportunity to make more knowledge and to improve on the existing technology by modification and sharing.
fr: L'id&eacute;e repose sur l'intense d&eacute;sir de mon cher ami et coll&egrave;gue, Richard Stallman, commen&ccedil;ant au d&eacute;but des ann&eacute;es 80, &agrave; mettre &agrave; jour un monde dans lequel tous les logiciels informatiques n&eacute;cessaires &agrave; quiconque pour faire quoi que ce soit seraient disponibles selon des termes permettant le libre acc&egrave;s aux savoirs que ces logiciels contiennent et l'opportunit&eacute; de cr&eacute;er librement des connaissances suppl&eacute;mentaires et d'am&eacute;liorer librement la technologie existante par sa modification et son partage.

source: This is a desire for a free evolution of technical knowledge. A descent by modification untrammeled by principles that forbid improvement, access and sharing. If you think about it, it sounds rather like a commitment to encourage the diffusion of science and the useful arts by promoting access to knowledge.
fr: C'est un d&eacute;sir pour une &eacute;volution libre des connaissances technologiques. Un proc&eacute;d&eacute; d'avanc&eacute;e par la modification non bloqu&eacute;e par des principes qui interdisent l'am&eacute;lioration, l'acc&egrave;s et le partage. Si vous y r&eacute;fl&eacute;chissez, cela sonne plut&ocirc;t comme un engagement pour encourager la diffusion des sciences en promouvant l'acc&egrave;s &agrave; la connaissance.

source: In short, the idea of the Free Software Movement is neither hostile to, nor in any sense at cross-purposes with, the 18th century ambition for the improvement of society and the human being through access to knowledge.
fr: Succinctement, l'id&eacute;e du mouvement pour le logiciel libre n'est ni hostile, ni oppos&eacute;e d'une quelconque fa&ccedil;on, &agrave; l'ambition du XVIII&egrave;me si&egrave;cle de l'am&eacute;lioration de la soci&eacute;t&eacute; et de l'&ecirc;tre humain par l'acc&egrave;s &agrave; la connaissance.

source: The copyrights clause in Article 1 Section 8 is only one of the many ways in which those rather less realistic than usually pictured founding parents of ours participated in the great 18th century belief in the perfectability of the world and of human life.
fr: Les clauses sur les copyrights dans la Section 8 de l'Article 1 sont l'un des nombreux moyens gr&acirc;ce auxquels nos parents fondateurs, plut&ocirc;t moins r&eacute;alistes qu'on ne les d&eacute;peint habituellement, ont particip&eacute; &agrave; la grande croyance du XVIII&egrave;me si&egrave;cle dans la perfectibilit&eacute; du monde et de la vie humaine.

source: The copyrights clause is an particular legal embrace of the idea of perfectability through access to and the sharing of knowledge. We, however, the 21st century inheritors of that promise, live in a world in which there is some doubt as to whether property principles, strongly enforced, with their inevitable corollary of exclusion &mdash; this is mine, you cannot have it unless you pay me &mdash; whether property principles best further that shared goal of the perfectability of human life and society based around access to knowledge.
fr: Ces clauses sur les copyrights sont un cadre l&eacute;gal particulier de l'id&eacute;e de perfectibilit&eacute; par l'acc&egrave;s et le partage du savoir. Cependant, nous, les h&eacute;ritiers de cette promesse au XXI&egrave;me si&egrave;cle, vivons dans un monde dans lequel on peut douter du fait que les principes de propri&eacute;t&eacute;, fortement appliqu&eacute;s, avec leur in&eacute;vitable corollaire d'exclusion &mdash; cela vient de moi, vous ne pouvez pas l'avoir tant que vous ne me payerez pas &mdash; que les principes de propri&eacute;t&eacute; ont contribu&eacute; au but de perfectibilit&eacute; de la vie humaine et de la soci&eacute;t&eacute; bas&eacute;e autour de l'acc&egrave;s au savoir.

source: Our position has been for twenty years that to the extent that existing copyright rules encourage the diffusion of science and the useful arts, they were good. And to the extent that they discouraged the diffusion of knowledge and the useful arts, that they could be improved.
fr: Notre position a &eacute;t&eacute; depuis vingt ans que, dans la mesure o&ugrave; les lois sur le copyright encouragent la diffusion des sciences, ils sont bons. Et que dans la mesure o&ugrave; ils d&eacute;couragent la diffusion des sciences, ils pourraient &ecirc;tre am&eacute;lior&eacute;s.

source: We have, pardon me for taking credit for something, we have improved them, substantially, not by negating any of the existing rules of copyright. On the contrary, we have been quite scrupulous about that.
fr: Nous les avons am&eacute;lior&eacute;s, pardonnez-moi de nous en attribuer le cr&eacute;dit, nous les avons am&eacute;lior&eacute;s et de fa&ccedil;on substantielle, non pas en niant aucune des lois existantes sur le copyright. Au contraire, nous avons &eacute;t&eacute; assez scrupuleux &agrave; ce sujet.

source: One of the things which amuses me amidst the rhetoric that is now being thrown around, is how oddly orthodox I seem to me when I consider my weekly activities as a lawyer.
fr: Une des choses qui m'amusent dans la rh&eacute;torique qui est utilis&eacute;e en ce moment, est &agrave; quel point je me semble peu catholique quand je consid&egrave;re mes activit&eacute;s en semaine en tant qu'avocat.

source: Though not necessarily welcome in Los Angeles, I find myself behaving very much like an awful lot of lawyers in Los Angeles. I want my clients' copyrights respected, and I spend a fairly large amount of tedious time trying to get people to play by the very rules embodied in the Copyright Act that I am supposedly so busy trying to destroy.
fr: Bien que pas forc&eacute;ment bien accueilli &agrave; Los Angeles, je me retrouve en train de me comporter exactement de la m&ecirc;me fa&ccedil;on qu'un grand nombre d'avocats &agrave; Los Angeles. Je veux que les copyrights de mes clients soient respect&eacute;s, et je passe une relativement large partie de mon temps &agrave; essayer difficilement de faire jouer les gens selon les r&egrave;gles constituant le Copyright Act que je suis suppos&eacute; &ecirc;tre si occup&eacute; &agrave; essayer de d&eacute;truire.

source: Free software is an attempt to use the 18th century principles for the encouragement of the diffusion of knowledge to transform the technical environment of human beings. And as Jonathan says, my own personal opinion on the subject is that the early going in our experiment has worked out pretty well.
fr: Le logiciel libre est une tentative d'utilisation des principes du XVIII&egrave;me si&egrave;cle d'encouragement de la diffusion du savoir afin de transformer l'environnement technique des &ecirc;tres humains. Ainsi que Jonathan le dit, mon opinion personnelle &agrave; ce sujet est que les premiers d&eacute;buts de notre exp&eacute;rience ont plut&ocirc;t bien march&eacute;.

source: It is because it has worked out pretty well that there is blowback from it, and one of the little pieces of that blowback is the controversy now roiling the world entitled SCO against IBM, which apparently is supposed to become, Mr. McBride said it when he was here, SCO against something called the Linux Community.
fr: C'est &agrave; cause de ce succ&egrave;s qu'il y a maintenant un retour de flamme contre lui, et l'un des petits &eacute;l&eacute;ments de ce retour est la controverse secouant actuellement le monde, personnifi&eacute;e par l'affaire SCO contre IBM, qui apparemment est suppos&eacute;e devenir bient&ocirc;t, selon ce que M. McBride a dit lorsqu'il &eacute;tait ici, SCO contre quelque chose appel&eacute; la communaut&eacute; Linux.

source: I don't think that's actually what's happening, but it is certainly what Mr. McBride came here to say was happening.
fr: Je ne pense pas que ce soit ce qui se passe r&eacute;ellement, mais c'est certainement ce que M. McBride est venu dire ici.

source: So I'd best talk for a moment or two about how we see the situation that Mr. McBride describes as a great test of whether free goods are somehow going to drive out the incentive to produce in the net.
fr: Donc je ferais mieux de parler un moment &agrave; propos de notre vision de la situation que M. McBride d&eacute;crit comme &eacute;tant un grand test d&eacute;terminant si les produits libres sont en train d'une mani&egrave;re ou d'une autre de tuer les encouragements de la production sur Internet.

source: Free software, of which the operating system kernel called Linux is one very important example among thousands, free software is the single greatest technical reference library on Planet Earth, as of now.
fr: Le logiciel libre, dont le syst&egrave;me d'exploitation appel&eacute; Linux est un exemple tr&egrave;s important parmi des milliers, le logiciel libre est la plus grande biblioth&egrave;que de r&eacute;f&eacute;rences techniques sur la plan&egrave;te Terre, pour le moment.

source: The reason I say that is that free software is the only corpus of information fixed in a tangible form, through which anyone, anywhere, can go from naivete to the state of the art in a great technical subject &mdash; what computers can be made to do &mdash; solely by consulting material that is freely available for adaptation and reuse, in any way that she or he may want.
fr: La raison pour laquelle je dis cela est que le logiciel libre est la seule collection d'informations fix&eacute;e en une forme tangible, &agrave; travers laquelle n'importe qui, de n'importe o&ugrave;, peut &eacute;voluer de la na&iuml;vet&eacute; &agrave; la pointe de l'avanc&eacute;e dans un grand sujet technique &mdash; ce que l'on peut faire faire &agrave; un ordinateur &mdash; uniquement en consultant du mat&eacute;riel librement disponible pour adaptation et r&eacute;utilisation, de n'importe quelle fa&ccedil;on souhait&eacute;e.

source: We enable learning all over the world by permitting people to experiment, not with toys, but with the actual real stuff on which all the good work is done.
fr: Nous rendons possible l'apprentissage partout sur la terre en autorisant les gens &agrave; exp&eacute;rimenter, non avec des jouets, mais r&eacute;ellement avec les moyens actuels gr&acirc;ce auxquels tout le bon boulot est r&eacute;alis&eacute;.

source: For that purpose, we are engaged in making an educational system and a human capital improvement system which brings about the promise of encouraging the diffusion of our science and useful art in a way which contributes to the perfectability of human beings.
fr: Dans ce but, nous sommes engag&eacute;s dans la r&eacute;alisation d'un syst&egrave;me &eacute;ducatif et d'un syst&egrave;me d'am&eacute;lioration du capital humain qui am&egrave;ne la promesse d'encourager la diffusion de nos sciences d'une mani&egrave;re qui contribue &agrave; la perfectibilit&eacute; de l'&ecirc;tre humain.

source: That's what we were trying to do, and we have done it. We are, as it happens, driving out of business a firm called the Santa Cruz Operation [sic] - or SCO Ltd. That was not our intention. That's a result of something called the creative destruction potential of capitalism, once upon a time identified by Joseph Schumpeter. We are doing a thing better at lower cost than it is presently being done by those people using other people's money to do it. The result - celebrated everywhere that capitalism is actually believed in &mdash; is that existing firms are going to have to change their way of operation or leave the market. This is usually regarded as a positive outcome, associated with enormous welfare increases of which capitalism celebrates at every opportunity everywhere all the time in the hope that the few defects that capitalism may possess will be less prominently visible once that enormous benefit is carefully observed.
fr: C'est ce que nous essayons de faire, et nous l'avons fait. Nous sommes, apparemment en train de faire quitter le march&eacute; &agrave; une entreprise appel&eacute;e la Santa Cruz Operation [sic] - ou SCO Ltd. Ce n'&eacute;tait pas notre intention. C'est le r&eacute;sultat de quelque chose appel&eacute; le potentiel de destruction cr&eacute;atif du capitalisme, d&eacute;j&agrave; identifi&eacute; par Joseph Schumpeter. Nous faisons quelque chose mieux et &agrave; moindre co&ucirc;t que ce qui est actuellement r&eacute;alis&eacute; par ces personnes utilisant l'argent des autres pour le faire. Ce r&eacute;sultat &mdash;f&ecirc;t&eacute; partout o&ugrave; l'on croit r&eacute;ellement au capitalisme&mdash; est que les entreprises existantes vont devoir changer leur mode op&eacute;ratoire ou quitter le march&eacute;. C'est g&eacute;n&eacute;ralement vu comme quelque chose de positif, associ&eacute; aux &eacute;normes augmentations de l'assistance que le capitalisme f&ecirc;te &agrave; chaque opportunit&eacute; en esp&eacute;rant que les quelques d&eacute;fauts que le capitalisme pourrait avoir seraient moins visibles une fois cet &eacute;norme b&eacute;n&eacute;fice attentivement observ&eacute;.

source: Mr. McBride does not want to go out of business. This is understandable. Mr. Gates does not want to go out of business either. But they are both on the wrong side of a problem in the political economy of the 21st century. They see software as a product. In order to make their quote &ldquo;business model&rdquo; close quote work, software must be a thing which is scarce. And out of the scarcity of software there will be a price which can be extracted, which will include an economic rent, from which Mr. McBride has suggested somebody will be enabled to buy a second home.
fr: M. McBride ne veut pas quitter le march&eacute;. C'est compr&eacute;hensible. M. Gates ne veut pas se retirer non plus. Mais ils sont tous les deux du mauvais c&ocirc;t&eacute; d'un probl&egrave;me dans l'&eacute;conomie politique du XXI&egrave;me si&egrave;cle. Ils voient le logiciel en tant que produit. Pour rendre leur mod&egrave;le &eacute;conomique efficace, le logiciel doit donc &ecirc;tre une chose rare. Et cette raret&eacute; du logiciel produira un prix exploitable, qui sera inclus dans une rente &eacute;conomique, gr&acirc;ce &agrave; laquelle M. McBride a sugg&eacute;r&eacute; que quelqu'un pourra acheter une seconde maison.

source: Mr. McBride thought it was the programmers who would be able to buy a second home but people who actually understand the current state of the software industry recognize that programmers are not buying second homes these days. I think Mr McBride means the executives who employ programmers and the financiers who employ executives to employ programmers will buy a second home on the software-is-product business model for a little while longer.
fr: M. McBride pensait que c'&eacute;tait les programmeurs qui seraient capables d'acheter une seconde maison mais les personnes qui en fait comprenne l'&eacute;tat actuel de l'industrie logicielle reconnaissent que les programmeurs n'ach&egrave;tent pas de maisons secondaires en ce moment. Je pense que M. McBride veut dire que les directeurs qui emploient les programmeurs et les hommes de la finance qui emploient les directeurs pour employer les programmeurs ach&egrave;teront une seconde maison gr&acirc;ce au mod&egrave;le le-logiciel-est-un-produit pour encore un certain temps.

source: We think that software is not a product, because we do not believe in excluding people from it. We think that software is a form of knowledge. The International Business Machines Corporation, the Hewlett Packard Corporation, and a number of other organizations either represented here in body or in spirit this evening have another theory, which is that software in the 21st century is a service, a form of public utility combined with knowledge about how to make best use of the utility, which enables economic growth in peoples' enterprises generally, from which there is a surplus to be used to pay the people who help you produce the surplus, by making the best possible use of the public utility.
fr: Nous pensons que le logiciel n'est pas un produit, parce que nous ne croyons pas &agrave; l'exclusion de certaines personnes du logiciel. Nous pensons que le logiciel est une forme de savoir. L'International Business Machines Corporation (IBM), la Hewlett Packard Corporation, et un bon nombre d'autres organisations repr&eacute;sent&eacute;es ce soir physiquement ou dans l'esprit ont une autre th&eacute;orie, qui est que le logiciel au XXI&egrave;me si&egrave;cle est un service, une forme de service public combin&eacute; au savoir de la fa&ccedil;on de faire le meilleur usage de ce service, ce qui rend possible la croissance &eacute;conomique pour les entreprises des gens en g&eacute;n&eacute;ral, de laquelle un surplus peut &ecirc;tre utilis&eacute; pour payer les personnes qui vous aident &agrave; produire ce surplus, en faisant le meilleur usage possible du service public.
