Repository: gitGNU/gnu_www-fr
Catalog: philosophy/moglen-harvard-speech-2004.*.po
Languages: fr

source: The European Commission put forward a suggestion for change and harmonization in European patent law which would have made the issuance of patents for inventions practiceable in software very much easier. The European parliament after a lengthy campaign, led in part by the Free Software Movement in Europe &mdash; that's Euro Linux and the Free Software Foundation Europe and a lot of small software houses in Europe benefitting substantially from the new mode of software as a public utility &mdash; a campaign which involved in the end 250,000 petition signatories, the European Parliament decided to say no. And two parties, Greens and Social Democrats, in the European Parliament now understand that patent policy in Europe is a partisan issue. That is to say that there are sides, and that electoral politics and party organization can be conducted around those sides.
fr: La Commission Europ&eacute;enne a sugg&eacute;r&eacute; un changement et une harmonisation de la loi europ&eacute;enne sur les brevets qui aurait rendu l'&eacute;mission de brevets pour des inventions praticables dans le domaine logiciel beaucoup plus facile. Le Parlement Europ&eacute;en, apr&egrave;s une longue campagne, en partie men&eacute;e par le mouvement pour le logiciel libre en Europe, c'est &agrave; dire Euro Linux et la Fondation pour le logiciel libre Europe et beaucoup de petites soci&eacute;t&eacute;s de logiciels en Europe b&eacute;n&eacute;ficiant substantiellement de la nouvelle mode du logiciel vu comme service public, une campagne qui a impliqu&eacute; au final 250000 signataires de p&eacute;tition, le Parlement a finalement d&eacute;cid&eacute; de refuser. Et deux partis, les Verts et les Sociaux-d&eacute;mocrates, dans le Parlement Europ&eacute;en comprennent maintenant que la politique des brevets en Europe est un probl&egrave;me partisan. C'est-&agrave;-dire qu'il y a deux camps, et que l'organisation des partis et de la politique &eacute;lectorale peut &ecirc;tre conduite sur ces camps.

source: Our society is a much less aware one on that subject. For those of us who live here, the task of getting to the standard set for us by our colleagues in Europe this past summer is the first and most important challenge. We must make our Congressmen understand that patent law is not an administrative law subject to be decided in the <abbr title="Patent and Trademark Office">PTO</abbr>, but a political subject to be decided by our legislators. We may have to restore actual democracy to the House of Representatives in the United States in order to make that possible, and there are many other aspects to the challenge involved.
fr: Notre soci&eacute;t&eacute; est beaucoup moins au courant de ce sujet. Pour ceux d'entre nous qui vivent ici, la t&acirc;che de nous mettre au standard &eacute;tabli pour nous par nos coll&egrave;gues en Europe l'&eacute;t&eacute; dernier est notre premier et plus important d&eacute;fi. Nous devons faire comprendre &agrave; nos membres du Congr&egrave;s que la loi sur les brevets n'est pas un sujet administratif devant &ecirc;tre d&eacute;cid&eacute; dans le <abbr title="Patent and Trademark Office">PTO</abbr>, mais un sujet politique devant &ecirc;tre d&eacute;cid&eacute; par nos l&eacute;gislateurs. Nous allons peut-&ecirc;tre devoir restaurer une r&eacute;elle d&eacute;mocratie dans la Chambre des Repr&eacute;sentants des &Eacute;tats-Unis afin de rendre ceci possible, et il y a beaucoup d'autres aspects &agrave; ce d&eacute;fi.

source: But this is one of the primary respects in which technically sophisticated people in the United States are going to have to get wise to the mechanisms of politics, because we're not going to solve this in the Supreme Court, and we're not going to solve this in the work station. We are going to solve this in Congress, and we're going to have to build our muscles up for doing that.
fr: Mais c'est l'un des aspects principaux pour lesquels les personnes techniquement sophistiqu&eacute;es aux &Eacute;tats-Unis vont devoir apprendre les arcanes de la politique, parce que nous n'allons r&eacute;soudre ceci ni &agrave; la Cour Supr&ecirc;me, ni &agrave; notre station de travail. Nous allons r&eacute;soudre ceci au Congr&egrave;s, et nous allons devoir b&acirc;tir nos forces pour le faire.

source: <b>Q:</b> Related to that point, I'm curious, this isn't so much a legal point as a, maybe even a public relations point. You opened up your talk by saying, This is about freedom not free beer. But when you, I think, listen to people like Jack Valenti and the <abbr title="Recording Industry Association of America">RIAA</abbr>, you know, and, Mr. McBride, the constant drumbeat is of this idea of free beer and teaching kids that they can't steal from, you know, Big Music. How do you win that battle of public relations on the ground, which ultimately will have ramifications in Congress? How do you, how do you convey that message outside the technology community?
fr: <b>Q&nbsp;:</b> &Agrave; ce propos, je suis curieux&nbsp;: ce n'est peut-&ecirc;tre pas tant un point l&eacute;gal qu'un point de relations publiques. Vous avez commencez par dire&nbsp;: il s'agit de libert&eacute; et non pas de gratuit&eacute;. Mais quand vous &eacute;coutez des personnes comme Jack Valenti et le <abbr title="Recording Industry Association of America">RIAA</abbr>, vous savez, et M. McBride, la rengaine est toujours cette id&eacute;e de gratuit&eacute; (ndt&nbsp;: free beer) et d'apprendre aux enfants qu'ils ne peuvent voler, vous savez, Big Music. Comment peut-on gagner cette bataille de relations publiques de fond, qui au final aura des ramifications jusqu'au Congr&egrave;s&nbsp;? Comment, comment faites vous parvenir ce message en dehors de la communaut&eacute; technologique&nbsp;?

source: <b>Moglen:</b> Well, one of the things that I guess I would say about that is that English language fights us on it, right? One of the things that has happened over the course of time in our European environments, where the word for free in the sense of costless and the word for free in the sense of liberated are two different words, is that people have twigged to the distinction much more easily.
fr: <b>Moglen&nbsp;:</b> Eh bien, une des choses que j'aimerais dire &agrave; ce sujet est que la langue anglaise nous combat sur ce point, n'est-ce pas&nbsp;? Une des choses qui se sont pass&eacute;es au cours du temps dans notre environnement europ&eacute;en, dans lequel le mot &laquo;&nbsp;free&nbsp;&raquo; dans le sens de gratuit&eacute; et le mot &laquo;&nbsp;free&nbsp;&raquo; dans le sens de libert&eacute; sont deux mots diff&eacute;rents, est que les gens ont compris la distinction beaucoup plus facilement.

source: Software libre works nicely, or logiciel libre if you have to truckle to the Academie Francaise, in a way that free software doesn't at making that distinction. It was in part for that reason that some folks decided in the late 90's, that maybe they ought to try and find another phrase and settled on open source. That turned out to have more difficulties, I think, than benefits for the people who did it, though it now works very nicely as a way for business to identify its interest in what we do without committing itself to political or social philosophies that businessmen may not share or at any rate don't need to trumpet just in order to get their work done from day to day.
fr: &laquo;&nbsp;Software libre&nbsp;&raquo;, ou &laquo;&nbsp;logiciel libre&nbsp;&raquo; si vous voulez suivre l'Acad&eacute;mie fran&ccedil;aise, marche bien et ne pose pas le probl&egrave;me de distinction de &laquo;&nbsp;free software&nbsp;&raquo;. C'est pour cela que certaines personnes ont d&eacute;cid&eacute; vers la fin des ann&eacute;es 90, que peut-&ecirc;tre ils devraient essayer de trouver un nouveau terme et se sont finalement d&eacute;cid&eacute;s pour open source. Finalement cela a pos&eacute; plus de difficult&eacute;s que de b&eacute;n&eacute;fices pour les personnes qui l'ont trouv&eacute;, bien que maintenant cela fonctionne vraiment bien pour que le monde des affaires identifie son int&eacute;r&ecirc;t dans ce que nous faisons sans se compromettre avec les philosophies politiques ou sociales que ces hommes d'affaire ne partagent pas ou en tout cas n'ont pas besoin de crier sur les toits pour avoir leur travail fait chaque jour.

source: So one of the things that we do, for those who speak English, is we actually have to reinforce from time to time &mdash; that is all the time &mdash; the distinction between free beer and free speech. On the other hand those of us who live in the United States and speak English shouldn't have quite that much trouble because free speech is a way more important part of the American cultural landscape than free beer is. At least it was in the world that I grew up in, whatever Rupert Murdoch may want to say about it now.
fr: Donc une chose que nous faisons, nous qui parlons anglais, est que nous avons &agrave; renforcer de temps en temps, en fait tout le temps, la distinction entre &laquo;&nbsp;free beer&nbsp;&raquo; et &laquo;&nbsp;free speech&nbsp;&raquo;. D'un autre c&ocirc;t&eacute;, ceux d'entre nous qui vivent aux &Eacute;tats-Unis et parlent anglais ne devraient pas avoir trop de probl&egrave;me &agrave; ce propos puisque la libert&eacute; d'expression est beaucoup plus implant&eacute;e dans la culture am&eacute;ricaine que la bi&egrave;re gratuite. Du moins, c'&eacute;tait vrai dans le monde dans lequel j'ai grandi, quoi que Rupert Murdoch veuille dire &agrave; ce sujet maintenant.

source: We are the party of free speech, and we need to point out to people that if you allow anybody, including a well-dressed lobbyist of ancient, ancient vintage, to declare that a love of free speech is like taking a CD out of a record store under your arm, game's over. Not game about free software, but game about liberty and life in a free society.
fr: Nous sommes le parti de la libert&eacute; d'expression, et nous devons faire remarquer aux gens que si vous autorisez n'importe qui &agrave; d&eacute;clarer, ceci incluant un lobbyiste bien habill&eacute; &agrave; l'ancienne mode, que l'amour de la libert&eacute; d'expression c'est comme sortir un CD sous le bras d'un magasin de disque, alors c'est perdu. Non pas le jeu &agrave; propos du logiciel libre, mais le jeu de la libert&eacute; et de la vie dans une soci&eacute;t&eacute; libre.

source: We stand for free speech. We're the free speech movement of the moment. And that we have to insist upon, all the time, uncompromisingly. My dear friend, Mr. Stallman, has caused a certain amount of resistance in life by going around saying, &ldquo;It's free software, it's not open source&rdquo;. He has a reason. This is the reason. We need to keep reminding people that what's at stake here is free speech. We need to keep reminding people that what we're doing is trying to keep the freedom of ideas in the 21st century, in a world where there are guys with little paste-it labels with price tags on it who would stick it on every idea on earth if it would make value for the shareholders. And what we have to do is to continue to reinforce the recognition that free speech in a technological society means technological free speech. I think we can do that. I think that's a deliverable message.
fr: Nous d&eacute;fendons la libert&eacute; d'expression. Nous sommes le mouvement pour la libert&eacute; d'expression en ce moment. Et nous devons insister l&agrave;-dessus en permanence, sans compromis. Mon cher ami, M. Stallman, a provoqu&eacute; une r&eacute;sistance certaine dans la vie en se promenant et disant, &laquo;&nbsp;c'est le logiciel libre, pas l'open source&nbsp;&raquo;. Il a une raison. C'est la raison. Nous devons continuer de rappeler aux gens que ce qui est dans la balance ici est la libert&eacute; d'expression. Nous devons continuer de rappeler aux gens que ce que nous faisons est essayer de prot&eacute;ger la libert&eacute; des id&eacute;es au XXI&egrave;me si&egrave;cle, dans un monde o&ugrave; des mecs avec des petites &eacute;tiquettes de prix autocollantes voudraient bien &eacute;tiqueter chaque id&eacute;e de la terre si cela faisait faire des b&eacute;n&eacute;fices aux actionnaires. Et ce que nous avons &agrave; faire est continuer &agrave; renforcer l'acceptation que la libert&eacute; d'expression dans une soci&eacute;t&eacute; technologique signifie la libert&eacute; d'expression technologique. Je pense que nous pouvons faire cela. Je pense que c'est un message qui peut passer.

source: That's what I spend a good deal of my time doing, and while it's true that I bore people occasionally, at least I think I manage, more or less, to get the point across. We're just all going to have to be really assiduous about doing it.
fr: C'est &agrave; cela que je consacre une grande partie de mon temps, et bien que ce soit vrai qu'occasionnellement j'ennuie les gens avec &ccedil;a, je pense au moins r&eacute;ussir, plus ou moins, &agrave; faire passer ce message. Nous allons simplement devoir &ecirc;tre vraiment assidus l&agrave;-dessus.

source: <b>Q:</b> I'll ask a question. You talked a lot about distribution and how you think that ought to be free, and I think I see that argument much better than I see the argument about how creators of zero-marginal-cost distribution goods will necessarily be compensated for what they create, and so I've heard a lot of, I don't think these are any of your arguments, but I've heard, OK, well, that the musicians will go on tour, so they'll make it back that way, you know, whatever time they put in. Or people will keep creating whatever it is they create &mdash; and this applies to more than just, you know, movies or music &mdash; it applies to books, or even non-entertainment-style knowledge-type things, there's gotta be, you hear people will still do the same amount of it because they love to do it or are interested to do it, but I don't think that quite compensates for the compensation that many of those creators now receive. And so I was wondering if you would comment a little bit on how the free distribution world, which differs from the current world in that many of the current distribution regimes were created specifically only to compensate people, will differ in terms of compensating creators.
fr: <b>Q&nbsp;:</b> Je vais vous poser une question. Vous avez beaucoup parl&eacute; de la distribution et de comment vous pensez qu'elle devrait &ecirc;tre libre, et je pense comprendre cet argument beaucoup mieux que je ne comprends l'argument selon lequel les cr&eacute;ateurs de biens &agrave; co&ucirc;ts marginaux de distribution nuls seront n&eacute;cessairement r&eacute;tribu&eacute;s pour ce qu'ils cr&eacute;ent, et j'en ai beaucoup entendu parler, je ne pense pas que cela soit aucun de vos arguments, mais j'ai entendu, ok, eh bien, que les musiciens feront leur tourn&eacute;e, donc qu'ils le r&eacute;cup&eacute;reront de cette fa&ccedil;on, vous savez, quel que soit le temps qu'ils y aient consacr&eacute;. Ou encore les gens continueront &agrave; cr&eacute;er ce qu'il cr&eacute;ent, et cela s'applique &agrave; plus de chose que juste les films et la musique, cela s'applique aussi aux livres, ou aux choses contenant du savoir autres que de loisir, cela doit se faire, vous entendez que les gens vont continuer &agrave; en faire la m&ecirc;me quantit&eacute; parce qu'ils aiment le faire ou sont int&eacute;resses pour le faire, mais je ne pense pas que cela compense vraiment les indemnisations que beaucoup de ces cr&eacute;ateurs re&ccedil;oivent maintenant. Et donc je me demandais si vous pouviez discuter un petit peu de comment le monde de la libre distribution, diff&eacute;rent du monde actuel dans lequel la plupart des r&eacute;gimes de distribution ont &eacute;t&eacute; cr&eacute;&eacute;s sp&eacute;cialement pour indemniser les gens, sera diff&eacute;rent en ce qui concerne l'indemnisation des auteurs.

source: <b>Moglen:</b> I will say a little bit now, and in the interests of time also say that you can find in the Net where I put stuff which is at http://moglen.law.columbia.edu a paper called <a href="http://moglen.law.columbia.edu/publications/maine-speech.html"> &ldquo;Freeing the Mind&rdquo;</a>, which addresses this question, I hope comprehensively, or at least a little bit. Now, let me give you an answer.
fr: <b>Moglen&nbsp;:</b> Je vais en parler un petit peu maintenant, et dans l'int&eacute;r&ecirc;t du temps dire aussi que vous pouvez trouver sur le Net un papier &agrave; l'endroit o&ugrave; je mets des choses c'est &agrave; dire http://moglen.law.columbia.edu, un papier appel&eacute; <a href="http://moglen.law.columbia.edu/publications/maine-speech.html">&laquo;&nbsp;Freeing the Mind&nbsp;&raquo;</a>, qui r&eacute;pond &agrave; cette question, j'esp&egrave;re de fa&ccedil;on compr&eacute;hensible, ou du moins un petit peu. Maintenant, laissez-moi vous donner une r&eacute;ponse.

source: Historical perspective is useful here. Before Thomas Edison, there was no way for culture to be commodity. Every musician, every artist, every creator of anything before Thomas Edison was essentially in the business of doing what we now have go back to doing, except those who lived in a world of goods that could be distributed in print, for whom you only have to step back to before Gutenberg. Right?
fr: Une perspective historique est utile ici. Avant Thomas Edison, il n'y avait aucun moyen pour la culture d'&ecirc;tre un bien de consommation de masse. Chaque musicien, chaque artiste, chaque cr&eacute;ateur de n'importe quoi avant Thomas Edison &eacute;tait essentiellement dans les affaires que nous sommes maintenant revenus &agrave; faire, except&eacute; ceux qui vivaient dans un monde de biens qui pouvaient &ecirc;tre distribu&eacute;s en impression, pour qui vous avez simplement &agrave; reculer avant Gutenberg. N'est-ce pas&nbsp;?

source: The commoditization of culture is a phenomenon of yesterday, with respect to the deep history of human creativity. Whatever else we believe, and the problems are serious, we have to remind ourselves that there is no prospect that music would go away if it is ceased to be commodifiable. Music is always there. It always was.
fr: L'&eacute;volution de la culture en consommation de masse est un ph&eacute;nom&egrave;ne r&eacute;cent, en comparaison avec l'anciennet&eacute; de l'histoire de la cr&eacute;ativit&eacute; humaine. Quoi que nous croyons d'autre, et les probl&egrave;mes sont s&eacute;rieux, nous devons nous rappeler qu'il n'y a aucune chance que la musique ne disparaisse si elle cessait d'&ecirc;tre un produit de masse. La musique est toujours pr&eacute;sente. Elle l'a toujours &eacute;t&eacute;.

source: What you are asking about is, why do people pay for the things they care about, in a way that will allow creators to go on making them? And the answer that I need to give you is that people pay out of the personal relationship that they have to the concept of making.
fr: Ce sur quoi vous vous interrogez est, pourquoi les gens payent-ils pour les choses auxquelles ils s'int&eacute;ressent, d'une mani&egrave;re qui permettent aux cr&eacute;ateurs de continuer&nbsp;? Et la r&eacute;ponse que je dois vous donner est que les gens payent pour la relation personnelle qu'ils ont avec le concept de fabrication.

source: Musicians got paid by people who heard music, because they had a personal relationship to musicians. This is what you mean by going on tour or the Grateful Dead or anybody who uses the non-zero marginal cost of the theatre seat as a way of getting back, just as people merchandise as a way of getting back.
fr: Les musiciens sont pay&eacute;s par les gens qui ont &eacute;cout&eacute; de la musique, parce qu'ils avaient une relation personnelle avec les musiciens. C'est ce que vous voulez dire par faire leur tourn&eacute;e ou &laquo;&nbsp;the Grateful Dead&nbsp;&laquo; ou n'importe qui qui utilise le co&ucirc;t marginal non nul des si&egrave;ges de th&eacute;&acirc;tre comme fa&ccedil;on de r&eacute;cup&eacute;rer, de la m&ecirc;me mani&egrave;re que les gens marchandent comme fa&ccedil;on de r&eacute;cup&eacute;rer.

source: Think for a moment about the coffee house folk musician, the singer/songwriter. The simplest case in a way of the transformation of the music business. Here are people who are currently on tour 40, 45, 50 weeks a year. What happens is, they go to places and they perform and at the back, CDs are on sale, but people don't buy those CDs as a kind of, you know, I would otherwise be stealing the music; they buy it the way they buy goods at a farmers market or a crafts fair, because of their personal relationship to the artist.
fr: Pensez un instant au musicien du monde des &laquo;&nbsp;coffee house&nbsp;&laquo;, le chanteur/compositeur. Le cas le plus simple d'une certaine fa&ccedil;on de la transformation de l'industrie musicale. Voil&agrave; des gens qui sont en tourn&eacute;e 40, 45, 50 semaines par an. Ce qui se passe est qu'ils vont &agrave; des endroits et jouent, et au fond de la salle leur CD sont en vente, mais les gens n'ach&egrave;tent pas ces CD genre, vous savez, sinon je volerais la musique&nbsp;; ils les ach&egrave;tent de la m&ecirc;me mani&egrave;re qu'ils ach&egrave;tent des produits au march&eacute; fermier ou &agrave; une foire d'artisans, &agrave; cause de leur relation personnelle avec l'artiste.

source: So let me tell you what I think the owners of culture were doing in the 20th century. It took them two generations from Edison to figure out what their business was, and it wasn't music and it wasn't movies. It was celebrity. They created very large artificial people, you know, with navels eight feet high. And then we had these fantasy personal relationships with the artificial big people. And those personal relationships were manipulated to sell us lots and lots of stuff &mdash; music and movies and T-shirts and toys and, you know, sexual gratification, and heavens knows what else. All of that on the basis of the underlying real economy of culture, which is that we pay for that which we have relations with. We are human beings, social animals. We have been socialized and evolved for life in the band for a very long time. And when we are given things of beauty and utility that we believe in, we actually do support them.
fr: Donc laissez-moi vous dire ce que je pense que les propri&eacute;taires de la culture faisaient au XX&egrave;me si&egrave;cle. &Ccedil;a leur a pris deux g&eacute;n&eacute;rations &agrave; partir d'Edison pour se rendre comte de ce qu'&eacute;tait leur affaire, et ce n'&eacute;tait ni la musique ni les films. C'&eacute;tait la c&eacute;l&eacute;brit&eacute;. Ils ont cr&eacute;&eacute; de grandes personnes artificielles, vous savez, avec des nombrils de 2m de haut. Et ensuite nous avions ces relations personnelles imaginaires avec ces grandes personnes artificielles. Et ces relations personnelles &eacute;taient manipul&eacute;es pour nous vendre des tonnes de choses, de la musique et des films et des T-shirts et des jouets et, vous savez, de la gratification sexuelle, et dieu sait quoi d'autre. Tout cela bas&eacute; sur l'&eacute;conomie sous-jacente de la culture, qui est que nous payons pour ce avec quoi nous avons des relations. Nous sommes des &ecirc;tres humains, des animaux sociaux. Nous avons &eacute;t&eacute; socialis&eacute;s et avons &eacute;volu&eacute; pour vivre en groupe depuis tr&egrave;s longtemps. Et quand on nous donne des choses belles et utiles dans lesquelles nous croyons, nous les soutenons r&eacute;ellement.
