Repository: gitGNU/gnu_www-fr
Catalog: philosophy/moglen-harvard-speech-2004.*.po
Languages: fr

source: You think that this isn't true, because the current skin at the top of social life says that that's not a robust enough mechanism to sustain creation, and that the only mechanism that will sustain creation is coercive exclusion &mdash; you can't have it, if you don't pay.
fr: Vous pensez que ce n'est pas vrai, parce que la couche sup&eacute;rieure actuelle de la vie sociale dit que ce n'est pas un m&eacute;canisme assez robuste pour maintenir la cr&eacute;ation, et que le seul m&eacute;canisme qui maintiendra la cr&eacute;ation est l'exclusion coercitive&nbsp;: vous ne pouvez pas l'avoir si vous ne payez pas.

source: But they can't be historically right, because the ability to coerce effectively is a thing of yesterday. And the longer, deeper history of culture is the history of the non-coercive mechanisms for securing compensation to artists, only some of which we are now in a position to improve immeasurably.
fr: Mais ils ne peuvent avoir raison historiquement, parce que la possibilit&eacute; de contraindre efficacement est quelque chose de pass&eacute;. Et la longue et profonde histoire de la culture est l'histoire de m&eacute;canismes non-coercitifs pour assurer l'indemnisation des artistes, et nous sommes maintenant en position d'am&eacute;liorer immens&eacute;ment certains d'entre eux.

source: <b>Q:</b> But what about the software writer?
fr: <b>Q&nbsp;:</b> Mais qu'en est-il de l'auteur du logiciel&nbsp;?

source: <b>Moglen:</b> Ah, the software&hellip;
fr: <b>Moglen&nbsp;:</b> Ah, le logiciel&hellip;

source: <b>Q:</b> That's the kind of stuff I think I was more getting at with my question. So you have somebody who creates something useful but it has a zero distribution cost, and it's useful in a way that's not, not useful like celebrity, though I'm not sure, I don't think that's useful in some ways, but it's useful in the different sense that it takes a long time to create well.
fr: <b>Q&nbsp;:</b> C'est plus de ce genre de chose dont je voulais parler avec ma question. Donc vous avez quelqu'un qui cr&eacute;e quelque chose d'utile mais qui n'a aucun co&ucirc;t de distribution, et c'est utile d'une mani&egrave;re qui n'est pas, par exemple utile comme la c&eacute;l&eacute;brit&eacute;, bien que je ne suis pas s&ucirc;r, je ne pense pas que ce soit utile d'aucune mani&egrave;re, mais c'est utile dans le sens que cela prend beaucoup de temps pour bien le cr&eacute;er.

source: <b>Moglen:</b> See, the programmers I worked with all my life thought of themselves as artisans, and it was very hard to unionize them. They thought that they were individual creators. Software writers at the moment have begun to lose that feeling, as the world proletarianizes them much more severely than it used to. They're beginning to notice that they're workers, and not only that, but if you pay attention to the Presidential campaign currently going on around us, they are becoming aware of the fact that they are workers whose jobs are movable in international trade.
fr: <b>Moglen&nbsp;:</b> Voyez-vous, les programmeurs avec qui j'ai travaill&eacute; toute ma vie se consid&egrave;rent comme des artisans, et c'&eacute;tait extr&ecirc;mement difficile de les unifier. Ils pensaient qu'ils &eacute;taient des cr&eacute;ateurs individuels. Les auteurs de logiciel commencent en ce moment &agrave; perdre cette sensation, car le monde les prol&eacute;tarise beaucoup plus qu'avant. Ils commencent &agrave; remarquer qu'ils sont des ouvriers, et pas seulement cela, mais si vous faites attention &agrave; la campagne pr&eacute;sidentielle ayant actuellement lieu autour de nous, ils se rendent compte du fait qu'ils sont des ouvriers dont les emplois sont d&eacute;pla&ccedil;ables dans le commerce international.

source: We are actually doing more to sustain the livelihood of programmers than the proprietary people are. Mr. Gates has only so many jobs, and he will move them to where the programming is cheapest. Just you watch. We, on the other hand, are enabling people to gain technical knowledge which they can customize and market in the world where they live. We are making people programmers, right? And we are giving them a base upon which to perform their service activity at every level in the economy, from small to large.
fr: Nous faisons r&eacute;ellement plus pour prot&eacute;ger l'existence des programmeurs que les gens du syst&egrave;me propri&eacute;taire. M. Gates a seulement un certain nombre d'emplois, et ils les d&eacute;placera vers l'endroit o&ugrave; la programmation est au meilleur march&eacute;. Contentez-vous de regarder ce qui se passe. Nous, au contraire, rendons capables les personnes d'acqu&eacute;rir un savoir technique qu'ils peuvent configurer et adapter au march&eacute; dans le monde dans lequel ils vivent. Nous faisons des personnes programmeurs, n'est-ce pas&nbsp;? Et nous leur donnons une base sur laquelle ils peuvent exercer leur activit&eacute; &agrave; tous les niveaux de l'&eacute;conomie, depuis la petite &agrave; la grande &eacute;chelle.

source: There is programming work for fourteen-year-olds in the world now because they have the whole of GNU upon which to erect whatever it is that somebody in their neighbourhood wants to buy, and we are making enough value for the IBM corporation that it's worth putting billions of dollars behind.
fr: Il y a actuellement du travail de programmation pour des gens de quatorze ans parce qu'ils ont l'int&eacute;gralit&eacute; de GNU sur laquelle b&acirc;tir quoi que ce soit que quelqu'un dans leur voisinage d&eacute;sire acheter, et nous produisons assez de valeur pour IBM que cela vaut le coup d'investir des millions de dollars dedans.

source: If I were an employee of the IBM corporation right this moment, I would consider my job more secure where it is because of free software than if free software disappeared from the face of the earth, and I don't think most of the people who work at IBM would disagree with me.
fr: Si j'&eacute;tais employ&eacute; par IBM &agrave; ce moment pr&eacute;sent, je consid&eacute;rerais mon emploi comme plus en s&eacute;curit&eacute; gr&acirc;ce au logiciel libre que si le logiciel libre disparaissait de la surface de la terre, et je ne pense pas que beaucoup depersonnes qui travaillent chez IBM soient en d&eacute;saccord avec moi.

source: Of all the people who participate in the economy of zero marginal cost, I think the programmers can see most clearly where their benefits lie, and if you just wait for a few more tens of thousands of programming jobs to go from here to Bangalore, they'll see it even more clearly.
fr: De toutes les personnes qui participent &agrave; l'&eacute;conomie de co&ucirc;t marginal nul, je pense que les programmeurs peuvent voir vraiment clairement o&ugrave; se situe leur avantage, et si vous attendez simplement que quelques dizaines de milliers d'emplois en programmation partent vers Bangalore, ils le verront encore plus clairement.

source: <b>Q:</b> So, author writes software. The moment the software is fixed in a tangible medium, copyright attaches; others can't use it without further action by author. Author chooses to adopt the General Public License to govern what others can do with the software, and you made the intriguing point then that the General Public License gives, with certain limits, and that's why, you point out, nobody is really wanting to challenge it all that much because it would be a Pyrrhic challenge. If you win and the license evaporates, then it rubber-bands back to the author. That seems so persuasive, and almost proves too much, doesn't it? Because, suppose another author writes software, writes for now with the author and chooses to license it under the Grand Old Party License, by which only Republicans may make derivative works, and other, what would otherwise be copyright-infringing uses of the software. One, do you think such a license should be enforced by the courts? And two, couldn't you say the same logic would apply, that nobody would dare to challenge it because half a loaf is better than none? At least, let the Republicans use the software.
fr: <b>Q&nbsp;:</b> Donc, les auteurs &eacute;crivent du logiciel. Au moment o&ugrave; le logiciel est fix&eacute; dans un m&eacute;dium tangible, les copyrights s'y attachent&nbsp;; personne d'autre ne peut l'utiliser sans autre action de l'auteur. L'auteur choisit d'adopter la General Public License pour g&eacute;rer ce que les autres peuvent faire avec le logiciel, et vous avez dit cette chose intrigante que la GPL donne, dans certaines limites, et c'est pourquoi vous avez fait remarquer que personne ne veut vraiment la d&eacute;fier car ce serait une victoire &agrave; la Pyrrhus. Si vous gagnez et que la licence dispara&icirc;t, alors cela revient automatiquement &agrave; l'auteur. Cela semble convaincant, et prouve presque trop, n'est-ce pas&nbsp;? Parce que, supposons qu'un autre auteur &eacute;crive du logiciel, qu'il l'&eacute;crive pour le moment avec l'auteur et choisisse de le licencier sous la &laquo;&nbsp;Grand Old Party License&nbsp;&laquo;, selon laquelle seuls les R&eacute;publicains peuvent en tirer des travaux d&eacute;riv&eacute;s, et d'autre choses qui seraient sinon des infractions d'utilisation &agrave; la licence du logiciel. Premi&egrave;rement, pensez-vous qu'une licence de ce type devraient &ecirc;tre appliqu&eacute;e par les cours de justice&nbsp;? Et secondement, ne pourrait-on pas dire que la m&ecirc;me logique s'applique, que personne n'oserait la d&eacute;fier car un tiens est mieux que deux tu l'auras&nbsp;? Au moins, laissons les R&eacute;publicains utiliser le logiciel.

source: <b>Moglen: </b> So, fundamentally I think the question that you asked is, Has the law of copyright misuse evaporated entirely? And I think the answer, notwithstanding the Supreme Court's current deference to whatever Congress chooses to say, is no. I think there's still a common law of going too far out there, and as a lawyer who works on behalf of people who are fairly militant on behalf of sharing, I hear proposals all the time about stuff that they think it would be really neat to do that I don't think the copyright law, unalloyed by further contractualization will permit them to do.
fr: <b>Moglen&nbsp;:</b> Donc, fondamentalement je crois que la question que vous posez est, est-ce que l'abus de la loi sur les copyrights a enti&egrave;rement disparu&nbsp;? Et je pense que la r&eacute;ponse, quelque soit la d&eacute;f&eacute;rence actuelle de la Cour Supr&ecirc;me envers ce que le Congr&egrave;s choisira de dire, est non. Je pense qu'il y a toujours une habitude de d&eacute;passer les bornes, et en tant qu'avocat travaillant pour des gens qui sont plut&ocirc;t militants pour le partage, j'entends tout le temps des propositions sur des choses qu'ils pensent que ce serait vraiment bien de faire, et que je ne pense pas que la loi sur les copyrights, sans la modifier par de futurs contrats, leur permettra de faire.

source: I think the actual tool set of Berne-harmonized copyright law has certain limits on the power of the licensor, and I believe that those limits are capacious enough to allow us to create the kind of self-healing commons we have created, but I'm not sure that they would be strong enough to permit the importation of lots of additional contractualizing restrictions as though they were part of the body of copyright law itself.
fr: Je pense que le panel d'outils actuels de la loi sur les copyrights et sa r&eacute;vision de Berne a certaines limites sur le pouvoir du d&eacute;tenteur de licence, et je crois que ces limites sont suffisamment larges pour nous autoriser &agrave; cr&eacute;er le bien commun auto-r&eacute;parable que nous avons cr&eacute;&eacute;, mais je ne suis pas s&ucirc;r qu'elles seraient assez fortes pour permettre l'importation de beaucoup de restrictions contractuelles en tant que faisant part du corps de la loi sur les copyrights elle-m&ecirc;me.

source: Moreover I'm pretty sure that if you tried to do it and succeeded in one jurisdiction, you would find that the Berne Convention didn't actually export all of those propositions around the world for you, and that therefore you would have difficulty erecting a worldwide empire around the GPL Public License.
fr: De plus je suis assez certain que si vous essayiez et r&eacute;ussissiez dans une juridiction, vous vous rendriez compte que la Convention de Berne n'a pas export&eacute; toutes ces propositions dans le monde pour vous, et que dans ce cas vous auriez des difficult&eacute;s &agrave; &eacute;riger un empire mondial autour de la GPL Public License.

source: But I think you're correct to say another thing, which is that if there were a number of self-defending commons raised on different principles around the world, that that would create undesirable dead weight lawsuits, which is why I spend a fair amount of time trying to help people see why the GPL is good and doesn't require to be turned into the XPL and the YPL and the ZPL around the world. In fact I think in the next few years, we're going to have a greater consolidation of licenses, not a greater multiplication of them. But it's a conceptual issue of importance, and it depends upon the belief that copyright law all by itself permits some things and not others, and that you can only fill those gaps with the kind of contract law that we try not to use.
fr: Mais je pense que vous avez raison quand vous dites autre chose, que s'il y avait un certain nombre de biens communs s'auto-d&eacute;fendant b&acirc;tis selon diff&eacute;rents principes dans le monde, que cela cr&eacute;erait des proc&egrave;s poids-morts ind&eacute;sirables,et c'est pour cela que je passe une bonne partie de mon temps &agrave; essayer d'aider les gens &agrave; voir pourquoi la GPL est bonne et n'a pas besoin d'&ecirc;tre transform&eacute;e en XPL ou YPL et ZPL ailleurs dans le monde. En fait je pense que dans les prochaines ann&eacute;es, nous allons avoir une consolidation croissante des licences, et pas leur multiplication croissante. Mais c'est un probl&egrave;me conceptuel d'importance, et il d&eacute;pend de la croyance que la loi sur les copyrights elle-seule autorise certaines choses et pas d'autres, et que vous pouvez bouchez ces trous avec le type de loi de contrat que nous essayons de ne pas utiliser.

source: <b>Q:</b> Can you recommend any economists who have studied zero marginal cost economics?
fr: <b>Q&nbsp;:</b> Pouvez-vous recommander un &eacute;conomiste qui a &eacute;tudi&eacute; l'&eacute;conomie &agrave; co&ucirc;t marginal nul&nbsp;?

source: <b>Moglen:</b> Well, see now, I sometimes joke with my dear colleague, Yochai Benkler at Yale Law School, that Yochai is well-positioned now to win the final Nobel Prize in economics. But I fear that that's not quite correct and that people are beginning to flood in. I have a little bit this sort of feeling that sooner or later I'm going to wake up and find out that in Stockholm they've decided to award a prize to guys for teaching economics that we have known for 25 years.
fr: <b>Moglen&nbsp;:</b> Et bien, voyez, je plaisante parfois avec mon cher coll&egrave;gue, Yochai Benkler de la Yale Law School, que Yochai est maintenant bien plac&eacute; pour gagner le prix Nobel final en &eacute;conomie. Mais je crains que ce ne soit pas correct et que d'autres personnes commencent &agrave; arriver. J'ai quelque peu cette sorte de sentiment que t&ocirc;t ou tard je vais me r&eacute;veiller et d&eacute;couvrir qu'&agrave; Stockholm ils ont d&eacute;cid&eacute; d'attribuer un prix &agrave; des personnes ayant enseign&eacute; l'&eacute;conomie que nous connaissons depuis vingt-cinq ans.

source: Eric von Hippel is doing very important work about that, if you want to take just people living in the neighborhood. We are beginning to get in our business schools a bunch of people who are actually trying to think about these questions, because they see billions of dollars being bet and in good business school tradition, they tend to figure out that what rich businessmen and their investors are thinking about is something they might want to pay attention to.
fr: Eric von Hippel r&eacute;alise un travail tr&egrave;s important &agrave; ce sujet, si vous ne voulez vous int&eacute;resser qu'aux personnes du voisinage. Nous commen&ccedil;ons &agrave; avoir dans nos &eacute;coles de commerce un tas de gens qui essayent r&eacute;ellement de r&eacute;fl&eacute;chir&agrave; ces questions, parce qu'ils voient des millions de dollars &ecirc;tre pari&eacute;s et que dans la bonne tradition des &eacute;coles de commerce, ils sont en train de d&eacute;couvrir qu'ils devraient s'int&eacute;resser &agrave; ce &agrave; quoi les riches hommes d'affaire et leurs investisseurs pensent.

source: In the pure economics departments, unfortunately we remain a phenomenon too disquieting to consult just yet. But PhD students, of course, do not always do what their professors do, and my guess is that we are merely a few years away from the beginning of some rocket science on these subjects.
fr: Dans les d&eacute;partements d'&eacute;conomie pure, malheureusement nous restons un ph&eacute;nom&egrave;ne trop d&eacute;rangeant pour &ecirc;tre consult&eacute;s d&egrave;s maintenant. Mais les &eacute;tudiants en doctorat, bien s&ucirc;r, ne font pas toujours ce que leurs professeurs font, et j'ai l'intuition que nous sommes &agrave; peine &agrave; quelques ann&eacute;es du d&eacute;but d'une grande avanc&eacute;e sur ces sujets.

source: It's an enormous, beautiful opportunity for the revision of a field. Even in an economic, even in a discipline like economics, it is only so long that people can be prevented from working on really interesting problems. And the day is coming.
fr: C'est une &eacute;norme et magnifique opportunit&eacute; pour revoir tout le domaine. M&ecirc;me dans une &eacute;conomie, m&ecirc;me dans une discipline telle que l'&eacute;conomie, les gens ne peuvent &ecirc;tre emp&ecirc;ch&eacute;s de travailler sur un probl&egrave;me vraiment int&eacute;ressant qu'un temps limit&eacute;. Et ce temps arrive.

source: <b>Q:</b> Just a general question on market forces and the free software economy. Even in an ideal world, wouldn't you say that, you know, because of the market forces and then we, you know, a group of players become especially successful, then they actually &mdash; even though it's an ideal world &mdash; they actually become powerful enough and they monopolize under standards again, and we come back to the same system we have today. So, I guess the question is that whether this product-type system economy we have, is that just a function of the structure we have, or is that, you know, a result of just market forces?
fr: <b>Q&nbsp;:</b> Juste une question g&eacute;n&eacute;rale sur les forces de march&eacute; et l'&eacute;conomie du logiciel libre. M&ecirc;me dans un monde id&eacute;al, ne diriez-vous pas que, vous savez, &agrave; cause des forces de march&eacute; et ensuite nous, vous savez, un groupe de joueurs devient sp&eacute;cialement puissant, et en fait ils &mdash;m&ecirc;me si c'est un monde id&eacute;al&mdash; ils deviennent r&eacute;ellement suffisamment puissants et monopolisent une nouvelle fois sous des standards, et nous revenons au syst&egrave;me que nous avons aujourd'hui. Donc finalement ma question est si ce syst&egrave;me &eacute;conomique de type de produit que nous avons, est-ce juste une fonction de la structure que nous avons, ou est-ce le r&eacute;sultat des forces de march&eacute;&nbsp;?

source: <b>Moglen:</b> Well, the structure that we have constitutes what we call market forces. I wouldn't want to take the position that the market was a Newtonian mechanism that existed in the universe independent of human social interaction.
fr: <b>Moglen&nbsp;:</b> Et bien, la structure que nous avons constitue ce que nous appelons une force de march&eacute;. Je ne voudrais pas affirmer que le march&eacute; est un m&eacute;canisme newtonien qui existait dans l'univers ind&eacute;pendamment de l'interaction humaine.

source: Look, what we are doing is trying, through legal institutions directed at the protection of a commons, to prevent that commons from suffering tragedy. Because the content of that commons is capable of renewal and has zero marginal cost, the tragedy we're trying to prevent is not Garrett Hardin's one, which was based upon the inherent exhaustibility of natural resources of certain kinds. But there is no question that the commons that we are making is capable of being appropriated and destroyed in the ways that you suggest.
fr: Regardez, ce que nous essayons de faire, &agrave; travers des institutions l&eacute;gales d&eacute;vou&eacute;es &agrave; la protection du bien commun, est d'&eacute;viter que ce bien commun ne subisse une trag&eacute;die. Du fait que le contenu de ce bien commun est capable de renouvellement et n'a aucun co&ucirc;t marginal, la trag&eacute;die que nous essayons d'&eacute;viter n'est pas celle de Garret Hardin, qui &eacute;tait bas&eacute;e sur l'exhaustion inh&eacute;rente des ressources naturelles d'un certain type. Mais il est certain que le bien commun que nous faisons est susceptible d'&ecirc;tre appropri&eacute; et d&eacute;truit de la mani&egrave;re que vous sugg&eacute;rez.

source: Those of us who believe in the GNU GPL as a particularly valuable license to use believe in that because we think that there are other licenses which too weakly protect the commons and which are more amenable to a form of appropriation that might be ultimately destructive &mdash; this is our concern with the freedoms presented, for example, by the BSD license &mdash; we are concerned that though the freedoms in the short term seem even greater, that the longterm result is more readily the one that you are pointing at, market participants who are free to propriatize the content of the commons may succeed in so effectively propriatizing it as to drive the commons out of use altogether, thus, if you like, killing the goose that laid the golden egg in the first place.
fr: Ceux d'entre nous qui croient que la GNU GPL est une licence particuli&egrave;rement importante le croient parce que nous pensons qu'il y a d'autres licences qui prot&egrave;gent trop faiblement le bien commun et qui pourraient &ecirc;tre amen&eacute;es vers une forme d'appropriation qui a terme serait destructrice. C'est notre souci avec les libert&eacute;s pr&eacute;sent&eacute;es, par exemple, par la licence BSD. Nous sommes inquiets que, bien que les libert&eacute;s &agrave; court terme semblent plus grandes, les r&eacute;sultats &agrave; long terme soient plus ceux que vous montrez, des participants au march&eacute; libres de s'approprier le contenu du bien commun pourraient avoir suffisamment de succ&egrave;s dans leur appropriation pour rendre le bien commun inutilisable en entier, tuant ainsi la poule ayant pondu l'œuf d'or directement.

source: So, to some extent, I would say, avoidance of the tragedy of the commons in our world depends upon the structuring of the commons. Institutions alone, as I also pointed out earlier in this conversation however, commons resources need active management.
fr: Donc, d'une certaine mani&egrave;re, je dirais qu'&eacute;viter la trag&eacute;die du bien commun dans notre monde d&eacute;pend de la structure de ce bien commun. &Eacute;tant uniquement une institution, ainsi que je l'ai d&eacute;j&agrave; signal&eacute; pr&eacute;c&eacute;demment dans cette conversation, les biens communs n&eacute;cessitent &eacute;galement une gestion active.
