Repository: gitGNU/gnu_www-fr
Catalog: philosophy/moglen-harvard-speech-2004.*.po
Languages: fr

source: I think it would be appropriate to suggest, if you like, that where we now are is in a world, where, if I may employ a metaphor, Mr. McBride and his colleagues &mdash; I do mean those in Redmond, as well as those in Utah &mdash; think that roads should all be toll roads. The ability to get from here to there's a product. Buy it, or we exclude you from it. Others believe that highways should be public utilities. Let us figure out how to use the public highways best, so that everybody can profit from them - from the reduction of the costs of transportations of goods and the provisions of services &mdash; and by the by, there will be plenty of money to pay traffic engineers and the people who fix the pot holes.
fr: Je pense qu'il serait utile d'indiquer, si vous le voulez bien, que l'endroit o&ugrave; nous sommes est un monde dans lequel, si je peux employer une m&eacute;taphore, M. McBride et ses coll&egrave;gues &mdash; et je veux effectivement parler de ceux de Redmond, ainsi que de ceux en Utah &mdash; pensent que toutes les routes devraient &ecirc;tre &agrave; p&eacute;age. La possibilit&eacute; d'aller d'un endroit &agrave; un autre est un produit. Achetez-le ou nous vous excluons de cette possibilit&eacute;. D'autre personnes croient que les autoroutes devraient &ecirc;tre des services publics. Faisons en sorte d'utiliser les autoroutes de la meilleure fa&ccedil;on possible, de telle mani&egrave;re que tout le monde puisse en b&eacute;n&eacute;ficier &mdash; de la r&eacute;duction des co&ucirc;ts des transports de marchandise et des co&ucirc;ts de mise &agrave; disposition de service &mdash; et de cette mani&egrave;re, il y aura de l'argent en abondance pour payer les ing&eacute;nieurs du trafic et les gens qui r&eacute;parent les nids de poule.

source: We believe, for what little our view of the economics of the software market may be worth in the 21st century &mdash; after all we are the people who transformed it &mdash; we believe that the public utility service conception of software better reflects economic actuality in the 21st century. We are not surprised that Mr. McBride is going out of business on the other business model.
fr: Nous croyons, pour la simple valeur que peut avoir notre vision sur l'&eacute;conomie du march&eacute; logiciel au XXI&egrave;me si&egrave;cle &mdash;apr&egrave;s tout nous sommes les gens qui l'ont transform&eacute;&mdash; nous croyons que la conception de service public du logiciel refl&egrave;te mieux l'actualit&eacute; &eacute;conomique du XXI&egrave;me si&egrave;cle. Nous ne sommes pas surpris de voir que M. McBride perde le march&eacute; avec son autre mod&egrave;le &eacute;conomique.

source: Mr. McBride's claim is that he is going out of business because somebody has taken what belongs to him. That's a lawsuit. As it turns out, however, the people he believes have taken what don't belong to him aren't us. His theory is that various people promised AT&amp;T at various times that they would do or refrain from doing various things, that some of the people who promised AT&amp;T in the old days to do or refrain from doing various things broke those promises, and that out of the breaking of those promises, Linux, a computer program distributed under free terms, benefitted.
fr: La r&eacute;clamation de M. McBride est qu'il est en train de perdre le march&eacute; &agrave; cause de quelqu'un qui lui prend ce qui lui appartient. C'est un proc&egrave;s. Au vu de la situation cependant, les gens dont il croit qu'ils ont pris ce qui ne lui appartient en fait pas, ne sont pas nous. Sa th&eacute;orie est que des personnes vari&eacute;es ont promis &agrave; AT&amp;T &agrave; diff&eacute;rents moments qu'ils feraient ou ne feraient pas diff&eacute;rentes choses, que certaines de ces personnes ayant promis &agrave; AT&amp;T il y a longtemps de faire ou de ne pas faire certaines choses n'ont pas tenu leur promesses, et qu'un programme informatique distribu&eacute; sous licence libre, Linux, a b&eacute;n&eacute;fici&eacute; de la rupture de ces promesses.

source: Mr. McBride may be right about that or he may be wrong. We do not know what the contents of those contracts are in general terms, and we do not even know, as Mr. McBride pointed out to you when he was here, that he is the beneficiary of those contracts. He is presently in litigation trying to prove that he has what he claims to have &mdash; certain contract rights which he claims were conveyed to him by Novell. I have no opinion about whose rights those are, and I wish Mr. McBride luck in his litigation over that question.
fr: Il est possible que M. McBride ait raison &agrave; ce propos comme il peut avoir tort. Nous ne connaissons pas le contenu pr&eacute;cis de ces contrats, et nous ne savons m&ecirc;me pas, comme M. McBride vous l'a pr&eacute;cis&eacute; quand il &eacute;tait ici, qu'il est le b&eacute;n&eacute;ficiaire de ces contrats. Il est actuellement en litige essayant de prouver qu'il a ce qu'il se r&eacute;clame de poss&eacute;der &mdash; certains droits contractuels dont il affirme qu'ils lui ont &eacute;t&eacute; confi&eacute;s par Novell. Je n'ai aucune opinion sur l'identit&eacute; du possesseur de ces droits, et je souhaite bonne chance &agrave; M. McBride dans son litige sur cette question.

source: But what Mr. McBride has also claimed is that our creative works are somehow dominated by those contract disputes, dominated in the sense that he has claimed, though so far not behaved in concert with the claim, that users of free software are liable to him, or to his firm, on the basis of claims that grow out of the contractual relations between AT&amp;T, Sequent, IBM, and others, over time.
fr: Mais ce que M. McBride a &eacute;galement revendiqu&eacute; est que nos travaux cr&eacute;atifs sont d'une certaine mani&egrave;re couverts par ces conflits contractuels, couverts dans le sens o&ugrave; il a revendiqu&eacute;, bien que jusqu'ici il n'ait pas agi en accord avec sa revendication, que les utilisateurs de logiciels libres lui sont oblig&eacute;s, &agrave; lui ou &agrave; sa compagnie, sur la base des revendications qui viennent de relations contractuelles entre AT&amp;T, Sequent, IBM, et d'autres, sur une certaine p&eacute;riode.

source: I have spent a fair amount of time tediously reflecting on whether each piece of the story, as Mr. McBride and his colleagues have told it, could amount to a copyright claim against third parties.
fr: J'ai pass&eacute; une longue et fatigante p&eacute;riode &agrave; &eacute;tudier si chaque pi&egrave;ce de l'histoire, comme M. McBride et ses coll&egrave;gues l'ont rapport&eacute;, pourrait mener &agrave; une revendication de copyright contre une tierce partie.

source: I have spent that time because there were lots of third parties out there in the world who were concerned about assertions of copyright problems that Mr. McBride was making. I have confronted wraithlike examples of what were said to be derivative work but weren't derivative work under copyright law, or asserted copyright claims that turned out to be based on code that nobody owned ascertainably and had been in the public domain for a lengthy period of time, or code that Mr. McBride claimed he was entitled to prevent people to stop using long after he had deliberately given to people that very code under promises that they could use it, copy, modify it and distribute any way that they want.
fr: J'ai pass&eacute; ce temps car il y aurait de nombreuses tierces parties dans le monde impliqu&eacute;es par les affirmations de probl&egrave;mes de copyright mentionn&eacute;s par M. McBride. J'ai d&eacute;mont&eacute; des exemples fant&ocirc;mes de ce qui &eacute;tait appel&eacute; travail d&eacute;riv&eacute; mais n'&eacute;taient pas des travaux d&eacute;riv&eacute;s au sens l&eacute;gal, ou des revendications de copyright qui se sont r&eacute;v&eacute;l&eacute;s porter sur du code que personne ne poss&egrave;de et est pr&eacute;sent dans le domaine public depuis des ann&eacute;es, ou du code que M. McBride affirmait &ecirc;tre charg&eacute; d'emp&ecirc;cher des personnes de l'utiliser, longtemps apr&egrave;s qu'il ait d&eacute;lib&eacute;r&eacute;ment donn&eacute; &agrave; ces personnes pr&eacute;cis&eacute;ment ce code sous promesse qu'ils puissent l'utiliser, le copier, le modifier et le distribuer de la fa&ccedil;on qu'ils voudraient.

source: And bit by bit, I have found myself unable to discover a single way in which Mr. McBride's firm could claim against third parties, not those who had ever been in privity of contract with AT&amp;T or its successors over code in the Unix operating system, anything that could force them to pay damages or stop them from using free software.
fr: Et petit &agrave; petit, je me suis trouv&eacute; incapable de d&eacute;couvrir d'aucune mani&egrave;re comment l'entreprise de M. McBride pourrait faire des revendications contre des tierces parties, m&ecirc;me ceux qui ont &eacute;t&eacute; en contrat priv&eacute;s avec AT&amp;T ou leurs successeurs sur du code pr&eacute;sent dans le syst&egrave;me d'exploitation Unix, ni quoi que ce soit qui puisse les forcer &agrave; payer des dommages et int&eacute;r&ecirc;ts ou les emp&ecirc;cher d'utiliser du logiciel libre.

source: This is the thing we call SCO, not a lawsuit actually brought on the basis of promises exchanged between IBM and AT&amp;T, but a mysterious belief that somewhere out in the world tens of thousands of people might have to stop using billions of dollars worth of software that we made it possible for them to have at marginal cost solely because of some agreement between AT&amp;T and somebody else to which Mr McBride's firm is a successor in interest.
fr: C'est cela que nous appelons SCO, non pas un proc&egrave;s r&eacute;ellement bas&eacute; sur des promesses &eacute;chang&eacute;es entre IBM et AT&amp;T, mais une croyance myst&eacute;rieuse que quelque part dans le monde des dizaines de milliers de personnes devraient arr&ecirc;ter d'utiliser du logiciel d'une valeur de millions de dollars dont nous avons rendu possible l'acquisition pour un co&ucirc;t marginal uniquement &agrave; cause de quelque agr&eacute;ment entre AT&amp;T et quelqu'un d'autre de qui la soci&eacute;t&eacute; de M. McBride a repris les int&eacute;r&ecirc;ts.

source: I see no substance to that claim. And I am prepared, under the guidance of your searching and hostile questioning, to explain bit by bit why I think that's true. But I have published those various inquiries, and I don't want to recapitulate them here this evening. I think that that would be a poor use of our time together.
fr: Je ne vois aucune substance dans cette revendication. Et je suis pr&ecirc;t, suivant votre recherche et votre questionnement hostile, &agrave; expliquer petit &agrave; petit pourquoi je pense que c'est vrai. Mais j'ai publi&eacute; ces diff&eacute;rentes investigations, et je ne veux pas les r&eacute;capituler ici ce soir. Je pense que ce serait un gaspillage du temps que nous passons ensemble.

source: At <a href="/philosophy/sco/">www.gnu.org/philosophy/sco</a>, all of it in lower case letters, you will find the various papers that I have written and that Mr. Stallman has written on these subjects, and there I hope we will have taken up in detail all the various points.
fr: Sur <a href="/philosophy/sco/sco.fr.html">www.gnu.org/philosophy/sco/</a>, le tout en minuscule, vous trouverez les diff&eacute;rents papiers que j'ai &eacute;crit ainsi que M. Stallman sur ces sujets, et dans lesquels j'esp&egrave;re que nous avons relev&eacute; en d&eacute;tail chaque point.

source: But it's hard to resist talking about the United States Supreme Court in a classroom at Harvard Law School. And so, for just a moment, I do want to engage in a little court watching with you.
fr: Mais il est difficile de r&eacute;sister &agrave; l'envie de parler de la Cour Supr&ecirc;me des &Eacute;tats-Unis dans une salle de cours de la Harvard Law School. Donc, juste pour un moment, je veux m'engager dans une br&egrave;ve observation de ce proc&egrave;s avec vous.

source: Mr. McBride, when he was here, had much to say about a case called Eldred against Ashcroft, in which Mr. McBride discovers that the United States Supreme Court came out 7-2 against free software and in favor of capitalism [laughter from audience]. The odd thing is that on the very day when Mr. McBride was standing here discussing that subject with you, I was in Los Angeles discussing the very same thing with a fellow called Kevin McBride, Mr. McBride's brother and the actual author of the document from which Mr. McBride was speaking.
fr: M. McBride, quand il est venu ici, a eu beaucoup &agrave; dire &agrave; propos du cas appel&eacute; Eldred contre Ashcroft, dans lequel M. McBride a d&eacute;couvert que la Cour Supr&ecirc;me des &Eacute;tats-Unis est parvenue &agrave; 7-2 contre le logiciel libre et en faveur du capitalisme [rires dans l'assistance]. Ce qui est bizarre est que le m&ecirc;me jour o&ugrave; M. McBride se tenait ici et discutait de ce sujet avec vous, j'&eacute;tais &agrave; Los Angeles pour discuter de la m&ecirc;me chose avec quelqu'un appel&eacute; Kevin McBride, le fr&egrave;re de M. McBride et l'auteur du document duquel M. McBride parlait.

source: Kevin McBride has the advantage in this discussion of being a lawyer, which is a little bit of help in discussing the United States Supreme Court. But it is not quite enough help.
fr: Kevin McBride avait l'avantage d'&ecirc;tre avocat dans cette discussion, ce qui aide l&eacute;g&egrave;rement pour parler de la Cour Supr&ecirc;me des &Eacute;tats-Unis. Mais ce n'&eacute;tait pas une aide tout &agrave; fait suffisante.

source: The primary trick in discussing cases - I shrink from saying that even in this room where I have taught first-year law students &mdash; the primary trick in discussing cases is to separate holding from dicta, a job with which many lugubrious Septembers and Octobers have been occupied by lawyers all over the planet and by every single one of you here.
fr: Le premier truc pour discuter d'affaires &mdash;je fr&eacute;mis de dire cela dans cette salle o&ugrave; j'ai enseign&eacute; &agrave; des &eacute;l&egrave;ves de premi&egrave;re ann&eacute;e en droit&mdash; le premier truc pour discuter d'affaires est de s&eacute;parer le &laquo;&nbsp;holding&nbsp;&raquo; du dictat, un travail avec lequel des avocats du monde entier et chacun d'entre vous ont occup&eacute; de nombreux mois lugubres de septembre et d'octobre.

source: The McBrides, jointly &mdash; I feel sometimes as though I'm in a Quentin Tarantino movie of some sort with them [laughter] &mdash; the McBrides have failed to distinguish adequately between dicta and holding.
fr: Les McBride, ensemble &mdash;j'ai parfois l'impression d'&ecirc;tre dans une sorte de film de Quentin Tarantino avec eux [rires]&mdash; les McBride ont &eacute;chou&eacute; &agrave; distinguer de mani&egrave;re ad&eacute;quate le &laquo;&nbsp;holding&nbsp;&raquo; du dictat.

source: I do not like Eldred against Ashcroft. I think it was wrongly decided. I filed a brief in it, amicus curiae, and I assisted my friend and colleague Larry Lessig in the presentation of the main arguments which did not, regrettably, succeed.
fr: Je n'aime pas Eldred contre Ashcroft. Je pense que le jugement n'a pas &eacute;t&eacute; bien rendu. J'ai rempli une lettre dans cette affaire, amicus curiae, et j'ai aid&eacute; mon ami et coll&egrave;gue Larry Lessig dans la pr&eacute;sentation des arguments principaux, qui n'a, malheureusement, pas gagn&eacute;.

source: Oddly enough, and I will take you through this just enough to show, oddly enough, it is the position that we were taking in Eldred against Ashcroft, which if you stick to holding rather than dicta, would be favorable to the position now being urged by Mr. McBride. What happened in Eldred against Ashcroft, as opposed to the window dressing of it, is actually bad for the argument that Mr. McBride has been presenting, whichever Mr. McBride it is. But they have not thought this through enough.
fr: Bizarrement, et je vous expliquerai cela juste suffisamment pour vous le montrer, bizarrement, c'est la position que nous avons pris dans Eldred contre Ashcroft, si vous restez sur le &laquo;&nbsp;holding&nbsp;&raquo; plut&ocirc;t que sur le dictat, qui serait favorable &agrave; la position actuellement exig&eacute;e par M. McBride. Ce qui s'est pass&eacute; dans Eldred contre Ashcroft, &agrave; l'oppos&eacute; du cadre qu'il pr&eacute;sente, est en fait mauvais pour l'argument que M. McBride a pr&eacute;sent&eacute;, quel que soit le M. McBride en question. Mais il n'y ont pas r&eacute;fl&eacute;chi assez.

source: Let me show you why. The grave difficulty that SCO has with free software isn't their attack; it's the inadequacy of their defense. In order to defend yourself in a case in which you are infringing the freedom of free software, you have to be prepared to meet a call that I make reasonably often with my colleagues at the Foundation who are here tonight. That telephone call goes like this:<br /> &ldquo;Mr. Potential Defendant, you are distributing my client's copyrighted work without permission. Please stop. And if you want to continue to distribute it, we'll help you to get back your distribution rights, which have terminated by your infringement, but you are going to have to do it the right way.&rdquo;
fr: Laissez-moi vous expliquer pourquoi. L'&eacute;norme difficult&eacute; que SCO a avec le logiciel libre n'est pas leur attaque, mais que leur d&eacute;fense est inad&eacute;quate. Pour vous d&eacute;fendre dans une affaire dans laquelle vous &ecirc;tes en infraction avec la libert&eacute; du logiciel libre, vous devez &ecirc;tre pr&ecirc;t &agrave; r&eacute;pondre &agrave; un appel que j'effectue assez souvent avec mes coll&egrave;gues de la fondation qui sont pr&eacute;sents ici ce soir. Cet appel t&eacute;l&eacute;phonique ressemble &agrave; cela&nbsp;: &laquo;&nbsp;M. D&eacute;fenseur Potentiel, vous distribuez le travail de mon client plac&eacute; sous copyright sans sa permission. Veuillez cessez. Et si vous voulez continuer &agrave; le distribuer, nous vous aiderons &agrave; retrouver vos droits de distribution qui ont cess&eacute; avec votre infraction, mais vous allez devoir le faire de la bonne fa&ccedil;on&nbsp;&raquo;.

source: At the moment that I make that call, the potential defendant's lawyer now has a choice. He can cooperate with us, or he can fight with us. And if he goes to court and fights with us, he will have a second choice before him. We will say to the judge, &ldquo;Judge, Mr. Defendant has used our copyrighted work, copied it, modified it and distributed it without permission. Please make him stop.&rdquo;
fr: Au moment o&ugrave; je passe cet appel, l'avocat du d&eacute;fenseur potentiel a d&eacute;sormais un choix. Il peut coop&eacute;rer avec nous ou nous combattre. Et s'il se rend en justice pour nous combattre, il aura un second choix devant lui. Nous dirons aux juges, &laquo;&nbsp;Monsieur le juge, M. le D&eacute;fenseur a utilis&eacute; notre travail prot&eacute;g&eacute; par copyright, l'a copi&eacute;, modifi&eacute; et distribu&eacute; sans notre permission. Merci de le faire cesser&nbsp;&raquo;.

source: One thing that the defendant can say is, &ldquo;You're right. I have no license.&rdquo; Defendants do not want to say that, because if they say that they lose. So defendants, when they envision to themselves what they will say in court, realize that what they will say is, &ldquo;But Judge, I do have a license. It's this here document, the GNU GPL. General Public License,&rdquo; at which point, because I know the license reasonably well, and I'm aware in what respect he is breaking it, I will say, &ldquo;Well, Judge, he had that license but he violated its terms and under Section 4 of it, when he violated its terms, it stopped working for him.&rdquo;
fr: Une des choses que le d&eacute;fenseur peut r&eacute;pondre est, &laquo;&nbsp;Vous avez raison. Je n'ai pas de licence&nbsp;&raquo;. Les d&eacute;fenseurs ne veulent en g&eacute;n&eacute;ral pas dire cela car s'ils le font, ils perdent. Donc les d&eacute;fenseurs, quand ils imaginent ce qu'ils diront au tribunal, r&eacute;alisent que ce qu'ils diront est,&laquo;&nbsp;Mais M. le juge, j'ai une licence. C'est ce document, la GNU GPL. General Public License&nbsp;&raquo;. &Agrave; ce moment-l&agrave;, comme je connais la licence assez bien, et que je sais de quelle mani&egrave;re elle est viol&eacute;e, je dirai, &laquo;&nbsp;Eh bien M. le juge, il avait cette licence mais a viol&eacute; ses termes et selon la section 4 de cette licence, quand il a viol&eacute; ses termes elle a cess&eacute; de fonctionner pour lui&nbsp;&raquo;.

source: But notice that in order to survive moment one in a lawsuit over free software, it is the defendant who must wave the GPL. It is his permission, his master key to a lawsuit that lasts longer than a nanosecond. This, quite simply, is the reason that lies behind the statement you have heard &mdash; Mr. McBride made it here some weeks ago &mdash; that there has never been a court test of the GPL.
fr: Mais notez que pour survivre le premier instant dans un proc&egrave;s sur le logiciel libre, c'est le d&eacute;fenseur qui doit agiter la GPL. C'est son autorisation, sa pi&egrave;ce ma&icirc;tresse pour un proc&egrave;s qui dure plus qu'une nanoseconde. Ceci, assez simplement, est ce qui explique la d&eacute;claration que vous avez entendue &mdash;M. McBride l'a exprim&eacute;e ici il y a quelques semaines&mdash; que la GPL n'a jamais &eacute;t&eacute; attaqu&eacute;e en justice.

source: To those who like to say there has never been a court test of the GPL, I have one simple thing to say: Don't blame me. I was perfectly happy to roll any time. It was the defendants who didn't want to do it. And when for ten solid years, people have turned down an opportunity to make a legal argument, guess what? It isn't any good.
fr: Pour tout ceux qui aiment dire que la GPL n'a jamais &eacute;t&eacute; attaqu&eacute;e en justice, je n'ai qu'une chose extr&ecirc;mement simple a dire&nbsp;: ne me jetez pas la pierre. Je serais tout &agrave; fait heureux de le faire &agrave; n'importe quel moment. Ce sont les d&eacute;fenseurs qui n'ont pas voulu le faire. Et si pendant 10 ans, tout le monde a n&eacute;glig&eacute; l'opportunit&eacute; de lancer une bataille l&eacute;gale, devinez quoi&nbsp;? Ce n'est pas sans raison.

source: The GPL has succeeded for the last decade, while I have been tending it, because it worked, not because it failed or was in doubt. Mr. McBride and his colleagues now face that very same difficulty, and the fellow on the other side is IBM. A big, rich, powerful company that has no intention of letting go.
fr: La GPL a r&eacute;ussi durant la derni&egrave;re d&eacute;cade, parce que je m'en suis occup&eacute;, parce qu'elle marchait, pas parce qu'elle ne marchait pas ou &eacute;tait mise en doute. M. McBride et ses coll&egrave;gues font maintenant face &agrave; cette m&ecirc;me difficult&eacute;, et la personne en face est IBM. Une grosse, riche et puissante compagnie qui n'a pas l'intention de l&acirc;cher le morceau.

source: They have distributed the operating system kernel program called Linux. That is, SCO has. They continue to do so to their existing customers because they have a contractual responsibility to provide maintenance.
fr: Ils ont distribu&eacute; le noyau du syst&egrave;me d'exploitation appel&eacute; Linux. En fait, SCO l'a fait. Ils continuent de le faire pour leurs clients existants puisqu'ils ont une responsabilit&eacute; contractuelle de fournir la maintenance.
