Repository: gitGNU/gnu_www-fr
Catalog: philosophy/motivation.*.po
Languages: fr

source: Studies Find Reward Often No Motivator - GNU Project - Free Software Foundation (FSF)
fr: Des &eacute;tudes montrent que la r&eacute;compense n'est pas un moteur de motivation - GNU Project - Free Software Foundation (FSF)

source: Studies Find Reward Often No Motivator
fr: Des &eacute;tudes montrent que la r&eacute;compense n'est pas un moteur de motivation

source: Creativity and intrinsic interest diminish if task is done for gain
fr: La cr&eacute;ativit&eacute; et l'int&eacute;r&ecirc;t intrins&egrave;que diminuent si la t&acirc;che est accomplie pour de l'argent

source: by <strong>Alfie Kohn</strong> <br /> Special to the Boston Globe <br /> [reprinted with permission of the author from the Monday, 19 January 1987, Boston Globe. Also granted translation rights by kind courtesy of the author in 2003. ed.]
fr: par <strong>Alfie Kohn</strong><br />Article sp&eacute;cial du Boston Globe<br />[r&eacute;imprim&eacute; avec la permission de l'auteur, du lundi 19 janvier 1987, Boston Globe. Les droits de traduction sont &eacute;galement autoris&eacute;s avec l'aimable permission de l'auteur en 2003. ed.]

source: In the laboratory, rats get Rice Krispies. In the classroom the top students get A's, and in the factory or office the best workers get raises. It's an article of faith for most of us that rewards promote better performance.
fr: En laboratoire, les rats gagnent des c&eacute;r&eacute;ales, en classe, les meilleurs &eacute;tudiants obtiennent un 20/20 et, &agrave; l'usine ou au bureau, les meilleurs travailleurs obtiennent des augmentations. Pour la plupart d'entre nous, c'est un credo que les r&eacute;compenses poussent &agrave; de meilleures performances.

source: But a growing body of research suggests that this law is not nearly as ironclad as was once thought. Psychologists have been finding that rewards can lower performance levels, especially when the performance involves creativity.
fr: Mais un nombre grandissant de recherches sugg&egrave;re que cette loi n'est plus aussi solide qu'on le pensait. Les psychologues ont &eacute;t&eacute; amen&eacute;s &agrave; trouver que les r&eacute;compenses peuvent diminuer le niveau des performances, surtout si la performance &agrave; trait &agrave; la cr&eacute;ativit&eacute;.

source: A related series of studies shows that intrinsic interest in a task &mdash; the sense that something is worth doing for its own sake &mdash; typically declines when someone is rewarded for doing it.
fr: Une s&eacute;rie d'articles montre que l'int&eacute;r&ecirc;t intrins&egrave;que pour une t&acirc;che, le sentiment qu'une chose vaille la peine qu'on la fasse pour elle-m&ecirc;me, d&eacute;cline de fa&ccedil;on caract&eacute;ristique lorsqu'on r&eacute;compense quelqu'un pour accomplir cette t&acirc;che.

source: If a reward &mdash; money, awards, praise, or winning a contest &mdash; comes to be seen as the reason one is engaging in an activity, that activity will be viewed as less enjoyable in its own right.
fr: Si une r&eacute;compense (argent, prix, &eacute;loge ou gagner une comp&eacute;tition) vient &agrave; &ecirc;tre consid&eacute;r&eacute;e comme la raison de s'engager dans une activit&eacute;, cette m&ecirc;me activit&eacute; sera per&ccedil;ue comme fondamentalement moins agr&eacute;able.

source: With the exception of some behaviorists who doubt the very existence of intrinsic motivation, these conclusions are now widely accepted among psychologists. Taken together, they suggest we may unwittingly be squelching interest and discouraging innovation among workers, students and artists.
fr: &Agrave; l'exception de quelques B&eacute;havioristes qui doutent de l'existence r&eacute;elle de la motivation intrins&egrave;que, ces conclusions sont maintenant largement accept&eacute;es dans le monde des psychologues. Globalement, elles sugg&egrave;rent que nous r&eacute;primerions, inconsciemment, l'int&eacute;ressement et que nous d&eacute;couragerions l'innovation chez les travailleurs, les &eacute;tudiants et les artistes.

source: The recognition that rewards can have counter-productive effects is based on a variety of studies, which have come up with such findings as these: Young children who are rewarded for drawing are less likely to draw on their own that are children who draw just for the fun of it. Teenagers offered rewards for playing word games enjoy the games less and do not do as well as those who play with no rewards. Employees who are praised for meeting a manager's expectations suffer a drop in motivation.
fr: Reconna&icirc;tre que les r&eacute;compenses peuvent avoir des effets contre-productifs, s'appuie sur de nombreuses &eacute;tudes qui ont montr&eacute; par exemple que&nbsp;: les enfants r&eacute;compens&eacute;s pour avoir fait un dessin sont moins enclins &agrave; dessiner d'eux-m&ecirc;mes que ceux qui dessinent juste pour s'amuser. Les adolescents r&eacute;compens&eacute;s aux jeux de lettres y prennent moins de plaisir et ne font pas aussi bien que ceux qui jouent sans r&eacute;compenses. Les employ&eacute;s qui re&ccedil;oivent des &eacute;loges pour avoir r&eacute;ussi dans ce que leur demandait leur patron, souffrent d'une baisse de motivation.

source: Much of the research on creativity and motivation has been performed by Theresa Amabile, associate professor of psychology at Brandeis University. In a paper published early last year on her most recent study, she reported on experiments involving elementary school and college students. Both groups were asked to make &ldquo;silly&rdquo; collages. The young children were also asked to invent stories.
fr: La plupart des recherches sur la cr&eacute;ativit&eacute; et la motivation ont &eacute;t&eacute; men&eacute;es par Theresa Amabile, Professeur adjointe de psychologie &agrave; l'Universit&eacute; de Brandeis. Au d&eacute;but de l'ann&eacute;e derni&egrave;re, dans un journal publiant ses toutes derni&egrave;res recherches, elle rapportait des exp&eacute;riences effectu&eacute;es en milieux scolaire et &eacute;tudiant. On a demand&eacute; aux deux groupes de r&eacute;aliser des collages &laquo;&nbsp;saugrenus&nbsp;&raquo;. On a demand&eacute; aussi aux jeunes enfants d'inventer des histoires.

source: The least-creative projects, as rated by several teachers, were done by those students who had contracted for rewards. &ldquo;It may be that commissioned work will, in general, be less creative than work that is done out of pure interest,&rdquo; Amabile said.
fr: Les projets les moins cr&eacute;atifs, ainsi &eacute;valu&eacute;s par plusieurs enseignants, ont &eacute;t&eacute; r&eacute;alis&eacute;s par les &eacute;tudiants &agrave; qui on a avait promis une r&eacute;compense. &laquo;&nbsp;Il se peut qu'un travail commissionn&eacute; soit, en g&eacute;n&eacute;ral, moins cr&eacute;atif qu'un travail fait en dehors de toute consid&eacute;ration int&eacute;ress&eacute;e&nbsp;&raquo;, dit Mme Amabile.

source: In 1985, Amabile asked 72 creative writers at Brandeis and at Boston University to write poetry. Some students then were given a list of extrinsic (external) reasons for writing, such as impressing teachers, making money and getting into graduate school, and were asked to think about their own writing with respect to these reasons. Others were given a list of intrinsic reasons: the enjoyment of playing with words, satisfaction from self-expression, and so forth. A third group was not given any list. All were then asked to do more writing.
fr: En 1985, Amabile demanda &agrave; 72 &eacute;crivains cr&eacute;atifs des Universit&eacute;s de Brandeis et de Boston d'&eacute;crire de la po&eacute;sie. On a donn&eacute; alors &agrave; quelques &eacute;tudiants les raisons extrins&egrave;ques (externes) d'&eacute;crire, comme d'impressionner le professeur, gagner de l'argent et de passer le troisi&egrave;me cycle et on leur a demand&eacute; de r&eacute;fl&eacute;chir &agrave; ce qu'ils pourraient mettre dans leur propre &eacute;criture, en respectant ces raisons. On a donn&eacute; &agrave; d'autres une liste de raisons intrins&egrave;ques&nbsp;: le plaisir de jouer avec les mots, la satisfaction de s'exprimer soi-m&ecirc;me etc. Aucune liste n'a &eacute;t&eacute; donn&eacute;e &agrave; un troisi&egrave;me groupe. Puis on a demand&eacute; &agrave; tous d'&eacute;crire plus encore.

source: The results were clear. Students given the extrinsic reasons not only wrote less creatively than the others, as judged by 12 independent poets, but the quality of their work dropped significantly. Rewards, Amabile says, have this destructive effect primarily with creative tasks, including higher-level problem-solving. &ldquo;The more complex the activity, the more it's hurt by extrinsic reward,&rdquo; she said.
fr: Les r&eacute;sultats furent limpides. Non seulement les &eacute;tudiants &agrave; qui avaient &eacute;t&eacute; donn&eacute;es les raisons extrins&egrave;ques, ont &eacute;t&eacute; moins cr&eacute;atifs dans leur &eacute;criture que les autres (ainsi en ont jug&eacute; 12 po&egrave;tes ind&eacute;pendants), mais la qualit&eacute; de leur travail a baiss&eacute; de fa&ccedil;on significative. Les r&eacute;compenses, dit Mme Amabile, ont cet effet destructeur, principalement dans les t&acirc;ches cr&eacute;atives, y compris dans la r&eacute;solution de probl&egrave;mes de haut niveau. &laquo;&nbsp;Plus une activit&eacute; est complexe, plus elle est touch&eacute;e par les r&eacute;compenses extrins&egrave;ques&nbsp;&raquo;, dit-elle.

source: But other research shows that artists are by no means the only ones affected.
fr: Mais d'autres recherches montrent qu'il n'y a pas que les artistes qui soient touch&eacute;s.

source: In one study, girls in the fifth and sixth grades tutored younger children much less effectively if they were promised free movie tickets for teaching well. The study, by James Gabarino, now president of Chicago's Erikson Institute for Advanced Studies in Child Development, showed that tutors working for the reward took longer to communicate ideas, got frustrated more easily, and did a poorer job in the end than those who were not rewarded.
fr: Dans une &eacute;tude, des filles de sixi&egrave;me et de cinqui&egrave;me faisaient la le&ccedil;on &agrave; de plus jeunes enfants avec beaucoup moins d'efficacit&eacute; quand on leur promettait des billets de cin&eacute;ma gratuits si elles enseignaient bien. L'&eacute;tude, men&eacute;e par James Gabarino, maintenant pr&eacute;sident du Chicago's Erikson Institute for Advanced Studies in Child Development, a montr&eacute; que les tuteurs travaillant pour une r&eacute;compense &eacute;taient plus lents &agrave; communiquer les id&eacute;es, frustr&eacute;s plus facilement et qu'au bout du compte travaillaient moins bien que ceux qui ne recevaient pas de r&eacute;compense.

source: Such findings call into question the widespread belief that money is an effective and even necessary way to motivate people. They also challenge the behaviorist assumption that any activity is more likely to occur if it is rewarded. Amabile says her research &ldquo;definitely refutes the notion that creativity can be operantly conditioned.&rdquo;
fr: De telles d&eacute;couvertes remettent en question la croyance largement r&eacute;pandue que l'argent est un moyen efficace et m&ecirc;me n&eacute;cessaire de motiver les gens. Elles lancent aussi un d&eacute;fi &agrave; la pr&eacute;somption b&eacute;havioriste qui veut que n'importe quelle activit&eacute; soit plus &agrave; m&ecirc;me de se r&eacute;aliser si elle est r&eacute;compens&eacute;e. Mme Amabile dit que ses recherches &laquo;&nbsp;r&eacute;futent d&eacute;finitivement la notion de cr&eacute;ativit&eacute; conditionn&eacute;e de fa&ccedil;on op&eacute;rante&nbsp;&raquo;.

source: But Kenneth McGraw, associate professor of psychology at the University of Mississippi, cautions that this does not mean behaviorism itself has been invalidated. &ldquo;The basic principles of reinforcement and rewards certainly work, but in a restricted context&rdquo; &mdash; restricted, that is, to tasks that are not especially interesting.
fr: Mais Kenneth McGraw, Professeur adjoint de psychologie &agrave; l'Universit&eacute; du Mississippi, met en garde&nbsp;: cela ne signifie pas que le b&eacute;haviorisme en lui-m&ecirc;me s'en retrouve invalid&eacute;. &laquo;&nbsp;Les principes de base du renforcement et des r&eacute;compenses fonctionnent certainement, mais dans un contexte restreint&nbsp;&raquo; &mdash; restreint, il faut bien le dire, &agrave; des t&acirc;ches pas sp&eacute;cialement int&eacute;ressantes.

source: Researchers offer several explanations for their surprising findings about rewards and performance.
fr: Les chercheurs proposent diff&eacute;rentes explications &agrave; leurs surprenantes d&eacute;couvertes sur les r&eacute;compenses et les performances.

source: First, rewards encourage people to focus narrowly on a task, to do it as quickly as possible and to take few risks. &ldquo;If they feel that &lsquo;this is something I have to get through to get the prize,&rsquo; they're going to be less creative,&rdquo; Amabile said.
fr: D'abord, la r&eacute;compense encourage les gens &agrave; se focaliser &eacute;troitement sur une t&acirc;che, &agrave; la faire aussi vite que possible et &agrave; prendre peu de risques. &laquo;&nbsp;S'ils se disent 'il faut que j'en passe par l&agrave; pour avoir le prix, ils vont devenir moins cr&eacute;atifs&nbsp;&raquo;, dit Mme Amabile.

source: Second, people come to see themselves as being controlled by the reward. They feel less autonomous, and this may interfere with performance. &ldquo;To the extent one's experience of being self-determined is limited,&rdquo; said Richard Ryan, associate psychology professor at the University of Rochester, &ldquo;one's creativity will be reduced as well.&rdquo;
fr: Ensuite, les gens finissent par se sentir contr&ocirc;l&eacute;s par la r&eacute;compense. Ils se sentent moins autonomes, ce qui peut interf&eacute;rer sur les performances. &laquo;&nbsp;&Agrave; la limite, quelqu'un qui fait l'exp&eacute;rience de sentir son auto-d&eacute;termination limit&eacute;e&nbsp;&raquo;, dit Richard Ryan, Professeur adjoint de psychologie de l'Universit&eacute; de Rochester, &laquo;&nbsp;verra diminuer d'autant sa cr&eacute;ativit&eacute;&nbsp;&raquo;.

source: Finally, extrinsic rewards can erode intrinsic interest. People who see themselves as working for money, approval or competitive success find their tasks less pleasurable, and therefore do not do them as well.
fr: Enfin, les r&eacute;compenses extrins&egrave;ques peuvent &eacute;roder l'int&eacute;r&ecirc;t intrins&egrave;que. Les gens qui consid&egrave;rent travailler pour de l'argent, desapprobations ou un succ&egrave;s dans la comp&eacute;tition, trouvent leurs t&acirc;ches moins plaisantes et du fait, ne les accomplissent pas aussi bien.

source: The last explanation reflects 15 years of work by Ryan's mentor at the University of Rochester, Edward Deci. In 1971, Deci showed that &ldquo;money may work to buy off one's intrinsic motivation for an activity&rdquo; on a long-term basis. Ten years later, Deci and his colleagues demonstrated that trying to best others has the same effect. Students who competed to solve a puzzle quickly were less likely than those who were not competing to keep working at it once the experiment was over.
fr: La derni&egrave;re explication est le reflet des 15 ann&eacute;es de travail par le mentor de Ryan, au sein de l'Universit&eacute; de Rochester, Edward Deci. En 1971, Deci a montr&eacute; que &laquo;&nbsp;l'argent peut agir de telle sorte qu'il rach&egrave;te &agrave; quelqu'un sa motivation intrins&egrave;que pour une activit&eacute;&nbsp;&raquo;, en voyant sur le long terme. Dix ans plus tard, Deci et ses coll&egrave;gues d&eacute;montr&egrave;rent qu'essayer de d&eacute;passer les autres a le m&ecirc;me effet. Des &eacute;tudiants, en comp&eacute;tition pour r&eacute;soudre rapidement un puzzle, s'av&eacute;r&egrave;rent moins dou&eacute;s que ceux qui n'&eacute;taient pas en comp&eacute;tition, continuant &agrave; travailler sur le probl&egrave;me une fois l'exp&eacute;rience termin&eacute;e.

source: Control plays role
fr: Le contr&ocirc;le joue un r&ocirc;le

source: There is general agreement, however, that not all rewards have the same effect. Offering a flat fee for participating in an experiment &mdash; similar to an hourly wage in the workplace &mdash; usually does not reduce intrinsic motivation. It is only when the rewards are based on performing a given task or doing a good job at it &mdash; analogous to piece-rate payment and bonuses, respectively &mdash; that the problem develops.
fr: Il est g&eacute;n&eacute;ralement accept&eacute;, cependant, que les r&eacute;compenses n'ont pas toutes le m&ecirc;me effet. Offrir une maigre r&eacute;mun&eacute;ration pour participer &agrave; une exp&eacute;rience &mdash; l'&eacute;quivalent d'un salaire horaire &mdash; ne r&eacute;duit g&eacute;n&eacute;ralement pas la motivation intrins&egrave;que. Ce n'est que lorsque la r&eacute;mun&eacute;ration est bas&eacute;e sur la r&eacute;alisation ou le d&eacute;passement d'une t&acirc;che donn&eacute;e &mdash; par analogie, le paiement &agrave; la pi&egrave;ce et les bonus, respectivement &mdash; que le probl&egrave;me se d&eacute;veloppe.

source: The key, then, lies in how a reward is experienced. If we come to view ourselves as working to get something, we will no longer find that activity worth doing in its own right.
fr: D&egrave;s lors, la clef r&eacute;side dans la fa&ccedil;on dont la r&eacute;compense est v&eacute;cue. Si nous en arrivons &agrave; nous voir comme travaillant pour obtenir quelque chose, il nous faudra peu de temps pour nous rendre compte que cette activit&eacute; n'en vaut pas la peine.

source: There is an old joke that nicely illustrates the principle. An elderly man, harassed by the taunts of neighborhood children, finally devises a scheme. He offered to pay each child a dollar if they would all return Tuesday and yell their insults again. They did so eagerly and received the money, but he told them he could only pay 25 cents on Wednesday. When they returned, insulted him again and collected their quarters, he informed them that Thursday's rate would be just a penny. &ldquo;Forget it,&rdquo; they said &mdash; and never taunted him again.
fr: Il y a une vieille blague qui explique joliment le principe. Un homme d'un certain &acirc;ge, fatigu&eacute; des sarcasmes des enfants voisins, finit par inventer un stratag&egrave;me. Il offrit de donner un dollar &agrave; chaque enfant qui reviendrait le mardi et qui hurlerait &agrave; nouveau ses insultes. Ce qu'ils firent avec z&egrave;le et re&ccedil;urent leur argent ; mais il leur dit que le mercredi, il ne pourrait leur donner que 25 cents. Quand ils revinrent, l'insult&egrave;rent &agrave; nouveau et re&ccedil;urent leurs pi&eacute;cettes, ils s'entendirent dire que le jeudi, le montant ne serait que d'un penny. &laquo;&nbsp;Laissez tomber&nbsp;&raquo;, dirent-ils et ils ne l'ont plus jamais ennuy&eacute;.

source: Means to an end
fr: Quelques mots pour la fin

source: In a 1982 study, Stanford psychologist Mark L. Lepper showed that any task, no matter how enjoyable it once seemed, would be devalued if it were presented as a means rather than an end. He told a group of preschoolers they could not engage in one activity they liked until they first took part in another. Although they had enjoyed both activities equally, the children came to dislike the task that was a prerequisite for the other.
fr: Dans une &eacute;tude de 1982, le psychologue Mark L. Lepper, de Stanford, a montr&eacute; que toute t&acirc;che, quelle que soit l'apparence agr&eacute;able qu'on lui ait vue, sera d&eacute;valoris&eacute;e si elle est pr&eacute;sent&eacute;e comme un moyen plut&ocirc;t que comme une fin. Il raconta l'histoire d'un groupe de futurs &eacute;coliers qui ne pouvaient s'engager dans l'activit&eacute; de leur pr&eacute;f&eacute;rence, sans avoir d'abord pris part &agrave; une autre. Bien qu'ils aient eut un plaisir identique &agrave; pratiquer les deux activit&eacute;s, les enfants en sont venus &agrave; ne pas aimer la t&acirc;che qui &eacute;tait la condition pr&eacute;alable de l'autre activit&eacute;.

source: It should not be surprising that when verbal feedback is experienced as controlling, the effect on motivation can be similar to that of payment. In a study of corporate employees, Ryan found that those who were told, &ldquo;Good, you're doing as you <em>should</em>&rdquo; were &ldquo;significantly less intrinsically motivated than those who received feedback informationally.&rdquo;
fr: Il ne devrait pas &ecirc;tre surprenant que lorsque la r&eacute;troaction verbale est vue comme un contr&ocirc;le, l'effet sur la motivation peut &ecirc;tre assimil&eacute;e &agrave; un paiement. Dans une &eacute;tude portant sur des employ&eacute;s d'un groupement corporatif, Ryan a trouv&eacute; que ceux &agrave; qui on disait &laquo;&nbsp;Bien, tu fais comme il le <em>faut</em>&nbsp;&raquo;, ceux-l&agrave; &eacute;taient &laquo;&nbsp;nettement moins motiv&eacute;s intrins&egrave;quement que ceux qui ont re&ccedil;u un feedback par voie informative&nbsp;&raquo;.

source: There's a difference, Ryan says, between saying, &ldquo;I'm giving you this reward because I recognize the value of your work&rdquo; and &ldquo;You're getting this reward because you've lived up to my standards.&rdquo;
fr: Il y a une diff&eacute;rence, dit Ryan, entre dire &laquo;&nbsp;je te donne cette r&eacute;compense parce que je reconnais la valeur de ton travail&nbsp;&raquo; et &laquo;&nbsp;tu vas recevoir cette r&eacute;compense parce que tu t'es conform&eacute; &agrave; mes exigences&nbsp;&raquo;.

source: A different but related set of problems exists in the case of creativity. Artists must make a living, of course, but Amabile emphasizes that &ldquo;the negative impact on creativity of working for rewards can be minimized&rdquo; by playing down the significance of these rewards and trying not to use them in a controlling way. Creative work, the research suggests, cannot be forced, but only allowed to happen.
fr: Une s&eacute;rie de probl&egrave;mes, diff&eacute;rents, mais li&eacute;s, existe dans le cas de la cr&eacute;ativit&eacute;. Les artistes doivent gagner leur vie, bien entendu, mais Mme Amabile met l'accent sur le fait que &laquo;&nbsp;l'impact n&eacute;gatif sur la cr&eacute;ativit&eacute; en travaillant pour de l'argent peut &ecirc;tre minimis&eacute;&nbsp;&raquo; en att&eacute;nuant la signification de ces r&eacute;compenses et en essayant de ne pas les utiliser comme moyen de contr&ocirc;le. Comme le sugg&egrave;rent les recherches, on ne peut forcer le travail cr&eacute;atif, simplement le laisser se produire.

source: Alfie Kohn, a Cambridge, MA writer, is the author of &ldquo;No Contest: The Case Against Competition,&rdquo; published by Houghton Mifflin Co., Boston, MA. ISBN 0-395-39387-6. For more information on this topic, see the author's website (www.alfiekohn.org) and his book PUNISHED BY REWARDS (rev. ed., Houghton Mifflin, 1999).
fr: Alfie Kohn, MA writer de Cambridge, est l'auteur de &laquo;&nbsp;No Contest: The Case Against Competition&nbsp;&raquo;, publi&eacute; r&eacute;cemment par Houghton Mifflin Co., Boston, MA. ISBN 0-395-39387-6. Pour plus d'informations sur ce sujet, consultez le site de l'auteur (www.alfiekohn.org) et son livre PUNISHED BY REWARDS (rev. ed., Houghton Mifflin, 1999).
