Repository: gitGNU/gnu_www-fr
Catalog: philosophy/motif.*.po
Languages: fr

source: The Motif License - GNU Project - Free Software Foundation (FSF)
fr: La licence Motif - GNU Project - Free Software Foundation (FSF)

source: The Motif License
fr: La licence Motif

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: A couple of weeks ago, the Open Group changed the license of Motif, inviting free software developers to use it. However, the new Motif license does not fit either the definition of free software, or the looser definition of open source software.
fr: Il y a quelques semaines, l'Open Group a modifi&eacute; la licence de Motif, en invitant les d&eacute;veloppeurs de logiciels libres &agrave; l'utiliser. Cependant, la nouvelle licence Motif ne correspond pas &agrave; la d&eacute;finition du logiciel libre, ou &agrave; la d&eacute;finition inf&eacute;rieure du logiciel open source.

source: Their announcement says they have released Motif to &ldquo;the open source community&rdquo;, but this is true only in an unnatural interpretation of the words. They have not made Motif available within the free software community; instead, they have invited the people in the free software community to leave the community by using Motif.
fr: Leur annonce dit qu'ils ont lib&eacute;r&eacute; Motif &agrave; la &laquo;&nbsp;communaut&eacute; open source&nbsp;&raquo;, mais ce n'est vrai que dans une interpr&eacute;tation contre nature. Ils n'ont pas rendu Motif disponible dans la communaut&eacute; du logiciel libre; &agrave; la place, ils ont invit&eacute; les personnes de lacommunaut&eacute; du logiciel libre &agrave; la quitter en utilisant Motif.

source: I've written to the Open Group about this, asking them to change the license. We can hope they will, but we can't assume it. In the present circumstances, we have to treat Motif the same way we treated it before: not available for us. Motif still cannot be part of a free operating system, and combining or linking someone else's GPL-covered code with Motif is still a violation of the GPL except in very special circumstances.
fr: J'ai &eacute;crit &agrave; l'Open Group &agrave; ce propos, en leur demandant de modifier la licence. Nous esp&eacute;rons qu'ils le feront, mais nous ne pouvons pas l'assurer. Dans les circonstances actuelles, nous avons &agrave; traiter Motif de la m&ecirc;me mani&egrave;re que nous l'avons trait&eacute; avant&nbsp;: ce n'est pas une licence pour nous. Motif ne peut toujours pas faire partie d'un syst&egrave;me d'exploitation libre, et combiner ou lier Motif avec un code tiers couvert par la GPL, est toujours une violation de la GPL, except&eacute; dans des circonstances tr&egrave;s sp&eacute;ciales.

source: Fortunately there is a free software alternative to Motif, called LessTif. Most programs that were written for Motif can use LessTif with no changes. Please support the free software community by using LessTif rather than Motif. Some finishing work still needs to be done on LessTif; to volunteer, contact <a href="mailto:lesstif@hungry.com"> &lt;lesstif@hungry.com&gt;</a>.
fr: Heureusement, il y a une alternative libre &agrave; Motif, appel&eacute;e LessTif. La plupart des programmes qui ont &eacute;t&eacute; &eacute;crits pour Motif peuvent utiliser LessTif sans modification. Nous vous demandons de contribuer &agrave; la communaut&eacute; du logiciel libre en utilisation LessTif &agrave; la place de Motif. Quelques travaux de finition ont toujours besoin d'&ecirc;tre effectu&eacute;s sur LessTif; pour poser une candidature, contactez <a href="mailto:lesstif@hungry.com">&lt;lesstif@hungry.com&gt;</a>.

source: Here are some of the problems of the Motif license:
fr: Voici quelques probl&egrave;mes de la licence Motif&nbsp;:

source: It claims that you accept the license merely by &ldquo;using&rdquo; Motif. Only a shrink-wrap license or something similar can do that, and shrink-wrap licenses are a bad thing.
fr: Elle revendique votre acceptation de la licence pratiquement en &laquo;&nbsp;utilisant&nbsp;&raquo; Motif. Seule une licence &laquo;&nbsp;emball&eacute;e sous plastique&nbsp;&raquo; peut le faire, et de telles licences sont une mauvaise chose.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: ?<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
