Repository: gitGNU/gnu_www-fr
Catalog: philosophy/netscape-npl.*.po
Languages: fr

source: On the Netscape Public License
fr: &Agrave; propos de la Netscape Public License (Licence publique de Netscape)

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org"><strong>Richard Stallman</strong></a>

source: The <a href="/philosophy/netscape-npl-old.html"> original version</a> of this article was written in March 1998 about a draft of the NPL. Our first article on the subject was <a href="/philosophy/netscape.html">Netscape is considering making the Netscape browser free software</a>.)
fr: [La <a href="/philosophy/netscape-npl-old.html"> version originale</a> de cet article a &eacute;t&eacute; &eacute;crite en mars 1998 &agrave; propos d'un brouillon de la NPL. Notre premier article sur ce sujet &eacute;tait <a href="/philosophy/netscape.fr.html">Netscape envisage la lib&eacute;ration du navigateur Netscape</a>]

source: The Netscape Public License, or NPL, as it was ultimately designed in 1998, is a free software license&mdash;but it has three major flaws. One flaw sends a bad philosophical message, another puts the free software community in a weak position, while the third creates a major practical problem within the free software community. Two of the flaws apply to the Mozilla Public License as well. Because of these flaws, we urge that you not use the NPL or the MPL for your free software.
fr: La Netscape Public License, ou NPL, telle qu'elle a &eacute;t&eacute; finalement con&ccedil;ue en 1998, est une licence libre &mdash; mais elle a trois d&eacute;fauts majeurs. Le premier d&eacute;faut est la diffusion d'une mauvaise philosophie, le deuxi&egrave;me est de placer la communaut&eacute; du logiciel libre en position de faiblesse, et le troisi&egrave;me cr&eacute;e un probl&egrave;me pratique majeur au sein de la communaut&eacute; du logiciel libre. Deux de ces d&eacute;fauts s'appliquent &eacute;galement &agrave; la Mozilla Public License. &Agrave; cause de ces d&eacute;fauts, nous vous pressons de ne pas utiliser la NPL ou la MPL pour votre logiciel libre.

source: 1. Not all users are equal
fr: 1. Tous les utilisateurs ne sont pas &eacute;gaux

source: The first problem I noticed in the NPL was that it does not give Netscape and the rest of us equal rights, as the GNU GPL does. Under the NPL, we can use Netscape's code only as specified in the NPL, but Netscape can use our changes in any way at all&mdash;even in proprietary licensed versions of the software.
fr: Le premier probl&egrave;me que j'ai relev&eacute; dans la NPL &eacute;tait qu'elle ne donne pas &agrave; Netscape et au reste d'entre nous des droits &eacute;quivalents, comme le fait la GNU GPL. Sous le r&eacute;gime de la NPL, nous pouvons utiliser le code de Netscape seulement comme sp&eacute;cifi&eacute; dans la NPL, mais Netscape peut utiliser vos modifications de n'importe quelle mani&egrave;re &mdash; m&ecirc;me dans des versions propri&eacute;taires du logiciel.

source: The problem here is subtle, because this does not make the program non-free. It does not stop us from redistributing the program, or from changing it; it does not deny us any particular freedom. Considered from a purely pragmatic viewpoint, it may not look like a problem at all.
fr: Le probl&egrave;me ici est subtil, parce que cela ne supprime pas la libert&eacute; du programme. Cela ne nous emp&ecirc;che pas de redistribuer le programme, ou de le modifier; cela ne nous retire aucune libert&eacute; particuli&egrave;re. D'un point de vue purement pratique, cela pourrait ne pas ressembler du tout &agrave; un probl&egrave;me.

source: The problem lies in the deeper message embodied in this condition. It denies the idea of cooperation among equals that our community rests on, and says that working on a free program means contributing to a proprietary software product. Those who accept this condition are likely to be changed by it, and the change will not strengthen our community.
fr: Le probl&egrave;me r&eacute;side dans le message profond qu'illustre cette clause. Elle nie l'id&eacute;e d'une coop&eacute;ration entre &eacute;gaux sur laquelle repose notre communaut&eacute;, et dit que travailler sur un programme libre signifie contribuer &agrave; un produit logiciel propri&eacute;taire. Ceux qui acceptent ces conditions en seront certainement affect&eacute;s, et le changement ne renforcera pas notre communaut&eacute;.

source: One proposed solution for this asymmetry is to put a time limit on it&mdash;perhaps three or five years. That would be a big improvement, because the time limit would deny the problematical deeper message.
fr: Une solution propos&eacute;e pour cette asym&eacute;trie est de la borner dans le temps &mdash; peut-&ecirc;tre trois ou quatre ans. Ce serait une grande am&eacute;lioration, parce que la limite temporelle ruinerait la probl&eacute;matique du message sous-jacent.

source: The practical effects of this condition are minimized by another drawback of the NPL: it is not designed as a thorough copyleft. In other words, it does not try very hard to ensure that modifications made by users are available as free software.
fr: Les effets pratiques de cette condition sont r&eacute;duits par un autre inconv&eacute;nient de la NPL&nbsp;: elle n'est pas con&ccedil;ue comme une vraie gauche d'auteur. En d'autres termes, elle ne fait pas beaucoup d'effort pour garantir que les modifications faites par les utilisateurs soient disponibles en tant que logiciel libre.

source: The MPL (Mozilla Public License) does <em>not</em> have this problem. That is the principal difference between the MPL and the NPL.
fr: La MPL (Mozilla Public License) n'a <em>pas</em> ce probl&egrave;me. C'est la principale diff&eacute;rence entre la MPL et la NPL.

source: 2. Not a copyleft
fr: 2. Pas une gauche d'auteur

source: The NPL has the form of a copyleft; it explicitly says that all modifications made by users must be released under the NPL. But this applies only to modifications to the existing code&mdash;not to added subroutines, if they are put in separate files. As a practical matter, this means it is easy to make proprietary changes if you want to: just put the bulk of your code into a separate file, and call the collection a Larger Work. Only the subroutine calls added to the old files will have to be released under the NPL, and they will not be very useful on their own.
fr: La NPL a l'apparence d'une gauche d'auteur; elle dit explicitement que toutes les modifications faites par des utilisateurs doivent &ecirc;tre fournies sous la NPL. Mais cela s'applique seulement aux modifications apport&eacute;es au code existant &mdash; pas &agrave; de nouvelles routines, si celles-ci sont plac&eacute;es dans des fichiers s&eacute;par&eacute;s. Sous l'angle pratique, cela signifie qu'il est facile de r&eacute;aliser des modifications propri&eacute;taires si vous le souhaitez&nbsp;: vous n'avez qu'&agrave; placer le gros de votre code dans un fichier s&eacute;par&eacute;, et appeler votre collection un Travail Original. Seules les routines d'appel ajout&eacute;es aux anciens fichiers devront &ecirc;tre fournies sous la NPL, et elles ne seront pas tr&egrave;s utiles en elles-m&ecirc;mes.

source: The lack of real copyleft is not a catastrophe; it does not make the software non-free. For example, the X.org distribution terms do not try to use copyleft at all, yet X.org is free software nonetheless. BSD is also non-copylefted free software (although the older BSD terms have a <a href="/philosophy/bsd.html">serious drawback</a> and should not be imitated&mdash;if you want to release non-copylefted free software, please use the X.org terms instead). NPL-covered software is also <a href="/philosophy/categories.html">free software</a> without being copylefted, and this by itself does not make the NPL worse than other non-copyleft free software license.
fr: L'absence d'une vrai gauche d'auteur n'est pas une catastrophe; cela ne rend pas le logiciel non-libre. Par exemple, les termes de la distribution de X.org n'essayent pas du tout d'employer une gauche d'auteur, mais X.org est n&eacute;anmoins un logiciel libre. BSD est &eacute;galement un logiciel libre sans gauche d'auteur (bien que les termes de BSD aient un <a href="/philosophy/bsd.fr.html">s&eacute;rieux inconv&eacute;nient</a> et ne devraient pas &ecirc;tre imit&eacute;s &mdash; si vous voulez distribuer du logiciel libre sans gauche d'auteur, vous devriez plut&ocirc;t utiliser les termes de X.org &agrave; la place). Le logiciel couvert par la NPL est &eacute;galement du <a href="/philosophy/categories.fr.html">logiciel libre</a> sans gauche d'auteur, et cela ne suffit pas &agrave; faire de la NPL une licence pire que d'autres licences sans gauche d'auteur.

source: However, while this is not catastrophic, it is nonetheless a drawback. And because the NPL looks like a copyleft, some users may be confused about it, and might adopt the NPL, thinking that they are obtaining the benefits of copyleft for their software, when that is not the case. To avoid this outcome, we will need to work hard to educate people about an issue that is not easy to explain in a few words.
fr: Par cons&eacute;quent, bien qu'il n'y ait pas de catastrophe, il y a tout de m&ecirc;me un inconv&eacute;nient. Et parce que la NPL ressemble &agrave; une gauche d'auteur, certains utilisateurs peuvent se tromper &agrave; son propos, et pourraient adopter la NPL, imaginant qu'ils obtiennent les b&eacute;n&eacute;fices de la gauche d'auteur pour leur logiciel, alors que ce n'est pas le cas. Pour &eacute;viter cet &eacute;cueil, nous devons travailler dur &agrave; informer les gens &agrave; propos d'un probl&egrave;me qu'il n'est pas facile d'expliquer en peu de mots.

source: 3. Not compatible with the GPL
fr: 3. Pas compatible avec la GPL

source: The most serious practical problem in the NPL is that it is incompatible with the GNU GPL. It is impossible to combine NPL-covered code and GNU GPL-covered code together in one program, not even by linking separate object files or libraries; no matter how this is done, it has to violate one license or the other.
fr: Le probl&egrave;me pratique le plus s&eacute;rieux avec la NPL est qu'elle est incompatible avec la GNU GPL. Il est impossible de combiner du code couvert par la NPL et du code couvert par la GNU GPL ensemble en un seul programme, m&ecirc;me en liant des fichiers objet ou des biblioth&egrave;ques; quelle que soit la mani&egrave;re employ&eacute;e, cela viole une licence ou l'autre.

source: This conflict occurs because the GPL is serious about copyleft: it was designed to ensure that all changes and extensions to a free program must be free. So it does not leave a loophole for making changes proprietary by putting them into a separate file. To close this loophole, the GPL does not allow linking the copylefted program with code that has other restrictions or conditions&mdash;such as the NPL.
fr: Ce conflit tient au fait que la GPL est s&eacute;rieuse sur la gauche d'auteur&nbsp;: elle a &eacute;t&eacute; con&ccedil;ue pour garantir que toutes les modifications et les extensions &agrave; un programme libre doivent &ecirc;tre libres. Donc elle n'offre pas de chausse-trappe autorisant des modifications propri&eacute;taires plac&eacute;es dans un fichier s&eacute;par&eacute;. Pour fermer cette chausse-trappe, la GPL interdit de lier le programme sous gauche d'auteur avec du code qui a d'autres restrictions ou conditions &mdash; comme la NPL.

source: Being incompatible with the GPL does not make a program non-free; it does not raise a fundamental ethical issue. But it is likely to create a serious problem for the free software community, dividing the code base into two collections that cannot be mixed. As a practical matter, this problem is very important.
fr: Le fait d'&ecirc;tre incompatible avec la GPL ne rend pas le programme non-libre; cela ne m&egrave;ne pas &agrave; un probl&egrave;me &eacute;thique de fond. Mais c'est la cause d'un s&eacute;rieux probl&egrave;me pour la communaut&eacute; du logiciel libre, en divisant la base de code en deux collections qui ne peuvent &ecirc;tre m&eacute;lang&eacute;es. D'un point de vue pratique, ce probl&egrave;me est tr&egrave;s important.

source: Solving this by changing the GPL is possible, but that would entail abandoning copyleft&mdash;which would do more harm than good. But it is possible to solve this problem with a small change in the NPL. (See below for a specific way of doing this.)
fr: Le r&eacute;soudre en modifiant la GPL est possible, mais cela signifierait l'abandon de la gauche d'auteur &mdash; causant plus de mal que de bien. Il est &eacute;galement possible de r&eacute;soudre ce probl&egrave;me par une petite modification de la NPL. (Voir ci-dessous pour les d&eacute;tails sp&eacute;cifiques).

source: 4. A note about names
fr: 4. Note au sujet des noms

source: NPL stands for Netscape Public License, but GPL does not stand for GNU Public License. The full name of our license is the GNU General Public License, abbreviated GNU GPL. Sometimes people leave out the word &ldquo;GNU&rdquo; and write just GPL.
fr: La NPL est la Netscape Public License, mais la GPL n'est pas la GNU Public License. Le nom complet de notre licence est la GNU General Public License (Licence publique G&eacute;n&eacute;rale GNU), abr&eacute;g&eacute; en GNU GPL. Parfois des gens mettent de c&ocirc;t&eacute; le mot &laquo;GNU&raquo; et &eacute;crivent juste GPL.

source: (This is not a problem, just a fact that you should know.)
fr: (Ce n'est pas un probl&egrave;me, seulement un fait que vous devriez conna&icirc;tre).

source: Since problem 3 is the most serious, I hope that people will politely and rationally explain to Netscape the importance of solving it. Solutions are available; they just have to decide to use them.
fr: Vu que le probl&egrave;me n&ordm;3 est le plus s&eacute;rieux, j'esp&egrave;re que les gens expliqueront poliment et rationnellement &agrave; Netscape l'importance d'y trouver une solution. Des solutions sont disponibles; les mettre en œuvre est de leur ressort.

source: Here is a possible way to permit linking NPL-covered code and GPL-covered code together. It can be done by adding these two paragraphs to the NPL:
fr: Nous pr&eacute;sentons ici une fa&ccedil;on possible d'autoriser la liaison mutuelle entre du code sous NPL et du code sous GPL. Cela peut &ecirc;tre fait en ajoutant ces deux paragraphes &agrave; la NPL&nbsp;:

source: A.1. You may distribute a Covered Work under the terms of the GNU General Public License, version 2 or newer, as published by the Free Software Foundation, when it is included in a Larger Work which is as a whole distributed under the terms of the same version of the GNU General Public License. A.2. If you have received a copy of a Larger Work under the terms of a version or a choice of versions of the GNU General Public License, and you make modifications to some NPL-covered portions of this Larger Work, you have the option of altering these portions to say that their distribution terms are that version or that choice of versions of GNU General Public License.
fr: A.1. Vous pouvez distribuer un Travail Couvert par les termes de la Licence publique g&eacute;n&eacute;rale GNU, version 2 ou plus r&eacute;cente, telle que publi&eacute;e par la Fondation pour le logiciel libre (FSF), lorsqu'il est inclus dans un Travail Original qui est distribu&eacute; enti&egrave;rement sour les termes de la m&ecirc;me version de la Licence publique g&eacute;n&eacute;rale GNU. A.2. Si vous avez re&ccedil;u une copie d'un Travail Original sous les termes d'une version ou d'un choix de versions de la Licence publique g&eacute;n&eacute;rale GNU, et que vous apportez des modifications &agrave; des portions de ce Travail Original couvertes par la NPL, vous avez le choix d'alt&eacute;rer ces portions afin de dire que les termes de distribution sont cette version ou ce choix de versions de la Licence publique g&eacute;n&eacute;rale GNU.)

source: This allows people to combine NPL-covered code with GPL-covered code, and to distribute the combined work under the terms of the GNU GPL.
fr: Cela permet aux gens de combiner du code couvert par la NPL avec du code couvert par la GPL, et de distribuer le travail combin&eacute; sous les termes de la GNU GPL.

source: It permits people to release modifications to such combined works under the terms of the GNU GPL&mdash;but the easiest way to release them is under the NPL.
fr: Cela permet aux gens de fournir des modifications &agrave; de tels travaux combin&eacute;s sous les termes de la GNU GPL &mdash; mais le chemin le plus court est de les fournir sous la NPL.

source: When people take advantage of A.2, their changes will be released only under the terms of the GNU GPL; so these changes would not be available for Netscape to use in proprietary versions. It makes sense that Netscape would see this as unfortunate.
fr: Lorsque des gens utiliseront l'option A.2, leurs modifications seront fournies uniquement dans les termes de la GNU GPL&nbsp;; de sorte que ces modifications ne seront pas disponibles pour Netscape pour inclusion dans des versions propri&eacute;taires. Il est raisonnable de croire que Netscape voie ceci comme une infortune.

source: However, the NPL gives proprietary software developers an easy way to make their changes entirely unavailable to Netscape&mdash;by putting their code into separate files and calling the combination a Larger Work. In fact, this is easier, for them, than A.2 is for GPL users.
fr: Cependant, la NPL donne aux d&eacute;veloppeurs de logiciel propri&eacute;taire un moyen facile de rendre leurs modifications non disponibles pour Netscape &mdash; en pla&ccedil;ant leur code dans des fichiers s&eacute;par&eacute;s et en appelant la combinaison un Travail Original. En fait, c'est plus facile, pour eux, que la section A.2 pour les utilisateurs de la GPL.

source: If Netscape feels it can live with the trouble of (effectively) proprietary modifications, surely the trouble of GPL-covered modifications is a small by comparison. If Netscape believes that practical considerations will encourage most of the proprietary software world to release its changes back to Netscape, without being compelled to, the same reasons ought to apply in the free software world as well. Netscape should recognize that this change is acceptable, and adopt it, to avoid confronting free software developers with a serious dilemma.
fr: Si Netscape sent qu'il peut assumer la g&ecirc;ne caus&eacute;e par des modifications propri&eacute;taires (effectives), certainement la g&ecirc;ne des modifications couvertes par la GPL est petite en comparaison. Si Netscape croit que les seules consid&eacute;rations pratiques encourageront la plupart des &eacute;diteurs de logiciel propri&eacute;taire &agrave; fournir leurs modifications &agrave; Netscape, sans raison valable, le m&ecirc;me raisonnement devrait s'appliquer dans le monde du logiciel libre. Netscape devrait reconna&icirc;tre que ce changement est acceptable, et l'adopter, afin d'&eacute;viter de placer les d&eacute;veloppeurs de logiciel libre devant un s&eacute;rieux dilemme.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Aurélien Campéas.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
