Repository: gitGNU/gnu_www-fr
Catalog: philosophy/new-monopoly.*.po
Languages: fr

source: Dear Representative So-and-so Congress is considering laws to establish a new kind of monopoly on electronic data bases. I am against the whole idea of this, because it would restrict the freedom of computer users. Private interests should not be allowed control over dissemination of facts that are public knowledge. As a measure to promote business, this is premature; the Internet is changing very fast, and passing any law about this issue in 1999 would be foolish. Multiple alternatives are being considered for this bill; HR 354 is especially drastic and dangerous, while HR 1858 is less so. If you have a chance to vote on the choice between them, please choose HR 1858. But when the data base monopoly bill ultimately comes up for a vote, I ask you to vote against it, regardless of the details. Sincerely, Jane Q. Public
fr: Cher Repr&eacute;sentant Untel, Le Congr&egrave;s consid&egrave;re une loi pour &eacute;tablir une nouvelle sorte de monopole sur les bases de donn&eacute;es &eacute;lectroniques. Je suis contre l'id&eacute;e de base elle-m&ecirc;me, car cela diminuerait la libert&eacute; des utilisateurs d'ordinateur. Aucun int&eacute;r&ecirc;t priv&eacute; ne devrait &ecirc;tre &agrave; m&ecirc;me de contr&ocirc;ler la divulgation d'informations qui sont du domaine public. En tant que mesure pour promouvoir les affaires, c'est pr&eacute;matur&eacute;&nbsp;; Internet change tr&egrave;s rapidement, et passer n'importe quelle loi &agrave; ce sujet en 1999 serait dangereux. De multiples alternatives sont consid&eacute;r&eacute;es pour cette loi&nbsp;; HR 354 est particuli&egrave;rement drastique et dangereuse, alors que HR 1858 l'est moins. Si vous avez une chance de voter sur le choix entre les deux, je vous prie de choisir HR 1858. Mais quand la loi sur le monopole des bases de donn&eacute;es parviendra au vote final, je vous demande de voter contre elle, quels que soient les d&eacute;tails. Sinc&egrave;rement, Jane Q. Public

source: There exists a <a href="http://www.senate.gov/senators/senator_by_state.cfm"> list of senators</a> and a service to <a href="http://www.house.gov/writerep/"> assist you in writing</a> to representative in the U.S. Congress.
fr: Il existe une <a href="http://www.senate.gov/senators/senator_by_state.cfm">liste de s&eacute;nateurs</a> et un service pour <a href="http://www.house.gov/writerep/">vous aider &agrave; &eacute;crire</a> aux repr&eacute;sentants du Congr&egrave;s des &Eacute;tats-Unis.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Marc de Maillard.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
