Repository: gitGNU/gnu_www-fr
Catalog: philosophy/new-monopoly.*.po
Languages: fr

source: U.S. Congress Threatens to Establish a New Kind of Monopoly - GNU Project - Free Software Foundation (FSF)
fr: Le Congr&egrave;s des &Eacute;tats-Unis menace d'&eacute;tablir un nouveau type de monopole - GNU Project - Free Software Foundation (FSF)

source: U.S. Congress Threatens to Establish a New Kind of Monopoly
fr: Le Congr&egrave;s des &Eacute;tats-Unis menace d'&eacute;tablir un nouveau type de monopole

source: Companies that want monopoly powers to control public use of the information we get from data bases are trying to pass a law this year in the U.S. &mdash; creating, for the first time, a private monopoly over repeating publicly known information. They are using the &ldquo;good bill, bad bill&rdquo; method; the &ldquo;bad&rdquo; bill is HR 354; the &ldquo;good&rdquo; bill is HR 1858.
fr: Des entreprises souhaitant obtenir un monopole afin de contr&ocirc;ler l'utilisation publique des informations provenant de bases de donn&eacute;es essayent de faire passer une loi cette ann&eacute;e aux &Eacute;tats-Unis (cr&eacute;ant, pour la premi&egrave;re fois, un monopole priv&eacute; sur des informations r&eacute;guli&egrave;rement et publiquement divulgu&eacute;es). Ils utilisent la m&eacute;thode &laquo;&nbsp;bonne loi, mauvaise loi&nbsp;&raquo;&nbsp;; la &laquo;&nbsp;mauvaise&nbsp;&raquo; loi est la HR 354, la &laquo;&nbsp;bonne&nbsp;&raquo; la HR 1858.

source: This method should be familiar. First, one legislator introduces an outrageous bill, one that would give a large handout of money or power to certain special interests and serves no legitimate public purpose. This inspires a chorus of opposition from other special interests that the bill would trample.
fr: Cette m&eacute;thode devrait vous &ecirc;tre d&eacute;j&agrave; famili&egrave;re. Pour commencer, un l&eacute;gislateur introduit une loi outrageuse, qui octroierait une vaste somme d'argent ou un pouvoir important &agrave; certains inter&ecirc;ts particuliers, et qui ne sert aucune cause publique l&eacute;gitime. Cela d&eacute;clenche une mar&eacute;e d'opposition de la part des autres inter&ecirc;ts particuliers que cette loi d&eacute;savantagerait.

source: So a second legislator introduces a more cautious bill, more clearly written, with some safeguards, avoiding some gross abuses, offering a smaller handout to a somewhat broader spectrum of special interests &mdash; and still diminishing the public treasury or the public's freedom.
fr: Ensuite, un deuxi&egrave;me l&eacute;gislateur introduit une loi plus prudente, &eacute;crite plus clairement, avec certains garde-fous, &eacute;vitant les abus trop importants, octroyant une somme moins importante ou un pouvoir plus r&eacute;duit &agrave; une cat&eacute;gorie l&eacute;g&egrave;rement plus large d'inter&ecirc;ts particuliers (bien que diminuant toujours le tr&eacute;sor public ou la libert&eacute; publique).

source: The second bill is typically praised for its &ldquo;balanced&rdquo; approach, and interest groups that might oppose the general idea feel obliged to support it, to make sure that the even worse first bill won't pass. With little opposition remaining, the second bill passes, and society takes one step for the worse.
fr: Cette seconde loi est typiquement lou&eacute;e en vertu de son approche &laquo;&nbsp;&eacute;quilibr&eacute;e&nbsp;&raquo;, et les groupes d'inter&ecirc;ts qui pourraient objecter contre l'id&eacute;e g&eacute;n&eacute;rale se sentent oblig&eacute;s de soutenir cette loi, pour s'assurer que la premi&egrave;re largement pire ne puisse passer. Face au peu d'opposition restante, cette seconde loi passe, et la soci&eacute;t&eacute; fait un pas en arri&egrave;re.

source: A few years later, the first legislator may propose another give-away. If we keep meeting his sponsors half-way each time, over time they can get as much as they like.
fr: Quelques ann&eacute;es plus tard, le premier l&eacute;gislateur peut &eacute;ventuellement proposer une autre loi abusive. Si un compromis est trouv&eacute;, et ainsi une part de ses r&eacute;clamations accord&eacute;es &agrave; chaque fois, il obtiendra au final tout ce qu'il veut.

source: This time, the &ldquo;bad&rdquo; bill is HR 354, which would effectively allow facts to become private property, simply through their inclusion in an electronic data base. Even mentioning more than a handful of the facts from any data base in a publication would be illegal, unless you could get them from some other source &mdash; often impossible, since in many cases there is no other ultimate source for a certain kind of fact.
fr: Cette fois ci la &laquo;&nbsp;mauvaise&nbsp;&raquo; loi est la HR 354, qui autoriserait effectivement des donn&eacute;es &agrave; devenir propri&eacute;t&eacute; priv&eacute;e, simplement par leur introduction dans une base de donn&eacute;es &eacute;lectronique. Le simple fait de mentionner plus qu'une poign&eacute;e de donn&eacute;es provenant de n'importe quelle base de donn&eacute;es dans une publication deviendrait donc ill&eacute;gal, sauf si vous pouviez les obtenir &eacute;galement depuis une autre source (ce qui est le plus souvent impossible, puisqu'il n'existe en g&eacute;n&eacute;ral aucune seconde source d'information convenant parfaitement pour un type particulier d'information recherch&eacute;).

source: Consider for example the scores of professional sports games. The score is counted in a computer, whose memory counts as a data base. Under HR 354, regularly printing scores in a newspaper would become illegal.
fr: Consid&eacute;rez par exemple les r&eacute;sultats sportifs professionnels. Le r&eacute;sultat est comptabilis&eacute; par un ordinateur, dont la m&eacute;moire est &eacute;quivalente &agrave; une base de donn&eacute;es. Selon la loi HR 354, imprimer r&eacute;guli&egrave;rement les r&eacute;sultats sportifs dans un journal deviendrait donc ill&eacute;gal.

source: HR 354 would probably give Network Solutions a permanent monopoly on the Internet domain name data base, making any change in the handling of top level domains impossible.
fr: La loi HR 354 donnerait probablement &agrave; Network Solutions un monopole permanent sur la base de donn&eacute;es des noms de domaine Internet, rendant impossible toute modification dans l'administration des domaines de haut niveau.

source: Any computer program counts as a data base under HR 354. So if the facts about the program's user interface and APIs can't be obtained from anywhere else, any compatible program would be prohibited. This would be devastating for the future of free software.
fr: N'importe quel programme informatique est &eacute;quivalent &agrave; une base de donn&eacute;es d'apr&egrave;s la loi HR 354. Donc si les informations relatives &agrave; l'interface utilisateur du programme et son <acronym title="Application Programming Interface">API</acronym> ne peuvent &ecirc;tre obtenues d'aucune autre source, tout programme compatible serait interdit. Ce serait d&eacute;vastateur pour le futur du logiciel libre.

source: Ominously, many collections of public records, maintained by companies on contract to governments, would become property of those companies.
fr: Tout aussi mena&ccedil;ant, de nombreuses collections de documents publics, maintenues par des entreprises sous contrat avec les gouvernements, deviendraient propri&eacute;t&eacute; de ces compagnies.

source: And West Publishing Company would regain its effective monopoly over the data needed to file a legal brief in much of the U.S. West maintains a data base of court decisions, and some courts require briefs to cite these decisions using page numbers as they appear in West's data base.
fr: Et West Publishing Company retrouverait son monopole effectif sur les informations n&eacute;cessaires pour r&eacute;diger une lettre l&eacute;gale sur la majorit&eacute; des &Eacute;tats-Unis. Cette soci&eacute;t&eacute; maintient une base de donn&eacute;es des d&eacute;cisions de cours de justice, et certaines cours exigent des lettres l&eacute;gales citant ces d&eacute;cisions de justice en utilisant le num&eacute;ro de page tel qu'apparaissant dans la base de donn&eacute;es de West Publishing Company.

source: West, seeking to prevent the necessary information from being available other than through their expensive service, used to claim that the pagination and page numbers were copyrighted, but a Federal court ruled against them. The court said that these page numbers don't result from creativity, so they are not copyrightable. But they are indubitably a data base, so HR 354 would prohibit anyone else from providing this data to the public &mdash; thus granting West a permanent monopoly on the law itself.
fr: West Publishing Company, cherchant &agrave; emp&ecirc;cher que ces informations n&eacute;cessaires soient disponibles autrement qu'&agrave; travers leurs services payants, avait d&eacute;j&agrave; d&eacute;clar&eacute; que le syst&egrave;me de mise en page et de num&eacute;rotation utilis&eacute; &eacute;tait prot&eacute;g&eacute; par copyright, mais une cour f&eacute;d&eacute;rale a tranch&eacute; en leur d&eacute;faveur. La cour a d&eacute;clar&eacute; que puisque ces num&eacute;ros de page n'&eacute;taient pas le r&eacute;sultat de cr&eacute;ativit&eacute;, ils n'&eacute;taient pas prot&eacute;geables. Mais ils sont indubitablement une base de donn&eacute;es, donc la loi HR 354 emp&ecirc;cherait tout tiers &agrave; rendre disponible au public ces informations (accordant ainsi &agrave; West Publishing Company un monopole permanent sur la justice elle-m&ecirc;me).

source: HR 354 would also interfere with scientific research, genealogical research, publication of stock prices, and many other areas of life and work. So it's no wonder that it has generated strong opposition. The Supreme Court might reject the bill as unconstitutional, but no one wants to rely on this. Hence HR 1858 &mdash; this year's &ldquo;good&rdquo; bill.
fr: La loi HR 354 interf&eacute;rerait &eacute;galement avec la recherche scientifique, la recherche g&eacute;n&eacute;alogique, la publication des cotations boursi&egrave;res, et de nombreux autres domaines de la vie et du travail. Ce n'est donc pas une surprise qu'elle ait g&eacute;n&eacute;r&eacute; une forte opposition. La Cour Supr&ecirc;merej&eacute;terait probablement cette loi comme anticonstitutionelle, mais personne ne veut trop s'appuyer l&agrave;-dessus. En cons&eacute;quence de quoi, voici la loi HR 1858 (la &laquo;&nbsp;bonne&nbsp;&raquo; loi de cette ann&eacute;e).

source: HR 1858 explicitly avoids most of the outrageous problems. It establishes a narrower kind of monopoly, permitting use of the facts in a different kind of data base, or in anything other than an electronic data base.
fr: La loi HR 1858 &eacute;vite explicitement la plupart des probl&egrave;mes les plus outrageux. Elle &eacute;tablit un monopole de type plus restreint, permettant l'utilisation des informations dans un type diff&eacute;rent de base de donn&eacute;es, ou dans n'importe quoi d'autre qu'une base de donn&eacute;es &eacute;lectronique.

source: Thus, you'll still be able to print game scores in an article, because an article doesn't count as a data base. A program is not a data base either, under HR 1858, so it will not create a new obstacle to writing compatible software.
fr: En cons&eacute;quence de quoi, il sera toujours possible d'imprimer les r&eacute;sultats sportifs dans un article, puisque cet article n'est pas &eacute;quivalent &agrave; une base de donn&eacute;es. Un programme n'est pas non plus consid&eacute;r&eacute; comme une base de donn&eacute;es selon cette loi, donc elle ne cr&eacute;era pas d'obstacle &agrave; la compatibilit&eacute; logicielle.

source: HR 1858 also excludes data bases for running the Internet. (But not the data bases that may some day be used for running future worldwide systems, even if they are just as important as the Internet is today.) It excludes data bases made by or for the Federal government. (But, by default, it doesn't exclude those made by or for state governments; this is a substantial loophole in HR 1858.)
fr: La loi HR 1858 exclut &eacute;galement les bases de donn&eacute;es servant &agrave; g&eacute;rer Internet. (Mais pas les bases de donn&eacute;es qui seront peut-&ecirc;tre utilis&eacute;es un jour pour g&eacute;rer de futurs syst&egrave;mes mondiaux, m&ecirc;me s'ils seront tout aussi importants qu'Internet l'est aujourd'hui). Elle exclut les bases de donn&eacute;es cr&eacute;&eacute;es par ou pour le gouvernement f&eacute;d&eacute;ral des &Eacute;tats-Unis. (Mais, par d&eacute;faut, n'exclut pas celles faites par ou pour les gouvernements d'&eacute;tats&nbsp;; c'est un probl&egrave;me majeur non r&eacute;gl&eacute; dans cette loi HR 1858).

source: A wide range of organizations are supporting HP 1858 &mdash; including many universities and professional organizations. Some of the letters of support show a clear desire for some kind of monopoly power.
fr: Un large &eacute;ventail d'organisations soutient cette loi HR 1858 (incluant de nombreuses universit&eacute;s et organisations professionelles). Certaines lettres de soutien d&eacute;notent un d&eacute;sir certain pour une sorte d'exercice de monopole.

source: HR 1858 is much less harmful than HR 354 &mdash; if we have to choose between the two, we should prefer HR 1858. But should we have to choose between a big loss of freedom and a smaller one?
fr: La loi HR 1858 est bien moins n&eacute;faste que la loi HR 354 (si nous avions &agrave; choisir entre les deux, nous devrions pr&eacute;f&eacute;rer HR 1858). Mais est-il normal d'avoir &agrave; choisir entre une large perte de libert&eacute; et une plus restreinte&nbsp;?

source: The advocates of these laws offer a reason, of course, for their proposal to limit our freedom. They say that nobody will maintain data bases without a monopoly over the contents. They have no specific evidence for this claim; it is based on an article of faith: a general assumption that nobody will do anything without a monopoly over the results.
fr: Les d&eacute;fenseurs de ces lois justifient, &eacute;videmment, leur intention de limiter notre libert&eacute;. Ils disent que personne ne maintiendra les bases de donn&eacute;es sans avoir de monopole sur leurs contenus. Ils n'ont aucune preuve sp&eacute;cifique pour &eacute;tayer cette affirmation&nbsp;; elle est enti&egrave;rement bas&eacute;e sur un &laquo;&nbsp;acte de foi&nbsp;&raquo;&nbsp;: une supposition g&eacute;n&eacute;rale que personne ne fera quoi que ce soit sans poss&eacute;der un monopole sur les r&eacute;sultats.

source: Just a few years ago, people said the same thing about software &mdash; that nobody would write programs without having a monopoly on them. The Free Software movement has proved that this is not true, and in the process, we have refuted that general assumption. Selfishness is not the whole of human nature. One kind of intellectual work, at least, CAN be done without a monopoly on the results.
fr: Il y a seulement quelques ann&eacute;es, les gens disaient la m&ecirc;me chose &agrave; propos du logiciel (que personne n'&eacute;crirait de programme sans obtenir de monopole sur eux). Le mouvement du logiciel libre a d&eacute;montr&eacute; que ce n'est pas vrai, et dans ce processus nous avons r&eacute;fut&eacute; la supposition g&eacute;n&eacute;rale. L'&eacute;go&iuml;sme n'est pas la totalit&eacute; de la nature humaine. Un type de travail intellectuel, au moins, PEUT &ecirc;tre r&eacute;alis&eacute; sans monopole sur ses r&eacute;sultats.

source: But data bases are not software. Will anyone develop data bases without a data base monopoly law?
fr: Mais les bases de donn&eacute;es ne sont pas des logiciels. Est-ce que quelqu'un d&eacute;veloppera des bases de donn&eacute;es sans une loi de monopole sur les bases de donn&eacute;es&nbsp;?

source: We know they will &mdash; because they already do. Many electronic data bases are available now, and the number is increasing, not decreasing. And many kinds of data base are byproducts or even preconditions of other activities that people do for other reasons.
fr: Nous savons qu'ils le feront (puisqu'ils le font d&eacute;j&agrave; aujourd'hui). De nombreuses bases de donn&eacute;es sont aujourd'hui disponibles, et leur nombre est croissant, pas d&eacute;croissant. Et de nombreuses sortes de bases de donn&eacute;es sont des produits secondaires ou m&ecirc;me une condition pr&eacute;liminaire aux activit&eacute;s que les gens effectuent pour d'autre raisons.

source: The data base companies can't deny this, so they threaten us with future uncertainty. &ldquo;Maybe we do this today, but ten years from now nobody will do it any more, unless you give us special privilege.&rdquo;
fr: Les compagnies de bases de donn&eacute;es ne peuvent d&eacute;nier ceci, donc elles nous menacent en employant l'incertitude du futur. &laquo;&nbsp;Peut-&ecirc;tre que nous le faisons aujourd'hui, mais dans dix ans personne ne le fera plus, sauf si vous nous accordez certains privil&egrave;ges&nbsp;&raquo;.

source: We don't know what will happen in ten years; neither do they. The economic situation of the Internet is changing rapidly, and no one knows where it is going. Perhaps, in 2009, commercial data bases will disappear from the Internet. Or perhaps they will be very successful. Perhaps networks of volunteers will maintain all the data bases anyone might want. Perhaps advertising will provide a comfortable source of revenue to any company that maintains a data base; perhaps a much weaker law saying &ldquo;If you redistribute our data base, you must redistribute our ads too&rdquo; would serve their interests almost as well. Nobody knows.
fr: Nous ne savons pas ce qui se passera dans dix ans, et eux non plus. La situation &eacute;conomique de l'Internet change rapidement, et personne ne sait o&ugrave; cela m&egrave;nera. Peut-&ecirc;tre qu'en 2009, les bases de donn&eacute;es commerciales dispara&icirc;tront d'Internet. Ou peut-&ecirc;tre qu'elles auront un succ&egrave;s &eacute;norme. Peut-&ecirc;tre que des r&eacute;seaux de volontaires maintiendront toutes les bases de donn&eacute;es que n'importe qui pourrait vouloir. Peut-&ecirc;tre que la publicit&eacute; fournira une source de revenu confortable &agrave; n'importe quelle compagnie maintenant une base de donn&eacute;es, peut-&ecirc;tre qu'une loi beaucoup plus souple disant &laquo;&nbsp;si vous redistribuez notre base de donn&eacute;es, vous devrez &eacute;galement redistribuer nos publicit&eacute;s&nbsp;&raquo; servira leurs inter&ecirc;ts tout aussi bien. Personne ne le sait.

source: What we do know is that things will change; if a data base law is passed this year, it will be obsolete a few years from now. But any attempt to abolish it will be opposed by the data base companies, which will protect thir privileges by predicting the sky would fall without them. They will say: &ldquo;We exist, so the law must be working.&rdquo;
fr: Ce que nous savons est que les choses changeront&nbsp;; si une loi sur les bases de donn&eacute;es passe cette ann&eacute;e, elle sera obsol&egrave;te dans quelques ann&eacute;es. Mais toute tentative de l'abolir sera combattue par les soci&eacute;t&eacute;s de gestion de bases de donn&eacute;es, qui voudront prot&eacute;ger leurs privil&egrave;ges en pr&eacute;disant que le ciel nous tombera sur la t&ecirc;te sans elles. Elles diront&nbsp;: &laquo;&nbsp;Nous existons, donc la loi fonctionne bien&nbsp;&raquo;.

source: It is folly, or worse, to lock in a restrictive policy this year, to solve a problem whose existence is just speculation. A data base monopoly will take away your freedom, it's a surrender to special interests, it's hasty, and there is no clear public need for it. We should instead let the Internet mature, and see what problems really need to be solved.
fr: C'est folie, ou pire, de s'enfermer dans une politique restrictive cette ann&eacute;e, pour r&eacute;soudre un probl&egrave;me dont l'existence m&ecirc;me n'est qu'une sp&eacute;culation. Un monopole sur les bases de donn&eacute;es nous priverait de notre libert&eacute;, ce serait une reddition &agrave; des inter&ecirc;ts particuliers, c'est pr&eacute;cipit&eacute;, et il n'y a aucun besoin public clair pour cela. Nous devrions au contraire laisser &agrave; Internet le temps de sa maturation, et voir quels probl&egrave;mes ont r&eacute;ellement besoin d'&ecirc;tre r&eacute;gl&eacute;s.

source: So if you are a U.S. voter, write your Congressman now. Say that if he or she has a chance to vote on whether the data base bill should be like HR 354 or HR 1858, to choose HR 1858. But then say, when the data base legislation ultimately comes up for a vote, to vote against it, whatever it says.
fr: Donc si vous &ecirc;tes un &eacute;lecteur aux &Eacute;tats Unis, &eacute;crivez &agrave; votre membre du Congr&egrave;s maintenant. Dites-lui que s'il ou elle a une chance de voter pour choisir entre les lois HR 354 ou HR 1858 pour la loi sur les bases de donn&eacute;es, qu'il choississe la HR 1858. Mais alors dites-lui de voter contre la l&eacute;gislation sur les bases de donn&eacute;es quand elle arrivera au vote ultime, quelle qu'elle soit.

source: I've written a sample letter that you can use, but remember that your letter will carry more weight if you write in your own words. Send your letter on paper; e-mail does not impress legislators, because they know how easy it is to send. Be polite, but not timid, and try to keep it under 20 lines. Please email your letter to <a href="mailto:database-letters@gnu.org">&lt;database-letters@gnu.org&gt;</a> also.
fr: J'ai &eacute;crit une lettre type que vous pouvez utiliser, mais rappelez-vous que votre lettre aura plus de poids si vous l'&eacute;crivez en utilisant vos propres mots. Envoyez votre lettre au format papier, les courriels n'impressionnent pas les l&eacute;gislateurs, car ils savent &agrave; quel point c'est facile de les envoyer. Soyez poli, mais pas timide, et essayez de la maintenir en dessous de 20 lignes. Merci d'envoyer &eacute;galement vos lettres par courrier &eacute;lectronique &agrave; <a href="mailto:database-letters@gnu.org">&lt;database-letters@gnu.org&gt;</a>.
