<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en"><head>




<meta http-equiv="content-type" content="text/html; charset=utf-8">
<link rev="made" href="mailto:webmasters@gnu.org">
<link rel="icon" type="image/png" href="http://www.gnu.org/graphics/gnu-head-mini.png"><title>Projet GNU - Vous avez dit "propri&eacute;t&eacute; intellectuelle" ? C'est un mirage s&eacute;duisant</title>


<link rel="stylesheet" href="not-ipr_fichiers/gnu-new.css" title="GNU">
<link rel="stylesheet alternate" href="not-ipr_fichiers/gnu-pink.css" title="A pink banner">
<link rel="stylesheet alternate" href="not-ipr_fichiers/gnu-high.css" title="Experimental High Contrast">
<link rel="stylesheet alternate" href="not-ipr_fichiers/gnu-blue.css" title="Experimental Blue/White Contrast">

<style type="text/css" media="print">
@import url('/gnu-print.css');
</style></head><body id="foo">

  <div id="wrapper">
    
    <p class="netscape4"><a href="#content" accesskey="2">Skip to content</a> | <a href="#amspita">Skip to navigation</a></p>
    
    <div id="top2">
      
      <div id="banner">

        <h1>GNU's Not Unix! - Free Software, Free Society</h1>
        
        <div id="gnulogo"><a href="http://www.gnu.org/" accesskey="1" title="Go to the GNU project homepage"><img src="not-ipr_fichiers/gnu-head-banner.png" alt=""></a></div>
        
        <div id="dbdlogo"><a href="http://badvista.fsf.org/" title="Bad Vista"><img src="not-ipr_fichiers/badvista-trash.png" alt=""></a></div>
        
        <ul id="links">
          <li><a href="http://www.fsf.org/philosophy/free-sw.html">What is Free Software?</a></li>
          <li><a href="http://www.fsf.org/join" title="Become an associate member today!">Join the Free Software Foundation</a></li>
          <li><a href="http://www.fsf.org/register_form" title="Register to receive regular postal and electronic updates">Get FSF alerts</a></li>
          
        </ul>
        
      </div>
      
      <h5 class="netscape4" id="amspita">Site Navigation</h5>
      
      <div id="navigation-bar">
        <div id="navbar">
        <ul>
          <li><a href="http://www.gnu.org/">Home</a></li>
          <li><a href="http://www.gnu.org/software/">Software</a></li>
          <li><a href="http://www.gnu.org/philosophy/">Philosophy</a></li>
          <li><a href="http://www.gnu.org/licenses/">Licenses</a></li>
          <li><a href="http://www.gnu.org/doc/">Documentation</a></li>
          <li><a href="http://www.gnu.org/help/">Help GNU</a></li>
          <li><a href="http://www.gnu.org/contact/">Contact Us</a></li>
          <li><a href="http://gplv3.fsf.org/">GPLv3</a></li>
        </ul>
        </div>
      </div>
      
      
    </div>
    <div id="columns">
	      <!-- beginning of sidebar.html -->
<div id="sidebar" class="boxbox">
			  <h3 class="netscape4">Navigation</h3>
                          <h3>Key resources</h3>
                            <ul>
                              <li><a href="http://www.fsf.org/campaigns/priority.html" style="font-weight: bold;" title="Help or suggest a priority project for the Free Software community">Help a priority project</a></li>
                              <li><a href="http://gplv3.fsf.org/" style="font-weight: bold;" title="Help revise the GNU GPL and others">Help revise GNU licenses</a></li>
                              <li><a href="http://www.gnu.org/links/links.html#FreeGNULinuxDistributions" style="font-weight: bold;" title="Free GNU/Linux distributions">Free&nbsp;GNU/Linux&nbsp;distributions</a></li>
                              <li><a href="http://directory.fsf.org/" title="Browse our directory of free software projects">Free&nbsp;Software&nbsp;Directory</a></li>
                              <li><a href="http://www.gnu.org/software/" title="List of GNU software packages">GNU software packages</a></li>
                            </ul>

                           <h3>Stay up to date</h3>
                            <ul>
                              <li><a href="http://www.fsf.org/register_form">Get&nbsp;email&nbsp;alerts&nbsp;from&nbsp;the&nbsp;FSF</a></li>
                              <li><a href="http://www.gnu.org/keepingup.html" title="Keep up to date with the latest news from the GNU project">Keeping Up</a></li>
                              <li><a href="http://lists.gnu.org/" title="Discuss with other free software users and developers">GNU Mailing Lists</a></li>
                              <li><a href="http://www.gnu.org/people/speakers.html">GNU Speakers</a></li>
                              <li><a href="http://www.gnu.org/gnu/gnu-user-groups.html" title="Meet people in your area who use and develop free software">GNU User Groups</a></li>
                              <li><a href="http://www.gnu.org/press/press.html">Press Information</a></li>
                            </ul>

                           <h3>For developers</h3>
                            <ul>
                              <li><a href="http://savannah.gnu.org/" title="Get involved in one of our free software projects">Development projects</a></li>
                              <li><a href="http://www.gnu.org/software/devel.html" title="Are you a developer? Get access to developer resources">Developer resources</a></li>
                            </ul>

                          <div id="supportfsf">
                          <h3>Support the FSF</h3>

			  <div style="margin: 1.5em; padding: 0.5em; text-align: center; background-color: white; -moz-border-radius-topleft: 1em; -moz-border-radius-topright: 1em; -moz-border-radius-bottomright: 1em; -moz-border-radius-bottomleft: 1em;">

			  <p><a href="http://www.fsf.org/associate/support_freedom/join_fsf"><img src="not-ipr_fichiers/joinfsf.png" alt=""></a></p>
			  
			  <p><a href="http://www.fsf.org/associate/support_freedom/join_fsf"><strong>Join the FSF today!</strong></a></p>

			  <p><a href="http://www.fsf.org/associate/support_freedom/donate"><img src="not-ipr_fichiers/donatefsf.png" alt=""></a></p>

			  <p><a href="http://www.fsf.org/associate/support_freedom/donate">Donate to the FSF today!</a></p>

			  </div>

                           <ul>
                              <li><a href="http://order.fsf.org/">Buy manuals and gear</a></li>
                              <li><a href="http://patron.fsf.org/">Corporate Patronage</a></li>
                              <li><a href="http://www.gnu.org/thankgnus/thankgnus.html">Thank GNUs</a></li>
                           </ul></div>

                          <h3>For fun</h3>
                           <ul>
                              <li><a href="http://www.gnu.org/graphics/graphics.html">GNU Graphics and Art</a></li>
                              <li><a href="http://www.gnu.org/fun/humor.html">Laugh along with GNU</a></li>
                           </ul>

                        <h3>Other resources</h3>
                         <ul>
                              <li><a href="http://www.gnu.org/links/links.html">Free Software Links</a></li>
                              <li><a href="http://www.gnu.org/jobs">Free Software Jobs</a></li>
                         </ul>
</div>
<!-- end of sidebar.html -->

<div id="content">

<h2>Vous avez dit "propri&eacute;t&eacute; intellectuelle" ?  C'est un mirage s&eacute;duisant...</h2>

<p>par <a href="http://www.stallman.org/">Richard M. Stallman</a></p>

<p>
Il est &agrave; la mode de regrouper le copyright, les brevets et les marques d&eacute;pos&eacute;es - 
trois choses distinctes r&eacute;gies par trois ensembles de lois -- en une seule entit&eacute;
appel&eacute;e "propri&eacute;t&eacute; intellectuelle". Ce terme prête &agrave; confusion et n'est 
pas arriv&eacute; par accident. Ce sont les entreprises qui b&eacute;n&eacute;ficient de cette 
confusion qui en font la promotion. La meilleure mani&egrave;re d'&eacute;viter la confusion est de
rejeter enti&egrave;rement l'expression.
</p>

<p>
D'apr&egrave;s le Professeur Mark Lemley, de la Stanford Law School, 
la large utilisation du terme de "propri&eacute;t&eacute; intellectuelle" est une manie
qui a suivi la cr&eacute;ation de l'Organisation Mondiale de la "Propri&eacute;t&eacute; Intellectuelle" (OMPI) (NdT : 
WIPO, World "Intellectual Property" Organization), et qui n'est devenue vraiment 
r&eacute;pandue que r&eacute;cemment. Cette Organisation Mondiale de la Propri&eacute;t&eacute; Intellectuelle 
est officiellement une organisation des Nations Unies, mais repr&eacute;sente en fait 
les int&eacute;rêts des d&eacute;tenteurs de copyrights, de brevets et de marques d&eacute;pos&eacute;es.
</p>

<p>
Il n'est pas difficile de voir que le terme est biais&eacute; : il sugg&egrave;re de penser 
aux copyrights, brevets et marques d&eacute;pos&eacute;es de la même mani&egrave;re qu'aux droits 
de propri&eacute;t&eacute; d'objets physiques (Cette analogie est &agrave; l'oppos&eacute; des doctrines 
de droit de la loi sur le copyright, de la loi sur les brevets, et de la loi 
sur les marques d&eacute;pos&eacute;es, mais seuls les sp&eacute;cialistes le savent). Ces lois ne 
sont pas vraiment semblables aux lois sur la propri&eacute;t&eacute; des objets physiques, mais 
l'utilisation de ce terme m&egrave;ne les l&eacute;gislateurs &agrave; les changer afin de les en 
rapprocher. Et comme il s'agit des changements voulus par les entreprises qui 
exercent le copyright, ces soci&eacute;t&eacute;s ont &oelig;uvr&eacute; pour mettre ce terme &agrave; la mode.
</p>

<p>
Ce biais est une raison suffisante pour rejeter le terme, et les gens 
m'ont souvent demand&eacute; de proposer un autre nom pour englober ces notions -- 
et m'ont même fait leurs propres propositions, souvent humoristiques. Ces propositions 
ont &eacute;t&eacute; par exemple "IMPs" (NdT : "lutins") pour "Imposed Monopoly Privil&egrave;ges" 
(NdT : "Privil&egrave;ges Monopolistiques Impos&eacute;s"), ou "GOLEMs", pour "Government-Originated 
Legally Enforced Monopolies" (NdT : "Monopoles L&eacute;galement Impos&eacute;s d'Origine 
Gouvernementale"). Certains parlent de "r&eacute;gimes de droits exclusifs", mais assimiler 
des restrictions &agrave; des «droits» est biais&eacute; aussi..
</p>

<p>
Certains de ces noms alternatifs peuvent être une am&eacute;lioration, mais c'est une erreur 
de remplacer "propri&eacute;t&eacute; intellectuelle" par une autre expression. Un nom diff&eacute;rent 
ne r&eacute;sout pas le plus gros probl&egrave;me du terme : la g&eacute;n&eacute;ralisation. Il n'y a pas 
d'unification dans la "propri&eacute;t&eacute; intellectuelle" -- c'est un mirage. La seule 
raison pour laquelle les gens trouvent le terme coh&eacute;rent vient de son utilisation 
courante.
</p>

<p>
Le terme "propri&eacute;t&eacute; intellectuelle" est au mieux un fourre-tout pour regrouper 
des ensembles disparates de lois. Les n&eacute;ophytes qui n'entendent qu'un 
seul terme pour toutes ces lois tendent &agrave; croire qu'il y a plusieurs 
variations d'un principe commun, et qu'elles fonctionnent de mani&egrave;re similaire. 
</p>

<p>
Rien ne pourrait être moins vrai. 
Ces lois, &agrave; l'origine cr&eacute;&eacute;es s&eacute;par&eacute;ment, ont &eacute;volu&eacute; diff&eacute;remment, couvrent des 
activit&eacute;s diff&eacute;rentes, ont des r&egrave;glements diff&eacute;rents, et concernent 
diff&eacute;rentes questions d'ordre public.
</p>

<p>
La l&eacute;gislation sur le copyright a &eacute;t&eacute; cr&eacute;&eacute;e pour promouvoir les oeuvres litt&eacute;raires 
et l'art, et couvre les d&eacute;tails d'une &oelig;uvre litt&eacute;raire ou artistique. La l&eacute;gislation 
sur les brevets a &eacute;t&eacute; cr&eacute;&eacute;e pour favoriser la publication d'id&eacute;es utiles, 
au prix d'un monopole temporaire &agrave; celui qui a publi&eacute; l'id&eacute;e. -- un prix facile 
&agrave; payer dans certains domaines, mais pas dans d'autres.
</p>

<p>
La l&eacute;gislation sur les marques d&eacute;pos&eacute;es, au contraire, ne visait pas &agrave; 
promouvoir une quelconque capacit&eacute; d'action, mais simplement &agrave; 
permettre aux acheteurs de savoir ce qu'ils ach&egrave;tent. Les l&eacute;gislateurs, 
sous l'influence de la "propri&eacute;t&eacute; intellectuelle", l'ont transform&eacute;e 
en un arrangement incitant &agrave; la publicit&eacute;.
</p>

<p>
Comme ces lois ont &eacute;t&eacute; d&eacute;velopp&eacute;es ind&eacute;pendamment, elles sont toutes 
diff&eacute;rentes dans le moindre d&eacute;tail, aussi bien dans leurs propos que dans 
leurs m&eacute;thodes de base. Ainsi, si vous apprenez quoi que ce soit sur la 
l&eacute;gislation des copyrights, vous serez avis&eacute; de penser que la l&eacute;gislation 
des brevets est diff&eacute;rente. Ce sera rarement faux ! 
</p>

<p>
Les gens disent souvent "propri&eacute;t&eacute; intellectuelle" quand ils 
veulent d&eacute;signer une autre cat&eacute;gorie, plus &eacute;tendue ou plus 
restreinte que la «propri&eacute;t&eacute; intellectuelle». Par exemple, les pays riches 
imposent souvent des lois injustes aux pays pauvres afin d'en extorquer 
de l'argent. Plusieurs de ces lois sont des lois de la "propri&eacute;t&eacute; 
intellectuelle", pendant que d'autres ne le sont pas ; n&eacute;anmoins, 
ceux qui critiquent ces pratiques utilisent souvent cette expression 
parce qu'elle leur est famili&egrave;re. En l'utilisant, ils d&eacute;figurent 
la nature du probl&egrave;me. Il serait pr&eacute;f&eacute;rable d'utiliser un terme 
plus pr&eacute;cis, tel que "colonisation l&eacute;gislative", qui va au coeur 
du probl&egrave;me.
</p>

<p>
Les "non-initi&eacute;s" ne sont pas les seuls &agrave; subir la confusion provoqu&eacute;e 
par ce terme. Même les professeurs de droit qui enseignent ces l&eacute;gislations 
sont leurr&eacute;s et distraits par le pouvoir de s&eacute;duction du terme 
"propri&eacute;t&eacute; intellectuelle", et affirment des choses qui rentrent 
en conflit avec les faits qu'ils connaissent. Par exemple, un 
professeur &eacute;crivait en 2006 : 
</p>

<p>
"&agrave; la diff&eacute;rence de leurs descendants qui travaillent maintenant &agrave; l'OMPI, 
les auteurs de la constitution am&eacute;ricaine avaient une attitude de principe 
pro-concurrentielle vis &agrave; vis de la propri&eacute;t&eacute; intellectuelle. Ils savaient 
que les droits &eacute;taient n&eacute;cessaires, mais...ils ont li&eacute; les mains du congr&egrave;s en 
restreignant son pouvoir de plusieurs mani&egrave;res".
</p>

<p>
Cette affirmation se r&eacute;f&egrave;re &agrave; l'article 1 section 8 clause 8 de la 
constitution am&eacute;ricaine, qui autorise les lois sur le copyright et 
celles sur les brevets. Celle clause n'a cependant rien &agrave; voir avec 
la l&eacute;gislation sur les marques d&eacute;pos&eacute;es. Le terme "propri&eacute;t&eacute; 
intellectuelle" a men&eacute; ce professeur &agrave; une g&eacute;n&eacute;ralisation abusive.
</p>

<p>
Le terme "propri&eacute;t&eacute; intellectuelle" am&egrave;ne &eacute;galement une r&eacute;flexion 
simplifi&eacute;e. Il m&egrave;ne les gens &agrave; se concentrer sur la moindre ressemblance 
que ces lois disparates ont -- qu'elles cr&eacute;ent des privil&egrave;ges 
artificiels pour certaines personnes -- et &agrave; ignorer leur contenu 
: les restrictions sp&eacute;cifiques que chaque loi exerce sur le public, 
et les cons&eacute;quences qui en r&eacute;sultent. Cette focalisation simpliste 
sur la forme encourage une approche "&eacute;conomique" &agrave; tous ces probl&egrave;mes.
</p>

<p>
Ici, l'&eacute;conomie op&egrave;re comme un v&eacute;hicule d'affirmations non-v&eacute;rifi&eacute;es, 
comme elle le fait souvent. Ceci inclut des affirmations sur les valeurs, 
comme quoi par exemple la quantit&eacute; de production compte alors que la libert&eacute; 
et la mani&egrave;re de vivre importent peu, et des postulats en majorit&eacute; faux, tel celui 
qui affirme que les copyrights sur la musique aide les artistes musicaux, ou que les 
brevets sur les m&eacute;dicaments aident aux recherches d'ordre vital.
</p>

<p>
Un autre probl&egrave;me est qu'&agrave; la tr&egrave;s large &eacute;chelle de la "propri&eacute;t&eacute; intellectuelle", 
les probl&egrave;mes sp&eacute;cifiques soulev&eacute;s par les diverses lois deviennent quasiment 
invisibles. Ces probl&egrave;mes viennent des sp&eacute;cifit&eacute;s de chaque loi -- pr&eacute;cis&eacute;ment 
ce que le terme de "propri&eacute;t&eacute; intellectuelle" cherche &agrave; faire oublier. Par exemple, 
un probl&egrave;me relatif &agrave; la loi sur le copyright est de savoir si le partage de 
la musique devrait être autoris&eacute;. La loi sur les brevets n'a rien &agrave; voir avec &ccedil;a. La 
loi sur les brevets concerne les probl&egrave;mes tels que la production et la vente &agrave; bas 
prix de m&eacute;dicaments vitaux par les pays pauvres. La loi sur le copyright n'a 
tiens &agrave; voir avec de tels probl&egrave;mes.
</p>

<p>
Aucun de ces probl&egrave;mes n'est &eacute;conomique par nature, mais ils ne sont 
pas similaires pour autant. Quiconque les observant superficiellement au travers 
de l'aspect &eacute;conomique les appr&eacute;hendera mal. Si vous mettez toutes les 
lois dans le même sac de la "propri&eacute;t&eacute; intellectuelle", vous d&eacute;couvrirez 
que ceci obstrue votre capacit&eacute; de r&eacute;flexion sur chacune de ces lois.
</p>

<p>
Par cons&eacute;quence, une quelconque opinion sur "le probl&egrave;me de la 
propri&eacute;t&eacute; intellectuelle" et la moindre g&eacute;n&eacute;ralisation de cette 
cat&eacute;gorie suppos&eacute;e sont tr&egrave;s certainement stupides. Si vous pensez 
que toutes ces lois ne constituent qu'un seul et unique probl&egrave;me, 
vous aurez tendance &agrave; vous constituer une opinion &agrave; partir d'une 
s&eacute;rie de g&eacute;n&eacute;ralisations, dont aucune n'est bonne.
</p>

<p>
Si vous voulez r&eacute;fl&eacute;chir de mani&egrave;re lucide aux probl&egrave;mes soulev&eacute;s par 
les brevets, les copyrights, ou les marques d&eacute;pos&eacute;es, la premi&egrave;re &eacute;tape 
est d'oublier l'id&eacute;e de les mettre toutes dans le même panier, et de 
les traiter comme des sujets s&eacute;par&eacute;s. Le seconde &eacute;tape est de rejeter 
la vision &eacute;troite et les images simplistes que le terme de "propri&eacute;t&eacute; 
intellectuelle" sugg&egrave;re. Consid&eacute;rez chacun de ces probl&egrave;mes 
s&eacute;par&eacute;ment, dans sa totalit&eacute;, et vous pourrez les consid&eacute;rer correctement.
</p>

<p>
Et pour la r&eacute;forme de l'OMPI, entre autres choses  
<a href="http://www.fsfeurope.org/documents/wiwo.html">appelons &agrave; changer son nom</a>.
</p>
</div>

<!-- close columns -->
</div>
			<div id="searcher">
				
				
				<form method="post" action="http://www.gnu.org/cgi-bin/htsearch">
				<div><label for="words">Search:</label>
				<input name="method" id="method" value="and" type="hidden">
				<input name="words" id="words" size="20" accesskey="4" type="text">
				<input value="Go" type="submit">
				<input name="format" value="builtin-long" type="hidden">
				<input name="config" value="htdig" type="hidden"></div>
				</form>
				<p>&nbsp;</p>
			</div>

    <!-- BEGIN FSFlinks -->
<div id="fsflinks">
    <ul>
          <li><a href="http://www.fsf.org/">FSF</a></li>
          <li><a href="http://www.fsfeurope.org/">FSF Europe</a></li>
          <li><a href="http://fsf.org.in/">FSF India</a></li>
          <li><a href="http://www.fsfla.org/">FSF Latin America</a></li>
          <li><a href="#translations">Translations of this page</a></li>
      </ul>
</div>

    <!-- END FSFlinks -->


<div id="footer">

<p>
Please send FSF &amp; GNU inquiries to 
<a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>.
There are also <a href="http://www.fsf.org/about/contact.html">other ways to contact</a> 
the FSF.
<br>
Please send broken links and other corrections (or suggestions) to
<a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
</p>

<p>
Please see the 
<a href="http://www.gnu.org/server/standards/README.translations.html">Translations
README</a> for information on coordinating and submitting
translations of this article.
</p>

<p>
Copyright © 2004, 2006 Richard M. Stallman
<br>
Verbatim copying and distribution of this entire article is
permitted worldwide without royalty in any medium provided
this notice is preserved.
</p>

<p>
Updated:
<!-- timestamp start -->
$Date$ $Author$
<!-- timestamp end -->
</p>
</div>

<div id="translations">
<h4>Translations of this page:</h4>

<!-- Please keep this list alphabetical, and in the original -->
<!-- language if possible, otherwise default to English -->
<!-- If you do not have it English, please comment what the -->
<!-- English is.  If you add a new language here, please -->
<!-- advise web-translators@gnu.org and add it to -->
<!--    - in /home/www/bin/nightly-vars either TAGSLANG or WEBLANG -->
<!--    - in /home/www/html/server/standards/README.translations.html -->
<!--      one of the lists under the section "Translations Underway" -->
<!--    - if there is a translation team, you also have to add an alias -->
<!--      to mail.gnu.org:/com/mailer/aliases -->
<!-- Please also check you have the 2 letter language code right versus -->
<!--     http://www.w3.org/WAI/ER/IG/ert/iso639.htm -->
<!-- Please use xhtml normative character entities, instead of -->
<!-- non-w3c entities.  xhtml should be XML compliant -->

<ul class="translations-list">
<li><a href="http://www.gnu.org/philosophy/not-ipr.af.html">Afrikaans</a></li>	<!-- Afrikaans -->
<li><a href="http://www.gnu.org/philosophy/not-ipr.de.html">Deutsch</a></li>	<!-- German -->
<li><a href="http://www.gnu.org/philosophy/not-ipr.html">English</a></li>
<li><a href="http://www.gnu.org/philosophy/not-ipr.fr.html">Fran&ccedil;ais</a></li>	<!-- French -->
<li><a href="http://www.gnu.org/philosophy/not-ipr.it.html">Italiano</a></li>		<!-- Italian -->
<li><a href="http://www.gnu.org/philosophy/not-ipr.pl.html">Polski</a></li>		<!-- Polish -->
</ul>
</div>

</div>

</body></html>