Repository: gitGNU/gnu_www-fr
Catalog: philosophy/not-ipr.*.po
Languages: fr

source: Did You Say &ldquo;Intellectual Property&rdquo;? It's a Seductive Mirage - GNU Project - Free Software Foundation (FSF)
fr: Vous avez dit &laquo;Propri&eacute;t&eacute; intellectuelle&raquo;&nbsp;? Un s&eacute;duisant mirage - GNU Project - Free Software Foundation (FSF)

source: Did You Say &ldquo;Intellectual Property&rdquo;? It's a Seductive Mirage
fr: Vous avez dit &laquo;Propri&eacute;t&eacute; intellectuelle&raquo;&nbsp;? Un s&eacute;duisant mirage

source: by <a href="http://www.stallman.org/">Richard M. Stallman</a>
fr: par <a href="http://www.stallman.org/">Richard M. Stallman</a>

source: It has become fashionable to toss copyright, patents, and trademarks &mdash; three separate and different entities involving three separate and different sets of laws &mdash; into one pot and call it &ldquo;intellectual property&rdquo;. The distorting and confusing term did not arise by accident. Companies that gain from the confusion promoted it. The clearest way out of the confusion is to reject the term entirely.
fr: C'est devenu &agrave; la mode de d&eacute;crire le copyright, les brevets, et les marques d&eacute;pos&eacute;es comme &laquo;propri&eacute;t&eacute; intellectuelle&raquo;. Cette mode n'est pas apparue par accident &mdash; le terme d&eacute;forme et rend confus syst&eacute;matiquement ces probl&egrave;mes, et son utilisation a &eacute;t&eacute; et est soutenue par ceux qui profitent de cette confusion. Quiconque souhaite r&eacute;fl&eacute;chir clairement &agrave; une quelconque de ces lois ferait bien de rejeter le terme.

source: According to Professor Mark Lemley, now of the Stanford Law School, the widespread use of the term &ldquo;intellectual property&rdquo; is a fashion that followed the 1967 founding of the World &ldquo;Intellectual Property&rdquo; Organization, and only became really common in recent years. (WIPO is formally a UN organization, but in fact represents the interests of the holders of copyrights, patents, and trademarks.)
fr: Selon le Professeur Mark Lemley, exer&ccedil;ant actuellement &agrave; la Stanford Law School, l'utilisation tr&egrave;s r&eacute;pandue du terme &laquo;propri&eacute;t&eacute; intellectuelle&raquo; est une mode suivie depuis la cr&eacute;ation en 1967 de l'Organisation mondiale de la &laquo;propri&eacute;t&eacute; intellectuelle&raquo;, et est devenue r&eacute;ellement courante depuis ces derni&egrave;res ann&eacute;es. (L'OMPI est formellement une organisation des Nations Unies, mais elle repr&eacute;sente en faitles int&eacute;r&ecirc;ts des d&eacute;tenteurs de copyrights, de brevets et de marques d&eacute;pos&eacute;es).

source: The term carries a bias that is not hard to see: it suggests thinking about copyright, patents and trademarks by analogy with property rights for physical objects. (This analogy is at odds with the legal philosophies of copyright law, of patent law, and of trademark law, but only specialists know that.) These laws are in fact not much like physical property law, but use of this term leads legislators to change them to be more so. Since that is the change desired by the companies that exercise copyright, patent and trademark powers, the bias of &ldquo;intellectual property&rdquo; suits them.
fr: Un effet du terme est la distorsion qui n'est pas difficile de voir&nbsp;: il sugg&egrave;re de penser au copyright, aux brevets et aux marques d&eacute;pos&eacute;es par analogie avec les droits de propri&eacute;t&eacute; pour les objets physiques. (Cette analogie est &agrave; l'oppos&eacute; des doctrines de droit de la loi sur le copyright, de la loi sur les brevets, et de la loi sur les marques d&eacute;pos&eacute;es, mais seuls les sp&eacute;cialistes le savent). Ces lois sont en fait peu semblables &agrave; la loi sur la propri&eacute;t&eacute; physique, mais l'utilisation de ce terme conduit les l&eacute;gislateurs &agrave; les changer pour qu'elles en soient plus proches. Puisque c'est le changement voulu par les soci&eacute;t&eacute;s qui se servent des pouvoirs du copyright, des brevets et des marques d&eacute;pos&eacute;es, ces soci&eacute;t&eacute;s ont &oelig;uvr&eacute; pour mettre ce terme &agrave; la mode.

source: The bias is enough reason to reject the term, and people have often asked me to propose some other name for the overall category &mdash; or have proposed their own alternatives (often humorous). Suggestions include IMPs, for Imposed Monopoly Privileges, and GOLEMs, for Government-Originated Legally Enforced Monopolies. Some speak of &ldquo;exclusive rights regimes&rdquo;, but referring to restrictions as &ldquo;rights&rdquo; is doublethink too.
fr: Ceux qui pr&eacute;f&eacute;reraient juger ces probl&egrave;mes sur leurs m&eacute;rites devraient rejeter un terme biais&eacute; pour en parler. Beaucoup m'ont demand&eacute; de proposer un autre nom pour la cat&eacute;gorie &mdash; ou m'ont propos&eacute; des alternatives eux-m&ecirc;mes. Ces suggestions incluent IMP pour &laquo;Imposed Monopoly Privileges&raquo; (&laquo;Privil&egrave;ges de monopoles impos&eacute;s&raquo;), et GOLEM, pour &laquo;Government-Originated Legally Enforced Monopolies&raquo; (&laquo;Monopoles d'origine gouvernementale mis en application l&eacute;galement&raquo;). Certains parlent de &laquo;r&eacute;gimes de droits exclusifs&raquo;, mais assimiler des restrictions &agrave; des &laquo;droits&raquo; est biais&eacute; aussi.

source: Some of these alternative names would be an improvement, but it is a mistake to replace &ldquo;intellectual property&rdquo; with any other term. A different name will not address the term's deeper problem: overgeneralization. There is no such unified thing as &ldquo;intellectual property&rdquo;&mdash;it is a mirage. The only reason people think it makes sense as a coherent category is that widespread use of the term gives that impression.
fr: Certaines de ces substitutions sont une am&eacute;lioration incr&eacute;mentale, mais c'est une erreur de remplacer &laquo;propri&eacute;t&eacute; intellectuelle&raquo; par un autre terme. Un nom diff&eacute;rent pourrait &eacute;liminer la confusion, mais ne r&egrave;glerait pas le probl&egrave;me plus profond de ce terme&nbsp;: la banalisation. Il n'existe pas de chose unifi&eacute;e telle que la &laquo;propri&eacute;t&eacute; intellectuelle&raquo;. C'est un mirage, qui semble avoir une existence coh&eacute;rente seulement parce que le terme le sugg&egrave;re.

source: The term &ldquo;intellectual property&rdquo; is at best a catch-all to lump together disparate laws. Non-lawyers who hear one term applied to these various laws tend to assume they are based on a common principle, and function similarly.
fr: Le terme &laquo;propri&eacute;t&eacute; intellectuelle&raquo; est un terme fourre-tout pour m&ecirc;ler des lois disparates. Les n&eacute;ophytes en droit qui entendent le terme &laquo;propri&eacute;t&eacute; intellectuelle&raquo; appliqu&eacute; &agrave; diverses lois, tendent &agrave; croire qu'il y a plusieurs variations d'un principe commun, et qu'elles fonctionnent de mani&egrave;re similaire.

source: Nothing could be further from the case. These laws originated separately, evolved differently, cover different activities, have different rules, and raise different public policy issues.
fr: Rien n'est moins vrai.Ces lois produites s&eacute;par&eacute;ment, ont &eacute;volu&eacute; diff&eacute;remment, couvrent diff&eacute;rentes activit&eacute;s, ont des r&egrave;gles diff&eacute;rentes et soul&egrave;vent des probl&egrave;mes de politique publique diff&eacute;rents.

source: Copyright law was designed to promote authorship and art, and covers the details of expression of a work. Patent law was intended to promote the publication of useful ideas, at the price of giving the one who publishes an idea a temporary monopoly over it&mdash;a price that may be worth paying in some fields and not in others.
fr: La loi sur le copyright a &eacute;t&eacute; con&ccedil;ue pour promouvoir les &oelig;uvres litt&eacute;raires et l'art, et couvre les d&eacute;tails d'une &oelig;uvre litt&eacute;raire ou artistique. La loi sur les brevets a &eacute;t&eacute; con&ccedil;ue pour encourager la publication d'id&eacute;es, au prix d'un monopole limit&eacute; sur ces id&eacute;es &mdash; un prix n&eacute;cessaire dans certains domaines et pas dans d'autres.

source: Trademark law, by contrast, was not intended to promote any particular way of acting, but simply to enable buyers to know what they are buying. Legislators under the influence of &ldquo;intellectual property&rdquo;, however, have turned it into a scheme that provides incentives for advertising.
fr: La loi sur les marques d&eacute;pos&eacute;es n'&eacute;tait pas destin&eacute;e &agrave; promouvoir une quelconque activit&eacute; commerciale, mais seulement pour permettre aux acheteurs de savoir ce qu'ils ach&egrave;tent; cependant, les l&eacute;gislateurs sous l'influence de la &laquo;propri&eacute;t&eacute; intellectuelle&raquo;, l'ont modifi&eacute;e en un sch&eacute;ma qui fournit des incitations &agrave; faire de la publicit&eacute;

source: Since these laws developed independently, they are different in every detail, as well as in their basic purposes and methods. Thus, if you learn some fact about copyright law, you'd be wise to assume that patent law is different. You'll rarely go wrong!
fr: Puisque ces lois ont &eacute;t&eacute; d&eacute;velopp&eacute;es ind&eacute;pendamment l'une de l'autre, elles sont diff&eacute;rentes dans chaque d&eacute;tail, comme dans leurs propos ou leurs m&eacute;thodes de base. Par cons&eacute;quent, si vous apprenez quelque chose sur la loi sur le copyright, vous feriez mieux de supposer que la loi sur les brevets est diff&eacute;rente. Vous vous tromperez rarement de cette fa&ccedil;on.

source: People often say &ldquo;intellectual property&rdquo; when they really mean some larger or smaller category. For instance, rich countries often impose unjust laws on poor countries to squeeze money out of them. Some of these laws are &ldquo;intellectual property&rdquo; laws, and others are not; nonetheless, critics of the practice often grab for that label because it has become familiar to them. By using it, they misrepresent the nature of the issue. It would be better to use an accurate term, such as &ldquo;legislative colonization&rdquo;, that gets to the heart of the matter.
fr: Les gens disent souvent &laquo;propri&eacute;t&eacute; intellectuelle&raquo; quand ils veulent vraiment qualifier une autre cat&eacute;gorie, plus &eacute;tendue ou plus restreinte que la &laquo;propri&eacute;t&eacute; intellectuelle&raquo;. Par exemple, les pays riches imposent souvent des lois injustes aux pays pauvres pour leur extorquer de l'argent. Certaines sont souvent des lois sur la &laquo;propri&eacute;t&eacute; intellectuelle&raquo;, mais pas toutes&nbsp; n&eacute;anmoins, les gens utilisent souvent ce terme car il leur est devenu familier, et travestit la nature du probl&egrave;me. Il serait bien mieux d'utiliser un terme comme &laquo;colonisation l&eacute;gislative&raquo; qui est au c&oelig;ur du sujet et &eacute;vite la d&eacute;naturation de son &eacute;tendue.

source: Laymen are not alone in being confused by this term. Even law professors who teach these laws are lured by, and distracted by, the seductiveness of the term &ldquo;intellectual property&rdquo;, and make general statements that conflict with facts they know. For example, one professor wrote in 2006:
fr: Les hommes de loi ne sont pas les seuls &agrave; se m&eacute;prendre sur ce terme. M&ecirc;me les professeurs de droit qui enseignent ces lois sont leurr&eacute;s par le terme de &laquo;propri&eacute;t&eacute; intellectuelle&raquo; dans des d&eacute;clarations g&eacute;n&eacute;rales qui sont en contradiction avec les faits qu'ils connaissent. Le terme les distrait d'utiliser leurs connaissances. Par exemple, un professeur a &eacute;crit en 2006&nbsp;:

source: Unlike their descendants who now work the floor at WIPO, the framers of the US constitution had a principled, pro-competitive attitude to intellectual property. They knew rights might be necessary, but&hellip;they tied congress's hands, restricting its power in multiple ways.
fr: &laquo;&nbsp;Contrairement &agrave; leur descendants qui travaillent &agrave; l'<abbr title="Organisation mondiale de la propri&eacute;t&eacute; intellectuelle">OMPI</abbr>, les fondateurs de la Constitution am&eacute;ricaine avaient une attitude de principe pro-concurrentielle vis &agrave; vis de la propri&eacute;t&eacute; intellectuelle. Il savaient que des droits seraient peut-&ecirc;tre n&eacute;cessaires mais&hellip; ils ont li&eacute; les mains du Congr&egrave;s, en restreignant son pouvoir de diverses mani&egrave;res&nbsp;&raquo;.

source: That statement refers to the article 1 section 8, clause 8 in the US Constitution, which authorizes copyright law and patent law. That clause, though, has nothing to do with trademark law. The term &ldquo;intellectual property&rdquo; led that professor into a false generalization.
fr: Cette affirmation se ref&egrave;re &agrave; l'article 1 clause 8 de la Constitution am&egrave;ricaine qui autorise des lois sur les droits d'auteurs et des lois sur les brevets, mais cet article n'a rien &agrave; voir avec les lois sur les marques d&eacute;pos&eacute;es. Le terme &laquo;propri&eacute;t&eacute; intellectuelle&raquo; a conduit ce professeur &agrave; une fausse g&eacute;n&eacute;ralisation.

source: The term &ldquo;intellectual property&rdquo; also leads to simplistic thinking. It leads people to focus on the meager commonality in form that these disparate laws have&mdash;that they create artificial privileges for certain parties&mdash;and to disregard the details which form their substance: the specific restrictions each law places on the public, and the consequences that result. This simplistic focus on the form encourages an &ldquo;economistic&rdquo; approach to all these issues.
fr: Le terme &laquo;propri&eacute;t&eacute; intellectuelle&raquo; conduit &eacute;galement &agrave; une r&eacute;flexion simpliste. Il am&egrave;ne les gens &agrave; se concentrer sur la portion congrue de ces lois disparates, qui est qu'elles ont cr&eacute;&eacute; des privil&egrave;ges artificiels pour certaines parties, et &agrave; ignorer leur contenu &mdash; les restrictions sp&eacute;cifiques que chacune d'elles exercent sur le public, et les cons&eacute;quences qui en r&eacute;sultent. Ceci encourage une approche &laquo;&eacute;conomistique&raquo; de tous ces probl&egrave;mes.

source: Economics operates here, as it often does, as a vehicle for unexamined assumptions. These include assumptions about values, such as that amount of production matters, while freedom and way of life do not, and factual assumptions which are mostly false, such as that copyrights on music supports musicians, or that patents on drugs support life-saving research.
fr: L'&eacute;conomie, comme souvent, op&egrave;re comme un v&eacute;hicule pour des valeurs non examin&eacute;es, comme par exemple, la quantit&eacute; de production importe, alors que la libert&eacute; et le mode de vie non, et des postulats qui ne sont que tr&egrave;s superficiellement vrais, comme par exemple, que le droit d'auteur aide les musiciens, ou que les brevets sur les m&eacute;dicaments aident la recherche &agrave; sauver des vies.

source: Another problem is that, at the broad scale of &ldquo;intellectual property&rdquo;, the specific issues raised by the various laws become nearly invisible. These issues arise from the specifics of each law&mdash;precisely what the term &ldquo;intellectual property&rdquo; encourages people to ignore. For instance, one issue relating to copyright law is whether music sharing should be allowed. Patent law has nothing to do with this. Patent law raises issues such as whether poor countries should be allowed to produce life-saving drugs and sell them cheaply to save lives. Copyright law has nothing to do with such matters.
fr: Pour celui qui a une vue g&eacute;n&eacute;rique, les probl&egrave;mes sp&eacute;cifiques de la politique publique soulev&eacute;s par la loi sur le droit d'auteur, et les probl&egrave;mes, diff&eacute;rents, soulev&eacute;s par la loi sur les brevets ou toute autre loi, sont presque invisibles. Ces probl&egrave;mes proviennent des sp&eacute;cificit&eacute;s de chaque loi &mdash; pr&eacute;cis&eacute;ment ce que le terme &laquo;propri&eacute;t&eacute; intellectuelle&raquo; encourage les gens &agrave; ignorer. Par exemple, un probl&egrave;me relatif &agrave; la loi sur le droit d'auteur est de savoir si le partage de la musique devrait &ecirc;tre autoris&eacute;. La loi sur les brevets n'a rien &agrave; voir avec ceci.Mais la loi sur les brevets soul&egrave;ve le probl&egrave;me de savoir si les pays pauvres devraient &ecirc;tre autoris&eacute;s &agrave; produire des m&eacute;dicament qui sauvent des vies et les vendre bon march&eacute; pour sauver des vies. La loi sur le droit d'auteur n'a rien &agrave; voir avec cela.

source: Neither of these issues is solely economic in nature, and their noneconomic aspects are very different; using the shallow economic overgeneralization as the basis for considering them means ignoring the differences. Putting the two laws in the &ldquo;intellectual property&rdquo; pot obstructs clear thinking about each one.
fr: Aucun de ces probl&egrave;mes n'est par nature seulement &eacute;conomique, et leurs aspects non-&eacute;nonomiques sont tr&egrave;s diff&eacute;rents&nbsp;; utiliser la sur-g&eacute;n&eacute;ralisation &eacute;conomique superficielle comme base pour les appr&eacute;hender implique d'ignorer les diff&eacute;rences. Mettre les deux lois dans le m&ecirc;me pot de la &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; emp&ecirc;che d'avoir un raisonnement clair pour chacune d'elles.

source: Thus, any opinions about &ldquo;the issue of intellectual property&rdquo; and any generalizations about this supposed category are almost surely foolish. If you think all those laws are one issue, you will tend to choose your opinions from a selection of sweeping overgeneralizations, none of which is any good.
fr: Par cons&eacute;quent, toute opinion &agrave; propos de &laquo;la question de propri&eacute;t&eacute; intellectuelle&raquo; est presque s&ucirc;rement absurde. Si vous pensez que toutes ces lois ne sont qu'un même probl&egrave;me, vous aurez tendance &agrave; choisir vos opinions &agrave; partir d'une s&eacute;lection de g&eacute;n&eacute;ralisations, dont aucune d'elles n'est bonne.

source: If you want to think clearly about the issues raised by patents, or copyrights, or trademarks, the first step is to forget the idea of lumping them together, and treat them as separate topics. The second step is to reject the narrow perspectives and simplistic picture the term &ldquo;intellectual property&rdquo; suggests. Consider each of these issues separately, in its fullness, and you have a chance of considering them well.
fr: Si vous voulez r&eacute;fl&eacute;chir clairement au sujet des probl&egrave;mes soulev&eacute;s par les brevets, les copyrights ou les marques d&eacute;pos&eacute;es, ou m&ecirc;me apprendre ce que ces lois disent, la premi&egrave;re &eacute;tape est d'oublier l'id&eacute;e de les mettre toutes dans le m&ecirc;me panier, et de les traiter comme des sujets s&eacute;par&eacute;s. Si vous voulez &eacute;crire des articles qui informent le public et encourage &agrave; r&eacute;fl&eacute;chir clairement, traiter chacune de ces lois s&eacute;par&eacute;ment; ne sugg&eacute;rez pas de g&eacute;n&eacute;ralisation &agrave; leur propos.

source: And when it comes to reforming WIPO, among other things <a href="http://www.fsfeurope.org/documents/wiwo.html">let's call for changing its name</a>.
fr: Et quand viendra le temps de la r&eacute;forme de l'OMPI, entre autres choses, <a href="http://www.fsfeurope.org/documents/wiwo.html">appelons &agrave; changer son nom</a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2004, 2006 Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted worldwide without royalty in any medium provided this notice is preserved.
fr: Copyright &copy; 2004, 2006 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
