Repository: gitGNU/gnu_www-fr
Catalog: philosophy/open-source-misses-the-point.*.po
Languages: fr

source: A pure open source enthusiast, one that is not at all influenced by the ideals of free software, will say, &ldquo;I am surprised you were able to make the program work so well without using our development model, but you did. How can I get a copy?&rdquo; This attitude will reward schemes that take away our freedom, leading to its loss.
fr: Un supporter de l'open source, un qui n'est pas du tout influenc&eacute; par les id&eacute;aux du logiciel libre, dira, &laquo;&nbsp;Je suis surpris que vous ayez &eacute;t&eacute; capable de faire fonctionner ce programme si bien sans utiliser notre mod&egrave;le de d&eacute;veloppement, mais vous l'avez fait. Comment puis-je avoir une copie&nbsp;?&nbsp;&raquo;. Ce genre d'attitude incite des arrangements qui emportent avec eux notre libert&eacute;, la menant &agrave; sa perte.

source: The free software activist will say, &ldquo;Your program is very attractive, but not at the price of my freedom. So I have to do without it. Instead I will support a project to develop a free replacement.&rdquo; If we value our freedom, we can act to maintain and defend it.
fr: L'activiste du logiciel libre dira &laquo;&nbsp;Votre programme est vraiment attrayant, mais pas au prix de ma libert&eacute;. Je dois donc faire sans. Au lieu de cela je soutiendrai un projet pour d&eacute;velopper un remplacement libre. Si nous accordons de la valeur &agrave; notre libert&eacute;, nous pouvons agir pour la maintenir et la d&eacute;fendre.

source: Powerful, reliable software can be bad
fr: Le logiciel puissant et fiable peut &ecirc;tre mauvais

source: The idea that we want software to be powerful and reliable comes from the supposition that the software is designed to serve its users. If it is powerful and reliable, that means it serves them better.
fr: L'id&eacute;e que nous voulons que le logiciel soit puissant et fiable vient de la supposition que le logiciel est fait pour servir ses utilisateurs. S'il est puissant et fiable, il les sert mieux.

source: But software can only be said to serve its users if it respects their freedom. What if the software is designed to put chains on its users? Then powerfulness only means the chains are more constricting, and reliability that they are harder to remove. Malicious features, such as spying on the users, restricting the users, back doors, and imposed upgrades are common in proprietary software, and some open source supporters want to do likewise.
fr: Mais on ne peut dire d'un logiciel qu'il sert ses utilisateurs seulement s'il respecte leur libert&eacute;. Que dire si le logiciel est con&ccedil;u pour encha&icirc;ner ses utilisateurs&nbsp;? La fiabilit&eacute; ne signifie alors uniquement que les cha&icirc;nes sont plus difficiles &agrave; retirer.

source: Under the pressure of the movie and record companies, software for individuals to use is increasingly designed specifically to restrict them. This malicious feature is known as DRM, or Digital Restrictions Management (see <a href="http://defectivebydesign.org/">DefectiveByDesign.org</a>), and it is the antithesis in spirit of the freedom that free software aims to provide. And not just in spirit: since the goal of DRM is to trample your freedom, DRM developers try to make it hard, impossible, or even illegal for you to change the software that implements the DRM.
fr: Sous la pression des compagnies de film et de disque, les logiciels &agrave; usage individuel sont de plus en plus con&ccedil;us sp&eacute;cifiquement pour imposer des restrictions. Ce dispositif malveillant est connu sous le nom de DRM, ou Digital Restrictions Management (ndt&nbsp;: Gestion Num&eacute;rique des Droits) (voir <a href="http://defectivebydesign.org/">DefectiveByDesign.org</a>), et c'est l'antith&egrave;se dans l'esprit de la libert&eacute; que le logiciel libre vise &agrave; fournir. Et pas simplement dans l'esprit&nbsp;: puisque le but des DRM est de pi&eacute;tiner votre libert&eacute;, les concepteurs de DRM essayent de rendre difficile, impossible ou m&ecirc;me ill&eacute;gal pour vous de modifier le logiciel qui met en application les DRM.

source: Yet some open source supporters have proposed &ldquo;open source DRM&rdquo; software. Their idea is that by publishing the source code of programs designed to restrict your access to encrypted media, and allowing others to change it, they will produce more powerful and reliable software for restricting users like you. Then it will be delivered to you in devices that do not allow you to change it.
fr: Pourtant quelques d&eacute;fenseurs de l'open source ont propos&eacute; des logiciels &laquo;&nbsp;DRM open source&nbsp;&raquo;. Leur id&eacute;e est qu'en publiant le code source de leur programme con&ccedil;u pour restreindre votre acc&egrave;s aux medias chiffr&eacute;s, et en autorisant d'autres &agrave; le modifier, ils produiront un logiciel pluspuissant et plus fiable pour limiter le droit des utilisateurs comme vous. Il vous sera alors livr&eacute; dans des dispositifs qui ne vous permettent pas de le changer.

source: This software might be &ldquo;open source,&rdquo; and use the open source development model; but it won't be free software, since it won't respect the freedom of the users that actually run it. If the open source development model succeeds in making this software more powerful and reliable for restricting you, that will make it even worse.
fr: Ce logiciel pourrait &ecirc;tre &laquo;&nbsp;open source&nbsp;&raquo; et utiliser le mod&egrave;le de d&eacute;veloppement open source&nbsp;; mais il ne sera pas un logiciel libre, &eacute;tant donn&eacute; qu'il ne respectera pas la libert&eacute; des utilisateurs qui l'utiliseront. Si le mod&egrave;le de d&eacute;veloppement open source r&eacute;ussi &agrave; r&eacute;aliser un logiciel plus puissant et fiable pour limiter vos droits, cela le rendra encore pire.

source: Fear of freedom
fr: La crainte de la libert&eacute;

source: The main initial motivation for the term &ldquo;open source software&rdquo; is that the ethical ideas of &ldquo;free software&rdquo; make some people uneasy. That's true: talking about freedom, about ethical issues, about responsibilities as well as convenience, is asking people to think about things they might prefer to ignore, such as whether their conduct is ethical. This can trigger discomfort, and some people may simply close their minds to it. It does not follow that we ought to stop talking about these things.
fr: La principale motivation initiale pour le terme &laquo;&nbsp;logiciel open source&nbsp;&raquo; est que les id&eacute;es &eacute;thiques du &laquo;&nbsp;logiciel libre&nbsp;&raquo; rend certaines personnes mal &agrave; l'aise. C'est vrai&nbsp;: parler de libert&eacute;, de probl&egrave;mes d'&eacute;thique, de responsabilit&eacute;s aussi bien que de commodit&eacute;s, c'est demander aux gens de penser &agrave; des choses qu'ils pr&eacute;f&eacute;reraient ignorer, comme leur conduite est-elle &eacute;thique ou non. Ceci peut d&eacute;clencher un malaise et certains peuvent simplement fermer leurs esprits &agrave; cela. Il ne s'en suit pas que nous devrions cesser de parler de ces choses.

source: However, that is what the leaders of &ldquo;open source&rdquo; decided to do. They figured that by keeping quiet about ethics and freedom, and talking only about the immediate practical benefits of certain free software, they might be able to &ldquo;sell&rdquo; the software more effectively to certain users, especially business.
fr: Cependant, c'est ce que les dirigeants de l'&laquo;&nbsp;open source&nbsp;&raquo; ont d&eacute;cid&eacute; de faire. Ils se sont figur&eacute; qu'en passant sous silence l'&eacute;thique et la libert&eacute;, et en ne parlant que des b&eacute;n&eacute;fices imm&eacute;diats de certains logiciels libres, ils seraient &agrave; m&ecirc;me de &laquo;&nbsp;vendre&nbsp;&raquo; le logiciel plus efficacement &agrave; certains utilisateurs, particuli&egrave;rement aux entreprises.

source: This approach has proved effective, in its own terms. The rhetoric of open source has convinced many businesses and individuals to use, and even develop, free software, which has extended our community&mdash;but only at the superficial, practical level. The philosophy of open source, with its purely practical values, impedes understanding of the deeper ideas of free software; it brings many people into our community, but does not teach them to defend it. That is good, as far as it goes, but it is not enough to make freedom secure. Attracting users to free software takes them just part of the way to becoming defenders of their own freedom.
fr: Cette approche &agrave; prouv&eacute; son efficacit&eacute;, dans ses propres termes. La rh&eacute;torique de l'open source &agrave; convaincu beaucoup d'entreprises et d'individus &agrave; utiliser, et m&ecirc;me &agrave; d&eacute;velopper du logiciel libre, ce qui a &eacute;tendu notre communaut&eacute;, mais seulement au niveau superficiel et pratique. La philosophie de l'open source avec ses valeurs purement pratiques, emp&ecirc;che la compr&eacute;hension des id&eacute;es plus profondes du logiciel libre&nbsp;; elle apporte beaucoup de monde dans notre communaut&eacute;, mais ne leur enseigne pas &agrave; la d&eacute;fendre. Cela est bon, tant que les choses vont bien, mais ce n'est pas assez pour instaurer une libert&eacute; durable. Attirer des utilisateurs vers le logiciel libre ne fait que leur faire prendre une partie du chemin pour devenir des d&eacute;fenseurs de leur propre libert&eacute;.

source: Sooner or later these users will be invited to switch back to proprietary software for some practical advantage. Countless companies seek to offer such temptation, some even offering copies gratis. Why would users decline? Only if they have learned to value the freedom free software gives them, to value freedom as such rather than the technical and practical convenience of specific free software. To spread this idea, we have to talk about freedom. A certain amount of the &ldquo;keep quiet&rdquo; approach to business can be useful for the community, but it is dangerous if it becomes so common that the love of freedom comes to seem like an eccentricity.
fr: T&ocirc;t ou tard, ces utilisateurs seront invit&eacute;s &agrave; retourner vers le logiciel propri&eacute;taire pour quelques avantages pratiques. D'innombrables compagnies cherchent &agrave; offrir une telle tentation, certaines offrent m&ecirc;me des copies gratuites. Pourquoi les utilisateurs refuseraient-ils&nbsp;? C'est seulement s'ils ont appris la valeur de la libert&eacute; que le logiciel libre leur donne, la valeur de cette libert&eacute; en tant que telle plut&ocirc;t que la commodit&eacute; technique et pratique de logiciels libres sp&eacute;cifiques. Pour diffuser cette id&eacute;e, nous devons parler de logiciel libre. Une certaine quantit&eacute; de l'approche &laquo;&nbsp; passer sous silence &nbsp;&raquo; avec les entreprises peut &ecirc;tre utile pour la communaut&eacute;, mais elle est dangereuse si elle devient si commune que l'amour de la libert&eacute; en vient &agrave; sembler comme une excentricit&eacute;.

source: That dangerous situation is exactly what we have. Most people involved with free software say little about freedom&mdash;usually because they seek to be &ldquo;more acceptable to business.&rdquo; Software distributors especially show this pattern. Nearly all GNU/Linux operating system distributions add proprietary packages to the basic free system, and they invite users to consider this an advantage, rather than a step backwards from freedom.
fr: Cette dangereuse situation est exactement ce que nous avons. La plupart des gens impliqu&eacute; dans le logiciel libre en disent peu sur la libert&eacute;, habituellement parce qu'ils cherchent &agrave; sembler &laquo;&nbsp;plus acceptables pour les entreprises&nbsp;&raquo;. Les distributeurs de logiciel montrent particuli&egrave;rement ce mod&egrave;le. Pratiquement tous les distributeurs de syst&egrave;me d'exploitation GNU/Linux ajoutent des paquetages propri&eacute;taires au syst&egrave;me de base libre, et ils invitent les utilisateurs &agrave; consid&eacute;rer cela comme un avantage, plut&ocirc;t qu'un pas en arri&egrave;re vis-&agrave;-vis de la libert&eacute;.

source: Proprietary add-on software and partially non-free GNU/Linux distributions find fertile ground because most of our community does not insist on freedom with its software. This is no coincidence. Most GNU/Linux users were introduced to the system by &ldquo;open source&rdquo; discussion which doesn't say that freedom is a goal. The practices that don't uphold freedom and the words that don't talk about freedom go hand in hand, each promoting the other. To overcome this tendency, we need more, not less, talk about freedom.
fr: Les greffons logiciels propri&eacute;taires et particuli&egrave;rement les distributions non-libres GNU/Linux, trouvent un sol fertile parce que notre communaut&eacute; n'insiste pas sur la libert&eacute; de ses logiciels. Ce n'est pas une co&iuml;ncidence. La plupart des utilisateurs GNU/Linux furent introduits au syst&egrave;me par un discours &laquo;&nbsp;open source&nbsp;&raquo; qui ne leur a pas dit que la libert&eacute; &eacute;tait le but. Les aspects pratiques qui n'impliquent pas la libert&eacute; et les discours qui ne parlent pas de libert&eacute; vont de pair, l'un favorisant l'autre. Pour surmonter cette tendance, nous avons besoin de plus parler de libert&eacute;, pas l'inverse.

source: As the advocates of open source draw new users into our community, we free software activists have to work even more to bring the issue of freedom to those new users' attention. We have to say, &ldquo;It's free software and it gives you freedom!&rdquo;&mdash;more and louder than ever. Every time you say &ldquo;free software&rdquo; rather than &ldquo;open source,&rdquo; you help our campaign.
fr: Alors que ceux qui pr&eacute;conisent l'open source am&egrave;nent de nouveaux utilisateurs dans notre communaut&eacute;, nous, activistes du logiciel libre, devons travailler encore plus pour porter l'attention de ces nouveaux utilisateurs sur les probl&egrave;mes de libert&eacute;. Nous devons leur dire &laquo;&nbsp;C'est le logiciel libre et il te donne la libert&eacute;&nbsp;!&nbsp;&raquo; plus souvent et plus fort que jamais. Chaque fois que vous dites &laquo;&nbsp;logiciel libre&nbsp;&raquo; plut&ocirc;t qu'&laquo;&nbsp;open source&nbsp;&raquo; vous aidez notre campagne.

source: Footnotes
fr: Apostille

source: Joe Barr wrote an article called <a href="http://www.itworld.com/AppDev/350/LWD010523vcontrol4/">Live and let license</a> that gives his perspective on this issue.
fr: Joe Barr a &eacute;crit un article intitul&eacute; <a href="http://www.itworld.com/AppDev/350/LWD010523vcontrol4/">Live and let license</a><sup><a href="#TransNote6">6</a></sup> qui donne sa perspective sur cette question.

source: Lakhani and Wolf's <a href="http://freesoftware.mit.edu/papers/lakhaniwolf.pdf">paper on the motivation of free software developers</a> says that a considerable fraction are motivated by the view that software should be free. This was despite the fact that they surveyed the developers on SourceForge, a site that does not support the view that this is an ethical issue.
fr: L'<a href="http://freesoftware.mit.edu/papers/lakhaniwolf.pdf">article sur la motivation des d&eacute;veloppeurs de logiciel libre</a> de Lakhani et Wolf dit qu'une fraction consid&eacute;rable est motiv&eacute;e par la perspective que le logiciel devrait &ecirc;tre libre. Cela malgr&eacute; le fait qu'ils ont examin&eacute; les d&eacute;veloppeurs de SourceForge, un site qui ne soutient pas le point de vue qui veut qu'il s'agit d'un probl&egrave;me &eacute;thique.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;: <ol><li id="TransNote1">Free speech en anglais.</li><li id="TransNote2">Free beer en anglais.</li><li id="TransNote3">&agrave; code source ouvert.</li><li id="TransNote4">Ce paragraphe traite de l'amalgame qui existe dans le terme &laquo;&nbsp;logiciel libre&nbsp;&raquo; dans la langue anglaise. En effet, en anglais on parle de &laquo;&nbsp;free software&nbsp;&raquo;, le mot &laquo;&nbsp;free&nbsp;&raquo; pouvant s'interpr&eacute;ter aussi bien par &laquo;&nbsp;libre&nbsp;&raquo; que par &laquo;&nbsp;gratuit&nbsp;&raquo;. En fran&ccedil;ais cet amalgame n'existe pas.</li><li id="TransNote5">&laquo;&nbsp;Think of free speech, not free beer.&nbsp;&raquo;).</li><li id="TransNote6">Vivre et mettre sous licencie.</li></ol>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Copyright &copy; 2007 Richard Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: Copyright &copy; 2007 Richard Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Mathieu Stumpf.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
