Repository: gitGNU/gnu_www-fr
Catalog: philosophy/open-source-misses-the-point.*.po
Languages: fr

source: Why Open Source misses the point of Free Software - GNU Project - Free Software Foundation (FSF)
fr: Pourquoi l'&laquo;&nbsp;open source&nbsp;&raquo; passe &agrave; cot&eacute; du probl&egrave;me que soul&egrave;ve le logiciel libre - GNU Project - Free Software Foundation (FSF)

source: Why &ldquo;Open Source&rdquo; misses the point of Free Software
fr: Pourquoi l'&laquo;&nbsp;open source&nbsp;&raquo; passe &agrave; cot&eacute; du probl&egrave;me que soul&egrave;ve le logiciel libre

source: by <strong>Richard Stallman</strong>
fr: par <strong>Richard Stallman</strong>

source: When we call software &ldquo;free,&rdquo; we mean that it respects the <a href="/philosophy/free-sw.html">users' essential freedoms</a>: the freedom to run it, to study and change it, and to redistribute copies with or without changes. This is a matter of freedom, not price, so think of &ldquo;free speech,&rdquo; not &ldquo;free beer.&rdquo;
fr: Quand on dit qu'un logiciel est &laquo;&nbsp;libre&nbsp;&raquo;, on entend par l&agrave; qu'il respecte <a href="/philosophy/free-sw.fr.html">les libert&eacute;s essentielles de l'utilisateur</a>&nbsp;: la libert&eacute; de l'utiliser, de l'&eacute;tudier et de le modifier, et de redistribuer des copies avec ou sans modification. C'est une question de libert&eacute;, pas de prix, pensez donc &agrave; &laquo;&nbsp;libert&eacute; d'expression&nbsp;&raquo;<sup><a href="#TransNote1">1</a></sup> et pas &agrave; &laquo;&nbsp;bi&egrave;re gratuite&nbsp;&raquo;<sup><a href="#TransNote2"></a></sup>.

source: These freedoms are vitally important. They are essential, not just for the individual users' sake, but because they promote social solidarity&mdash;that is, sharing and cooperation. They become even more important as more and more of our culture and life activities are digitized. In a world of digital sounds, images and words, free software comes increasingly to equate with freedom in general.
fr: Ces libert&eacute;s sont d'une importance vitale. Elles sont essentielles, pas juste pour les enjeux individuels des utilisateurs, mais parce qu'elles promeuvent la solidarit&eacute; sociale, que sont le partage et la coop&eacute;ration. Elles deviennent encore plus importantes &agrave; mesure que de plus en plus notre culture et les activit&eacute;s quotidiennes sont num&eacute;ris&eacute;s. Dans un monde de sons, d'images et de mots num&eacute;riques, le logiciel libre devient de plus en plus n&eacute;cessaire pour la libert&eacute; en g&eacute;n&eacute;ral.

source: Tens of millions of people around the world now use free software; the schools of regions of India and Spain now teach all students to use the free <a href="/gnu/linux-and-gnu.html">GNU/Linux operating system</a>. But most of these users have never heard of the ethical reasons for which we developed this system and built the free software community, because today this system and community are more often described as &ldquo;open source,&rdquo; and attributed to a different philosophy in which these freedoms are hardly mentioned.
fr: Des dizaines de millions de personnes &agrave; travers le monde utilisent maintenant le logiciel libre&nbsp;; les &eacute;coles des r&eacute;gions de l'Inde et de l'Espagne enseignent maintenant &agrave; tous les &eacute;tudiants &agrave; utiliser le <a href="/gnu/linux-and-gnu.fr.html">syst&egrave;me d'exploitation libre GNU/Linux</a>. Mais la plupart des utilisateurs n'ont jamais entendu parler des raisons &eacute;thiques pour lesquelles nous avons d&eacute;velopp&eacute; ce syst&egrave;me et b&acirc;ti la communaut&eacute; du logiciel libre, parce qu'aujourd'hui ce syst&egrave;me et la communaut&eacute; sont plus souvent d&eacute;crits comme &laquo;&nbsp;open source&nbsp;&raquo;<sup><a href="#TransNote3">3</a></sup> et attribu&eacute;s &agrave; une philosophie diff&eacute;rente dans laquelle ces libert&eacute;s sont &agrave; peine mentionn&eacute;es.

source: The free software movement has campaigned for computer users' freedom since 1983. In 1984 we launched the development of the free operating system GNU, so we could avoid the non-free operating systems that deny freedom to their users. During the 80s, we developed most of the essential components of such a system, as well as the <a href="/licenses/gpl.html">GNU General Public License</a>, a license designed specifically to protect freedom for all users of a program.
fr: Le mouvement du logiciel libre a fait campagne pour la libert&eacute; des utilisateurs d'ordinateur depuis 1983. En 1984 nous avons lanc&eacute; le d&eacute;veloppement du syst&egrave;me d'exploitation libre GNU, pour pouvoir ainsi &eacute;viter d'utiliser un syst&egrave;me qui refuse la libert&eacute; &agrave; ses utilisateurs. Durant les ann&eacute;es 80, nous avons d&eacute;velopp&eacute; la majeure partie des composants essentiels d'un tel syst&egrave;me, tout autant que la <a href="/licenses/gpl.html">GNU General Public License</a>, une licence con&ccedil;ue sp&eacute;cifiquement pour prot&eacute;ger la libert&eacute; pour tous les utilisateurs d'un programme.

source: However, not all of the users and developers of free software agreed with the goals of the free software movement. In 1998, a part of the free software community splintered off and began campaigning in the name of &ldquo;open source.&rdquo; The term was originally proposed to avoid a possible misunderstanding of the term &ldquo;free software,&rdquo; but it soon became associated with philosophical views quite different from those of the free software movement.
fr: Cependant, tous les utilisateurs et les d&eacute;veloppeurs de logiciel libre n'&eacute;taient pas en accord avec les buts du mouvement du logiciel libre. En 1998, une partie de la communaut&eacute; du logiciel libre s'est mise &agrave; part et a commenc&eacute; &agrave; faire campagne au nom de l'&laquo;&nbsp;open source&nbsp;&raquo;. Le terme fut originellement propos&eacute; pour &eacute;viter une possible incompr&eacute;hension du terme &laquo;&nbsp;logiciel libre&nbsp;&raquo; (ndt&nbsp;: &laquo;&nbsp;free software&nbsp;&raquo;) mais il fut bient&ocirc;t associ&eacute; avec des points de vue philosophique compl&egrave;tement diff&eacute;rents de ceux du mouvement du logiciel libre.

source: Some of the proponents of &ldquo;open source&rdquo; considered it a &ldquo;marketing campaign for free software,&rdquo; which would appeal to business executives by citing practical benefits, while avoiding ideas of right and wrong that they might not like to hear. Other proponents flatly rejected the free software movement's ethical and social values. Whichever their views, when campaigning for &ldquo;open source&rdquo; they did not cite or advocate those values. The term &ldquo;open source&rdquo; quickly became associated with the practice of citing only practical values, such as making powerful, reliable software. Most of the supporters of &ldquo;open source&rdquo; have come to it since then, and that practice is what they take it to mean.
fr: Certains des partisans de l'&laquo;&nbsp;open source&nbsp;&raquo; consid&eacute;raient cela comme &laquo;&nbsp;une campagne marketing pour le logiciel libre&nbsp;&raquo; qui plairait aux cadres des entreprises en citant les avantages pratiques, tout en &eacute;vitant les id&eacute;es de bien ou de mal qu'ils pourraient ne pas aimer entendre. D'autres partisans rejet&egrave;rent cat&eacute;goriquement les valeurs morales et sociales du mouvement du logiciel libre. Quel que fut leur point de vue, pendant leur campagne sur l'&laquo;&nbsp;open source&nbsp;&raquo; ils ne mentionn&egrave;rent ou ne pr&eacute;conis&egrave;rent pas ces valeurs. Le terme &laquo;&nbsp;open source&nbsp;&raquo; devint rapidement associ&eacute; avec la pratique de ne citer que les valeurs pratiques, tel que faire des logiciels puissants et fiables. La plupart des d&eacute;fenseurs de l'&laquo;&nbsp;open source&nbsp;&raquo; se sont ralli&eacute;s &agrave; celui-ci depuis, et cette pratique est celle dont ils se servent.

source: Nearly all open source software is free software; the two terms describe almost the same category of software. But they stand for views based on fundamentally different values. Open source is a development methodology; free software is a social movement. For the free software movement, free software is an ethical imperative, because only free software respects the users' freedom. By contrast, the philosophy of open source considers issues in terms of how to make software &ldquo;better&rdquo;&mdash;in a practical sense only. It says that non-free software is a suboptimal solution. For the free software movement, however, non-free software is a social problem, and moving to free software is the solution.
fr: Pratiquement tous les logiciels &laquo;&nbsp;open source&nbsp;&raquo; sont des logiciels libres&nbsp;; les deux termes d&eacute;crivent pratiquement la m&ecirc;me cat&eacute;gorie de logiciel. Mais ils repr&eacute;sentent des vues bas&eacute;es sur des valeurs fondamentalement diff&eacute;rentes. L'&laquo;&nbsp;open source&nbsp;&raquo; est une m&eacute;thodologie de d&eacute;veloppement&nbsp;; le logiciel libre est un mouvement social. Pour le mouvement du logiciel libre, le logiciel libre est un imp&eacute;ratif &eacute;thique, parce que seul le logiciel libre respecte la libert&eacute; de l'utilisateur. En revanche, la philosophie de l'&laquo;&nbsp;open source&nbsp;&raquo; consid&egrave;re uniquement les questions pratiques en termes de performance. Cela signifie que les logiciels non-libres sont des solutions sous-optimales. Pour le mouvement du logiciel libre cependant, les logiciels non-libres sont un probl&egrave;me social et migrer vers les logiciels libres est une solution.

source: Free software. Open source. If it's the same software, does it matter which name you use? Yes, because different words convey different ideas. While a free program by any other name would give you the same freedom today, establishing freedom in a lasting way depends above all on teaching people to value freedom. If you want to help do this, it is essential to speak about &ldquo;free software.&rdquo;
fr: &laquo;&nbsp;Logiciel libre&nbsp;&raquo;. &laquo;&nbsp;Open source&nbsp;&raquo;. Si ce sont les m&ecirc;mes logiciels, le nom utilis&eacute; pour les qualifier est-il important&nbsp;? Oui, parce que des mots diff&eacute;rents v&eacute;hiculent des id&eacute;es diff&eacute;rentes. Bien qu'un programme libre avec n'importe quel autre nom vous donnerait la m&ecirc;me libert&eacute; aujourd'hui, l'&eacute;tablissement de la libert&eacute; de mani&egrave;re durable d&eacute;pend par dessus tout de l'enseignement de la valeur de la libert&eacute;. Si vous voulez aider &agrave; faire cela, il est essentiel de parler de &laquo;&nbsp;logiciel libre&nbsp;&raquo;.

source: We in the free software movement don't think of the open source camp as an enemy; the enemy is proprietary (non-free) software. But we want people to know we stand for freedom, so we do not accept being misidentified as open source supporters.
fr: Nous, dans le mouvement du logiciel libre, nous ne consid&eacute;rons pas le mouvement &laquo;&nbsp;open source&nbsp;&raquo; comme un ennemi&nbsp;; l'ennemi est le logiciel propri&eacute;taire. Mais nous voulons que les gens sachent que nous repr&eacute;sentons la libert&eacute;, alors nous n'acceptons pas d'&ecirc;tre incorrectement assimil&eacute;s aux d&eacute;fenseurs de l'&laquo;&nbsp;open source&nbsp;&raquo;.

source: Common misunderstandings of &ldquo;free software&rdquo; and &ldquo;open source&rdquo;
fr: Malentendus courants sur le &laquo;&nbsp;logiciel libre&nbsp;&raquo; et l'&laquo;&nbsp;open source&nbsp;&raquo;<sup><a href="#TransNote4">4</a></sup>

source: The term &ldquo;free software&rdquo; has a problem of misinterpretation: an unintended meaning, &ldquo;software you can get for zero price,&rdquo; fits the term just as well as the intended meaning, &ldquo;software which gives the user certain freedoms.&rdquo; We address this problem by publishing the definition of free software, and by saying &ldquo;Think of free speech, not free beer.&rdquo; This is not a perfect solution; it cannot completely eliminate the problem. An unambiguous, correct term would be better, if it didn't have other problems.
fr: Le terme de &laquo;&nbsp;free sofware&nbsp;&raquo; souffre d'un probl&egrave;me de mauvaise interpr&eacute;tation&nbsp;: une signification fortuite, &laquo;&nbsp;un logiciel que vous pouvez avoir gratuitement&nbsp;&raquo; correspond au terme aussi bien que la signification voulue, &laquo;&nbsp;un logiciel qui donne certaines libert&eacute;s &agrave; l'utilisateur&nbsp;&raquo;. Nous traitons ce probl&egrave;me en publiant la d&eacute;finition de logiciel libre, et en disant &laquo;&nbsp;Pensez &agrave; la libert&eacute; d'expression, pas &agrave; la bi&egrave;re gratuite&nbsp;&raquo;<sup><a href="#TransNote5">5</a></sup>. Ce n'est pas une solution parfaite, cela ne peut pas compl&egrave;tement &eacute;liminer le probl&egrave;me. Un terme correct non ambigu serait meilleur, s'il n'avait pas d'autres probl&egrave;mes.

source: The <a href="http://opensource.org/docs/osd">official definition of &ldquo;open source software&rdquo;</a> (which is published by the Open Source Initiative and too long to cite here) was derived indirectly from our criteria for free software. It is not the same; it is a little looser in some respects, so open source supporters have accepted a few licenses that we consider unacceptably restrictive of the users. Nonetheless, it is fairly close to our definition in practice.
fr: La <a href="http://opensource.org/docs/osd">d&eacute;finition officielle d'un &laquo;&nbsp;logiciel open source&nbsp;&raquo;</a> (qui est publi&eacute;e par l'Open Source Initiative est trop longue pour &ecirc;tre cit&eacute;e ici) &eacute;tait indirectement d&eacute;riv&eacute;e de nos crit&egrave;res pour le logiciel libre. Ce n'est pas la m&ecirc;me&nbsp;: elle est un peu plus laxiste &agrave; quelques &eacute;gards, en cons&eacute;quence de quoi les d&eacute;fenseurs de l'open source ont accept&eacute; quelques licences que nous consid&eacute;rons inadmissibles par les restrictions qu'elles imposent aux utilisateurs. N&eacute;ammoins, elle est assez pr&egrave;s de notre d&eacute;finition dans la pratique.

source: However, the obvious meaning for the expression &ldquo;open source software&rdquo; is &ldquo;You can look at the source code,&rdquo; and most people seem to think that's what it means. That is a much weaker criterion than free software, and much weaker than the official definition of open source. It includes many programs that are neither free nor open source.
fr: Cependant, la signification &eacute;vidente de &laquo;&nbsp;logiciel open source&nbsp;&raquo; est &laquo;&nbsp;Vous pouvez regardez le code source&nbsp;&raquo; et la plupart des gens semble penser que c'est ce que cela signifie. C'est un crit&egrave;re beaucoup plus faible que celui du logiciel libre, et beaucoup plus faible que la d&eacute;finition officielle de l'open source. Elle inclut beaucoup de programmes qui ne sont ni libres, ni open source.

source: Since that obvious meaning for &ldquo;open source&rdquo; is not the meaning that its advocates intend, the result is that most people misunderstand the term. Here is how writer Neal Stephenson defined &ldquo;open source&rdquo;:
fr: Puisque cette signification &eacute;vidente d'&laquo;&nbsp;open source&nbsp;&raquo; n'est pas la signification que ceux qui la pr&eacute;conisent entendent, le r&eacute;sultat est que la plupart des gens se m&eacute;prennent sur le terme. Voil&agrave; comme Neal Stephenson d&eacute;finit l'&laquo;&nbsp;open source&nbsp;&raquo;&nbsp;:

source: Linux is &ldquo;open source&rdquo; software meaning, simply, that anyone can get copies of its source code files.
fr: Linux est la signification du logiciel &laquo;&nbsp;open source&nbsp;&raquo;, simplement que quiconque peut obtenir des copies des fichiers de son code source.

source: I don't think he deliberately sought to reject or dispute the &ldquo;official&rdquo; definition. I think he simply applied the conventions of the English language to come up with a meaning for the term. The state of Kansas published a similar definition:
fr: Je ne pense pas qu'il a d&eacute;lib&eacute;r&eacute;ment cherch&eacute; &agrave; rejeter ou contester la d&eacute;finition officielle. Je pense qu'il a simplement appliqu&eacute; les conventions de l'anglais pour trouver une signification du terme. L'&eacute;tat du Kansas &agrave; publi&eacute; une d&eacute;finition similaire&nbsp;:

source: Make use of open-source software (OSS). OSS is software for which the source code is freely and publicly available, though the specific licensing agreements vary as to what one is allowed to do with that code.
fr: Utiliser le logiciel open source. Le logiciel open source est un le logiciel pour lequel le code source est librement et publiquement disponible, bien que les accords de licence sp&eacute;cifiques changent quant &agrave; ce qui est permis de faire avec ce code.

source: Open source supporters try to deal with this by pointing to their official definition, but that corrective approach is less effective for them than it is for us. The term &ldquo;free software&rdquo; has two natural meanings, one of which is the intended meaning, so a person who has grasped the idea of &ldquo;free speech, not free beer&rdquo; will not get it wrong again. But &ldquo;open source&rdquo; has only one natural meaning, which is different from the meaning its supporters intend. So there is no succinct way to explain and justify the official definition of &ldquo;open source.&rdquo; That makes for worse confusion.
fr: Les supporters de l'open source essaient de traiter ceci en renvoyant &agrave; leur d&eacute;finition officielle, mais cette approche corrective est moins efficace pour eux qu'elle ne l'est pour nous. Le terme &laquo;&nbsp;free software&nbsp;&raquo; a deux significations naturelles, l'une d'entre elle est la signification escompt&eacute;e, ainsi une personne qui aura saisi l'id&eacute;e de &laquo;&nbsp;free speech, not free beer&nbsp;&raquo; ne pourra plus d&egrave;s lors se tromper sur son sens. Ainsi il n'y a aucune mani&egrave;re succincte d'expliquer et de justifier la d&eacute;finition officielle d'&laquo;&nbsp;open source&nbsp;&raquo;. Cela rend encore pire la confusion.

source: Another misunderstanding of &ldquo;open source&rdquo; is the idea that it means &ldquo;not using the GNU GPL&rdquo;. It tends to accompany a misundertanding of &ldquo;free software&rdquo;, equating it to &ldquo;GPL-covered software&rdquo;. These are equally mistaken, since the GNU GPL is considered an open source license, and most of the open source licenses are considered free software licenses.
fr: Un autre malentendu de l'&laquo;&nbsp;open source&nbsp;&raquo;, est l'id&eacute;e que cela signifie &laquo;&nbsp;ne pas utiliser la GNU GPL&nbsp;&raquo;. Cela tend &agrave; accompagner le malentendu de &laquo;&nbsp;logiciel libre&rdquo; &eacute;gale &laquo;&nbsp;logiciel couvert par la GPL&nbsp;&raquo;. Ce sont deux erreurs, puisque la GNU GPL est consid&eacute;r&eacute;e comme une licence open source, et la plupart des licences open source sont consid&eacute;r&eacute;es comme des licences de logiciels libres.

source: Different values can lead to similar conclusions&hellip;but not always
fr: Des valeurs diff&eacute;rentes peuvent amener &agrave; des conclusions similaires&hellip; mais pas toujours

source: Radical groups in the 1960s had a reputation for factionalism: some organizations split because of disagreements on details of strategy, and the two daughter groups treated each other as enemies despite having similar basic goals and values. The right-wing made much of this, and used it to criticize the entire left.
fr: Les groupes radicaux dans les ann&eacute;es 60 avaient une r&eacute;putation pour le sectarisme&nbsp;: quelques organismes se sont scind&eacute;s en deux en raison des d&eacute;saccords sur des d&eacute;tails de strat&eacute;gie et les deux groupes r&eacute;sultants se sont trait&eacute;s l'un l'autre comme des ennemis en d&eacute;pit du fait qu'ils aient les m&ecirc;mes buts et des valeurs de base semblables. La droite a fait grand cas de ceci et a utilis&eacute; cela pour critiquer la gauche toute enti&egrave;re.

source: Some try to disparage the free software movement by comparing our disagreement with open source to the disagreements of those radical groups. They have it backwards. We disagree with the open source camp on the basic goals and values, but their views and ours lead in many cases to the same practical behavior&mdash;such as developing free software.
fr: Certains essaient de d&eacute;pr&eacute;cier le mouvement du logiciel libre en comparant notre d&eacute;saccord avec l'open source avec les d&eacute;saccords de ces groupes radicaux. Ces personnes ne font que reculer. Nous sommes en d&eacute;saccord avec le camp de l'open source sur les buts et les valeurs de base, mais leurs points de vue et les n&ocirc;tres m&egrave;nent dans beaucoup de cas au m&ecirc;me comportement pratique, comme d&eacute;velopper du logiciel libre.

source: As a result, people from the free software movement and the open source camp often work together on practical projects such as software development. It is remarkable that such different philosophical views can so often motivate different people to participate in the same projects. Nonetheless, these views are very different, and there are situations where they lead to very different actions.
fr: En cons&eacute;quence, les gens du mouvement du logiciel libre et du camp de l'open source travaillent souvent ensemble sur des projets pratiques tels que le d&eacute;veloppement de logiciel. Il est remarquable que de telles diff&eacute;rences de point de vue philosophiques puissent tellement souvent motiver des personnes diff&eacute;rentes &agrave; participer aux m&ecirc;mes projets. N&eacute;anmoins, ces vues sont tr&egrave;s diff&eacute;rentes et il y a des situations o&ugrave; elles m&egrave;nent &agrave; des actions tr&egrave;s diff&eacute;rentes.

source: The idea of open source is that allowing users to change and redistribute the software will make it more powerful and reliable. But this is not guaranteed. Developers of proprietary software are not necessarily incompetent. Sometimes they produce a program which is powerful and reliable, even though it does not respect the users' freedom. How will free software activists and open source enthusiasts react to that?
fr: L'id&eacute;e de l'open source c'est que permettre aux utilisateurs de modifier et redistribuer le logiciel le rendra plus puissant et fiable.Mais ce n'est pas garanti. Les d&eacute;veloppeurs de logiciel propri&eacute;taire ne sont pas n&eacute;cessairement incomp&eacute;tents. Parfois il produisent un programme qui est puissant et fiable, bien qu'il ne respecte pas les libert&eacute;s des utilisateurs. Comment les activistes du logiciel libre et les supporters de l'open source vont r&eacute;agir &agrave; cela&nbsp;?
