<?xml version="1.0" encoding="utf-8" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr" lang="fr">

<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:webmasters@gnu.org" />
<link rel="icon" type="image/png" href="/graphics/gnu-head-mini.png" />
<link rev="translated" href="mailto:trad-gnu&#64;april.org" />

<title>Pourquoi l’ « Open Source » manque-t-il l’objectif de la Free Software</title>

<link rel="stylesheet" href="/gnu-new.css" title="GNU" />
<link rel="stylesheet alternate" href="/gnu-pink.css" title="Une banni&egrave;re rose" />
<link rel="stylesheet alternate" href="/gnu-high.css" title="Fort contraste (exp&eacute;rimental)" />
<link rel="stylesheet alternate" href="/gnu-blue.css" title="Contraste bleu/blanc (exp&eacute;rimental)" />

<style type="text/css" media="print">
@import url('/gnu-print.css');
</style>

</head>

<body id="foo">

  <div id="wrapper">
    
    <p class="netscape4"><a href="#content" accesskey="2">Aller au contenu</a> | <a href="#amspita">Aller &agrave; la navigation</a></p>
    
    <div id="top2">
      
      <div id="banner">

        <h1>GNU's Not Unix&nbsp;! - Logiciels libres, Soci&eacute;t&eacute; libre</h1>
        
        <div id="gnulogo"><a href="/" accesskey="1" title="Se rendre &agrave; la page d'accueil du projet GNU"><img src="/graphics/gnu-head-banner.png" alt="" /></a></div>
        
        <div id="dbdlogo"><a href="http://badvista.fsf.org/" title="Bad Vista"><img src="/graphics/badvista-trash.png" alt="" /></a></div>
        
        <ul id="links">
          <li><a href="http://www.fsf.org/philosophy/free-sw.fr.html">Qu'est-ce qu'un logiciel libre&nbsp;?</a></li>
          <li><a href="http://www.fsf.org/join" title="Adh&eacute;rez aujourd'hui&nbsp;!">Rejoignez la Fondation pour le Logiciel Libre</a></li>
          <li><a href="http://www.fsf.org/register_form" title="Enregistrez-vous pour obtenir r&eacute;guli&egrave;rement des mises &agrave; jour par courrier postal ou &eacute;lectronique">Recevez les alertes de la FSF</a></li>
        </ul>

      </div>

      <h5 class="netscape4" id="amspita">Navigation</h5>

      <div id="navigation-bar">
        <div id="navbar">
        <ul>
          <li><a href="/">Accueil</a></li>
          <li><a href="/software/">Logiciels</a></li>
          <li><a href="/philosophy/">Philosophie</a></li>
          <li><a href="/licenses/">Licences</a></li>
          <li><a href="/doc/">Documentation</a></li>
          <li><a href="/help/">Aidez GNU</a></li>
          <li><a href="/contact/">Contactez-nous</a></li>
          <li><a href="http://gplv3.fsf.org/">GPL v3</a></li>
        </ul>
        </div>
      </div>


    </div>
    <div id="columns">
              <!-- beginning of sidebar.html -->
<div id="sidebar" class="boxbox">
                          <h3 class="netscape4">Navigation</h3>
                          <h3>Ressources principales</h3>
                            <ul>
                              <li><a href="http://www.fsf.org/campaigns/priority.html" style="font-weight: bold;" title="Aidez un projet prioritaire pour la Communaut&eacute; du logiciel libre">Aidez&nbsp;un&nbsp;projet&nbsp;prioritaire</a></li>
                              <li><a href="http://gplv3.fsf.org/" style="font-weight: bold;" title="Aider &agrave; la r&eacute;vision de la GNU GPL et autres licences">Aidez &agrave; la r&eacute;vision des licences GNU</a></li>
                              <li><a href="/links/links.html#FreeGNULinuxDistributions" style="font-weight: bold;" title="Distributions GNU/Linux libres">Distributions&nbsp;GNU/Linux&nbsp;libres</a></li>
                              <li><a href="http://directory.fsf.org/" title="Parcourez notre r&eacute;pertoire de projets de logiciels libres">R&eacute;pertoire&nbsp;des&nbsp;logiciels&nbsp;libres</a></li>
                              <li><a href="/software/" title="Liste des paquetages logiciels GNU">Paquetages&nbsp;logiciels&nbsp;GNU</a></li>
                            </ul>

                           <h3>Restez &agrave; jour</h3>
                            <ul>
                              <li><a href="http://www.fsf.org/register_form">Recevez&nbsp;des&nbsp;courriels&nbsp;d'alerte&nbsp;de&nbsp;la&nbsp;FSF</a></li>
                              <li><a href="/keepingup.html" title="Rester inform&eacute; sur le projet GNU">Derni&egrave;res nouvelles</a></li>
                              <li><a href="http://lists.gnu.org" title="Discutez avec d'autres utilisateurs et d&eacute;veloppeurs de logiciels libres">Listes&nbsp;de&nbsp;diffusion&nbsp;de&nbsp;GNU</a></li>
                              <li><a href="/people/speakers.html">Porte-parole de GNU</a></li>
                              <li><a href="/gnu/gnu-user-groups.html" title="Rencontrez les gens pr&egrave; de chez vous qui utilisent et d&eacute;veloppent des logiciels libres">Groupes&nbsp;d'utilisateurs de&nbsp;GNU</a></li>
                              <li><a href="/press/press.html">Information presse</a></li>
                            </ul>

                           <h3>Pour les d&eacute;veloppeurs</h3>
                            <ul>
                              <li><a href="http://savannah.gnu.org/" title="Impliquez-vous dans l'un de nos projets de logiciels libres">Projets&nbsp;de&nbsp;d&eacute;veloppement</a></li>
                              <li><a href="/software/devel.html" title="Vous &ecirc;tes d&eacute;veloppeur&nbsp;? Acc&eacute;dez aux ressources d&eacute;veloppeur">Ressources&nbsp;pour&nbsp;les&nbsp;d&eacute;veloppeurs</a></li>
                            </ul>

                          <div id="supportfsf">
                          <h3>Support the FSF</h3>

                          <div style="margin: 1.5em; padding: 0.5em; text-align: center; background-color: white; -moz-border-radius: 1em;">
                          <p><a href="http://www.fsf.org/associate/support_freedom/join_fsf"><img src="http://www.fsf.org/graphics/joinfsf" alt="" /></a></p>
                          <p><a href="http://www.fsf.org/associate/support_freedom/join_fsf"><strong>Rejoignez la FSF aujourd'hui&nbsp;!</strong></a></p>
                          <p><a href="http://www.fsf.org/associate/support_freedom/donate"><img src="http://www.fsf.org/graphics/donatefsf" alt="" /></a></p>
                          <p><a href="http://www.fsf.org/associate/support_freedom/donate">Faites un don &agrave; la FSF aujourd'hui&nbsp;!</a></p>
                          </div>

                          <ul>
                          <li><a href="http://order.fsf.org/">Achetez&nbsp;des&nbsp;livres&nbsp;et&nbsp;des&nbsp;accessoires</a></li>
                          <li><a href="http://patron.fsf.org/">Adh&eacute;sion&nbsp;entreprises</a></li>
                          <li><a href="/thankgnus/thankgnus.html">Merci&nbsp;aux&nbsp;supporters&nbsp;de&nbsp;GNU</a></li>
                          </ul></div>

                          <h3>Divertissement</h3>
                           <ul>
                              <li><a href="/graphics/graphics.html">Images de GNU</a></li>
                              <li><a href="/fun/humor.html">Riez avec GNU</a></li>
                           </ul>

                        <h3>Autres ressources</h3>
                         <ul>
                              <li><a href="/links/links.html">Liens&nbsp;sur&nbsp;les&nbsp;logiciels&nbsp;libres</a></li>
                              <li><a href="http://www.freesoftwaremagazine.com" title="Le Free Software Magazine est publi&eacute; ind&eacute;pendamment">Le&nbsp;Free&nbsp;Software&nbsp;Magazine</a></li>
                              <li><a href="/jobs">Emplois&nbsp;dans&nbsp;le&nbsp;logiciel&nbsp;libre</a></li>
                         </ul>
</div>
<!-- end of sidebar.html -->










<DIV id=content> 
      <H2>Pourquoi l’ &laquo; Open Source &raquo; manque-t-il l’objectif de la Free Software</H2>
      <P>Par Richard Stallman</P>
      <P>Lorsque nous qualifions un logiciel de &laquo; libre &raquo;, nous sous-entendons 
        qu’il respecte les <A 
		href="http://www.gnu.org/philosophy/free-sw.html">libert&eacute;s essentielles 
        de l'utilisateur</A>: la libert&eacute; de l’utiliser, de l’&eacute;tudier et de le 
        modifier, et d’en redistribuer des copies avec ou sans modifications. 
        C’est l&agrave; une question de libert&eacute; et non de co&ucirc;t, tout comme on parle d’&laquo; 
        expression libre &raquo; et non de &laquo; bi&egrave;re gratuite &raquo;.</P>
      <P>Ces libert&eacute;s sont vitalement importantes. Elles sont essentielles, pas 
        seulement pour le bien des utilisateurs individuels, mais parce qu’elles 
        promeuvent la solidarit&eacute; sociale – c'est-&agrave;-dire le partage et la coop&eacute;ration. 
        Elles le deviennent davantage du moment où notre culture et les activit&eacute;s 
        de notre vie sont de plus en plus num&eacute;ris&eacute;es. 
	<b>In a world of digital sounds, 
        images and words, free software comes increasingly to equate with freedom 
        in general.</b></P>
      <P>Des dizaines de millions de personnes &agrave; travers le monde utilisent d&eacute;sormais 
        le logiciel libre ; des &eacute;coles dans certaines r&eacute;gions d’Inde et d’Espagne 
        apprennent d&eacute;sormais &agrave; tous leurs &eacute;leves &agrave; utiliser <A 
href="http://www.gnu.org/gnu/linux-and-gnu.html">le syst&egrave;me d'exploitation GNU/Linux</A> 
        libre. Mais la plupart de ces utilisateurs n’ont jamais entendu parler 
        des raisons &eacute;thiques pour lesquelles nous avons d&eacute;velopp&eacute; ce syst&egrave;me et 
        b&acirc;ti la communaut&eacute; du logiciel libre, parce qu’aujourd’hui ce syst&egrave;me 
        et cette communaut&eacute; sont le plus souvent d&eacute;crits tels que &laquo; Open Source 
        &raquo;, et attribu&eacute;s &agrave; une philosophie diff&eacute;rente dans laquelle ces libert&eacute;s 
        sont rarement mentionn&eacute;es.</P>
      <P>Le mouvement du logiciel libre milite pour la libert&eacute; des utilisateurs 
        d’ordinateurs depuis 1983. En 1984 nous avons lanc&eacute; le d&eacute;veloppement du 
        syst&egrave;me d’exploitation libre GNU, de sorte &agrave; contrecarrer les syst&egrave;mes 
        non libres qui emp&ecirc;chent la libert&eacute; &agrave; leurs utilisateurs. Durant les ann&eacute;es 
        80 nous avons d&eacute;velopp&eacute; la plupart des composants essentiels d’un tel 
        syst&egrave;me, aussi bien que la <A href="http://www.gnu.org/licenses/gpl.html">Licence 
        Publique G&eacute;n&eacute;rale GNU</A>, une licence con&ccedil;ue sp&eacute;cifiquement afin de prot&eacute;ger 
        la libert&eacute; de tous les utilisateurs d’un programme.</P>
      <P>Cependant, les utilisateurs et les d&eacute;veloppeurs du logiciel libre ne 
        se sont pas tous accord&eacute;s aux objectifs du mouvement. 
        En 1998, une frange de la communaut&eacute; du logiciel libre s’est d&eacute;tach&eacute;e 
        et a commenc&eacute; &agrave; militer sous le nom de &laquo; Open Source &raquo;. Le terme a &eacute;t&eacute; 
        propos&eacute; &agrave; l’origine afin d’&eacute;viter une &eacute;ventuelle incompr&eacute;hension du terme 
        &laquo; logiciel libre &raquo;, mais il s’est aussit&ocirc;t associ&eacute; &agrave; des visions philosophiques 
        tr&egrave;s diff&eacute;rentes de celles du mouvement du logiciel libre.</P>
      <P>Certains partisans de l’ &laquo; Open Source &raquo; ont qualifi&eacute; cela de &laquo; campagne 
        de marketing pour le logiciel libre &raquo;, qui devrait faire du charme &agrave; des 
        magnats du business en mettant en avant les avantages pratiques, tout 
        en rejetant l’id&eacute;e du bien ou de l’incorrect qu’ils n'auraient pas aim&eacute; 
        entendre. Certains autres ont carr&eacute;ment rejet&eacute; les valeurs &eacute;thiques et 
        sociales du mouvement du logiciel libre. Quoique furent leurs objectifs, 
        en militant pour l’ &laquo; Open Source &raquo; ils n’ont aucunement fait allusion 
        &agrave; ces valeurs. Le terme &laquo; Open Source &raquo; est rapidement devenu associ&eacute; 
        au fait de seulement pr&ocirc;ner les valeurs pratiques, telles que le d&eacute;veloppement 
        de logiciels puissants et fiables. C’est &agrave; ce moment l&agrave; que la plupart 
        des partisans de l’ &laquo; Open Source &raquo; s’y sont engag&eacute;, <b>and that practice 
        is what they take it to mean.</b></P>
      <P>Tout logiciel Open Source est &agrave; peu pr&egrave;s un logiciel libre, les deux 
        termes d&eacute;crivant presque la m&ecirc;me cat&eacute;gorie de logiciel. Mais ils soutiennent 
        des points de vue bas&eacute;s sur des valeurs fondamentalement diff&eacute;rentes. 
        L’Open Source est une m&eacute;thodologie de d&eacute;veloppement ; le logiciel libre 
        est un mouvement social. Pour le mouvement du logiciel libre, le logiciel 
        libre est un imp&eacute;ratif &eacute;thique, car seul le logiciel libre respecte la 
        libert&eacute; de l’utilisateur. Par contraste, la philosophie de l’Open Source 
        consid&egrave;re cette question en termes de comment rendre le logiciel &laquo; meilleur 
        &raquo; --dans un sens pratique uniquement. Elle consid&egrave;re que le logiciel non 
        libre est une solution sous optimale. Pour le mouvement du logiciel libre 
        cependant, le logiciel non-libre est un probl&egrave;me social, et aller vers 
        le logiciel libre en est la solution.</P>
      <P>Logiciel libre. Open Source. Si c’est le m&ecirc;me logiciel, le nom que vous 
        utilisez importe t’il ? Oui, car des mots diff&eacute;rents v&eacute;hiculent des id&eacute;es 
        diff&eacute;rentes. Pendant qu’un programme libre d’un quelconque autre nom vous 
        donnerait la m&ecirc;me libert&eacute; aujourd’hui, &eacute;tablir la libert&eacute; de mani&egrave;re durable 
        d&eacute;pend apr&egrave;s tout de l’enseignement des gens &agrave; la valeur libert&eacute;. Si vous 
        voulez aider &agrave; le faire, il est essentiel de parler de &laquo; logiciel libre 
        &raquo;.</P>
      <P>Nous du mouvement du logiciel libre ne consid&eacute;rons pas ceux de l’Open 
        Source en ennemis ; l’ennemi est le logiciel propri&eacute;taire. Mais nous voulons 
        que les gens sachent que nous militons pour la libert&eacute;, ainsi n’acceptons 
        pas d’&ecirc;tre maladroitement identifi&eacute;s comme des supporteurs de l’Open Source.</P>
      <H3>Malentendus fr&eacute;quents du &laquo; logiciel libre &raquo; et de l’ &laquo; Open Source &raquo;</H3>
      <P>Le terme &laquo; logiciel libre &raquo; a un probl&egrave;me de mauvaise interpr&eacute;tation 
        : une signification non voulue, &laquo; logiciel que vous pouvez vous procurer 
        &agrave; co&ucirc;t z&eacute;ro&raquo;, <b>fits the term just as well as the intended meaning</b>, &laquo; logiciel 
        qui accorde &agrave; l’utilisateur certaines libert&eacute;s &raquo;. Nous r&eacute;glons cette question 
        en publiant la d&eacute;finition du logiciel libre, et en d&eacute;clarant &laquo; pensez 
        &agrave; libre expression, non &agrave; bi&egrave;re gratuite &raquo;. Ce n’est pas une solution 
        parfaite ; elle ne peut enti&egrave;rement r&eacute;soudre le probl&egrave;me. Un terme correct, 
        non ambiguë serait meilleur, s’il n’introduit aucun autre probl&egrave;me.</P>
      <P>Malheureusement, toutes les alternatives en anglais ont leurs propres 
        probl&egrave;mes. Nous avons &eacute;pluch&eacute; de nombreuses alternatives sugg&eacute;r&eacute;es par 
        nombre de personnes, mais aucune n’est assez &laquo; juste &raquo; pour que son adoption 
        en fasse une bonne solution. Chaque remplacement propos&eacute; de &laquo; logiciel 
        libre &raquo; a chacun une sorte de probl&egrave;me s&eacute;mantique – et cela inclut &laquo; logiciel 
        Open Source &raquo;.</P>
      <P><A href="http://opensource.org/docs/def_print.php">La d&eacute;finition officielle 
        de &laquo; logiciel Open Source &raquo;</A> (publi&eacute;e par l’Initiative Open Source 
        et trop longue pour &ecirc;tre cit&eacute;e ici) d&eacute;coulait indirectement de nos crit&egrave;res 
        pour le logiciel libre. Ce n’est pas la m&ecirc;me chose ; c’est un peu l&eacute;ger 
        &agrave; quelques &eacute;gards, de sorte que les partisans de l’Open Source ont accept&eacute; 
        tr&egrave;s peu de licences que nous consid&eacute;rions beaucoup trop restrictives 
        pour les utilisateurs. Malgr&eacute; tout, c’est assez proche de notre d&eacute;finition.</P>
      <P>Toutefois, la signification &eacute;vidente de l’expression &laquo; logiciel Open 
        Source &raquo; est &laquo; vous pouvez voir le code source &raquo;, et beaucoup semblent 
        croire que c’est cela que &ccedil;a veut dire. C’est l&agrave; un crit&egrave;re beaucoup plus 
        faible que le logiciel libre, et beaucoup plus faible que la d&eacute;finition 
        officielle de l’ Open Source. Elle inclut de nombreux programmes qui ne 
        sont ni libres ni Open Source.</P>
      <P>Du moment où cette d&eacute;finition &eacute;vidente de l’ &laquo; Open Source &raquo; n’est pas 
        celle que ses d&eacute;fenseurs soutiennent, le r&eacute;sultat est que la plupart des 
        gens ne comprennent pas ce terme. Telle est la d&eacute;finition de l’&eacute;crivain 
        Neal Stephenson &agrave; propos de l’ &laquo; Open Source &raquo; : </P>
      <BLOCKQUOTE> 
        <P>Linux est un logiciel &laquo; Open Source &raquo; signifie simplement que tout 
          le monde peut avoir des copies de son code source.</P>
      </BLOCKQUOTE>
      <P>Je ne pense pas qu’il cherchait d&eacute;lib&eacute;r&eacute;ment &agrave; rejeter ou disputer la 
        d&eacute;finition &laquo; officielle &raquo;. Je pense qu’il a simplement appliqu&eacute; les conventions 
        de la langue anglaise et est arriv&eacute; &agrave; une signification du terme. L’Etat 
        du Kansas a publi&eacute; une d&eacute;finition similaire :</P>
      <BLOCKQUOTE> 
        <P>Servez-vous du Logiciel Open Source (LOS). LOS est le logiciel pour 
          lequel le code source est librement et publiquement disponible, bien 
          que les termes de licence sp&eacute;cifiques changent quant &agrave; ce qu'on est 
          permis de faire avec ce code.</P>
      </BLOCKQUOTE>
      <P>Les gens de l’Open Source essayent de g&eacute;rer &ccedil;a en visant leur d&eacute;finition 
        officielle, mais cette approche corrective est moins effective pour eux 
        que &ccedil;a l’est pour nous. Le terme &laquo; logiciel libre &raquo; a deux significations 
        naturelles, dont l’une est celle voulue, de sorte que celui qui a saisi 
        l’id&eacute;e de &laquo; libre expression, non bi&egrave;re gratuite &raquo; ne se trompera plus. 
        Mais &laquo; Open Source &raquo; n’a qu’une signification naturelle, qui est diff&eacute;rente 
        de celle que ses souteneurs veulent lui donner. Ainsi il n’y a pas de 
        moyen succinct d’expliquer et de justifier la d&eacute;finition officielle de 
        l’ &laquo; Open Source &raquo;. Ce qui conduit &agrave; une confusion totale.</P>
      <H3>Des valeurs diff&eacute;rentes peuvent conduire aux m&ecirc;mes conclusions … mais 
        pas toujours.</H3>
      <P>Dans les ann&eacute;es 1960, les groupes radicaux &eacute;taient r&eacute;put&eacute;s pour <b>factionalism</b> 
        : certaines organisations se sont scind&eacute;es &agrave; cause de divergences sur 
        des d&eacute;tails de strat&eacute;gie, et les deux groupes ainsi n&eacute;s se traitaient 
        en ennemis malgr&eacute; le fait d’avoir des buts et valeurs de base similaires. 
        <b>The right-wing made much of this, and used it to criticize the entire left.</b></P>
      <P>Certains tentent de d&eacute;nigrer le mouvement du logiciel libre en comparant 
        notre m&eacute;sentente avec l’ Open Source &agrave; celui de ces groupes radicaux. 
        Ils le comprennent mal. Nous divergeons de l’Open Source sur les valeurs 
        et objectifs de base, mais leurs points de vue et les notre conduisent 
        dans beaucoup de cas au m&ecirc;me comportement en pratique –- comme de d&eacute;velopper 
        des logiciels libres.</P>
      <P>Comme r&eacute;sultat, des membres du logiciel libre et certains de l’open source 
        travaillent souvent ensemble &agrave; des projets pratiques tels que le d&eacute;veloppement 
        de logiciels. Il est remarquable que des opinions philosophiques aussi 
        diff&eacute;rentes peuvent aussi souvent motiver des gens &agrave; travailler sur de 
        m&ecirc;me projets. Cependant ces opinions sont divergentes, et il y a des situations 
        où elles conduisent &agrave; des actions totalement diff&eacute;rentes.</P>
      <P>L’id&eacute;e de l’open source est que le fait de permettre aux utilisateurs 
        de modifier et de redistribuer le logiciel le rendra plus puissant et 
        fiable. Mais ce n’est pas s&ucirc;r. Les d&eacute;veloppeurs de logiciels propri&eacute;taires 
        ne sont forc&eacute;ment incomp&eacute;tents. Ils produisent quelques fois des programmes 
        puissants et fiables, qui ne respectent toutefois pas la libert&eacute; des utilisateurs. 
        Comment r&eacute;agiront les activistes du logiciel libre et les enthousiastes 
        de l’open source &agrave; cela ?</P>
      <P>Un enthousiaste de l’open source de pure souche, qui ne soit aucunement 
        influenc&eacute; par les id&eacute;aux du logiciel libre, dira &laquo; je suis surpris que 
        vous ayez pu faire si bien fonctionner le programme sans utiliser notre 
        mod&egrave;le de d&eacute;veloppement, mais vous y &ecirc;tes parvenus. Comment puis-je m’en 
        procurer une copie ?&raquo;. Cette attitude profitera &agrave; des syst&egrave;mes qui emportent 
        notre libert&eacute;, la conduisant &agrave; sa perte.</P>
      <P>L’activiste du logiciel libre dira &laquo; votre programme est tr&egrave;s int&eacute;ressant, 
        mais pas au prix de ma libert&eacute;. Alors je ferai sans cela. Je soutiendrai 
        plut&ocirc;t un projet pour en d&eacute;velopper un remplacement qui soit libre &raquo;. 
        Si nous consid&eacute;rons notre libert&eacute; &agrave; sa juste valeur, nous pouvons agir 
        afin de l’entretenir et la d&eacute;fendre.</P>
      <H3>Des logiciels puissants et fiables peuvent &ecirc;tre mauvais</H3>
      <P>L’id&eacute;e selon laquelle nous d&eacute;sirons des logiciels puissants et fiables 
        tient de la supposition que le logiciel est fait pour servir les utilisateurs. 
        S’ils sont puissants et fiables, ils serviront mieux.</P>
      <P>Mais on ne peut dire d’un logiciel qu’il sert &agrave; ses utilisateurs que 
        s’il respecte leur libert&eacute;. Et si le logiciel &eacute;tait con&ccedil;u pour enchaîner 
        ses utilisateurs ? Ainsi fiabilit&eacute; veut tout simplement dire que les chaînes 
        sont plus difficiles &agrave; briser.</P>
      <P>Sous la pression des entreprises du film et de la production, <b>software 
        for individuals to use is increasingly designed specifically to restrict 
        them</b>. Cet accessoire malicieux est connu en tant que DRM, ou Digital Restrictions 
        Management (voir <A 
href="http://defectivebydesign.org/">DefectiveByDesign.org</A>), et constitue 
        l’antith&egrave;se &agrave; l’esprit de libert&eacute; que le logiciel libre ambitionne d’apporter. 
        Et pas seulement &agrave; l’esprit : du moment où l’objectif du DRM est de pi&eacute;tiner 
        votre libert&eacute;, ses d&eacute;veloppeurs essayent de le rendre difficile, impossible 
        ou m&ecirc;me ill&eacute;gal pour vous de modifier le logiciel impl&eacute;mentant le DRM.</P>
      <P>Des partisans de l’open source ont d&eacute;j&agrave; propos&eacute; un logiciel &laquo; DRM open 
        source&raquo;. Leur id&eacute;e est qu’en publiant le code source de programmes con&ccedil;us 
        pour limiter votre acc&egrave;s aux medias crypt&eacute;s, et en permettant aux autres 
        de le modifier, ils produiront des logiciels plus puissants et fiables 
        pour des utilisateurs limit&eacute;s comme vous. Ils vous seront alors servis 
        dans des &eacute;quipements qui ne vous permettent pas de les modifier.</P>
      <P>Ce logiciel est certainement open source, et utilise le mod&egrave;le de d&eacute;veloppement 
        open source ; mais il ne sera pas un logiciel libre, tant qu’il ne respectera 
        pas la libert&eacute; des utilisateurs qui l’emploient. Si le mod&egrave;le de d&eacute;veloppement 
        de l’open source r&eacute;ussi &agrave; rendre ce logiciel plus puissant et fiable pour 
        vous limiter, &ccedil;a le rendra pire. </P>
      <H3>Peur de libert&eacute;</H3>
      <P>La principale motivation premi&egrave;re du terme &laquo; logiciel open source &raquo; tient 
        de ce que les id&eacute;es &eacute;thiques du &laquo; logiciel libre &raquo; d&eacute;rangent certains. 
        C’est vrai : parler de libert&eacute;, de probl&egrave;mes d’&eacute;thique, de responsabilit&eacute;s 
        aussi bien de confort, demande aux gens de penser &agrave; des choses qu’ils 
        pr&eacute;f&egrave;rent ignorer, tel que de savoir si leur agissement est &eacute;thique. Cela 
        peut entraîner un embarras, et ils se fermeront simplement &agrave; cela. Ca 
        ne veut pas dire que nous devons arr&ecirc;ter d’en parler.</P>
      <P>C’est pourtant ce que les leaders de l’open source ont d&eacute;cid&eacute; de faire. 
        Ils pensent qu’en se taisant &agrave; propos d’&eacute;thique et de libert&eacute;, et en parlant 
        seulement du b&eacute;n&eacute;fice pratique imm&eacute;diat de certains logiciels libres, 
        ils pourront les &laquo; vendre &raquo; avec plus de r&eacute;ussite &agrave; certains utilisateurs, 
        en l’occurrence ceux des affaires.</P>
      <P>Cette approche s’est av&eacute;r&eacute;e efficace, selon ses propres termes. La rh&eacute;torique 
        de l’open source a convaincu de nombreux march&eacute;s et utilisateurs &agrave; l’adopter, 
        et m&ecirc;me de d&eacute;velopper des logiciels libres, ce qui a &eacute;largi notre communaut&eacute; 
        – mais seulement &agrave; un niveau superficiel, pratique. La philosophie de 
        l’open source, et ses valeurs purement pratiques, entravent la compr&eacute;hension 
        des id&eacute;aux profonds du logiciel libre ; cela conduit beaucoup de personnes 
        &agrave; notre communaut&eacute;, mais ne leur apprend pas &agrave; les d&eacute;fendre. C’est bien, 
        tant que &ccedil;a marche, mais &ccedil;a ne suffit pas &agrave; pr&eacute;server la libert&eacute;. Le fait 
        d’attirer des utilisateurs au logiciel libre fait simplement d’eux des 
        partisans en voie de devenir des d&eacute;fenseurs de leur propre libert&eacute;.</P>
      <P>Ces utilisateurs seront ramen&eacute;s t&ocirc;t ou tard &agrave; l’utilisation de logiciels 
        propri&eacute;taires pour des raisons pratiques. Un nombre incalculable de soci&eacute;t&eacute;s 
        cherchent &agrave; offrir ce genre de tentation, certaines offrant m&ecirc;me des copies 
        gratuites. Pour quelle raison les utilisateurs d&eacute;clineraient-ils de telles 
        offres ? Seulement s’ils ont appris &agrave; &eacute;valuer la libert&eacute; que le logiciel 
        libre leur offre, <b>to value freedom as such rather than the technical and 
        practical convenience of specific free software</b>. Pour &eacute;tendre cette id&eacute;e, 
        nous devons parler de libert&eacute;. Une certaine dose de l’approche &laquo; gardez 
        le silence &raquo; du business peut &ecirc;tre utile pour la communaut&eacute;, mais dangereuse 
        si elle devient si courante que l’amour de la libert&eacute; paraisse excentrique.</P>
      <P>Cette situation dangereuse est exactement celle que nous avons. Beaucoup 
        de personnes engag&eacute;es dans le logiciel libre disent peu de la libert&eacute; 
        – habituellement parce qu’elles cherchent &agrave; &ecirc;tre &laquo; plus permises dans 
        le business &raquo;. Les distributeurs de logiciels particuli&egrave;rement affichent 
        ce caract&egrave;re. Presque toutes les distributions du syst&egrave;me GNU/Linux sont 
        des packages propri&eacute;taires du syst&egrave;me libre de base, et convient les utilisateurs 
        &agrave; les consid&eacute;rer avantageusement, au lieu d’un recul face a la libert&eacute;.</P>
      <P>Des add-ons logiciels propri&eacute;taires et des distributions non libres de 
        GNU/Linux trouvent terrain fertile parce que beaucoup de nos communaut&eacute;s 
        n’insistent pas sur la libert&eacute; de leur logiciel. Ce n’est pas une coïncidence. 
        Beaucoup d’utilisateurs de GNU/Linux ont connu ce syst&egrave;me par des propos 
        de l’ Open Source ne disant pas que la libert&eacute; en est un objectif. Les 
        pratiques ne soutenant pas la libert&eacute; et les mots ne parlant pas de libert&eacute; 
        vont ensemble, l’un promouvant l’autre. Pour vaincre cette tendance, nous 
        devons plus, pas moins, parler de libert&eacute;.</P>
      <H3>Conclusion</H3>
      <P>Tels les d&eacute;fenseurs de l’Open Source qui suscitent de nouveaux utilisateurs 
        dans notre communaut&eacute;, nous les activistes du logiciel libre devons travailler 
        encore plus afin de porter la question de libert&eacute; &agrave; l’attention de ces 
        nouveaux utilisateurs. Nous devons dire, &laquo;c’est le logiciel libre et il 
        vous procure la libert&eacute;!&raquo; --toujours plus fort et plus haut que jamais. 
        Chaque fois que vous dites logiciel libre plut&ocirc;t que Open Source, vous 
        contribuez a notre campagne.</P>
      <H4>Notes de page</H4>
      <P>Joe Barr a &eacute;crit un article intitul&eacute; <A 
href="http://www.itworld.com/AppDev/350/LWD010523vcontrol4/">Live and let license</A> 
        pr&eacute;sentant son point de vue sur cette question.</P>
      <P>Le <A 
href="http://freesoftware.mit.edu/papers/lakhaniwolf.pdf">livre sur la motivation 
        des d&eacute;veloppeurs du logiciel libre</A> de Lakhani et Wolf declare qu'une 
        frange consid&eacute;rable est motiv&eacute;e par le fait que le logiciel devrait &ecirc;tre 
        libre. Ceci malgr&eacute; le fait d'avoir interrog&eacute; des d&eacute;veloppeurs sur SourceForge,un 
        site ne soutenant pas le point de vue selon lequel il s'agit l&agrave; d'un probl&egrave;me 
        &eacute;thique.</P>
    </DIV>








<!-- close columns -->
</div>
			<div id="searcher">
				
				
				<form method="post" action="http://www.gnu.org/cgi-bin/htsearch">
				<div><label for="words">Rechercher&nbsp;:</label>
				<input type="hidden" name="method" id="method" value="and" />
				<input name="words" id="words" type="text" size="20" accesskey="4" />
				<input type="submit" value="Go" />
				<input type="hidden" name="format" value="builtin-long" />
				<input type="hidden" name="config" value="htdig" /></div>
				</form>
				<p>&nbsp;</p>
			</div>

    <!-- BEGIN FSFlinks -->
<div id="fsflinks">
    <ul>
          <li><a href="http://www.fsf.org">FSF</a></li>
          <li><a href="http://www.fsfeurope.org/">FSF Europe</a></li>
          <li><a href="http://fsf.org.in/">FSF Inde</a></li>
          <li><a href="http://www.fsfla.org">FSF Am&eacute;rique latine</a></li>
          <li><a href="#translations">Traductions de cette page</a></li>
      </ul>
</div>

    <!-- END FSFlinks -->


<!-- BEGIN copyleft -->
<div id="footer">
   <!--
     this anchor is referred to from the default
     gendocs_template (available as part of Texinfo) used for
     generating GNU manuals online, so please don't remove it.
   -->
   <p><a name="ContactInfo"></a>
      Renseignements et contacts <acronym>GNU</acronym> disponibles par e-mail:
      <a href="mailto:gnu@gnu.org">gnu@gnu.org</a>,
      T&eacute;l: +1-617-542-5942, ou Fax: +1-617-542-2652.
   </p>

   <p>Veuillez signaler les liens morts ou envoyer vos suggestions pour le site aux
      <a href="/people/webmeisters.fr.html">Webmasters de <acronym>GNU</acronym></a> :
      <a href="mailto:webmasters@gnu.org">webmasters@gnu.org</a>, merci.
   </p>

   <p>Copyright &copy; 2007
      <a href="http://www.fsf.org">Free Software Foundation</a>, Inc.,
      51 Franklin St - Fifth Floor, Boston, MA 02110-1301 USA<br />
      Verbatim copying and distribution of this entire article are permitted
      worldwide, without royalty, in any medium, provided this notice, and
      the copyright notice, are preserved.
   </p>

   <p>
      <!-- timestamp start -->
      Post&eacute; le $Date$ par $Author$<br />
      Traduction faite par jessenguiamba, &eacute;quivalente version anglaise 1.88 du Sun Mar 11 10:57:53 2007 UTC
      <!-- timestamp end -->
   </p>
</div>
<!-- END copyleft -->

<!-- BEGIN TranslationList -->
<div id="translations">
   <h4><a href="/server/standards/README.translations.fr.html">Traductions</a> de cette page</h4>

   <!-- Veuillez conserver la liste dans l'ordre alphab&eacute;tique et les noms dans leur langue d'origne -->
<ul class="translations-list">
  <li><a hreflang="en-US" href="/philosophy/open-source-misses-the-point.fr.html">English</a></li>
  <li><a hreflang="it" href="/philosophy/open-source-misses-the-point.it.html">Italiano</a></li> <!-- Italian -->
  <li><a hreflang="nl" href="/philosophy/open-source-misses-the-point.nl.html">Nederlands</a></li> <!-- Dutch -->
</ul>
</div>
<!-- END TranslationList -->

</div>
<!-- END wrapper -->

</body>
</html>
<!-- END layout -->

