Repository: gitGNU/gnu_www-fr
Catalog: philosophy/opposing-drm.*.po
Languages: fr

source: Opposing Digital Rights Mismanagement - GNU Project - Free Software Foundation (FSF)
fr: S'opposer &agrave; la m&eacute;gestion des droits num&eacute;riques - GNU Project - Free Software Foundation (FSF)

source: Opposing Digital Rights Mismanagement
fr: S'opposer &agrave; la m&eacute;gestion des droits num&eacute;riques

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: In 1989, in a very different world, I wrote the first version of the GNU General Public License, a license that gives computer users freedom. The GNU GPL, of all the free software licenses, is the one that most fully embodies the values and aims of the free software movement, by ensuring the four fundamental freedoms for every user. These are freedoms to 0) run the program as you wish; 1) study the source code and change it to do what you wish; 2) make and distribute copies, when you wish; 3) and distribute modified versions, when you wish.
fr: En 1989, dans un monde tr&egrave;s diff&eacute;rent, j'&eacute;crivais la premi&egrave;re version de la Licence G&eacute;n&eacute;rale Publique GNU, une licence qui donne aux utilisateurs d'ordinateurs la libert&eacute;. La GPL GNU, de toutes les licences de logiciels libres, est celle qui int&eacute;gre le plus les valeurs et les buts du mouvement du logiciel libre en assurant les quatre libert&eacute;s fondamentales pour tout utilisateur. Ces libert&eacute;s sont&nbsp;: 0. ex&eacute;cuter le programme comme bon vous semble&nbsp;; 1. &eacute;tudier le code source et le modifier pour qu'il fasse ce que vous voulez&nbsp;; 2. faire et distribuer des copies quand vous le voulez&nbsp;; 3. et distribuer les versions modifi&eacute;es quand vous le voulez.

source: Any license that grants these freedoms is a free software license. The GNU GPL goes further: it protects these freedoms for all users of all versions of the program by forbidding middlemen from stripping them off. Most components of the GNU/Linux operating system, including the Linux component that was made free software in 1992, are licensed under GPL version 2, released in 1991. Now, with legal advice from Professor Eben Moglen, I am designing version 3 of the GNU GPL.
fr: Toute licence qui donne ces libert&eacute;s est une licence de logiciel libre. La GPL GNU va plus loin&nbsp;: elle prot&egrave;ge ces libert&eacute;s pour tous les utilisateurs de toutes les versions du programme en interdisant aux interm&eacute;diaires de les enlever. La plupart des composants du syst&egrave;me d'exploitation GNU/Linux, y compris le composant Linux qui a &eacute;t&eacute; rendu libre en 1992, sont sous la licence GPL version 2, publi&eacute;e en 1991. Maintenant, avec les conseils juridiques du Professeur Eben Moglen, je suis en train de concevoir la version 3 de la GPL GNU.

source: GPLv3 must cope with threats to freedom that we did not imagine in 1989. The coming generation of computers, and many products with increasingly powerful embedded computers, are being turned against us by their manufacturers before we buy them&mdash;they are designed to restrict what we can use them to do.
fr: La GPLv3 doit faire face aux menaces contre la libert&eacute; que nous n'avions pas imagin&eacute; en 1989. La future g&eacute;n&eacute;ration d'ordinateurs, et beaucoup de produits contenant des ordinateurs int&eacute;gr&eacute;s de plus en plus puissants, sont retourn&eacute;s contre nous par leurs fabriquants avant que nous les achetions &mdash; ils sont con&ccedil;us pour restreindre ce que nous pouvons en faire.

source: First, there was the TiVo. People may think of it as an appliance to record TV programs, but it contains a real computer running a GNU/Linux system. As required by the GPL, you can get the source code for the system. You can change the code, recompile and install it. But once you install a changed version, the TiVo won't run at all, because of a special mechanism designed to sabotage you. Freedom No. 1, the freedom to change the software to do what you wish, has become a sham.
fr: D'abord, il y a eu le TiVo. Les gens peuvent penser qu'il s'agit d'un appareil pour enregistrer les programmes TV, mais il contient un vrai ordinateur ex&eacute;cutant le syst&egrave;me GNU/Linux. Comme le requiert la GPL, vous pouvez obtenir le code source pour le syst&egrave;me. Vous pouvez modifier le code, le recompiler et l'installer. Mais une fois que vous avez install&eacute; une version modifi&eacute;e, le TiVo ne fonctionne plus &agrave; cause d'un m&eacute;canisme sp&eacute;cial con&ccedil;u pour vous faire &eacute;chouer. La libert&eacute; n&deg; 1, celle qui permet de modifier le logiciel pour en faire ce que vous voulez est devenue une parodie.

source: Then came Treacherous Computing, promoted as &ldquo;Trusted Computing,&rdquo; meaning that companies can &ldquo;trust&rdquo; your computer to obey them instead of you. It enables network sites to tell which program you are running; if you change the program, or write your own, they will refuse to talk to you. Once again, freedom No. 1 becomes a sham.
fr: Puis vint l'&laquo;&nbsp;informatique d&eacute;loyale promue comme l'&laquo;&nbsp;informatique de confiance&nbsp;&raquo;, ce qui signifie que les soci&eacute;t&eacute;s peuvent avoir &laquo;&nbsp;confiance&nbsp;&raquo; en votre ordinateur pour qu'il leur ob&eacute;isse plut&ocirc;t qu'&agrave; vous. Cela permet &agrave; des sites du r&eacute;seau de dire quel programme vous ex&eacute;cutez&nbsp;; si vous modifiez le programme ou si vous &eacute;crivez le v&ocirc;tre, ils refuseront de vous parler. Une fois encore, la libert&eacute; n&deg; 1 devient une parodie.

source: Microsoft has a scheme, originally called Palladium, that enables an application program to &ldquo;seal&rdquo; data so that no other program can access it. If Disney distributes movies this way, you'll be unable to exercise your legal rights of fair use and de minimis use. If an application records your data this way, it will be the ultimate in vendor lock-in. This too destroys freedom No. 1 &mdash; if modified versions of a program cannot access the same data, you can't really change the program to do what you wish. Something like Palladium is planned for a coming version of Windows.
fr: Microsoft a un projet, appel&eacute; Palladium &agrave; l'origine, qui permet &agrave; une application de &laquo;&nbsp;sceller&nbsp;&raquo; les donn&eacute;es de sorte qu'aucun autre programme ne puisse y acc&eacute;der. Si Disney (DIS) distribue des films de cette mani&egrave;re, vous serez incapables d'exercer vos droits l&eacute;gaux d'&laquo;&nbsp;usage raisonnable&nbsp;&raquo; (fair use) et d'usage <em>de minimis</em>. Si une application enregistre vos donn&eacute;es de cette fa&ccedil;on, vous serez prisonnier du vendeur. Ceci aussi d&eacute;truit la libert&eacute; n&deg; 1 &mdash; si des versions modifi&eacute;es d'un programme ne peuvent acc&eacute;der aux m&ecirc;mes donn&eacute;es, vous ne pouvez pas r&eacute;ellement modifier le programme pour qu'il fasse ce que vous voulez. Quelque chose comme Palladium est pr&eacute;vue pour uneprochaine version de Windows.

source: AACS, the &ldquo;Advanced Access Content System,&rdquo; promoted by Disney, IBM, Microsoft, Intel, Sony, and others, aims to restrict use of HDTV recordings&mdash;and software&mdash;so they can't be used except as these companies permit. Sony was caught last year installing a &ldquo;rootkit&rdquo; into millions of people's computers, and not telling them how to remove it. Sony has learned its lesson: it will install the &ldquo;rootkit&rdquo; in your computer before you get it, and you won't be able to remove it. This plan explicitly requires devices to be &ldquo;robust&rdquo;&mdash;meaning you cannot change them. Its implementors will surely want to include GPL-covered software, trampling freedom No. 1. This scheme should get &ldquo;AACSed,&rdquo; and a boycott of HD DVD and Blu-ray has already been announced (<a href="http://bluraysucks.com/boycott">http://bluraysucks.com/boycott</a>).
fr: AACS, &laquo;&nbsp;Advanced Access Content System&nbsp;&raquo; (syst&egrave;me avanc&eacute; d'acc&egrave;s au contenu), promu par Disney, IBM, Microsoft, Intel, Sony et d'autres, se destine &agrave; restreindre l'usage des enregistrements TV haute d&eacute;finition (HDTV) &mdash; et des logiciels &mdash; de sorte qu'ils ne peuvent &ecirc;tre utilis&eacute;s sauf si ces soci&eacute;t&eacute;s le permettent. Sony s'est fait attrap&eacute; l'an dernier en installant un &laquo;&nbsp;rootkit&nbsp;&raquo; sur des millions d'ordinateurs de particuliers et en ne leur disant pas comment le retirer. Sony a appris sa le&ccedil;on&nbsp;: il installera le &laquo;&nbsp;rootkit&nbsp;&raquo; dans votre ordinateur avant que vous ne l'achetiez et vous serez incapables de le retirer. Ce plan requiert explicitement que les dispositifs doivent &ecirc;tre &laquo;&nbsp;robustes&nbsp;&raquo; &mdash; ce qui veut dire que vous ne pourrez pas les modifier. Leurs concepteurs voudront s&ucirc;rement y inclure un logiciel couvert par la GPL, en pi&eacute;tinant la libert&eacute; n&deg; 1. Ce plan devrait &ecirc;tre &laquo;&nbsp;AACSis&eacute;&nbsp;&raquo; et un boycott des DVD haute d&eacute;finition et Blu-ray a d&eacute;j&agrave; &eacute;t&eacute; annonc&eacute; (<a href="http://bluraysucks.com/boycott">http://bluraysucks.com/boycott</a>).

source: Allowing a few businesses to organize a scheme to deny our freedoms for their profit is a failure of government, but so far most of the world's governments, led by the U.S., have acted as paid accomplices rather than policemen for these schemes. The copyright industry has promulgated its peculiar ideas of right and wrong so vigorously that some readers may find it hard to entertain the idea that individual freedom can trump their profits.
fr: Permettre &agrave; quelques soci&eacute;t&eacute;s d'organiser un plan pour d&eacute;nier nos libert&eacute;s pour leur profit est un manquement du gouvernement, mais jusqu'&agrave; pr&eacute;sent, la plupart des gouvernements mondiaux, men&eacute;s par les &Eacute;tats-Unis, ont agi en complices r&eacute;mun&eacute;r&eacute;s plut&ocirc;t qu'en policiers pour ces plans. L'industrie du droit d'auteur a promulgu&eacute; ses id&eacute;es personnelles sur ce qui est bien et ce qui est mal si vigoureusement que certains lecteurs peuvent trouver difficile d'entretenir l'id&eacute;e que la libert&eacute; individuelle puisse tarir leurs profits.

source: Facing these threats to our freedom, what should the free software community do? Some say we should give in and accept the distribution of our software in ways that don't allow modified versions to function, because this will make our software more popular. Some refer to free software as &ldquo;open source,&rdquo; that being the slogan of an amoral approach to the matter, which cites powerful and reliable software as the highest goals. If we allow companies to use our software to restrict us, this &ldquo;open source DRM&rdquo; could help them restrict us more powerfully and reliably. Those who wield the power could benefit by sharing and improving the source code of the software they use to do so. We too could read that source code&mdash;read it and weep, if we can't make a changed version run. For the goals of freedom and community&mdash;the goals of the free software movement&mdash;this concession would amount to failure.
fr: Pour faire face aux menaces contre notre libert&eacute;, que devrait faire la communaut&eacute; du logiciel libre&nbsp;? Certains disent que nous devrions renoncer et accepter la distribution de nos logiciels avec des moyens qui ne permettent pas aux versions modifi&eacute;es de fonctionner car cela rendrait nos logiciels plus populaires. Certains font r&eacute;f&eacute;rence aux logiciels libres comme &laquo;&nbsp;open source&nbsp;&raquo; qui est le slogan d'une approche amorale du sujet, qui dit que la puissance et la fiabilit&eacute; sont des buts sup&eacute;rieurs. Si nous permettons aux soci&eacute;t&eacute;s d'utiliser nos logiciels pour nous restreindre, ce &laquo;&nbsp;<abbr title="Digital Right Management">DRM</abbr> open source&nbsp;&raquo; pourrait les aider &agrave; nous restreindre de mani&egrave;re plus puissante et fiable. Ceux qui ont le pouvoir pourraient y gagner en partageant et en am&eacute;liorant le code source du logiciel qu'ils utilisent pour cela. Nous pourrions aussi le lire &mdash; le lire et pleurer, si nous ne pouvons faire fonctionner une version modifi&eacute;e. Pour les objectifs de la libert&eacute; et de la communaut&eacute; &mdash; les objectifs du mouvement du logiciel libre &mdash; cette concession se r&eacute;sumerait &agrave; l'&eacute;chec.

source: We developed the GNU operating system so that we could control our own computers, and cooperate freely in using them in freedom. To seek popularity for our software by ceding this freedom would defeat the purpose; at best, we might flatter our egos. Therefore we have designed version 3 of the GNU GPL to uphold the user's freedom to modify the source code and put modified versions to real use.
fr: Nous avons d&eacute;velopp&eacute; le syst&egrave;me d'exploitation GNU afin de contr&ocirc;ler nos propres ordinateurs et de coop&eacute;rer librement en les utilisant en toute libert&eacute;. Rechercher la popularit&eacute; pour nos logiciels en conc&eacute;dant cette libert&eacute; irait &agrave; l'encontre de ce pour quoi nous l'avons d&eacute;velopp&eacute;&nbsp;; au mieux cela pourrait flatter nos &eacute;gos. Donc, nous avons con&ccedil;u la version 3 de la GPL GNU pour maintenir la libert&eacute; de l'utilisateur de modifier le code source et de pouvoir utiliser r&eacute;ellement les versions modifi&eacute;es.

source: The debate about the GPL v3 is part of a broader debate about DRM versus your rights. The motive for DRM schemes is to increase profits for those who impose them, but their profit is a side issue when millions of people's freedom is at stake; desire for profit, though not wrong in itself, cannot justify denying the public control over its technology. Defending freedom means thwarting DRM.
fr: Le d&eacute;bat sur la GPL v3 fait partie d'un d&eacute;bat plus large sur les DRM contre vos droits. Le mobile des plans des DRM est d'accro&icirc;tre les profits de ceux qui nous les imposent, mais leurs profits n'ont pas d'importance quand la libert&eacute; de millions de gens est en jeu&nbsp;; bien que le d&eacute;sir de profit ne soit pas une mauvaise chose en soi, il ne peut justifier de d&eacute;nier au public le contr&ocirc;le sur ses technologies. D&eacute;fendre la libert&eacute; signifie de contrecarrer les <abbr title="Digital Right Management">DRM</abbr>.

source: First published by BusinessWeek Online.
fr: Publi&eacute; originellement sur BusinessWeek Online. Copyright 2006 Richard Stallman.

source: Dr. Richard M. Stallman is the founder of the <a href="/gnu/">GNU Project</a>
fr: Le Dr. Richard M. Stallman est le fondateur du projet GNU&nbsp;: <a href="/gnu/thegnuproject.fr.html">http://www.gnu.org/gnu/thegnuproject.fr.html</a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2006 Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2006 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
