Repository: gitGNU/gnu_www-fr
Catalog: philosophy/patent-practice-panel.*.po
Languages: fr

source: Daniel Ravicher's FFII panel presentation, November 10, 2004 - GNU Project - Free Software Foundation (FSF)
fr: Présentation à la table ronde de la FFII de Daniel Ravicher, le 10 novembre 2004 - GNU Project - Free Software Foundation (FSF)

source: New developments in patent practice: assessing the risks and cost of portfolio licensing and hold-ups
fr: Nouveaux d&eacute;veloppements dans la pratique des brevets&nbsp;: &eacute;valuation des risques, le co&ucirc;t des concessions de licences et la r&eacute;tention

source: by <strong>Daniel B. Ravicher</strong>
fr: par <strong>Daniel B. Ravicher</strong>

source: <em>This is a transcript of a panel presentation given by Daniel B. Ravicher as the executive director of the Public Patent Foundation on Wednesday, November 10, 2004, at a conference organized by the Foundation for a Free Information Infrastructure (FFII) in Brussels, Belgium. The transcription was done by Aendrew Rininsland.</em>
fr: <em>Ceci est la transcription d'une pr&eacute;sentation donn&eacute;e par Daniel B. Ravicher en tant que directeur ex&eacute;cutif de la &laquo;&nbsp;Public Patent Foundation&nbsp;&raquo; (Fondation publique pour les brevets) le mercredi 10 novembre 2004, &agrave; une conf&eacute;rence organis&eacute;e par l'Association pour une infrastructure informationnelle libre (Fondation pour une Infrastructure d'Information Libre) &agrave; Bruxelles, Belgique. La transcription a &eacute;t&eacute; faite par Aendrew Rininsland.</em>

source: Thanks. I think, for me, the whole two days of conferences boils to really one question, and the whole debate boils down to one question: &ldquo;How do we want success in the software industry to be determined?&rdquo;
fr: Merci. Je pense, pour moi, que les deux journ&eacute;es de conf&eacute;rences peuvent se r&eacute;sumer en une question&nbsp;: &laquo;&nbsp;Comment voulons-nous d&eacute;terminer le succ&egrave;s dans l'industrie des logiciels&nbsp;?&nbsp;&raquo;.

source: Or, another way, who do we want to determine those who succeed and those who fail in the software industry? Because there are various people who can make this decision. We can have bureaucrats make the decision about who wins and who fails, or we can let consumers make the decision about who wins and who fails. If we want software to succeed because we want it to succeed on its merits and be the best software that the public can have, it's more likely we want a system that lets consumers and end-users make the decision about which software is selected &mdash; not bureaucrats.
fr: Ou, d'une autre mani&egrave;re, qui voulons-nous pour d&eacute;terminer ceux qui r&eacute;ussissent et ceux qui &eacute;chouent dans l'industrie du logiciel&nbsp;? Puisqu'il y a diverses personnes qui peuvent prendre cette d&eacute;cision. Nous pouvons faire prendre par des bureaucrates la d&eacute;cision au sujet de qui r&eacute;ussit et qui &eacute;choue, ou nous pouvons laisser des consommateurs prendre cette d&eacute;cision de qui r&eacute;ussit et de qui &eacute;choue. Si nous voulons que le logiciel r&eacute;ussisse parce que nous voulons qu'il r&eacute;ussisse sur ses m&eacute;rites et soit le meilleur logiciel que le public puisse avoir, il est plus probable que nous voulons un syst&egrave;me qui laisse des consommateurs et des utilisateurs prendre les d&eacute;cisions au sujet du choix du logiciel &mdash; pas des bureaucrates.

source: Now, what does that have to do with patents? The larger you make a patent system, the more you allow the patent system to impact software, and the more you're allowing success in the software industry to be determined by patent-based bureaucrats, those who can take advantage of the bureaucracy which grants and resolves disputes regarding patent rights. It's a bureaucratic competition, not one based on the decision of consumers. That means it's less likely for the merits to be determinative of what software succeeds.
fr: Alors maintenant, quel est le lien avec les brevets&nbsp;? Plus vous faites un syst&egrave;me de brevets large, plus vous permettez au syst&egrave;me de brevets d'avoir un impact sur le logiciel, et plus vous permettez que le succ&egrave;s dans l'industrie du logiciel soit d&eacute;termin&eacute; par des bureaucrates se basant sur les brevets, ceux qui peuvent tirer profit de la bureaucratie qui accordent et r&eacute;solvent les contestations en regard des droits sur les brevets. C'est une concurrence bureaucratique qui n'est pas bas&eacute;e sur la d&eacute;cision des consommateurs. Cela signifie qu'il est moins probable que les m&eacute;rites soient d&eacute;terminants dans la r&eacute;ussite d'un logiciel.

source: We have to recognize that even without software patents, large developers have intrinsic advantages over small developers. Large developers have the resources, large developers have the relationships, large developers have the distribution channels, large developers have the brand. So even without software patents, large developers are still at an advantage &mdash; they start out at an advantage. Well, then, the next question to me is, &ldquo;If we have software patents, does that increase the advantage of large developers or decrease it?&rdquo;, because the patent system could benefit small developers and therefore that could erode some of the naturally existing benefits that large corporations have.
fr: Nous devons reconna&icirc;tre que m&ecirc;me sans brevets sur les logiciels, les grands d&eacute;veloppeurs ont des avantages intrins&egrave;ques sur les petits d&eacute;veloppeurs. Les grands d&eacute;veloppeurs ont des ressources, les grands d&eacute;veloppeurs ont des relations, les grands d&eacute;veloppeurs ont les canaux de distribution, les grands d&eacute;veloppeurs ont la marque. Alors m&ecirc;me sans brevet sur les logiciels, les grands d&eacute;veloppeurs ont toujours un avantage &mdash; ils commencent avec un avantage. Bien, alors, la prochaine question qui me vient, &laquo;&nbsp;si nous avons des brevets logiciels, est-ce que &ccedil;a augmente l'avantage des grands d&eacute;veloppeurs ou le diminue&nbsp;?&nbsp;&raquo;, parce que le syst&egrave;me de brevets pourrait b&eacute;n&eacute;ficier &agrave; de petits d&eacute;veloppeurs et donc pourrait &eacute;roder certains des avantages qu'ont naturellement les grandes corporations.

source: I think that point's been belaboured already. We know that small developers are not benefited by a patent system, in fact, they are prejudiced by a patent system. So, enlarging a patent system to apply to software development only enlarges the disadvantage small developers have in competition. Again, it comes back: Who do we want to make the decision about which software developers succeed, do we want consumers, based on merits and functionality and price, or bureaucrats, based on whom patents are granted to and who wins patent infringement cases?
fr: Je pense que ce point a d&eacute;j&agrave; &eacute;t&eacute; bien expliqu&eacute;. Nous savons que de petits d&eacute;veloppeurs ne sont pas privil&eacute;gi&eacute;s avec un syst&egrave;me de brevets, en fait, ils ont un pr&eacute;judice avec un syst&egrave;me de brevets. Ainsi, &eacute;tendre un syst&egrave;me de brevets pour l'appliquer au d&eacute;veloppement de logiciel augmente seulement les inconv&eacute;nients que les petits d&eacute;veloppeurs ont avec la concurrence. Et &ccedil;a revient encore&nbsp;: Qui voulons-nous pour prendre la d&eacute;cision au sujet de la r&eacute;ussite des d&eacute;veloppeurs de logiciel, voulons-nous que ce soit des consommateurs, se basant sur les m&eacute;rites, la fonctionnalit&eacute; et le prix, ou des bureaucrates, se basant sur les soci&eacute;t&eacute;s &agrave; qui les brevets sont accord&eacute;s et sur les gagnants dans les affaires de violation de brevets&nbsp;?

source: The other thing we need to recognize is whether or not the patent system has a preference for users of certain types of software. A patent system as we have in the United States benefits those under a software distribution scheme which allows them to charge royalties. This is because all software has to deal with the risk of infringing on patents. Patents don't discriminate between open-source or freely licensed software and proprietary software: a patent covers certain technology, it doesn't matter how the software's distributed. But proprietary software is licensed with a fee so the cost of that risk can be passed on to the consumer without them recognizing it. They don't see it, it's baked into the price of the software they're buying and if you were to ask a consumer if they've bought insurance against being sued for patent infringement, they would say they don't believe that have. But in fact they had, because if someone sues a user of Microsoft software, Microsoft has built in the cost of stepping in to defend them from that into the cost of the license fee. On the other side, if you have royalty-free distributed software such as open-source or free software, you can't bake in the cost of that risk so it becomes more transparent. And this makes consumers or users think that open-source is in a worse position than proprietary software when it's actually not. It's just because the open-source distribution scheme does not allow someone to sneak in the cost of that risk to make it opaque instead of transparent. So the patent system not only prefers large developers over small developers, it also prefers users of proprietary software over open-source software.
fr: L'autre chose que nous devons reconna&icirc;tre est que le syst&egrave;me de brevets a une pr&eacute;f&eacute;rence pour des utilisateurs de certains types de logiciel. Un syst&egrave;me de brevets comme celui que nous avons aux &Eacute;tats-Unis b&eacute;n&eacute;ficie &agrave; ceux qui sont sous un r&eacute;gime de distribution de logiciel qui leur permet de faire payer des royalties. C'est parce que tous les logiciels doivent faire face au risque de violation de brevets. Les brevets ne font pas la distinction entre l'open source ou les logiciels sous licence libre et les logiciels propri&eacute;taires&nbsp;: un brevet couvre certaines technologies, il ne se soucie pas de la fa&ccedil;on dont le logiciel est distribu&eacute;. Mais les Logiciels propri&eacute;taires sont sous licence payante et donc le co&ucirc;t de ce risque peut &ecirc;tre transmis aux consommateurs sans qu'ils s'en rendent compte. Ils ne le voient pas, c'est inclus dans le prix du logiciel qu'ils ach&egrave;tent et si vous deviez demander &agrave; un consommateur s'il est assur&eacute; contre des poursuites pour violation de brevets, il dirait qu'il ne pense pas l'avoir fait. Mais en fait, il l'a fait, parce que si quelqu'un poursuit un utilisateur de logiciel provenant de Microsoft, Microsoft a inclus dans le prix de la licence les frais de proc&eacute;dures pour le d&eacute;fendre. D'un autre c&ocirc;t&eacute;, si vous avez un logiciel distribu&eacute; sans royalties tel que l'open source ou le logiciel libre, vous ne pouvez pas inclure le co&ucirc;t de ce risque ainsi il devient plus transparent. Et ceci incite les consommateurs ou les utilisateurs &agrave; penser que l'open source est en plus mauvaise position que le logiciel propri&eacute;taire alors qu'il ne l'est pas r&eacute;ellement. C'est juste parce que le mode de distribution de l'open source ne permet pas &agrave; quelqu'un d'incorporer furtivement le co&ucirc;t de ce risque pour le rendre opaque au lieu de transparent. Ainsi le syst&egrave;me de brevets pr&eacute;f&egrave;re non seulement les grands d&eacute;veloppeurs aux petits d&eacute;veloppeurs mais il pr&eacute;f&egrave;re &eacute;galement des utilisateurs de logiciels propri&eacute;taires aux utilisateurs de logiciels open source.

source: If we come back to the initial question, which I think this is all about, how do we want success in the software market to be determined? Do we want it to be determined by these types of factors, or do we want it to be determined by who can get the best software at the best price?
fr: Si nous revenons &agrave; la question initiale, puisque je pense que c'est de &ccedil;a dont il s'agit, comment voulons-nous que le succ&egrave;s dans le march&eacute; des logiciels soit d&eacute;termin&eacute;&nbsp;? Voulons-nous que ce soit d&eacute;termin&eacute; par ce type de facteurs, ou voulons-nous que ce soit d&eacute;termin&eacute; par l'obtention du meilleur logiciel au meilleur prix&nbsp;?

source: Now, I think it's important to concede the point that people on the other side will make, which is, will a less-onerous patent system, or they would call it a &lsquo;less-beneficial&rsquo; patent system, I call it less-onerous, will harm their business, because people could copy them. Well, large businesses aren't worried about being copied. They really aren't. At least not by other large businesses, this is why they enter into cross-licenses all the time. If a large company really didn't want its software to be copied, why is it licensing its patent portfolio to every other big company in the world? Because it can't stop them from copying it once they enter into that agreement, so this argument that , &ldquo;Well, we're worried about people copying our software&rdquo;, the most likely people to copy your software are other large businesses because they have the resources and the ability and the distribution channels and the brand and the relationships. Why are you letting them copy it? You must not be that worried about it.
fr: Maintenant, je pense qu'il est important d'admettre le point de vue que les gens auront d'un autre c&ocirc;t&eacute;, qui est, est-ce qu'un syst&egrave;me moins on&eacute;reux de brevets, (ou ils l'appelleraient un syst&egrave;me &laquo;&nbsp;moins b&eacute;n&eacute;fique&nbsp;&raquo; de brevet, je l'appelle moins on&eacute;reux), nuira &agrave; leurs affaires, parce que les gens pourraient les copier. Bien, les grandes entreprises ne sont pas inqui&eacute;t&eacute;es d'&ecirc;tre copi&eacute;es. Elles ne le sont vraiment pas. Au moins pas par d'autres grandes entreprises, c'est pourquoi elles font des licences crois&eacute;es tout le temps. Si une grande entreprise ne voulait vraiment pas que son logiciel soit copi&eacute;, pourquoi ferait-elle des concessions de licences de son portefeuille &agrave; toutes les autres grandes entreprises du monde&nbsp;? Puisque &ccedil;a ne peut pas les emp&ecirc;cher de le copier une fois qu'ils entrent dans cet accord, alors cet argument que, &laquo;&nbsp;Bien, c'est que nous nous inqui&eacute;tons des personnes copiant nos logiciels&nbsp;&raquo;, les personnes les plus susceptibles de copier vos logiciels sont d'autres grandes entreprises parce qu'elles ont les ressources, la capacit&eacute;, les canaux de distribution, la marque et les relations. Pourquoi les laissez-vous les copier&nbsp;? &Ccedil;a ne doit pas vous inqui&eacute;ter tant que &ccedil;a.

source: And so the question is, then, does a patent system have a net-beneficial effect or a net-detrimental effect on software development? I think we've seen already it only decreases the ability for open-source or royalty-free license software to compete with proprietary software. In the end you have to ask, is less competition beneficial for the software industry? I don't know what Europeans think about that, I think Europeans are very pro-competition and I know us on the other side of the Atlantic are very pro-competition as well, and so the answer is never less competition is better for consumers. And so I think as we bring the point home, if we had two seconds in an elevator to pitch this idea to someone, software patents have a net-negative effect on competition in the software industry. True, they may increase competition in some ways, but the net-effect is anti-competitive. And that's what putting the ability to decide success in the software industry in the hands of the patent office or in hands of the courts does. If you need examples, if people think that's just rhetoric or your opinion, just point to the United States. Microsoft is a very successful software company, I don't think anyone would debate that. They've never had to sue anyone for patent infringement. So they claim they need patents, but yet they've never had to use them. They cross-license them and that's where we wonder, &lsquo;If you're worried about people copying, then why are you cross-licensing them to people?&rsquo;.
fr: Alors, la question est, un syst&egrave;me de brevets a-t-il un effet b&eacute;n&eacute;fique net ou un effet de d&eacute;ficit net sur le d&eacute;veloppement de logiciel&nbsp;? Je pense que nous avons d&eacute;j&agrave; vu qu'il diminue seulement la capacit&eacute; pour l'open source ou le logiciel sous licence gratuite &agrave; concourir avec le logiciel propri&eacute;taire. &Agrave; la fin vous devez vous demander, moins de concurrence est-ce b&eacute;n&eacute;fique pour l'industrie de logiciel&nbsp;? Je ne sais pas ce que les Europ&eacute;ens en pensent, je pense que les Europ&eacute;ens sont vraiment pour la concurrence et je sais que nous de l'autre c&ocirc;t&eacute; de l'Atlantique sommes vraiment pour la concurrence aussi, et donc la r&eacute;ponse est que moins de concurrence n'est jamais meilleure pour les consommateurs. Et puisque nous en revenons au point de d&eacute;part, si nous avions deux secondes dans un ascenseur pour lancer cette id&eacute;e &agrave; quelqu'un, les brevets de logiciel ont un effet n&eacute;gatif net sur la concurrence dans l'industrie de logiciel. Il est vrai, qu'ils peuvent augmenter la concurrence de certains c&ocirc;t&eacute;s, mais l'effet net est anti-concurrentiel. Et c'est ce que fait de mettre la capacit&eacute; de d&eacute;cider du succ&egrave;s dans l'industrie des logiciels dans les mains de l'office des brevets ou des tribunaux. Si vous avez besoin d'exemples, si les gens pensent que c'est juste de la rh&eacute;torique ou votre avis, pointer juste vers les &Eacute;tats-Unis. Microsoft est une entreprise de logiciel couronn&eacute; de succ&egrave;s, je ne pense pas que quiconque puisse en douter. Ils n'ont jamais eu besoin de poursuivre quelqu'un pour des violations de brevet. Donc ils clament qu'ils ont besoin de brevets, mais pourtant ils n'ont jamais eu &agrave; s'en servir. Ils font des licences crois&eacute;es et c'est l&agrave; que nous nous demandons&nbsp;: &laquo;&nbsp;Si vous vous inqui&eacute;tez des personnes qui copient, alors pourquoi faire des licences crois&eacute;es avec elles&nbsp;?&nbsp;&raquo;.

source: You know, the last point is, who else does a patent system benefit? If it benefits large developers over small developers, is there anyone else? A patent system benefits non-developers. Do we really want a bureaucratic system that helps people who aren't adding anything to society? What I mean by non-developers are trolls &mdash; which everyone here is familiar with &mdash; people who get a patent either by applying for it or acquiring it in some asset purchase and then use it to tax other developers, other distributors of a product.
fr: Vous savez, le dernier point est, &agrave; qui d'autre un syst&egrave;me de brevets b&eacute;n&eacute;ficie t-il&nbsp;? S'il b&eacute;n&eacute;ficie aux grands d&eacute;veloppeurs plut&ocirc;t qu'aux petits d&eacute;veloppeurs, y a-t-il d'autres personnes&nbsp;? Un syst&egrave;me de brevets b&eacute;n&eacute;ficie aux non-d&eacute;veloppeurs. Voulons-nous vraiment un syst&egrave;me bureaucratique qui aide les personnes qui n'ajoutent rien &agrave; la soci&eacute;t&eacute;&nbsp;? Ce que j'entends par non-d&eacute;veloppeurs est un troll &mdash; dont tout le monde ici est familier &mdash; les gens qui obtiennent un brevet soit en en faisant la demande soit en l'acqu&eacute;rant avec un certain achat de capitaux et puis qui l'utilisent pour taxer les d'autres d&eacute;veloppeurs, d'autres distributeurs d'un produit.

source: Do we really want a system which encourages people to not add products or services to the market place but only detracts from the profits and capabilities of those that do?
fr: Est-ce que nous voulons vraiment un syst&egrave;me qui encourage des personnes &agrave; ne pas ajouter des produits ou des services sur le march&eacute; mais amoindrissent les b&eacute;n&eacute;fices et les possibilit&eacute;s de ceux qui le font&nbsp;?

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2006 Daniel B. Ravicher <br /> Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: Copyright &copy; 2006 Daniel B. Ravicher <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: EWENS.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
