Repository: gitGNU/gnu_www-fr
Catalog: philosophy/plan-nine.*.po
Languages: fr

source: The Problems of the Plan 9 License - GNU Project - Free Software Foundation (FSF)
fr: Les probl&egrave;mes de la licence de Plan 9 - GNU Project - Free Software Foundation (FSF)

source: The Problems of the (Earlier) Plan 9 License
fr: Les probl&egrave;mes de la (pr&eacute;c&eacute;dente) licence de Plan 9

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: <em>Note:</em> This applies to the earlier license used for Plan 9. The current license of Plan 9 does qualify as free software (and also as open source). So this article's specific example is of historical relevance only. Nonetheless, the general point remains valid.
fr: <em>Note&nbsp;:</em> Ceci s'applique &agrave; la licence pr&eacute;c&eacute;dente utilis&eacute;e pour Plan 9. La licence actuelle de Plan 9 est une licence de logiciel libre (et &eacute;galement open source). Aussi, cet article sur un exemple sp&eacute;cifique n'a qu'une valeur historique. N&eacute;anmoins, l'id&eacute;e g&eacute;n&eacute;rale demeure valide.

source: When I saw the announcement that the Plan 9 software had been released as &ldquo;open source&rdquo;, I wondered whether it might be free software as well. After studying the license, my conclusion was that it is not free; the license contains several restrictions that are totally unacceptable for the Free Software Movement. (See <a href="/philosophy/free-sw.html">http://www.gnu.org/philosophy/free-sw.html</a>.)
fr: Quand j'ai vu annoncer que Plan 9 &eacute;tait devenu &laquo;&nbsp;un logiciel &agrave; code source ouvert&nbsp;&raquo; (&laquo;&nbsp;open source&nbsp;&raquo;), je me suis demand&eacute; s'il pouvait &ecirc;tre consid&eacute;r&eacute; tout autant comme un logiciel libre. Apr&egrave;s avoir &eacute;tudi&eacute; la licence, ma conclusion fut qu'elle n'&eacute;tait pas libre&nbsp;; la licence contenait beaucoup de restrictions qui sont totalement inacceptables pour le mouvement pour le logiciel libre. (Voyez <a href="/philosophy/free-sw.fr.html">http://www.gnu.org/philosophy/free-sw.fr.html</a>).

source: I am not a supporter of the Open Source Movement, but I was glad when one of their leaders told me they don't consider the license acceptable either. When the developers of Plan 9 describe it as &ldquo;open source&rdquo;, they are altering the meaning of that term and thus spreading confusion. (The term &ldquo;open source&rdquo; is widely misunderstood; see <a href="/philosophy/open-source-misses-the-point.html">http://www.gnu.org/philosophy/open-source-misses-the-point.html</a>.)
fr: Je ne suis pas un supporter du mouvement du logiciel &agrave; code source ouvert mais j'&eacute;tais heureux lorsque l'un de ses repr&eacute;sentants m'a dit qu'ils ne consid&eacute;raient pas la licence comme acceptable non plus. Lorsque les d&eacute;veloppeurs de Plan 9 le d&eacute;crivent comme &laquo;&nbsp;logiciel &agrave; code source ouvert&nbsp;&raquo;, ils alt&egrave;rent la signification du terme et par l&agrave; m&ecirc;me r&eacute;pandent la confusion. (Le terme &laquo;&nbsp;Open Source&nbsp;&raquo; est largement mal compris; voyez <a href="/philosophy/open-source-misses-the-point.fr.html">http://www.gnu.org/philosophy/open-source-misses-the-point.fr.html</a>).

source: Here is a list of the problems that I found in the Plan 9 license. Some provisions restrict the Plan 9 software so that it is clearly non-free; others are just extremely obnoxious.
fr: Voici une liste des probl&egrave;mes que j'ai trouv&eacute;s dans la licence de Plan 9. Certaines clauses restreignent le logiciel Plan 9 afin qu'il soit clairement non-libre&nbsp;; d'autres sont juste extr&ecirc;mement d&eacute;sagr&eacute;ables.

source: First, here are the provisions that make the software non-free.
fr: Premi&egrave;rement, voici les clauses qui rendent le logiciel non-libre.

source: <strong> You agree to provide the Original Contributor, at its request, with a copy of the complete Source Code version, Object Code version and related documentation for Modifications created or contributed to by You if used for any purpose. </strong>
fr: <strong>Vous acceptez de fournir au contributeur originel, &agrave; sa demande, un copie compl&egrave;te de la version code source, de la version code objet et de la documentation relative pour les Modifications cr&eacute;&eacute;es ou ajout&eacute;es en contribution par vous si elles sont utilis&eacute;es dans n'importe quel but.</strong>

source: This prohibits modifications for private use, denying the users a basic right.
fr: Ceci interdit les modifications pour usage priv&eacute;, enlevant ainsi un droit &eacute;l&eacute;mentaire aux utilisateurs.

source: <strong> and may, at Your option, include a reasonable charge for the cost of any media. </strong>
fr: <strong> et pouvez, &agrave; votre discr&eacute;tion, demander une r&eacute;tribution raisonnable pour le co&ucirc;t de quelque support que ce soit.</strong>

source: This seems to limit the price that may be charged for an initial distribution, prohibiting selling copies for a profit.
fr: Ceci para&icirc;t limiter le prix qui peut &ecirc;tre demand&eacute; pour une distribution initiale, interdisant la vente de copie dans un but lucratif.

source: <strong> Distribution of Licensed Software to third parties pursuant to this grant shall be subject to the same terms and conditions as set forth in this Agreement, </strong>
fr: <strong>La distribution du logiciel sous licence &agrave; des tiers en conformit&eacute; &agrave; cet accord sera sujette aux m&ecirc;mes modalit&eacute;s et conditions que celles pr&eacute;sent&eacute;es dans ce contrat,</strong>

source: This seems to say that when you redistribute you must insist on a contract with the recipients, just as Lucent demands when you download it.
fr: Ceci para&icirc;t signifier que, lorsque vous redistribuez, vous devez passer un accord avec le r&eacute;cipiendaire conforme &agrave; ce que AT&amp;T demande lorsque vous le t&eacute;l&eacute;chargez.

source: <strong> 1. The licenses and rights granted under this Agreement shall terminate automatically if (i) You fail to comply with all of the terms and conditions herein; or (ii) You initiate or participate in any intellectual property action against Original Contributor and/or another Contributor. </strong>
fr: <strong> 1. Les licences et droits autoris&eacute;s sous ce contrat se termineront automatiquement si (i) Vous &eacute;chouez &agrave; vous conformer &agrave; toutes les modalit&eacute;s et conditions incluses; ou (ii) Vous entamez ou participez &agrave; toute poursuite judiciaire &agrave; l'encontre du contributeur originel et/ou autre contributeur.</strong>

source: This seemed reasonable to me at first glance, but later I realized that it goes too far. A retaliation clause like this would be legitimate if it were limited to patents, but this one is not. It would mean that if Lucent or some other contributor violates the license of your GPL-covered free software package, and you try to enforce that license, you would lose the right to use the Plan 9 code.
fr: Cela me paraissait raisonnable &agrave; premi&egrave;re vue mais par la suite j'ai r&eacute;alis&eacute; que &ccedil;a allait trop loin. Une clause de r&eacute;pression telle que celle-ci serait l&eacute;gitime si elle se limitait aux brevets mais ce n'est pas le cas. Cela signifie que si Bell Labs ou quelqu'autre contributeur violait la licence d'un de vos logiciels libres couverts par la GPL et que vous la d&eacute;fendiez en cour, vous perdriez le droit d'utiliser le code de Plan 9.

source: <strong> You agree that, if you export or re-export the Licensed Software or any modifications to it, You are responsible for compliance with the United States Export Administration Regulations and hereby indemnify the Original Contributor and all other Contributors for any liability incurred as a result. </strong>
fr: <strong> Vous acceptez que, si vous exportez ou r&eacute;exportez le logiciel couvert par ce contrat ou toute modification relative, vous seriez responsable de la conformit&eacute; aux r&egrave;glements de l'administration de l'exportation des &Eacute;tats-Unis et que par la m&ecirc;me vous indemniserez le contributeur originel et tous les autres contributeurs pour la responsabilit&eacute; encourue en cons&eacute;quence.</strong>

source: It is unacceptable for a license to require compliance with US export control regulations. Laws being what they are, these regulations apply <em>in certain situations</em> regardless of whether they are mentioned in a license; however, requiring them as a license condition can extend their reach to people and activities outside the US government's jurisdiction, and that is definitely wrong.
fr: Il est inacceptable pour une licence de requ&eacute;rir la conformit&eacute; avec les r&egrave;glements de contr&ocirc;le d'exportation des &Eacute;tats-Unis. Les lois &eacute;tant ce qu'elles sont, ces r&egrave;glements s'appliquent <em>dans certaines situations</em> sans m&ecirc;me &ecirc;tre mentionn&eacute;es dans une licence&nbsp;; cependant, les imposer comme condition dans une licence peut &eacute;tendre leurs cons&eacute;quences aux personnes et aux activit&eacute;s hors de la juridiction du gouvernement des &Eacute;tats-Unis et ceci est d&eacute;finitivement mauvais.

source: A part of the distribution is covered by a further unacceptable restriction:
fr: Une partie de la distribution est couverte par une autre restriction inacceptable&nbsp;:

source: <strong> 2.2 No right is granted to Licensee to create derivative works of or to redistribute (other than with the Original Software or a derivative thereof) the screen imprinter fonts identified in subdirectory /lib/font/bit/lucida and printer fonts (Lucida Sans Unicode, Lucida Sans Italic, Lucida Sans Demibold, Lucida Typewriter, Lucida Sans Typewriter83), identified in subdirectory /sys/lib/postscript/font. </strong>
fr: <strong> 2.2 Aucun droit n'est donn&eacute; au concessionnaire de produire une œuvre d&eacute;riv&eacute;e ou de redistribuer (autrement qu'avec le logiciel d'origine ou d&eacute;riv&eacute;) les polices d'affichage d'&eacute;cran identifi&eacute;es dans le sous-r&eacute;pertoire /lib/font/bit/lucida ainsi que les polices d'impression (Lucida Sans Unicode, Lucida Sans Italic, Lucida Sans Demibold, Lucida Typewriter, Lucida Sans Typewriter83), identifi&eacute;es dans le sous-r&eacute;pertoire /sys/lib/postscript/font.</strong>

source: One part of this collection is free&mdash;the Ghostscript fonts that are covered by the GNU GPL. All the rest does not even come close.
fr: Une partie de cette collection est libre (les polices de Ghostscript sont couvertes par la GNU GPL), tout le reste ne s'en approche m&ecirc;me pas.

source: Aside from those fatal flaws, the license has other obnoxious provisions:
fr: En dehors de ces d&eacute;fauts s&eacute;v&egrave;res, la licence a d'autres dispositions infectes&nbsp;:

source: <strong> &hellip;As such, if You or any Contributor include Licensed Software in a commercial offering (&ldquo;Commercial Contributor&rdquo;), such Commercial Contributor agrees to defend and indemnify Original Contributor and all other Contributors (collectively &ldquo;Indemnified Contributors&rdquo;) </strong>
fr: <strong> &hellip;Tel quel, si vous ou quelqu'autre contributeur inclus le logiciel sous licence dans une offre commerciale (&laquo;&nbsp;contributeur commercial&nbsp;&raquo;), ledit contributeur commercial accepte de d&eacute;fendre et d'indemniser le contributeur originel et tous les autres contributeurs (&laquo;&nbsp;contributeurs indemnis&eacute;s&nbsp;&raquo; collectivement)</strong>

source: Requiring indemnities from users is quite obnoxious.
fr: Imposer des indemnit&eacute;s de la part d'utilisateurs est tr&egrave;s regrettable.

source: <strong> Contributors shall have unrestricted, nonexclusive, worldwide, perpetual, royalty-free rights, to use, reproduce, modify, display, perform, sublicense and distribute Your Modifications, and to grant third parties the right to do so, including without limitation as a part of or with the Licensed Software; </strong>
fr: <strong> Les contributeurs ont les droits libres de royalty, non-restreints, non-exclusifs, panmondiaux et perp&eacute;tuels d'utiliser, de reproduire, de modifier d'afficher, de pr&eacute;senter, de redistribuer et de sous-licencier vos modifications et d'en autoriser autant &agrave; des tiers, y compris sans limite en tant que partie ou en accompagnement aulogiciel sous licence&nbsp;;</strong>

source: This is a variant of the <a href="/licenses/license-list.html#SoftwareLicenses">NPL</a> asymmetry: you get limited rights to use their code, but they get unlimited rights to use your changes. While this does not by itself disqualify the license as a free software license (if the other problems were corrected), it is unfortunate.
fr: Ceci est une variation sur l'asym&eacute;trie de la <a href="/licenses/license-list.fr.html#SoftwareLicenses">NPL</a>&nbsp;: vous obtenez un droit limit&eacute; d'utiliser leur code mais eux acqui&egrave;rent un droit illimit&eacute; d'utiliser vos modifications. Bien que cela ne disqualifie pas cette licence en tant que licence de logiciel libre (si les autres probl&egrave;mes &eacute;taient corrig&eacute;s), c'est n&eacute;anmoins regrettable.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2000 Richard Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2000 Richard Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Wolfgang Sourdeau<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
