Repository: gitGNU/gnu_www-fr
Catalog: philosophy/privacyaction.*.po
Languages: fr

source: Protect Postal Privacy - GNU Project - Free Software Foundation (FSF)
fr: Prot&eacute;geons l'anonymat postal - GNU Project - Free Software Foundation (FSF)

source: Protect Postal Privacy
fr: Prot&eacute;geons l'anonymat postal

source: The following information was written by Kathleen Ellis. The Free Software Foundation does not lead this campaign, but we support it by spreading the word and hope that you do too.
fr: Ce document a &eacute;t&eacute; &eacute;crit par Kathleen Ellis. Bien que n'&eacute;tant pas &agrave; l'initiative de ce mouvement, la Fondation pour le logiciel libre lui apporte son soutien en le diffusant. Nous esp&eacute;rons que vous ferez de m&ecirc;me.

source: Background
fr: La situation

source: The United States Postal Service has submitted a rule to Congress proposing that all Commercial Mail Recieving Agencies (CMRAs) must, as of June 24, 1999, collect significant personal information from all clients using their services. This would certainly affect anonymous mail transactions, and could put millions of CMRA customers in danger. Any CMRA or CMRA customer who refuses to comply with this regulation would effectively lose their right to recieve mail.
fr: Les services postaux des &Eacute;tats-Unis (<acronym title="United States Postal Services">USPS</acronym>) ont propos&eacute; au Congr&egrave;s un r&egrave;glement selon lequel toutes les agences commerciales de r&eacute;ception de courrier (<acronym title="Commercial Mail Recieving Agencies">CMRA</acronym>) devraient collecter un certain nombre d'informations personnelles concernant leurs clients. Ce r&egrave;glement affecterait probablement les &eacute;changes de courriers anonymes et mettrait des millions de clients de CMRA en danger. Les CMRA ou leur client qui refuseraient de se plier &agrave; ce r&egrave;glement perdraient leur droit &agrave; recevoir du courrier.

source: The proposed regulation (published in the Federal Register on March 25, 1999) requires that CMRAs collect names, home addresses, telephone numbers, and photo ID information about each customer. If the CMRA customer classifies themselves as a business, they must surrender the information on that box holder to anyone who asks for it. CMRAs are widely used by survivors of domestic violence, undercover law enforcement officials, and stalking victims in order to conceal their locations and identities from people who could cause them harm.
fr: Selon ce projet de r&eacute;glementation (publi&eacute;e dans le Federal Register du 25 mars 1999), les CMRA se verraient dans l'obligation de r&eacute;colter le nom, l'adresse physique, le num&eacute;ro de t&eacute;l&eacute;phone et une photo de chaque client. Les entreprises inscrites en tant que clientes devront tenir ces informations publiques. Le service des CMRA est largement utilis&eacute; par les victimes de violence domestique, les agents des forces de l'ordre travaillant sous couverture et les victimes de harc&egrave;lements divers afin de se cacher de ceux qui pourraient leur nuire.

source: The USPS proposal was intended to help cut down on mail fraud, a practice that costs consumers millions of dollars every year. However, experts state that the Postal Service's proposal will not serve as a deterrent to criminals. &ldquo;It will be a simple process for those with financial means to rent homes, apartments, office space, or the executive suites available in most major metropolitan areas&rdquo;, says Postal Watch's website.
fr: combattre la fraude postale qui co&ucirc;te annuellement des millions de dollars &agrave; ses usagers. Les experts s'accordent pourtant sur le fait que la proposition des services postaux n'aurait pas d'effets dissuasifs sur les criminels. Le site du Postal Watch indique qu'il «&nbsp;sera facile de passer outre pour ceux qui poss&egrave;dent les moyens de louer des maisons, des appartements, des espaces de bureaux ou des locaux de direction disponibles dans tous les milieux urbains&nbsp;».

source: Congressman Ron Paul has introduced House Joint Resolution 55, which would effectively revoke the Postal Service's new regulations regarding CMRAs, but the resolution needs your support in order to ensure that this insidious assault on consumer privacy is defeated.
fr: Ron Paul, membre du Congr&egrave;s am&eacute;ricain, a d&eacute;pos&eacute; l'amendement 55 («&nbsp;house joint resolution&nbsp;») pour rejeter cette proposition des services postaux concernant les CMRA. Cet amendement n&eacute;cessite votre soutien pour assurer le rejet de cette insidieuse attaque au droit &agrave; l'anonymat du consommateur.

source: What you can do
fr: Ce que vous pouvez faire

source: Contact your Representative and urge them to co-sponsor HJR 55.
fr: Contactez votre repr&eacute;sentant afin qu'il soutienne &agrave; son tour l'amendement 55.

source: Write or call members of the House Appropriations Committee and inform them about this issue, and urge them to pass the resolution.
fr: &Eacute;crivez ou appelez les membres du&nbsp; House Appropriations Committee, expliquez-leur la situation et demandez-leur d'acc&eacute;l&eacute;rer l'adoption de la r&eacute;solution.

source: Send written comments about this issue to the US Postal Service before July 9, 1999 to:
fr: Envoyez aux services postaux des commentaires &eacute;crits avant le 9 juillet 1999 &agrave;&nbsp;:

source: More information
fr: Plus d'informations

source: For further information, see the following web pages:
fr: Pour plus d'informations, consultez les pages suivantes&nbsp;:

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Luc Fievet.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
