Repository: gitGNU/gnu_www-fr
Catalog: philosophy/protecting.*.po
Languages: fr

source: Help Protect the Rights to Write Both Non-Free and Free Software - GNU Project - Free Software Foundation (FSF)
fr: Aider &agrave; d&eacute;fendre le droit d'&eacute;crire des logiciels libres ou non - GNU Project - Free Software Foundation (FSF)

source: Help Protect the Rights to Write Both Non-Free and Free Software
fr: Aider &agrave; d&eacute;fendre le droit d'&eacute;crire des logiciels libres ou non

source: The right to write both non-free and free software is threatened by <a href="http://progfree.org/Patents/patents.html">software patents</a> and by <a href="http://progfree.org/Copyright/copyright.html">&ldquo;look-and-feel&rdquo; interface copyright lawsuits</a>.
fr: Le droit d'&eacute;crire des logiciels, libres ou non, est menac&eacute; par <a href="http://progfree.org/Patents/patents.html">les brevets sur les logiciels</a> et par <a href="http://progfree.org/Copyright/copyright.html">les proc&egrave;s sur les copyrights des interfaces &laquo;look-and-feel&raquo;</a>.

source: The Free Software Foundation fights these threats in many ways. These include support for and being a member of <a href="http://progfree.org/">League for Programming Freedom</a>.
fr: La Fondation pour le logiciel libre (Free Software Foundation) combat ces menaces de plusieurs fa&ccedil;ons. Cela comprend soutenir et &ecirc;tre membre de la <a href="http://progfree.org/">League for Programming Freedom</a> (Ligue pour la libert&eacute; de programmation).

source: The League is a grass-roots organization of professors, students, business people, programmers, users, and even software companies dedicated to bringing back the freedom to write programs. The League isn't opposed to the legal system that Congress intended&mdash;copyright on individual programs. The League aims to reverse recent changes made by judges in response to special interests.
fr: La ligue est une organisation compos&eacute;e &agrave; la base de professeurs, d'&eacute;tudiants, d'hommes d'affaires, de d&eacute;veloppeurs, d'utilisateurs et m&ecirc;me d'&eacute;diteurs de logiciels mobilis&eacute;s pour r&eacute;instaurer la libert&eacute; de d&eacute;velopper des programmes. La ligue n'est pas oppos&eacute;e au syst&egrave;me juridique que projette le Congr&egrave;s : le copyright sur des programmes individuels. La ligue cherche &agrave; annuler les r&eacute;cents changementsd&eacute;cid&eacute;s par les juges en r&eacute;ponse &agrave; des int&eacute;r&ecirc;ts particuliers.

source: The FSF urges you to join us in fighting these threats by <a href="http://progfree.org/Help/help.html">helping the League</a>.
fr: La FSF vous exhorte &agrave; la rejoindre pour combattre ces menaces. Deux bonnes fa&ccedil;ons de le faire sont de <a href="http://progfree.org/Links/prep.ai.mit.edu/lpf.join">rejoindre</a> et/ou d'<a href="http://progfree.org/Help/help.html">aider</a> la ligue.

source: <strong>The League is not connected with the Free Software Foundation, and is not concerned with the issue of free software.</strong> The FSF supports the League because, like any software developer smaller than Microsoft, it is endangered by software patents, and interface copyrights. You are in danger, too! It would be easy to ignore the problem until you or your employer is sued, but it is more prudent to organize before that happens.
fr: <strong>La ligue ne fait pas partie de la Fondation pour le logiciel libre, et n'est pas concern&eacute;e par le probl&egrave;me du logiciel libre</strong>. La FSF soutient la ligue parce que comme tout d&eacute;veloppeur plus petit que Microsoft, elle est menac&eacute;e par les brevets sur les logiciels et les copyrights sur les interfaces. Vous &ecirc;tes aussi en danger&nbsp;! Ce serait facile d'ignorer le probl&egrave;me jusqu'&agrave; ce que vous ou votre employeur soyez poursuivis en justice mais il est plus prudent de prendre les devants avant que cela n'arrive.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Frédéric Couchet<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
