Repository: gitGNU/gnu_www-fr
Catalog: philosophy/push-copyright-aside.*.po
Languages: fr

source: Science must &ldquo;push copyright aside&rdquo; - GNU Project - Free Software Foundation (FSF)
fr: La science doit &laquo;&nbsp;mettre le droit d'auteur de c&ocirc;t&eacute;&nbsp;&raquo; - GNU Project - Free Software Foundation (FSF)

source: Science must &ldquo;push copyright aside&rdquo;
fr: La science doit &laquo;&nbsp;mettre le droit d'auteur de c&ocirc;t&eacute;&nbsp;&raquo;

source: by <strong>Richard M. Stallman</strong>
fr: par <strong>Richard M. Stallman</strong>

source: <em>This article appeared in <em>Nature Webdebates</em> in 2001</em>
fr: <em>Cet article est paru dans <em>Nature Webdebates</em> en 2001</em>

source: It should be a truism that the scientific literature exists to disseminate scientific knowledge, and that scientific journals exist to facilitate the process. It therefore follows that rules for use of the scientific literature should be designed to help achieve that goal.
fr: Il devrait &ecirc;tre &eacute;vident pour tout un chacun que la litt&eacute;rature scientifique est faite pour diffuser les connaissances scientifiques, et que les revues scientifiques existent pour faciliter ce travail. Par cons&eacute;quent les r&egrave;gles d'utilisation de la litt&eacute;rature scientifique devraient &ecirc;tre de nature &agrave; aider &agrave; atteindre cet objectif.

source: The rules we have now, known as copyright, were established in the age of the printing press, an inherently centralized method of mass-production copying. In a print environment, copyright on journal articles restricted only journal publishers&mdash;requiring them to obtain permission to publish an article&mdash;and would-be plagiarists. It helped journals to operate and disseminate knowledge, without interfering with the useful work of scientists or students, either as writers or readers of articles. These rules fit that system well.
fr: Les r&egrave;gles actuelles, appel&eacute;es droit d'auteur, ont &eacute;t&eacute; &eacute;tablies &agrave; l'&eacute;poque de la presse &eacute;crite, une m&eacute;thode de publication de masse in&eacute;vitablement centralis&eacute;e. Dans un contexte de presse &eacute;crite, le droit d'auteur sur les articles de revues n'&eacute;tait une contrainte que pour les &eacute;diteurs &mdash; les obligeant &agrave; obtenir une autorisation avant de publier un article &mdash; et les plagiaires potentiels. Elle aidait les revues &agrave; fonctionner et &agrave; faire circuler les connaissances, sans g&ecirc;ner le travail utile des scientifiques ou des &eacute;tudiants, qu'ils soient lecteurs ou auteurs d'articles. Ces r&egrave;gles conviennent bien &agrave; ce syst&egrave;me.

source: The modern technology for scientific publishing, however, is the World Wide Web. What rules would best ensure the maximum dissemination of scientific articles, and knowledge, on the Web? Articles should be distributed in nonproprietary formats, with open access for all. And everyone should have the right to &ldquo;mirror&rdquo; articles&mdash;that is, to republish them verbatim with proper attribution.
fr: Mais la technique actuelle de publication scientifique est le Web. Quelles sont les r&egrave;gles susceptibles d'assurer une diffusion maximale des articles et connaissances scientifiques sur le Web&nbsp;? Il faudrait que les articles soient diffus&eacute;s sous des formats non-propri&eacute;taires, en acc&egrave;s libre pour tous. Et chacun devrait avoir le droit de placer les articles sur un site &laquo;&nbsp;miroir&nbsp;&raquo;, c'est-&agrave;-dire de les republier int&eacute;gralement en indiquant correctement la source.

source: These rules should apply to past as well as future articles, when they are distributed in electronic form. But there is no crucial need to change the present copyright system as it applies to paper publication of journals because the problem is not in that domain.
fr: Ces r&egrave;gles devraient s'appliquer aussi bien aux anciens articles qu'aux nouveaux, lorsqu'ils sont diffus&eacute;s sous forme &eacute;lectronique. Mais il n'y a pas de n&eacute;cessit&eacute; vitale &agrave; modifier le syst&egrave;me actuel de droits d'auteur en ce qui concerne la publication des revues sur papier parce qu'il n'y a pas de probl&egrave;me dans ce domaine.

source: Unfortunately, it seems that not everyone agrees with the truisms that began this article. Many journal publishers appear to believe that the purpose of scientific literature is to enable them to publish journals so as to collect subscriptions from scientists and students. Such thinking is known as &ldquo;confusion of the means with the ends&rdquo;.
fr: Malheureusement, il semble que tout le monde ne soit pas d'accord avec les &eacute;vidences exprim&eacute;es au d&eacute;but de cet article. De nombreux &eacute;diteurs de revues semblent croire que l'objectif de la litt&eacute;rature scientifique est de leur permettre de publier des revues afin de recueillir des abonnements de scientifiques et d'&eacute;tudiants. Partager un tel point de vue c'est &laquo;&nbsp;confondre la fin et les moyens&nbsp;&raquo;.

source: Their approach has been to restrict access even to read the scientific literature to those who can and will pay for it. They use copyright law, which is still in force despite its inappropriateness for computer networks, as an excuse to stop scientists from choosing new rules.
fr: Leur approche consiste &agrave; restreindre l'acc&egrave;s &agrave; la simple consultation de la litt&eacute;rature scientifique &agrave; ceux qui veulent et peuvent payer pour cela. Ils utilisent le droit d'auteur, qui est toujours en vigueur malgr&eacute; son inadaptation aux r&eacute;seaux informatiques, comme excuse pour dissuader les scientifiques de choisir de nouvelles r&egrave;gles.

source: For the sake of scientific cooperation and humanity's future, we must reject that approach at its root&mdash;not merely the obstructive systems that have been instituted, but the mistaken priorities that inspired them.
fr: Dans l'int&eacute;r&ecirc;t de la coop&eacute;ration scientifique et de l'avenir de l'humanit&eacute;, nous devons refuser cette approche &agrave; la base &mdash; non seulement les syst&egrave;mes d'obstruction qui ont &eacute;t&eacute; mis en place, mais aussi les mauvaises priorit&eacute;s qui les ont inspir&eacute;s.

source: Journal publishers sometimes claim that online access requires expensive high-powered server machines, and that they must charge access fees to pay for these servers. This &ldquo;problem&rdquo; is a consequence of its own &ldquo;solution.&rdquo; Give everyone the freedom to mirror, and libraries around the world will set up mirror sites to meet the demand. This decentralized solution will reduce network bandwidth needs and provide faster access, all the while protecting the scholarly record against accidental loss.
fr: Les &eacute;diteurs de revues affirment parfois que la mise &agrave; disposition en ligne n&eacute;cessite des serveurs puissants, et qu'ils sont oblig&eacute;s de faire payer l'acc&egrave;s pour financer ces serveurs. Ce &laquo;&nbsp;probl&egrave;me&nbsp;&raquo; est une cons&eacute;quence de sa propre &laquo;&nbsp;solution&nbsp;&raquo;. Que l'on donne &agrave; chacun la libert&eacute; de publier sur un site miroir, et les biblioth&egrave;ques du monde entier vont cr&eacute;er des sites miroirs pour faire face &agrave; la demande. Cette solution d&eacute;centralis&eacute;e r&eacute;duira la bande passante du r&eacute;seau et assurera un acc&egrave;s plus rapide, tout en prot&eacute;geant les donn&eacute;es universitaires contre une perte accidentelle.

source: Publishers also argue that paying the editors requires charging for access. Let us accept the assumption that editors must be paid; this tail need not wag the dog. The cost of editing for a typical paper is between 1% and 3% of the cost of funding the research to produce it. Such a small percentage of the cost can hardly justify obstructing the use of the results.
fr: Les &eacute;diteurs disent aussi qu'il faut un acc&egrave;s payant pour r&eacute;mun&eacute;rer les r&eacute;dacteurs. Admettons qu'il faille payer les r&eacute;dacteurs; c'est l'arbre qui cache la for&ecirc;t. Les frais de r&eacute;daction pour un article moyen varient entre 1% et 3% du co&ucirc;t n&eacute;cessaire &agrave; la recherche qui l'a suscit&eacute;. Un si petit pourcentage ne justifie pas que l'on fasse obstruction &agrave; l'utilisation des r&eacute;sultats.

source: Instead, the cost of editing could be recovered, for example, through page charges to the authors, who can pass these on to the research sponsors. The sponsors should not mind, given that they currently pay for publication in a more cumbersome way, through overhead fees for the university library's subscription to the journal. By changing the economic model to charge editing costs to the research sponsors, we can eliminate the apparent need to restrict access. The occasional author who is not affiliated with an institution or company, and who has no research sponsor, could be exempted from page charges, with costs levied on institution-based authors.
fr: Au lieu de cela, les frais de r&eacute;daction pourraient &ecirc;tre couverts, par exemple, par des frais &agrave; la page pour les auteurs, qui pourraient les faire financer par les commanditaires de la recherche. Ces commanditaires ne devraient pas s'y opposer dans la mesure o&ugrave; ils financent d&eacute;j&agrave; lourdement cette publication par l'interm&eacute;diaire des frais que constitue l'abonnement de la biblioth&egrave;que universitaire &agrave; la revue. En changeant le mod&egrave;le &eacute;conomique (transfert des frais de publication vers les commanditaires de la recherche), on peut &eacute;liminer le besoin apparent de restreindre la consultation. L'auteur occasionnel qui n'est pas affili&eacute; &agrave; une institution ou une entreprise, et qui n'a pas de commanditaire pour sa recherche, pourrait &ecirc;tre dispens&eacute; de frais de page, qui seraient r&eacute;percut&eacute;s sur les auteurs soutenus par des institutions.

source: Another justification for access fees to online publications is to fund conversion of the print archives of a journal into online form. That work needs to be done, but we should seek alternative ways of funding it that do not involve obstructing access to the result. The work itself will not be any more difficult, or cost any more. It is self-defeating to digitize the archives and waste the results by restricting access.
fr: Une autre justification pour faire payer l'acc&egrave;s aux publications en ligne c'est de dire qu'il faut financer la conversion des archives imprim&eacute;es au format &eacute;lectronique. Ce travail doit &ecirc;tre fait, mais il nous faut trouver des alternatives qui ne remettent pas en cause le libre acc&egrave;s au r&eacute;sultat. Le travail lui-m&ecirc;me ne sera pas plus difficile, ni plus co&ucirc;teux. Il est contre-productif de num&eacute;riser des archives et de g&acirc;cher le r&eacute;sultat de ce travail en en restreignant l'acc&egrave;s.

source: The US Constitution says that copyright exists &ldquo;to promote the progress of science&rdquo;. When copyright impedes the progress of science, science must push copyright out of the way.
fr: La Constitution des &Eacute;tats-Unis dit que le droit d'auteur existe &laquo;&nbsp;pour promouvoir les progr&egrave;s de la science&nbsp;&raquo;. Quand les droits d'auteur freinent les progr&egrave;s de la science, la science doit mettre le droit d'auteur de c&ocirc;t&eacute;.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2001 Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2001 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Bruno Menan.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
