Repository: gitGNU/gnu_www-fr
Catalog: philosophy/reevaluating-copyright.*.po
Languages: fr

source: Reevaluating Copyright: The Public Must Prevail - GNU Project - Free Software Foundation (FSF)
fr: Dans une r&eacute;&eacute;valuation du copyright, le public doit pr&eacute;valoir - GNU Project - Free Software Foundation (FSF)

source: Reevaluating Copyright: The Public Must Prevail
fr: Dans une r&eacute;&eacute;valuation du copyright, le public doit pr&eacute;valoir

source: Reevaluating Copyright: The Public Must Prevail [Published in Oregon Law Review, Spring 1996] Richard Stallman
fr: Dans une réévaluation du copyright, le public doit prévaloir Paru dans l'Oregon Law Review, printemps 1996] Richard Stallman

source: The legal world is aware that digital information technology poses &ldquo;problems for copyright,&rdquo; but has not traced these problems to their root cause: a fundamental conflict between publishers of copyrighted works and the users of these works. The publishers, understanding their own interest, have set forth a proposal through the Clinton Administration to fix the &ldquo;problems&rdquo; by deciding the conflict in their favor. This proposal, the Lehman White Paper <a href="#ft2">[2]</a>, was the principal focus of the &ldquo;Innovation and the Information Environment&rdquo; conference at the University of Oregon (November 1995).
fr: Le monde du droit est au courant que la technologie de l'information num&eacute;rique pose &laquo;&nbsp;des probl&egrave;mes de copyright&nbsp;&raquo;, mais n'est pas remont&eacute; &agrave; la source de ces probl&egrave;mes&nbsp;: un conflit fondamental entre les &eacute;diteurs de travaux sous copyright et les utilisateurs de ces travaux. Les &eacute;diteurs, comprenant o&ugrave; &eacute;taient leurs int&eacute;r&ecirc;ts propres, ont d&eacute;pos&eacute; dans la foul&eacute;e une proposition, via l'administration Clinton, pour stopper ces &laquo;&nbsp;probl&egrave;mes&nbsp;&raquo; en faisant pencher le conflit en leur faveur. Cette proposition, la Lehman White Paper <a href="#ft2">[2]</a>, fut le th&egrave;me principal de la conf&eacute;rence &laquo;&nbsp;Innovation and the Information Environment&nbsp;&raquo; &agrave; l'Universit&eacute; de l'Or&eacute;gon (novembre 1995).

source: John Perry Barlow <a href="#ft3">[3]</a>, the keynote speaker, began the conference by telling us how the Greatful Dead recognized and dealt with this conflict. They decided it would be wrong to interfere with copying of their performances on tapes, or with distribution on the Internet, but saw nothing wrong in enforcing copyright for CD recordings of their music.
fr: John Perry Barlow <a href="#ft3">[3]</a>, l'orateur principal, a commenc&eacute; la conf&eacute;rence en nous rapportant comment le groupe musical Grateful Dead reconnaissait et g&eacute;rait ce conflit. Ses membres ont d&eacute;cid&eacute; qu'il serait mauvais d'intervenir au sujet des copies de leurs morceaux sur cassettes ou sur l'Internet, mais ne voient rien de mal &agrave; faire appliquer le copyright sur les enregistrements CD de leur musique.

source: Barlow did not analyze the reasons for treating these media differently, and later Gary Glisson <a href="#ft4">[4]</a> criticized Barlow's idea that the Internet is inexplicably unique and unlike anything else in the world. He argued that we should be able to determine the implications of the Internet for copyright policy by the same kind of analysis that we apply to other technologies. This paper attempts to do just that.
fr: Barlow n'a pas analys&eacute; les raisons pour lesquelles ce support est trait&eacute; diff&eacute;remment, et, plus tard, Gary Glisson <a href="#ft4">[4]</a> a critiqu&eacute; l'id&eacute;e de Barlow que l'Internet est inexplicablement unique et comparable &agrave; rien d'autre au monde. Et d'argumenter que nous devrions &ecirc;tre capables de d&eacute;terminer les implications de l'Internet dans la politique du copyright, avec les m&ecirc;mes m&eacute;thodes d'analyse que nous appliquons aux autres technologies. C'est ce que tente simplement de faire cet article.

source: Barlow suggested that our intuitions based on physical objects as property do not transfer to information as property because information is &ldquo;abstract.&rdquo; As Steven Winter <a href="#ft5">[5]</a> remarked, abstract property has existed for centuries. Shares in a company, commodity futures, and even paper money, are forms of property that are more or less abstract. Barlow and others who argue that information should be free do not reject these other kinds of abstract property. Clearly, the crucial difference between information and acceptable kinds of property is not abstractness per se. So what is it? I propose a simple and practical explanation.
fr: Barlow sugg&eacute;rait qu'on ne peut transf&eacute;rer nos intuitions &mdash; bas&eacute;es sur le fait que les biens sont des objets mat&eacute;riels &mdash; sur celles que l'information est un bien, car l'information est &laquo;&nbsp;abstraite&nbsp;&raquo;. Comme Steven Winter <a href= "#ft5">[5]</a> l'a remarqu&eacute;, la propri&eacute;t&eacute;, le bien abstrait, existe depuis des si&egrave;cles. Les parts dans une soci&eacute;t&eacute;, les op&eacute;rations &agrave; terme et m&ecirc;me la monnaie papier sont des formes de biens plus ou moins abstraits. Barlow et d'autres, qui discutent sur le fait que l'information devrait &ecirc;tre libre, ne rejettent pas ces autres formes de propri&eacute;t&eacute; abstraite. En clair, la diff&eacute;rence cruciale entre information et formes acceptables de propri&eacute;t&eacute; n'est pas une donn&eacute;e abstraite en soi. Qu'est-ce donc&nbsp;? Je propose une explication simple et pratique.

source: United States copyright law considers copyright a bargain between the public and &ldquo;authors&rdquo; (although in practice, usually publishers take over the authors' part of the bargain). The public trades certain freedoms in exchange for more published works to enjoy. Until the White Paper, our government had never proposed that the public should trade <b>all</b> of its freedom to use published works. Copyright involves giving up specific freedoms and retaining others. This means that there are many alternative bargains that the public could offer to publishers. So which bargain is the best one for the public? Which freedoms are worth while for the public to trade, and for what length of time? The answers depend on two things: how much additional publication the public will get for trading a given freedom, and how much the public benefits from keeping that freedom.
fr: Aux &Eacute;tats-Unis, la loi sur le copyright consid&egrave;re ce dernier comme un march&eacute; pass&eacute; entre le public et les &laquo;&nbsp;auteurs&nbsp;&raquo; (m&ecirc;me si dans la pratique, ce sont en g&eacute;n&eacute;ral les &eacute;diteurs qui raflent les parts des auteurs). Le public n&eacute;gocie certaines libert&eacute;s en &eacute;change de profiter de plus en plus de publications. Jusqu'au White Paper, notre gouvernement n'a jamais propos&eacute; au public de n&eacute;gocier <em>toutes</em> ses libert&eacute;s pour utiliser les travaux publi&eacute;s. Le copyright implique un accroissement de certaines libert&eacute;s et la diminution d'autres. Ce qui signifie qu'il existe de multiples alternatives de n&eacute;gociations que le public pourrait mettre en &oelig;uvre face aux &eacute;diteurs. Alors, quelle est la meilleure affaire pour le public&nbsp;? Quelles sont les libert&eacute;s qui valent la peine pour le public d'&ecirc;tre n&eacute;goci&eacute;es et pour combien de temps&nbsp;? Les r&eacute;ponses d&eacute;pendent de deux choses&nbsp;: du nombre de publications suppl&eacute;mentaires que le public obtiendra en n&eacute;gociant une libert&eacute; donn&eacute;e et dub&eacute;n&eacute;fice du public en gardant cette libert&eacute;.

source: This shows why making <a href="#later-1">intellectual property decisions</a> by analogy to physical object property, or even to older intellectual property policies, is a mistake. Winter argued persuasively that it is possible to make such analogies, to stretch our old concepts and apply them to new decisions <a href= "#ft6">[6]</a>. Surely this will reach some answer&mdash;but not a good answer. Analogy is not a useful way of deciding what to buy or at what price.
fr: Ceci montre pourquoi c'est une erreur de faire une analogie entre la <a href="#later-1">propri&eacute;t&eacute; intellectuelle</a> et la propri&eacute;t&eacute; mat&eacute;rielle ou m&ecirc;me la vieille politique de la propri&eacute;t&eacute; intellectuelle. Winter avait des arguments convaincants pour dire qu'il est possible de faire de telles analogies, de d&eacute;poussi&eacute;rer nos vieux concepts et de les appliquer &agrave; de nouvelles d&eacute;cisions<a href="#ft6">[6]</a>. Cela donnera s&ucirc;rement des r&eacute;ponses, mais pas les bonnes. L'analogie n'est pas une mani&egrave;re utile pour d&eacute;cider ce qu'il faut acheter et &agrave; quel prix.

source: For example, we do not decide whether to build a highway in New York City by analogy with a previous decision about a proposed highway in Iowa. In each highway construction decision, the same factors apply (cost, amount of traffic, taking of land or houses); if we made highway decisions by analogy to previous highway decisions, we would either build every proposed highway or none of them. Instead we judge each proposed highway based on the pros and cons, whose magnitudes vary from case to case. In copyright issues, too, we must weigh the cost and benefits for today's situation and today's media, not as they have applied to other media in the past.
fr: Pour prendre un exemple, on ne d&eacute;cide pas de construire une autoroute dans la ville de New York par analogie &agrave; une d&eacute;cision ant&eacute;rieure d'autoroute dans l'Iowa. Dans chacun des cas de d&eacute;cision de construction, s'appliquent les m&ecirc;mes facteurs (le co&ucirc;t, la quantit&eacute; de trafic, l'environnement)&nbsp;; prendre la d&eacute;cision de construire une autoroute par analogie &agrave; ce qui avait &eacute;t&eacute; propos&eacute; revient &agrave; constuire toutes les autoroutes propos&eacute;es, ou aucune. Au lieu de cela, nous jugeons chaque proposition de construction d'autoroute, en fonction du pour et du contre, le rapport en faveur de l'un ou l'autre variant au cas par cas. De m&ecirc;me, dans le cas du copyright, nous devons peser les co&ucirc;ts et b&eacute;n&eacute;fices s'appliquant dans la situation actuelle et sur des supports actuels, non pas comme ils s'appliquaient &agrave; d'autres supports dans le pass&eacute;s.

source: This also shows why Laurence Tribe's principle, that rights concerning speech should not depend on the choice of medium<a href="#ft7">[7]</a>, is not applicable to copyright decisions. Copyright is a bargain with the public, not a natural right. Copyright policy issues are about which bargains benefit the public, not about what rights publishers or readers are entitled to.
fr: Ce qui montre aussi pourquoi le principe de Laurence Tribe, (les droits concernant le discours ne devraient pas d&eacute;pendre du choix du support) <a href="#ft7">[7]</a>, ne peut s'appliquer aux d&eacute;cisions sur le copyright. Le copyright est un march&eacute; pass&eacute; avec le public, pas un droit naturel. Les questions de la politique du copyright traitent des n&eacute;gociations les plus b&eacute;n&eacute;fiques pour le public, pas des droits dont seraient investis les &eacute;diteurs ou les lecteurs.

source: The copyright system developed along with the printing press. In the age of the printing press, it was unfeasible for an ordinary reader to copy a book. Copying a book required a printing press, and ordinary readers did not have one. What's more, copying in this way was absurdly expensive unless many copies were made&mdash;which means, in effect, that only a publisher could copy a book economically.
fr: Le syst&egrave;me du copyright s'est d&eacute;velopp&eacute; parall&egrave;lement &agrave; l'industrie de l'imprimerie. Aux temps de l'offset, il &eacute;tait impossible pour un lecteur de copier un livre. Cela demandait des rotatives, ce qu'un lecteur lambda n'avait pas. De plus, de copier ainsi revenait absurdement cher, si les copies ne se faisaient pas en nombre suffisant, ce qui veut dire, dans les faits, que seul l'&eacute;diteur pouvait copier &eacute;conomiquement un livre.

source: So when the public traded to publishers the freedom to copy books, they were selling something which they <b>could not use</b>. Trading something you cannot use for something useful and helpful is always good deal. Therefore, copyright was uncontroversial in the age of the printing press, precisely because it did not restrict anything the reading public might commonly do.
fr: Alors, quand le public a n&eacute;goci&eacute;, aupr&egrave;s des &eacute;diteurs, la libert&eacute; de copier des livres, on leur a vendu quelque chose qu'ils <em>ne pouvaient utiliser</em>. Vendre une chose qui ne vous est ni utile ni d'un grand secours, c'est toujours une bonne affaire. C'est pourquoi le copyright, aux temps de la presse papier, n'a jamais &eacute;t&eacute; controvers&eacute;, pr&eacute;cis&eacute;ment parce qu'il ne restreignait en rien ce que les lecteurs seraient commun&eacute;ment amen&eacute;s &agrave; faire.

source: But the age of the printing press is gradually ending. The xerox machine and the audio and video tape began the change; digital information technology brings it to fruition. These advances make it possible for ordinary people, not just publishers with specialized equipment, to copy. And they do!
fr: Mais ces temps arrivent &agrave; leur fin. Les photocopieurs, les cassettes audio et vid&eacute;o ont initi&eacute; le changement&nbsp;; la technologie de l'information num&eacute;rique l'a accompli. Ces avanc&eacute;es ont permis, pas seulement aux &eacute;diteurs poss&eacute;dant un mat&eacute;riel sp&eacute;cialis&eacute;, mais &agrave; tout un chacun de copier. Et c'est ce qui se fait&nbsp;!

source: Once copying is a useful and practical activity for ordinary people, they are no longer so willing to give up the freedom to do it. They want to keep this freedom and exercise it instead of trading it away. The copyright bargain that we have is no longer a good deal for the public, and it is time to revise it&mdash;time for the law to recognize the public benefit that comes from making and sharing copies.
fr: &Agrave; partir du moment o&ugrave; la copie est un acte utile et pratique, pour l'homme de la rue, les gens ne sont plus aussi d&eacute;sireux de laisser de c&ocirc;t&eacute; leur libert&eacute; de la pratiquer. Ils veulent garder cette libert&eacute; et l'exercer, plut&ocirc;t que de la n&eacute;gocier. La n&eacute;gociation du copyright que nous avons n'est plus une bonne affaire pour le public et il est temps de le r&eacute;viser&nbsp;; il est temps que la loi reconnaisse le b&eacute;n&eacute;fice public n&eacute; de la copie et du partage des copies.

source: With this analysis, we see why rejection of the old copyright bargain is not based on supposing that the Internet is ineffably unique. The Internet is relevant because it facilitates copying and sharing of writings by ordinary readers. The easier it is to copy and share, the more useful it becomes, and the more copyright as it stands now becomes a bad deal.
fr: &Agrave; travers cette analyse, nous voyons pourquoi le rejet du vieux contrat du copyright n'est pas bas&eacute; sur la supposition que l'Internet est ineffablement unique. L'Internet est pertinent de par sa facilit&eacute; &agrave; permettre, &agrave; tout le monde, la copie et le partage. Plus il est facile de copier et de partager, plus cela devient utile, et plus le copyright, tel qu'il est actuellement, devient une mauvaise affaire.

source: This analysis also explains why it makes sense for the Grateful Dead to insist on copyright for CD manufacturing but not for individual copying. CD production works like the printing press; it is not feasible today for ordinary people, even computer owners, to copy a CD into another CD. Thus, copyright for publishing CDs of music remains painless for music listeners, just as all copyright was painless in the age of the printing press. To restrict copying the same music onto a digital audio tape does hurt the listeners, however, and they are entitled to reject this restriction. (1999 note: the practical situation for CDs has changed, in that many ordinary computer users can now copy CDs. This means that we should now consider CDs more like tapes. 2007 clarification: notwithstanding the improvement in CD technology, it still makes sense to apply copyright to commercial distribution while letting individuals copy freely.)
fr: Mais cette analyse explique aussi l'int&eacute;r&ecirc;t qu'ont eu les Grateful Dead d'insister sur le copyright appliqu&eacute; aux CD plut&ocirc;t qu'&agrave; la copie individuelle. La production de CD fonctionne de la m&ecirc;me fa&ccedil;on qu'une imprimerie&nbsp;; ce n'est pas faisable pour les gens, m&ecirc;me ceux qui ont un ordinateur, de copier un CD vers un autre CD. C'est pourquoi les copyrights sur les CD industriels sont moins douloureux pour les m&eacute;lomanes, tout comme les copyrights l'&eacute;taient aux temps de la presse papier. Cependant, restreindre la copie du m&ecirc;me morceau sur un support digital choque l'amateur de musique et ce dernier est enclin &agrave; rejeter ces restrictions. (note ajout&eacute;e en 1999&nbsp;: la situation des CD a chang&eacute;, dans le sens que beaucoup de possesseurs d'ordinateurs peuvent maintenant copier des CD. Nous devons donc consid&eacute;rer les CD comme des cassettes. Pr&eacute;cision de 2007&nbsp;: malgr&eacute; les progr&egrave;s dans la technologie des CD, il est toujours sens&eacute; d'appliquer le copyright &agrave; une distribution commerciale tout en autorisant les particuliers &agrave; copier librement).

source: We can also see why the abstractness of <a href="#later-1">intellectual property</a> is not the crucial factor. Other forms of abstract property represent shares of something. Copying any kind of share is intrinsically a zero-sum activity; the person who copies benefits only by taking wealth away from everyone else. Copying a dollar bill in a color copier is effectively equivalent to shaving a small fraction off of every other dollar and adding these fractions together to make one dollar. Naturally, we consider this wrong.
fr: Nous pouvons aussi nous rendre compte que le c&ocirc;t&eacute; abstrait de la <a href="#later-1">propri&eacute;t&eacute; intellectuelle</a> n'est pas un facteur crucial. D'autres aspects des biens abstraits se pr&eacute;sentent sous la forme d'un partage de quelque chose. Copier quelle que partie que ce soit d'un produit &eacute;chang&eacute; est une activit&eacute; intrins&egrave;que de valeur z&eacute;ro ; la personne qui copie retire du b&eacute;n&eacute;fice uniquement au d&eacute;triment de quelqu'un d'autre. Copier un billet de banque dans un copieur couleur est en fait l'&eacute;quivalent de prendre une petite partie de chaque autre billet et de r&eacute;unir ces morceaux pour un faire un billet entier. Naturellement, nous pensons que cela n'est pas bon.

source: By contrast, copying useful, enlightening or entertaining information for a friend makes the world happier and better off; it benefits the friend, and inherently hurts no one. It is a constructive activity that strengthens social bonds.
fr: &Agrave; l'oppos&eacute;, copier , mettre en valeur ou rendre ludique une information pour un ami rend le monde plus heureux et meilleur&nbsp;; la copie utile profite &agrave; l'ami et ne blesse personne dans son sillage. C'est une activit&eacute; constructive qui resserre les liens sociaux.

source: Some readers may question this statement because they know publishers claim that illegal copying causes them &ldquo;loss.&rdquo; This claim is mostly inaccurate and partly misleading. More importantly, it is begging the question.
fr: Quelques lecteurs pourraient remettre en question cette affirmation, car ils connaissent des &eacute;diteurs pr&eacute;tendant que les copies ill&eacute;gales leur portent &laquo;&nbsp;pr&eacute;judice&nbsp;&raquo;. Cette revendication est pratiquement inexacte et partiellement trompeuse. Et surtout, c'est une p&eacute;tition de principe.

source: The claim is mostly inaccurate because it presupposes that the friend would otherwise have bought a copy from the publisher. That is occasionally true, but more often false; and when it is false, the claimed loss does not occur.
fr: La revendication est pratiquement inexacte, car elle pr&eacute;suppose que l'ami aurait, dans le cas contraire, achet&eacute; une copie &agrave; l'&eacute;diteur. Ce qui peutoccasionnellement &ecirc;tre vrai, mais la plupart du temps, c'est faux&nbsp;; et dans ce cas, il n'y a pas de pr&eacute;judice.

source: The claim is partly misleading because the word &ldquo;loss&rdquo; suggests events of a very different nature&mdash;events in which something they have is taken away from them. For example, if the bookstore's stock of books were burned, or if the money in the register got torn up, that would really be a &ldquo;loss.&rdquo; We generally agree it is wrong to do these things to other people.
fr: La revendication est partiellement trompeuse parce que le mot &laquo;&nbsp;pr&eacute;judice&nbsp;&raquo; sugg&egrave;re des &eacute;v&eacute;nements de natures diverses, &eacute;v&eacute;nements dans lesquels ils poss&egrave;dent quelque chose et qui dispara&icirc;t. Par exemple, si le stock de livres d'une librairie avait br&ucirc;l&eacute; ousi l'argent dans la caisse avait &eacute;t&eacute; vol&eacute;, cela, oui, serait un manque, un pr&eacute;judice. Nous sommes en g&eacute;n&eacute;ral d'accord pour dire que ce n'est pas bien de faire cela aux autres.

source: But when your friend avoids the need to buy a copy of a book, the bookstore and the publisher do not lose anything they had. A more fitting description would be that the bookstore and publisher get less income than they might have got. The same consequence can result if your friend decides to play bridge instead of reading a book. In a free market system, no business is entitled to cry &ldquo;foul&rdquo; just because a potential customer chooses not to deal with them.
fr: Mais quand votre ami passe outre le besoin d'acheter la copie d'un livre, le libraire et l'&eacute;diteur ne perdent rien de ce qu'ils ont. Pour &ecirc;tre plus pr&eacute;cis, disons que le libraire et l'&eacute;diteur recevront moins d'argent qu'ils auraient pu avoir. Si votre ami d&eacute;cide de jouer au bridge plut&ocirc;t que de bouquiner, la cons&eacute;quence sera la m&ecirc;me. Dans un syst&egrave;me de march&eacute; libre, aucun commerce n'est habilit&eacute; &agrave; crier &agrave; l'injustice simplement parce qu'un consommateur potentiel a choisi de ne pas faire affaire avec.
