Repository: gitGNU/gnu_www-fr
Catalog: philosophy/reevaluating-copyright.*.po
Languages: fr

source: The claim is begging the question because the idea of &ldquo;loss&rdquo; is based on the assumption that the publisher &ldquo;should have&rdquo; got paid. That is based on the assumption that copyright exists and prohibits individual copying. But that is just the issue at hand: what should copyright cover? If the public decides it can share copies, then the publisher is not entitled to expect to be paid for each copy, and so cannot claim there is a &ldquo;loss&rdquo; when it is not.
fr: Il s'agit d'une p&eacute;tition de principe parce que l'id&eacute;e de pr&eacute;judice se base sur la supposition que l'&eacute;diteur &laquo;&nbsp;aurait d&ucirc;&nbsp;&raquo; &ecirc;tre pay&eacute;. Ceci est bas&eacute; sur la pr&eacute;tention que le copyright existe et qu'il interdit la copie individuelle. Mais le litige est bien l&agrave;&nbsp;: que doit couvrir le copyright&nbsp;? Si le public d&eacute;cide de partager des copies, alors l'&eacute;diteur n'est pas tenu d'esp&eacute;rer une r&eacute;mun&eacute;ration sur chaque copie et donc ne peut revendiquer un &laquo;&nbsp;pr&eacute;judice&nbsp;&raquo;.

source: In other words, the &ldquo;loss&rdquo; comes from the copyright system; it is not an inherent part of copying. Copying in itself hurts no one.
fr: En d'autres termes, le pr&eacute;judice vient du syst&egrave;me du copyright&nbsp;; il ne s'agit pas d'une part inh&eacute;rente de la copie. En soi, copier ne blesse personne.

source: The most widely opposed provision of the White Paper is the system of collective responsibility, whereby a computer owner is required to monitor and control the activities of all users, on pain of being punished for actions in which he was not a participant but merely failed to actively prevent. Tim Sloan <a href="#ft8">[8]</a> pointed out that this gives copyright owners a privileged status not accorded to anyone else who might claim to be damaged by a computer user; for example, no one proposes to punish the computer owner if he fails actively to prevent a user from defaming someone. It is natural for a government to turn to collective responsibility for enforcing a law that many citizens do not believe in obeying. The more digital technology helps citizens share information, the more the government will need draconian methods to enforce copyright against ordinary citizens.
fr: La mesure d'opposition la plus r&eacute;pandue contre le White Paper est le syst&egrave;me de la responsabilit&eacute; collective, o&ugrave; le propri&eacute;taire d'un ordinateur est requis de surveiller et contr&ocirc;ler les activit&eacute;s de tous les usagers, sous peine d'&ecirc;tre puni pour des actions dans lesquelles il n'a aucune part, mais pour lesquelles il a simplement &eacute;chou&eacute; en ne les em&ecirc;chant pas activement. Tim Sloan <a href="#ft8">[8]</a> a mis en &eacute;vidence que cela donne aux d&eacute;tenteurs de copyright un statut privil&eacute;gi&eacute;, qui n'est accord&eacute; &agrave; personne d'autre qui se plaindrait d'un dommage caus&eacute; par unutilisateur d'ordinateur&nbsp;; par exemple, personne ne propose de punir le propri&eacute;taire d'un ordinateur s'il a n'a pu emp&ecirc;cher un utilisateur de diffamation. Pour ungouvernement, il est naturel de se tourner vers la responsabilit&eacute; collective afin de faire appliquer une loi en laquelle beaucoup de citoyens ne croient pas. Plus la technologie du num&eacute;rique aidera les citoyens, plus le gouvernement aura besoin de m&eacute;thodes draconiennes pour faire appliquer le copyright contre les citoyens ordinaires.

source: When the United States Constitution was drafted, the idea that authors were entitled to a copyright monopoly was proposed&mdash;and rejected <a href="#ft9">[9]</a>. Instead, the founders of our country adopted a different idea of copyright, one which places the public first <a href="#ft10">[10]</a>. Copyright in the United States is supposed to exist for the sake of users; benefits for publishers and even for authors are not given for the sake of those parties, but only as an inducement to change their behavior. As the Supreme Court said in Fox Film Corp. v. Doyal: &ldquo;The sole interest of the United States and the primary object in conferring the [copyright] monopoly lie in the general benefits derived by the public from the labors of authors.&rdquo; <a href="#ft11">[11]</a>
fr: Quand la Constitution des &Eacute;tats-Unis a &eacute;t&eacute; esquiss&eacute;e, il a &eacute;t&eacute; fait une proposition selon laquelle les auteurs auraient droit &agrave; un monopole sur le copyright, proposition qui a &eacute;t&eacute; rejet&eacute;e <a href="#ft9">[9]</a>. Ce que les fondateurs de notre pays ont adopt&eacute;, &agrave; la place, c'est une id&eacute;e diff&eacute;rente du copyright, qui place le public en premier <a href="#ft10">[10]</a>. Aux &Eacute;tats-Unis, le copyright est suppos&eacute; exister pour le bien des utilisateurs&nbsp;; les b&eacute;n&eacute;fices pour les &eacute;diteurs ou m&ecirc;me les auteurs ne sont pas accord&eacute;s pour leurs beaux yeux, mais sont vus comme une incitation &agrave; changer de comportement. Ainsi que l'a prononc&eacute; la Cour Supr&ecirc;me lors de la confrontation entre Fox Film Corp. et Doyal&nbsp;: &laquo;&nbsp;L'int&eacute;r&ecirc;t exclusif des &Eacute;tats-Unis et l'objectif premier de conf&eacute;rer un monopole au copyright, r&eacute;side dans les b&eacute;n&eacute;fices g&eacute;n&eacute;raux dont tire profit le public &agrave; partir du travail des auteurs&nbsp;&raquo;.<a href="#ft11">[11]</a>

source: Under the Constitution's view of copyright, if the public prefers to be able to make copies in certain cases even if that means somewhat fewer works are published, the public's choice is decisive. There is no possible justification for prohibiting the public from copying what it wants to copy.
fr: Selon la perspective de la Constitution sur le copyright, si le public pr&eacute;f&egrave;re avoir la possibilit&eacute; de faire des copies, dans certains cas, m&ecirc;me si cela signifie une quelconque baisse de travaux &eacute;dit&eacute;s, le choix du public est d&eacute;cisif. Il n'y a pas de justification possible &agrave; l'interdiction au public de copier ce qu'il veut copier.

source: Ever since the constitutional decision was made, publishers have tried to reverse it by misinforming the public. They do this by repeating arguments which presuppose that copyright is a natural right of authors (not mentioning that authors almost always cede it to publishers). People who hear these arguments, unless they have a firm awareness that this presupposition is contrary to the basic premises of our legal system, take for granted that it is the basis of that system.
fr: Alors m&ecirc;me que la d&eacute;cision constitutionnelle &eacute;tait prise, les &eacute;diteurs ont essay&eacute; de la renverser en d&eacute;sinformant le public. Ils l'ont fait en r&eacute;p&eacute;tant ces arguments fond&eacute;s sur la supposition que le copyright est un droit naturel des auteurs (sans mentionner que la plupart du temps, les auteurs le c&egrave;dent aux &eacute;diteurs). Les gens qui entendent ces arguments, tant qu'ils ne sont pas s&eacute;rieusement avertis que cette pr&eacute;supposition est contraire aux bases pos&eacute;es en pr&eacute;misse de notre syst&egrave;me l&eacute;gal, croiront en toute bonne foi qu'il s'agit des bases de notre syst&egrave;me.

source: This error is so ingrained today that people who oppose new copyright powers feel the need to do so by arguing that even authors and publishers may be hurt by them. Thus, James Boyle <a href="#ft12">[12]</a> explains how a strict <a href="#later-2">intellectual property system</a> can interfere with writing new works. Jessica Litman <a href="#ft13">[13]</a> cites the copyright shelters which historically allowed many new media to become popular. Pamela Samuelson <a href="#ft14">[14]</a> warns that the White Paper may block the development of &ldquo;third-wave&rdquo; information industries by locking the world into the &ldquo;second-wave&rdquo; economic model that fit the age of the printing press.
fr: Cette erreur est tellement enracin&eacute;e aujourd'hui, que les gens qui opposent de nouveaux pouvoirs de copyright se sentent oblig&eacute; de le faire en disant que m&ecirc;me les auteurs et les &eacute;diteurs peuvent en &ecirc;tre touch&eacute;s. C'est pourquoi James Boyle<a href="#ft12">[12]</a> explique comment un strict syst&egrave;me de <a href="later-2">propri&eacute;t&eacute; intellectuelle</a> peut interf&eacute;rer sur l'&eacute;criture de nouveaux travaux. Jessica Litman<a href="#ft13">[13]</a> cite les couvertures qui ont historiquement permis &agrave; de nombreux m&eacute;dias de devenir populaires. Pamela Samuelson <a href="#ft14">[14]</a> nous met en garde&nbsp;: le White Paper peut stopper le d&eacute;veloppement de la &laquo;&nbsp;troisi&egrave;me vague&nbsp;&raquo; des industries de l'information, en verrouillant le monde dans une &laquo;&nbsp;deuxi&egrave;me vague&nbsp;&raquo; de mod&egrave;le &eacute;conomique qui correspond &agrave; l'&acirc;ge de l'imprimerie traditionnelle.

source: These arguments can be very effective on those issues where they are available, especially with a Congress and Administration dominated by the idea that &ldquo;What's good for General Media is good for the USA.&rdquo; But they fail to expose the fundamental falsehood on which this domination is based; as a result, they are ineffective in the long term. When these arguments win one battle, they do so without building a general understanding that helps win the next battle. If we turn to these arguments too much and too often, the danger is that we may allow the publishers to replace the Constitution uncontested.
fr: Ces arguments peuvent faire mouche dans les cas o&ugrave; ils sont pos&eacute;s, sp&eacute;cialement dans un Congr&egrave;s et une Administration domin&eacute; par l'id&eacute;e que &laquo;&nbsp;ce qui est bon pour les m&eacute;dias en g&eacute;n&eacute;ral est bon pour les USA&nbsp;&raquo;. Mais ils &eacute;chouent &agrave; exposer la fausse conception, fondamentale sur laquelle cette domination est bas&eacute;e&nbsp;; avec comme r&eacute;sultat qu'ils sont inefficaces sur le long terme. Lorsque ces arguments gagnent une bataille, c'est sans construire une compr&eacute;hension globale qui aiderait &agrave; gagner la prochaine bataille. Si nous retournons trop ces arguments et trop souvent, le danger est de permettre aux &eacute;diteurs de r&eacute;tablir la position incontest&eacute;e et incontestable de la Constitution.

source: For example, the recently published position statement of the Digital Future Coalition, an umbrella organization, lists many reasons to oppose the White Paper, for the sake of authors, libraries, education, poor Americans, technological progress, economic flexibility, and privacy concerns&mdash;all valid arguments, but concerned with side issues <a href="#ft15">[15]</a>. Conspicuously absent from the list is the most important reason of all: that many Americans (perhaps most) want to continue making copies. The DFC fails to criticize the core goal of the White Paper, which is to give more power to publishers, and its central decision, to reject the Constitution and place the publishers above the users. This silence may be taken for consent.
fr: Par exemple, la r&eacute;cente proposition rendue publique de la Digital Future Coalition, une organisation f&eacute;d&eacute;rant plusieurs autres organisations, a list&eacute; plein de raisons de s'opposer au White Paper&nbsp;: pour le bien des auteurs, des biblioth&egrave;ques, de l'&eacute;ducation, des Am&eacute;ricains n&eacute;cessiteux, du progr&egrave;s technologique, de la flexibilit&eacute; &eacute;conomique et autres raisons priv&eacute;es &mdash; arguments qui se valent, certes, mais biais&eacute;s. <a href="#ft15">[15]</a>. La raison la plus importante de toute brille par son absence&nbsp;: beaucoup d'Am&eacute;ricains (si ce n'est presque tous) veulent continuer &agrave; faire des copies. La DFC a manqu&eacute; sa critique du but intime du White Paper, qui est de donner plus de pouvoirs aux &eacute;diteurs et &agrave; sa d&eacute;cision centrale, de rejeter la Constitution et de placer les &eacute;diteurs au-dessus des utilisateurs. Ne rien dire pourrait signifier consentir.

source: Resisting the pressure for additional power for publishers depends on widespread awareness that the reading and listening public are paramount; that copyright exists for users and not vice versa. If the public is unwilling to accept certain copyright powers, that is ipso facto justification for not offering them. Only by reminding the public and the legislature of the purpose of copyright and the opportunity for the open flow of information can we ensure that the public prevails.
fr: La r&eacute;sistance &agrave; la pression qui veut rajouter du pouvoir aux &eacute;diteurs d&eacute;pend de l'ampleur de la mise en garde dont sont avertis les lecteurs et les auditeurs&nbsp;; savoir que le copyright est fait pour les utilisateurs et non le contraire. Si le public n'est pas enclin &agrave; accepter certains pouvoirs du copyright, c'est ipso facto la justification de ne pas leur donner. Ce n'est qu'en gardant &agrave; l'esprit du public et de nos &eacute;lus le but du copyright, ainsi que l'opportunit&eacute; d'ouverture du flot de l'information, que nous pouvons &ecirc;tre certains que le public pr&eacute;vaudra.

source: ENDNOTES
fr: RENVOIS

source: [3] John Perry Barlow, Remarks at the Innovation and the Information Environment Conference (Nov. 1995). Mr. Barlow is one of the founders of the Electronic Frontier Foundation, an organization which promotes freedom of expression in digital media, and is also a former lyricist for the Grateful Dead.
fr: [3] John Perry Barlow, remarques lors de la Conf&eacute;rence &laquo;&nbsp;Innovation and the Information Environment&nbsp;&raquo; (nov. 1995). Mr Barlow est un des fondateurs de la &laquo;&nbsp;Electronic Frontier Foundation&nbsp;&raquo;, une organisation charg&eacute;e de promouvoir la libert&eacute; d'expression dans le cadre des medias num&eacute;riques&nbsp;; il est aussi un ancien parolier du Grateful Dead.

source: [4] Gary Glisson, Remarks at the Innovation and the Information Environment Conference (Nov. 1995); see also Gary Glisson, A Practitioner's Defense of the NII White Paper, 75 Or. L. Rev. (1996) (supporting the White Paper). Mr. Glisson is a partner and chair of the Intellectual Property Group at Lane Powell Spears Lubersky in Portland, Oregon.
fr: [4] Gary Glisson, remarques lors de la Conf&eacute;rence &laquo;&nbsp;Innovation and the Information Environment&nbsp;&raquo; (nov. 1995); voir aussi Gary Glisson, A Practitioner's Defense ofthe NII White Paper, 75 Or. L. Rev. (1996) (supportant le White Paper). Mr Glisson est un partenaire et pr&eacute;sident dui &laquo;&nbsp;Intellectual Property Group&nbsp;&raquo;, Lane Powell Spears Lubersky &agrave; Portland, Oregon.

source: [5] Steven Winter, Remarks at the Innovation and the Information Environment Conference (Nov. 1995). Mr. Winter is a professor at the University of Miami School of Law.
fr: [5] Steven Winter, remarques lors de la Conf&eacute;rence &laquo;&nbsp;Innovation and the Information Environment&nbsp;&raquo; (nov. 1995). Mr Winter est professeur &agrave; l'Universit&eacute; de la Miami School of Law.

source: [7] See Laurence H. Tribe, The Constitution in Cyberspace: Law and Liberty Beyond the Electronic Frontier, Humanist, Sept.-Oct. 1991, at 15.
fr: [7] Voir Laurence H. Tribe, The Constitution in Cyberspace: Law and Liberty Beyond the Electronic Frontier, Humanist, Sept.-Oct. 1991, at 15.

source: [8] Tim Sloan, Remarks at the Innovation and the Information Environment Conference (Nov. 1995). Mr. Sloan is a member of the National Telecommunication and Information Administration.
fr: [8] Tim Sloan, remarques lors de la Conf&eacute;rence &laquo;&nbsp;Innovation and the Information Environment&nbsp;&raquo; (nov. 1995). Mr Sloan est membre de &laquo;&nbsp;National Telecommunication and Information Administration&nbsp;&raquo;.

source: [9] See Jane C. Ginsburg, A Tale of Two Copyrights: Liberary Property in Revolutionary France and America, in, Of Authors and Origins: Essays on Copyright Law 131, 137-38 (Brad Sherman &amp; Alain Strowel, eds., 1994) (stating that the Constitution's framers either meant to &ldquo;subordinate[] the author's interests to the public benefit,&rdquo; or to &ldquo;treat the private and public interests&hellip;even-handedly.&rdquo;).
fr: [9] Voir Jane C. Ginsburg, A Tale of Two Copyrights: Liberary Property in Revolutionary France and America, dans, Of Authors and Origins: Essays on Copyright Law 131, 137-38 (Brad Sherman &amp; Alain Strowel, eds., 1994) (déclarant que les fondateurs de la Constitution voulaient soit &laquo;&nbsp;subordonner les intérêts de l'auteur au bénéfice du public&nbsp;&raquo;, soit &laquo;&nbsp;traiter les intérêts privés et publics&hellip;de la même façon&nbsp;&raquo;).

source: [10] U.S. Const., art. I, p. 8, cl. 8 (&ldquo;Congress shall have Power&hellip;to promote the Progress of Science and useful Arts, by securing for limited Times to Authors and Inventors the exclusive Right to their respective Writings and Discoveries.&rdquo;).
fr: [10] U.S. Const., art. I, 8, cl. 8 (&laquo;&nbsp;Le Congr&egrave;s aura le pouvoir&hellip; de promouvoir le progr&egrave;s de la Science et des Arts utiles, en assurant pour une dur&eacute;e limit&eacute;e aux Auteurs et Inventeurs le droit exclusif sur leurs ouvrages et d&eacute;couvertes respectives&nbsp;&raquo;).

source: [12] James Boyle, Remarks at the Innovation and the Information Environment Conference (Nov. 1995). Mr. Boyle is a Professor of Law at American University in Washington, D.C.
fr: [12] James Boyle, remarques lors de la Conf&eacute;rence &laquo;&nbsp;Innovation and the Information Environment&nbsp;&raquo; (nov. 1995). Mr Boyle est professeur de droit &agrave; l'American University, &agrave; Washington, D.C.

source: [13] Jessica Litman, Remarks at the Innovation and the Information Environment Conference (Nov. 1995). Ms. Litman is a Professor at Wayne State University Law School in Detroit, Michigan.
fr: [13] Jessica Litman, remarques lors de la Conf&eacute;rence &laquo;&nbsp;Innovation and the Information Environment&nbsp;&raquo; (nov. 1995). Mme Litman est professeur &agrave; &laquo;&nbsp;Wayne State University Law School&nbsp;&raquo;, Detroit, Michigan.

source: [14] Pamela Samuelson, The Copyright Grab, Wired, Jan. 1996. Ms. Samuelson is a Professor at Cornell Law School.
fr: [14] Pamela Samuelson, The Copyright Grab, Wired, Jan. 1996. Mme Samuelson est professeur &agrave; &laquo;&nbsp;Cornell Law School&nbsp;&raquo;.

source: LATER NOTES
fr: NOTES ULT&Eacute;RIEURES

source: [1] This article was part of the path that led me to recognize the <a href="/philosophy/not-ipr.html"> bias and confusion in the term &ldquo;intellectual property&rdquo;</a>. Today I believe that term should never be used under any circumstances.
fr: Cet article faisait partie du cheminement qui m'a conduit &agrave; reconna&icirc;tre la <a href="/philosophy/not-ipr.fr.html">distorsion et la confusion dans le terme &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;</a>. Aujourd'hui je crois que ce terme ne devrait jamais &ecirc;tre utilis&eacute; quelle que soit la circonstance.

source: [2] Here I fell into the fashionable error of writing &ldquo;intellectual property&rdquo; when what I meant was just &ldquo;copyright&rdquo;. This is like writing &ldquo;Europe&rdquo; when you mean &ldquo;France&rdquo;&mdash;it causes confusion that is easy to avoid.
fr: Ici, j'ai fait l'erreur &agrave; la mode d'&eacute;crire &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; quand je voulais juste dire &laquo;&nbsp;droit d'auteur&nbsp;&raquo;. C'est comme d'&eacute;crire &laquo;&nbsp;Europe&nbsp;&raquo; quand vous voulez dire &laquo;&nbsp;France&nbsp;&raquo; &mdash; cela provoque une confusion qu'il est facile d'&eacute;viter.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 1996, 1999 Richard M. Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 1996, 1999 Richard M. Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Pierre-Yves Enderlin.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
