Repository: gitGNU/gnu_www-fr
Catalog: philosophy/rieti.*.po
Languages: fr

source: Free software business already exists. In fact, I started a free software business in 1985. I was selling copies of GNU Emacs. I was looking for a way to make money through free software. So I said, &ldquo;Pay me $150, and I will mail you a tape with the GNU Emacs text editor.&rdquo; People started paying me, and I mailed them tapes. I made enough money to live on. I stopped this because I started the Free Software Foundation, and it seemed appropriate for the Free Software Foundation to start distributing GNU Emacs. I did not want to compete with the Free Software Foundation, so I had to find a different way. For several years, the Foundation made enough money this way to pay several employees, including programmers. So actually, if I had done it myself, I would probably have become comfortably well off by selling copies of free software.
fr: Les affaires dans le logiciel libre existent d&eacute;j&agrave;. En fait, j'ai mont&eacute; une soci&eacute;t&eacute; de logiciel libre en 1985. Je vendais des copies de GNU Emacs. Je cherchais un moyen pour gagner de l'argent avec le logiciel libre. Alors j'ai dit, &laquo;&nbsp;Payez-moi 150 dollars, et je vous enverrai une bande avec l'&eacute;diteur de texte GNU Emacs.&nbsp;&raquo; Les gens ont commencé à me payer et je leur envoyais les bandes. J'ai gagn&eacute; suffisamment d'argent pour en vivre. J'ai arr&ecirc;t&eacute; cela car j'ai cr&eacute;&eacute; la Free Software Foundation (Fondation pour le logiciel libre), et il m'a sembl&eacute; appropri&eacute; pour la Free Software Foundation de commencer &agrave; distribuer GNU Emacs. Je ne voulais pas entrer en concurrence avec la Free Software Foundation, je devais donc trouver un autre moyen. Pendant plusieurs ann&eacute;es, la Fondation a gagn&eacute; suffisamment d'argent de cette fa&ccedil;on pour payer plusieurs employ&eacute;s, y compris les programmeurs. Donc en fait, si je l'avais fait moi-m&ecirc;me, je serais probablement financi&egrave;rement tr&egrave;s &agrave; l'aise en vendant des copies de logiciels libres.

source: After that, I started another free software business where I would make changes on commission.
fr: Apr&egrave;s cela, j'ai cr&eacute;&eacute; une autre soci&eacute;t&eacute; de logiciel libre o&ugrave; j'effectuais des modifications contre r&eacute;mun&eacute;ration.

source: With non-free software, you cannot change it. You are a prisoner of the software. So you either use it exactly as it is or you do not use it at all. With free software, you have those two choices, but you have another choice also, actually many different choices. You can make changes, bigger or smaller, in the program and use the modified program.
fr: Avec un logiciel non-libre, vous ne pouvez rien modifier. Vous &ecirc;tes prisonnier du logiciel. Donc soit vous l'utilisez en l'&eacute;tat, soit vous ne l'utilisez pas du tout. Avec le logiciel libre, vous avez ces deux choix, mais vous avez &eacute;galement un autre choix, en fait, beaucoup de choix diff&eacute;rents. Vous pouvez faire des modifications plus ou moins importantes dans le programme, et utiliser le programme modifi&eacute;.

source: Now, if you are personally a programmer, you could make the changes yourself. But suppose you are not a programmer. Then, you can pay a programmer to make the changes for you. For instance, if this ministry is using a program and people conclude this program does not work the way we really want, you could easily spend some money to pay a programmer to change it to do what you want. This is the kind of free software business that I was doing for several years in the 1980s. (I could have kept on doing it, but I received a big prize and I did not have to do it anymore.)
fr: Maintenant, si vous &ecirc;tes programmeur, vous pourriez faire les modifications vous-m&ecirc;me. Mais supposez que vous ne le soyez pas. Alors, vous pouvez payez un programmeur pour faire les modifications &agrave; votre place. Par exemple, si ce minist&egrave;re utilise un programme et que les gens trouvent que ce programme ne fonctionne pas &agrave; leur satisfaction, vous pouvez facilement payer un programmeur pour le modifier &agrave; votre convenance. C'est le genre d'affaires dans le logiciel libre que j'ai fait pendant plusieurs ann&eacute;es dans les ann&eacute;es 1980. (J'aurais pu continuer &agrave; le faire, mais j'ai re&ccedil;u une grande r&eacute;compense et je n'en ai plus eu besoin).

source: Nowadays there are many people making a living this way. I recently heard from somebody in South America who said that he know 30 people there who are making a living this way. South America is not among the technologically most advanced parts of the world, but this is already starting there. In 1989 or 1990, I believe, a company was started to do this kind of business, and that company was started by three people. In several years it had grown to 50 people, and it had been profitable every year. They could have kept on doing it, but they got greedy, and so they started developing non-free software, and later on they were purchased by Red Hat.
fr: De nos jours, beaucoup de gens vivent de cette fa&ccedil;on. J'ai r&eacute;cemment entendu parler de quelqu'un en Am&eacute;rique du Sud qui disait conna&icirc;tre trente personnes qui en vivaient. L'Am&eacute;rique du Sud ne fait pas partie des r&eacute;gions les plus avanc&eacute;es du monde technologiquement, mais cela a d&eacute;j&agrave; commenc&eacute; l&agrave;-bas. En 1989 ou 1990, je crois, une soci&eacute;t&eacute; se cr&eacute;ait pour faire ce type d'affaires, et cette soci&eacute;t&eacute; fut cr&eacute;&eacute; par trois personnes. En quelques ann&eacute;es, elle s'est d&eacute;velopp&eacute;e pour atteindre cinquante personnes, et elle a &eacute;t&eacute; b&eacute;n&eacute;ficiaire chaque ann&eacute;e. Ils auraient pu continuer ainsi, mais ils sont devenus avides, et donc commenc&egrave;rent &agrave; d&eacute;velopper du logiciel non-libre et peu de temps apr&egrave;s, il furent rachet&eacute; par Red Hat.

source: Anyway, the free software business is a new way of doing business that does not exist in the proprietary software world. So people often wonder how would free software affect employment. Suppose every computer user had freedom. Suppose, therefore, that all software were free software. In other words, if you have the program, you have the freedom to run it, study it, change it and redistribute it.What would that do to employment in the information technology field?
fr: De toute mani&egrave;re, le logiciel libre permet une nouvelle fa&ccedil;on de faire des affaires qui n'existe pas dans le monde du logiciel propri&eacute;taire. C'est pourquoi les gens se demandent souvent de quelle fa&ccedil;on le logiciel libre affecterait l'emploi. Supposons que chaque utilisateur d'ordinateur ait la libert&eacute;. Supposons, par cons&eacute;quent, que tous les logiciels soient des logiciels libres. En d'autres mots, si vous avez un programme, vous avez la libert&eacute; de l'ex&eacute;cuter, de l'&eacute;tudier, de le modifier et de le redistribuer. Qu'est-ce que cela produirait comme effets sur l'emploi dans le domaine de la technologie de l'information&nbsp;?

source: Well, of all the employment in the field, a small fraction is programming; and most programming is custom software, software being written for one client. That is perfectly okay; as long as the client gets the source code and gets the full rights to control the software once he has paid for it, then this is legitimate. In fact, it is free software for the client who has it. [Thus, only the programming which is not client-specific is really non-free.]
fr: De tous les employ&eacute;s dans ce domaine, seule une petite fraction programme, pour la plupart des logiciels personnalis&eacute;s, &eacute;crits pour un seul client. Ceci est tout &agrave; fait correct aussi longtemps que le client obtient le code source et tous les droits pour contr&ocirc;ler le logiciel une fois qu'il a &eacute;t&eacute; pay&eacute;, alors ceci est l&eacute;gitime. En fait, c'est un logiciel libre pour le client qui le poss&egrave;de. [Par cons&eacute;quent, seule la programmation qui n'est pas sp&eacute;cifique au client,est r&eacute;ellement non-libre].

source: So of this fraction that is programming, most of that is custom software; software to be published is a small fraction of a small fraction of the total [IT sector employment].
fr: Donc, de cette fraction qui concerne la programmation, la quasi-totalit&eacute; est du logiciel personnalis&eacute;; le logiciel &agrave; publier repr&eacute;sente donc une petite fraction d'une petite fraction du total [secteur des Technologies de l'Information].

source: So, what would free software do? It might eliminate this tiny fraction of the employment, but maybe not. Because while the possibility of paying these programmers by restricting the users would go away, there would be a new possibility instead of supporting programmers who would be paid to make improvements and extensions in free software. So will we lose more jobs or gain more jobs? Nobody knows. It is impossible to tell. What we do know is that the decrease in employment in the IT field is limited to this small fraction of a small fraction, which is programming for publication. The rest would continue the way it is now. So it is clear that there is no problem for employment.
fr: Donc, que pourrait faire le logiciel libre&nbsp;? Il pourrait &eacute;liminer cette fraction t&eacute;nue de l'emploi, mais peut-&ecirc;tre pas. Parce que la possibilit&eacute; de payer ces programmeurs en restreignant les utilisateurs dispara&icirc;trait, il y aurait alors une nouvelle possibilit&eacute; de soutenir les programmeurs qui seraient pay&eacute;s pour faire les am&eacute;liorations et les extensions dans le logiciel libre. Alors, perdrons-nous plus d'emplois ou en gagnerons-nous plus&nbsp;? Personne ne le sait. C'est impossible &agrave; dire. Ce que nous savons, c'est que cette perte d'emplois dans le domaine des technologies de l'information, est limit&eacute;e &agrave; une petite fraction d'une petite fraction, qui programme pour le grand-public. Le reste continuera de la m&ecirc;me mani&egrave;re que maintenant. Aussi, il est clair que ce n'est pas un probl&egrave;me pour l'emploi.

source: What about another issue people sometimes raise: Could we possibly develop enough software and make it free? The answer is obvious because we already are. The people who ask this question are like asking could airplanes really stay up? Well, I flew in one. Probably all of you have flown in airplanes too. I think they can stay up. In free software today, we have hundreds of people, maybe thousands, getting paid to develop free software. But we have over half a million volunteer developers of free software working part time and not getting paid and developing a lot of software.
fr: Et que dire d'un autre probl&egrave;me que les gens soul&egrave;vent parfois&nbsp;: Pourrons-nous d&eacute;velopper suffisamment de logiciels et les rendre libres&nbsp;? La r&eacute;ponse est &eacute;vidente car nous le faisons d&eacute;j&agrave;. Les gens qui posent cette question pourraient tout aussi bien demander si les avions se maitiennent r&eacute;ellement en l'air&nbsp;? Eh bien, j'ai vol&eacute; dans un avion. Vous avez tous probablement d&eacute;j&agrave; voyag&eacute; en avion aussi. Je pense qu'il peuvent se maintenir en l'air. Dans le logiciel libre aujourd'hui, nous avons des centaines de gens, peut-&ecirc;tre des milliers, qui sont pay&eacute;s pour d&eacute;velopper des logiciels libres. Mais nous avons plus d'un demi-million de d&eacute;veloppeurs volontaires de logiciels libres qui travaillent &agrave; temps partiel, qui ne sont pas pay&eacute;s et qui d&eacute;veloppent beaucoup de logiciels.

source: So in fact, free software business is not necessary for free software to do its job. Free software business is very desirable. The more we can develop institutions that funnel funds from users to free software developers, the more free software we can produce, the better we can produce it. So it is certainly desirable, but it is not crucial. We have already developed two entire operating systems, two graphical user interface desktops and two office suites that are free software.
fr: En fait, le commerce de logiciels libres n'est pas n&eacute;cessaire pour que le logiciel libre fasse son œuvre. Le commerce de logiciels libres est tr&egrave;s souhaitable. Plus nous pourrons d&eacute;velopper d'institutions qui rassemblent des fonds des utilisateurs pour les d&eacute;veloppeurs de logiciels libres, plus nous pourrons produire de logiciels libres, et mieux nous pourrons les produire. Aussi, ce serait certainement souhaitable, mais pas crucial. Nous avons d&eacute;j&agrave; d&eacute;velopp&eacute; deux syst&egrave;mes d'exploitation complets, deux interfaces graphiques de bureau et deux suites office qui sont des logiciels libres.

source: People are creatively looking for ways to fund free software, and some [ways] work and some do not, as you might expect. For instance, last summer, there was a product that people had liked but was non-free called Blender, and the business decided it was no use supporting this or selling this anymore. They discontinued it. But the developers did not want it to be discontinued, so they negotiated a deal: If they could raise $100,000, they could buy the rights and make it free software. So they went to the community, and in a few weeks they raised the money. Blender is now free software. This suggests that maybe we can raise money from the community in the same way to make specific extensions.
fr: Les gens cherchent de mani&egrave;re inventive, des moyens de financer le logiciel libre, et certains [moyens] fonctionnent et d'autres pas, comme l'on peut s'y attendre. Par exemple, l'&eacute;t&eacute; dernier, il y avait un produit que les gens avaient aim&eacute; mais qui &eacute;tait non-libre, appel&eacute; Blender, et la soci&eacute;t&eacute; d&eacute;cida qu'il n'&eacute;tait pas n&eacute;cessaire de continuer &agrave; le maintenir ou &agrave; le vendre. Ils l'ont donc arr&ecirc;t&eacute;. Mais les d&eacute;veloppeurs ne voulaient pas que cela s'arr&ecirc;te, alors ils ont fait un march&eacute;&nbsp;: s'ils pouvaient lever 100 000 dollars, ils pourraient acheter les droits et rendre le logiciel libre. Alors, ils se tourn&egrave;rent vers la communaut&eacute;, et en quelques semaines, ils r&eacute;colt&egrave;rent l'argent n&eacute;cessaire. Blender est maintenant un logiciel libre. Ceci sugg&egrave;re que nous pourrions peut-&ecirc;tre r&eacute;colter de l'argent de la communaut&eacute; de la m&ecirc;me mani&egrave;re pour r&eacute;aliser des extensions sp&eacute;cifiques.

source: A programmer who has a name, a reputation for ability, could go to the community and say, &ldquo;If people put up this much money, I will do the work.&rdquo; He does not have to do the work entirely himself. He can employ other programmers working with him, and this is how you would get started. Before you have a name, before you could go to the community on the strength of your own reputation, you could be working as an apprentice for other programmers. They raise the funds, they supervise the work, but by doing this, eventually you develop a reputation too, and then you can go and get clients.
fr: Un programmeur qui a un nom, une r&eacute;putation pour son adresse, pourrait venir &agrave; la communaut&eacute; et dire, &laquo;&nbsp;Si les gens mettent cette somme d'argent, je ferai le travail&nbsp;&raquo;. Il n'a pas besoin de faire tout le travail lui-m&ecirc;me. Il peut employer d'autres programmeurs pour travailler avec lui, et c'est comme cela que vous pourriez d&eacute;marrer. Avant d'avoir un nom, avant que vous puissiez rejoindre la communaut&eacute; gr&acirc;ce &agrave; votre propre r&eacute;putation, vous pourriez travailler en tant qu'apprenti pour d'autres programmeurs. Ils l&egrave;vent les fonds, ils supervisent le travail; en faisant cela, vous pouvez &eacute;ventuellement acqu&eacute;rir une r&eacute;putation aussi, et vous pouvez ainsi aller chercher des clients.

source: There are also, of course, legitimate roles for government funding in developing useful software, just as governments fund scientific research designed to be of use to the citizens, and even just for the sake of human curiosity, but certainly to be of use for the citizens, for the public. It is equally legitimate for governments to fund the development of software that is going be of use to the public, and then when it is done, hand it off to the public and say, &ldquo;Everyone can now use and improve this. It is human knowledge.&rdquo; Because that is what free software is really about. It is human knowledge, knowledge that belongs to humanity, to all beings. A non-free program is restricted knowledge, knowledge that is kept under control by a few, and other people cannot really have access to it. They can only use it barely on sufferance. They can never have the knowledge.
fr: Il y a aussi, bien s&ucirc;r, un r&ocirc;le l&eacute;gitime de financement des logiciels utiles de la part du gouvernement, tout comme les gouvernements financent la recherche scientifique destin&eacute;e &agrave; servir aux citoyens, et m&ecirc;me seulement pour le bien de la curiosit&eacute; humaine, mais certainement pour servir aux citoyens, au public. Il est tout autant l&eacute;gitime pour les gouvernements de financer le d&eacute;veloppement de logiciels qui serviront au public, et quand le d&eacute;veloppement est termin&eacute;, le donner au public et de dire&nbsp;: &laquo;&nbsp;Tout le monde peut maintenant utiliser et am&eacute;liorer ceci. Il s'agit du savoir de l'humanit&eacute;&nbsp;&raquo;. Car c'est de cela dont il s'agit. Il s'agit de connaissances humaines, de savoir qui appartient &agrave; l'humanit&eacute;, &agrave; tout le monde. Un programme non-libre est un savoir restreint, un savoir qui est gard&eacute; sous contr&ocirc;le de quelques-uns, les autres personnes ne peuvent pas vraiment y avoir acc&egrave;s. Elles ne peuvent l'utiliser que par tol&eacute;rance. Elles ne peuvent jamais acc&eacute;der au savoir.

source: For this reason, it is essential that schools use free software. There are three reasons why schools should use exclusively free software. The most shallow reason is to save money. Even in a developed country, schools never have enough money, and so the use of computers in schools is held back. Now, if the schools use free software, then the school system has the freedom to make copies and redistribute them to all the schools and they do not have to pay for permission to use the software. So the school system can thus install more computers, make more facilities available. In addition, the GNU plus Linux operating system is more efficient than Windows, so you can use an older, less powerful, cheaper model of computer. Maybe you can use a second-hand computer that somebody else is getting rid of. So that is another way to save. That is obvious, but it is shallow.
fr: Pour cette raison, il est essentiel que les &eacute;coles utilisent des logiciels libres. Il y a trois raisons pour lesquelles les &eacute;coles devraient utiliser exclusivement des logiciels libres. La raison la plus superficielle est d'&eacute;conomiser de l'argent. M&ecirc;me dans un pays d&eacute;velopp&eacute;, les &eacute;coles n'ont jamais assez d'argent, et c'est pourquoi l'utilisation d'ordinateurs dans les &eacute;coles est mesur&eacute;. Mais si les &eacute;coles utilisent des logiciels libres, alors elles ont la libert&eacute; de faire des copies et de les redistribuer &agrave; toutes les &eacute;coles et elles n'ont pas besoin de payer pour utiliser les logiciels. Donc, les &eacute;coles peuvent ainsi installer plus d'ordinateurs et rendre plus d'installations disponibles. De plus, le syst&egrave;me d'exploitation GNU/Linux est plus efficace que Windows, de sorte que vous pouvez utiliser un ordinateur plus vieux, moins puissant et moins cher. Vous pouvez peut-&ecirc;tre utiliser un ordinateur d'occasion dont quelqu'un d'autre s'est d&eacute;barrass&eacute;. C'est &eacute;galement une autre mani&egrave;re de faire des &eacute;conomies. C'est &eacute;vident, mais c'est superficiel.

source: A more important reason for schools to use free software is for the sake of learning. You see, in the teenage years, some students are going to want to learn everything there is to know about the inside of the computer system. These are the people who can become good programmers. If you want to develop a strong programming capacity, people prepared not just to work as part of a big team in a rather mechanical way, but people who will take the initiative, do big things, develop powerful, exciting programs, then you need to encourage the impulse to do that, whenever a kid has that impulse. So it is important to provide facilities and a social milieu that encourages this kind of learning to develop. The way to do this is the schools should run free software, and whenever a kid starts wondering, &ldquo;How does this actually work?&rdquo; the teacher can say, &ldquo;This is done by the Fubar program. You can find the source code of the Fubar program there. Go read it and figure it out, see for yourself how this works.&rdquo; Then if a kid says, &ldquo;You know, I have got an idea for how this could be better,&rdquo; the teacher could say, &ldquo;Why not give it a try? Try writing it. Make the change in the Fubar program to change this one feature.&rdquo;
fr: Une raison plus importante pour les &eacute;coles d'utiliser des logiciels libres, se situe dans l'int&eacute;r&ecirc;t de l'enseignement. Vous voyez, pendant les ann&eacute;esd'adolescence, des &eacute;tudiants vont vouloir apprendre tout ce qu'il y a &agrave; savoir sur le m&eacute;canisme d'un syst&egrave;me d'ordinateur. Ces personnes peuvent devenir de bon programmeurs. Si vous voulez d&eacute;velopper un fort potentiel de programmation, des gens pr&eacute;par&eacute;s, pas seulement pour travailler dans une grosse &eacute;quipe de mani&egrave;re plut&ocirc;t m&eacute;canique, mais des gens qui prendront des initiatives, feront de grandes choses, d&eacute;velopperont des programmes puissants et passionnants, alors vous avez besoin d'encourager cet &eacute;lan pour le faire, chaque fois qu'un enfant a cette impulsion. Donc il est important de fournir des installations et un environnement social qui encourage ce type d'enseignement &agrave; se d&eacute;velopper. Le moyen d'y arriver, c'est que les &eacute;coles devraient utiliser des logiciels libres, et quand un &eacute;l&egrave;ve commence &agrave; se questionner&nbsp;: &laquo;&nbsp;Comment est-ce que cela fonctionne en fait&nbsp;?&nbsp;&raquo; le professeur peut dire&nbsp;:&laquo;&nbsp;C'est fait par le programme Fubar. Tu peux trouver le code source du programme Fubar ici. Lis-le et vois par toi-m&ecirc;me comment il fonctionne&nbsp;&raquo;. Puis, si un &eacute;l&egrave;ve dit&nbsp;: &laquo;&nbsp;Vous savez, j'ai une id&eacute;e pour l'am&eacute;liorer&nbsp;&raquo; le professeur peut dire&nbsp;: &laquo;&nbsp; pourquoi ne pas essayer&nbsp;? Essaie de l'&eacute;crire. Fais le changement dans le programme Fubar pour modifier cette fonctionnalit&eacute;&nbsp;&raquo;.
