Repository: gitGNU/gnu_www-fr
Catalog: philosophy/rieti.*.po
Languages: fr

source: To learn to be a good writer, you have to read a lot and write a lot. It is the same if you are writing software: You have to read a lot of software and write a lot of software. To learn to understand big programs, you have to work with big programs. But how can you get started at that? When you are beginning, you cannot write a big program yourself, not and do a good job, because you have not learned how. So how are you going to learn? The answer is you have to read existing big programs and then try making small changes in them. Because at that stage, you cannot write a big program yourself, but you can write a small improvement in a big program.
fr: Pour apprendre &agrave; &ecirc;tre un bon &eacute;crivain, vous devez lire beaucoup et &eacute;crire beaucoup. C'est la m&ecirc;me chose quand vous &eacute;crivez des logiciels&nbsp;: vous devez lire beaucoup de logiciels et en &eacute;crire beaucoup. Pour apprendre, pour comprendre de gros programmes, vous devez travailler avec de gros programmes. Mais comment pourriez-vous d&eacute;buter par cela&nbsp;? Quand vous commencez, vous ne pouvez pas &eacute;crire un gros programme vous-m&ecirc;me et faire un bon travail, parce que vous n'avez pas appris comment le faire. Donc, comment allez-vous apprendre&nbsp;? Vous devez lire les gros programmes existants et essayerd'y faire de petits changements. Parce qu'&agrave; ce stade, vous ne pouvez pas &eacute;crire de gros programmes par vous-m&ecirc;me, mais vous pouvez &eacute;crire une petite am&eacute;lioration dans un gros programme.

source: That is how I learned to be a good programmer. I had a special opportunity at the Massachusetts Institute of Technology. There was a lab where they had written their own operating system, and then they used it. I went there and they said, &ldquo;We would like to hire you.&rdquo; They hired me to improve the programs in this operating system. It was my second year of college. At the time, I could not have written an operating system myself. I could not have written those programs from zero, but I could read them and add a feature and then add another feature and another and another. Every week I would add another feature to some program. By doing this many, many times, I developed my skill. In the 1970s, the only way you could get that opportunity was to be in a very special place. But today, we can give that opportunity to everyone. All you need is a PC running the GNU/Linux system with the source code, and you have this opportunity. So you can easily encourage Japanese teenagers, those of them who are fascinated by computers, to become good programmers.
fr: C'est ainsi que j'ai appris &agrave; &ecirc;tre un bon programmeur. J'avais une opportunit&eacute; particuli&egrave;re &agrave; l'Institut de technologie du Massachusetts (M.I.T.). Il y avait un laboratoire o&ugrave; ils avaient &eacute;crit leur propre syst&egrave;me d'exploitation qu'ils utilisaient. J'y suis all&eacute; et ils me dirent&nbsp;: &laquo;&nbsp;Nous voudrions vous embaucher&nbsp;&raquo; Ils m'embauch&egrave;rent pour am&eacute;liorer les programmes dans ce syst&egrave;me d'exploitation. C'&eacute;tait ma deuxi&egrave;me ann&eacute;e d'universit&eacute;. &Agrave; l'&eacute;poque, je n'aurais pas pu &eacute;crire tout un syst&egrave;me d'exploitation moi-m&ecirc;me. Je n'aurais pas pu &eacute;crire ces programmes &agrave; partir de z&eacute;ro, mais je pouvais les lire et leur ajouter une fonctionnalit&eacute; puis une autre et une autre et encore une autre. Chaque semaine, j'ajoutais une autre fonctionnalit&eacute; &agrave; un programme. En faisant cela de nombreuses fois, j'ai d&eacute;velopp&eacute; mes comp&eacute;tences. Dans les ann&eacute;es 1970, la seule fa&ccedil;on d'obtenir ce type d'opportunit&eacute; &eacute;tait de se trouver dans un endroit tr&egrave;s particulier. Mais aujourd'hui, nous pouvons donner cette opportunit&eacute; &agrave; chacun. Tout ce dont vous avez besoin, c'est d'un PC ex&eacute;cutant le syst&egrave;me GNU/Linux avec le code source, et vous avez cette opportunit&eacute;. Aussi, vous pouvez facilement encourager les adolescents japonais, ceux d'entre eux qui sont fascin&eacute;s par les ordinateurs, &agrave; devenir de bons programmeurs.

source: I have a friend who was a high school teacher around 1980, and he set up the first Unix machine in a high school. He then mentored the high school students so that they learned to become good programmers. Several of them were very good programmers with reputations by the time they graduated from high school. I am sure any high school has a few people who have that talent and will want to develop it. They just need the opportunity. So that is the second reason why schools should use free software exclusively.
fr: J'ai un ami qui &eacute;tait professeur de lyc&eacute;e dans les ann&eacute;es 1980, et qui monta la premi&egrave;re machine Unix dans un lyc&eacute;e. Il enseigna alors aux lyc&eacute;ens qui devinrent alors de bons programmeurs. Plusieurs d'entre eux &eacute;taient de tr&egrave;s bon programmeurs avec un certain renom quand ils furent dipl&ocirc;m&eacute;s. Je suis s&ucirc;r chaque lyc&eacute;e rec&egrave;le quelques personnes qui ont ce talent et qui voudront le d&eacute;velopper. Ils ont juste besoin d'une opportunit&eacute;. C'est la deuxi&egrave;me raison pour laquelle les &eacute;coles devraient utiliser exclusivement des logiciels libres.

source: The third reason is even more fundamental. We want schools to teach facts and skill, of course, but also good moral character, which means being prepared to help other people. That means the school should say to the kids, &ldquo;Any software that is here, you can copy it. Copy it and take it home. That is what it is here for. If you bring any software to school, you must share it with the other kids. If you are not willing to share it with the other kids, do not bring it here, it does not belong here, because we are teaching kids to be helpful to each other.&rdquo; Education of moral character is important for every society.
fr: La troisi&egrave;me raison est encore plus fondamentale. Nous voulons que les &eacute;coles enseignent les faits et les comp&eacute;tences, bien s&ucirc;r, de bonnes dispositions morales, ce qui signifie, &ecirc;tre pr&eacute;par&eacute; &agrave; aider d'autres personnes. Cela signifie que l'&eacute;cole devrait dire aux enfants&nbsp;: &laquo;&nbsp;Tout logiciel qui se trouve ici peut &ecirc;tre copi&eacute;. Copiez-le et amenez-le &agrave; la maison. C'est ce pourquoi il est l&agrave;. Si vous amenez un logiciel &agrave; l'&eacute;cole, vous devez le partager avec les autres enfants. Si vous ne voulez pas le partager avec les autres, ne l'amenez pas ici, il n'a rien &agrave; faire ici, parce que nous enseignons aux enfants &agrave; s'entraider&nbsp;&raquo;. L'&eacute;ducation morale est importante pour toutes les soci&eacute;t&eacute;s.

source: I did not invent the idea of free software. Free software began as soon as there were two computers of the same kind, because then people using one computer would write some software, and the people using the other computer would say, &ldquo;Do you know anything to solve this problem?&rdquo; and they would say, &ldquo;Yes. We wrote something to solve this problem. Here is a copy.&rdquo; So they started exchanging the software that they had developed, so that they could all develop more. But in the 1960s, there was a trend to replace it with non-free software, a trend to subjugate the users, to deny users freedom.
fr: Je n'ai pas invent&eacute; l'id&eacute;e de logiciel libre. Le logiciel libre a commenc&eacute; d&egrave;s qu'il y a eu deux ordinateurs de m&ecirc;me type, parce que les gens utilisant l'un &eacute;crivent un logiciel, et les gens utilisant l'autre disent&nbsp;: &laquo;&nbsp;Vous savez comment r&eacute;soudre ce probl&egrave;me&nbsp;?&nbsp;&raquo; et ils r&eacute;pondent&nbsp;: &laquo;&nbsp;Oui. Nous avons &eacute;crit quelque chose pour r&eacute;soudre ce probl&egrave;me. En voici une copie&nbsp;&raquo;. Aussi, ils commencent &agrave; &eacute;changer des logiciels qu'ils ont d&eacute;velopp&eacute;, de sorte qu'ils puissent tous d&eacute;velopper plus. Mais dans les ann&eacute;es 1960, il y eut une tendance &agrave; les replacer par des logiciels non-libres, une tendance pour assujettir les utilisateurs, pour leur d&eacute;nier la libert&eacute;.

source: When I was in my first year of college, I got to see a moral example that impressed me. I was using a computer facility, and at this facility they said, &ldquo;This is an educational institution, and we are here for people to learn about computer science. So we will have a rule: any time software is installed on a system, the source code must be on display so people can read it and learn how this software works.&rdquo; One of the employees wrote a utility program and he started selling it as non-free software. He was not just selling copies the way I was doing; he was restricting the users. But he offered the school a copy at no charge, and the people in charge of the computer facility said, &ldquo;No, we will not install this here because our rule is the source code must be on display. If you will not let us put the source code of this program on display, we just will not run your program.&rdquo; This inspired me because it was a willingness to renounce a practical convenience for the sake of something more important which is the mission of the school: education.
fr: Quand j'&eacute;tais en premi&egrave;re ann&eacute;e d'universit&eacute;, il m'a &eacute;t&eacute; donn&eacute; de voir un exemple moral qui m'a impressionn&eacute;. J'utilisais les ordinateurs d'une salle informatique, et dans cette salle, les responsables disaient&nbsp;: &laquo;&nbsp;C'est une institution scolaire et nous sommes l&agrave; pour que les gens apprennent l'informatique. Aussi, nous avons une r&egrave;gle&nbsp;: chaque fois qu'un logiciel est install&eacute; sur un syst&egrave;me, le code source doit &ecirc;tre affich&eacute; de sorte que les gens puissent le lire et apprendre comment le logiciel fonctionne&nbsp;&raquo;. Un des employ&eacute;s a &eacute;crit un programme et commen&ccedil;a &agrave; le vendre comme logiciel non-libre. Il ne vendaient pas de copies de la fa&ccedil;on dont je le faisais; il restreignait les utilisateurs. Mais il offrit &agrave; l'&eacute;cole une copie gratuite, et les personnes en charge de la salle informatique dirent alors&nbsp;: &laquo;&nbsp;Non, nous n'installerons pas ceci ici car notre r&egrave;gle est que le code source doit &ecirc;tre affich&eacute;. Si vous ne nous laissez pas afficher le code source de ce programme, nous n'utiliserons pas votre programme&nbsp;&raquo;. Cela m'a inspir&eacute; parce que c'&eacute;tait une volont&eacute; de renoncer &agrave; la commodit&eacute; pour le bien de quelque chose plus important qui est la mission d'une &eacute;cole&nbsp;: l'&eacute;ducation.

source: The lab where I worked at MIT was an exception though in the 1970s due to the fact that we had an operating system that was free software. Most computers were using non-free operating systems at the time. But I was inspired by the example that I saw there and I learned to live in that way. I learned the way of life where you will teach your knowledge to others instead of keeping it all for yourself. Then this community died in the early 1980s. At that point, I started the free software movement. I did not begin free software. I learned the free software way of life by joining a lab where people already practiced it. What I did was to turn this into an ethical and social movement, to say that this is a matter of choosing between a good society and an ugly society, between a clean, kind, helpful way of life where we have freedom, and a way of life where everybody is in bondage to various empires that conquer them, where people believe they have no practical choice but to give up their freedom.
fr: Le laboratoire o&ugrave; je travaillais au MIT &eacute;tait cependant une exception dans les ann&eacute;es 1970, &agrave; cause du fait que nous avions un syst&egrave;me d'exploitation qui &eacute;tait libre. La plupart des ordinateurs utilisaient des syst&egrave;mes d'exploitation non-libres &agrave; l'&eacute;poque. Mais j'ai &eacute;t&eacute; inspir&eacute; par l'exemple que j'y ai vu et j'ai appris &agrave; vivre de cette mani&egrave;re. J'ai appris un mode de vie o&ugrave; l'on enseigne ses connaissances aux autres plut&ocirc;t que de les garder pour soi. Puis, cette communaut&eacute; mourut au d&eacute;but des ann&eacute;es 1980. &Agrave; ce moment-l&agrave;, je d&eacute;marrais le mouvement du logiciel libre. Je n'ai pas cr&eacute;&eacute; le logiciel libre. J'ai appris les pratiques du logiciel libre en rejoignant un laboratoire o&ugrave; les gens le pratiquait d&eacute;j&agrave;. Ce que j'ai fait, c'est de muer cela en un mouvement &eacute;thique et social, pour dire que c'est une question de choix entre une bonne soci&eacute;t&eacute; et une horrible soci&eacute;t&eacute;, entre un mode de vie propre, aimable et utile o&ugrave; nous avons la libert&eacute;, et un mode de vie o&ugrave; chacun est prisonnier de divers empires qui les conqui&egrave;rent, o&ugrave; les gens croient qu'il n'y a pas d'autre choix que d'abandonner leur libert&eacute;.

source: Theoretically speaking, on the one hand people say, &ldquo;Oh, nobody forces you to use that non-free software. Nobody forces you to use Microsoft Word.&rdquo; On the other hand, you have people saying, &ldquo;I have no choice.&rdquo; So practically speaking, it is not a situation of individual choice. Yes, it is true, if you are determined to be free, determined to reject it, you can do it, but it takes a lot of determination. When we started 20 years ago, it took tremendous work to use a computer without the non-free software. All the operating systems for modern computers in 1983 were proprietary. You could not get a computer and use it, except with non-free software. To change this, we had to spend years working, and we did, we changed it.
fr: Th&eacute;oriquement, d'un c&ocirc;t&eacute; les gens disent&nbsp;: &laquo;&nbsp;Oh, personne ne vous force &agrave; utiliser des logiciels non-libres. Personne ne vous force &agrave; utiliser Microsoft Word&nbsp;&raquo;. D'un autre c&ocirc;t&eacute;, les gens disent&nbsp;: &laquo;&nbsp;Je n'ai pas le choix&nbsp;&raquo;. Pratiquement, il ne s'agit pas d'une situation de choix individuel. Oui, c'est vrai, si vous &ecirc;tes d&eacute;termin&eacute; &agrave; &ecirc;tre libre, d&eacute;termin&eacute; &agrave; le rejeter, vous pouvez le faire, mais cela demande beaucoup de d&eacute;termination. Quand j'ai d&eacute;but&eacute; il y a vingt ans, cela demandait un immense travail d'utiliser un ordinateur sans logiciels non-libres. Tous les syst&egrave;mes d'exploitation pour les ordinateurs modernes en 1983 &eacute;taient propri&eacute;taires. Vous ne pouviez avoir d'ordinateur et l'utiliser qu'avec des logiciels non-libres. Pour changer cela, nous avons pass&eacute; des ann&eacute;es &agrave; travailler, et nous avons r&eacute;ussi, nous l'avons chang&eacute;.

source: For you, today, the situation is easier. There are free operating systems. You can get a modern computer and use it with free software, exclusively with free software. So nowadays, instead of a tremendous sacrifice, you just have to make a temporary, small sacrifice, and then you can live in freedom. By working together, we can eliminate that sacrifice. We can make it easier to live in freedom. But for that we have to work. We have to recognize freedom as a social value.
fr: Pour vous aujourd'hui, la situation est plus facile. Il y a des syst&egrave;mes d'exploitation libres. Vous pouvez obtenir un ordinateur moderne et l'utiliser avec des logiciels libres,exclusivement avec des logiciels libres. Ainsi, de nos jours, plut&ocirc;t que de faire un sacrifice &eacute;norme, vous n'avez qu'&agrave; faire un petit sacrifice, temporaire, et vous pouvez alors vivre en libert&eacute;. En travaillant ensemble, nous pouvons &eacute;liminer ce sacrifice. Nous pouvons rendre plus facile de vivre en libert&eacute;. Mais pour cela, nous devons travailler. Nous devons reconna&icirc;tre la libert&eacute; comme une valeur sociale.

source: Every government tries to get its work done inexpensively, and every government agency has a specific job to get done. So when government agencies choose their computers, they tend to look at narrow, practical questions: How much will it cost, when can we have it running, and so on.
fr: Chaque gouvernement essaie d'effectuer son travail de mani&egrave;re peu ch&egrave;re, et chaque agence gouvernementale a un travail sp&eacute;cifique &agrave; faire. Aussi, quand des agences gouvernementales choisissent leurs ordinateurs, elles ont tendance &agrave; se cantonner &agrave; des questions pratiques&nbsp;: combien cela co&ucirc;tera-t-il, quand pourrons-nous le faire fonctionner, etc.

source: But the government has a larger mission, which is to lead the country in a healthy direction, one that is good for the citizens. So when government agencies choose their computer systems, they should make this choice so as to lead the country to free software. It is better for the economy of the country because the users, instead of paying merely for permission to run the software, will be paying people in the local area to improve it and adapt it for them. So in instead of all draining away to Redmond, Washington, the money will circulate in the region, creating employment locally instead of filling somebody's pockets. But more important, it creates a way of life where the country and the people are independent and free.
fr: Mais le gouvernement a une mission plus importante, qui est de guider le pays dans une direction saine, qui soit b&eacute;n&eacute;fique pour les citoyens. Donc, quand les agences gouvernementales choisissent le syst&egrave;me pour leurs ordinateurs, elles devraient faire ce choix de sorte &agrave; mener le pays vers le logiciel libre. C'est mieux pour l'&eacute;conomie du pays car les utilisateurs, au lieu de payer simplement pour la permission d'ex&eacute;cuter le logiciel, paieront des gens dans leur r&eacute;gion pourl'am&eacute;liorer et l'adapter pour eux. Aussi, au lieu de drainer tout vers Redmond, Washington, l'argent circulera dans la r&eacute;gion en cr&eacute;ant des emplois localement, plut&ocirc;t que de remplir les poches de quelqu'un. Mais plus important encore, il cr&eacute;e un mode de vie o&ugrave; le pays et les gens sont ind&eacute;pendants et libres.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2003 Richard M. Stallman. <br /> Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: Copyright &copy; 2003 Richard M. Stallman. <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
