Repository: gitGNU/gnu_www-fr
Catalog: philosophy/rieti.*.po
Languages: fr

source: The Future of Jiyuna Software, 21 April 2003 - GNU Project - Free Software Foundation (FSF)
fr: Le futur du &laquo;&nbsp;Jiyuna Software&nbsp;&raquo;, le 21 avril 2003 - GNU Project - Free Software Foundation (FSF)

source: The Future of Jiyuna Software
fr: Le futur du &laquo;&nbsp;Jiyuna Software&nbsp;&raquo;

source: Keynote Speech by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: Discours d'ouverture par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: (Transcript) Date: 21 April 2003 Venue: Seminar Room, Research Institute of Economy, Trade and Industry (RIETI), (Annex 11th Floor, 1121 Ministry of Economy, Trade and Industry (METI))
fr: (Transcription) Date&nbsp;: 21 avril 2003 Lieu&nbsp;: Salle de s&eacute;minaire, Research Institute of Economy, Trade and Industry (RIETI), (annexe 11&egrave;me &eacute;tage, 1121 Ministry of Economy, Trade and Industry (METI))

source: Mr. Richard Stallman, GNU Project: I am going to speak about free software and, first of all, its ethical, social and political significance, and secondly, something about its economic consequences.
fr: M. Richard Stallman, Projet GNU&nbsp;: Je vais vous parler du logiciel libre&nbsp;; tout d'abord, de son importance &eacute;thique, sociale et politique, et ensuite, je dirai quelques mots sur ses cons&eacute;quences &eacute;conomiques.

source: Free software is a matter of freedom. The English word &ldquo;free&rdquo; does not make this clear because it has two meanings. In your language, fortunately, you have two different words. So, if you say jiyu na sofuto, it is very clear that you are not talking about the price, you are talking about freedom. So, I urge you, always use your unambiguous word and not our unclear word when you are talking about free software in Japanese.
fr: Le logiciel libre est une question de libert&eacute;. Le mot anglais &laquo;&nbsp;free&nbsp;&raquo; ne rend pas les choses claires car il a deux significations. Dans votre langue, heureusement, vous avez deux mots diff&eacute;rents. Aussi, si vous dites&nbsp;: &laquo;&nbsp;jiyu na sofuto&nbsp;&raquo;, il est tr&egrave;s clair que vous ne parlez pas du prix, mais que vous parlez de libert&eacute;. C'est pourquoi je vous presse de toujours utiliser votre mot non-ambigu plut&ocirc;t que le n&ocirc;tre qui est peu clair, quand vous parlez de logiciel libre en japonais.

source: The reason for having free software is very simple: to live in freedom and, in particular, to be free to treat other people decently. Non-free software says that you are helpless and divided. It says you cannot even tell what the program does; you are supposed to take the developer's word for it; and often they will not tell you what it really does. And if you do not like it, you cannot change it. Even if the developer made his best sincere effort to make the program useful, nobody is perfect. I could write a program, and you might find it halfway good for what you want. Perhaps I wrote it for somewhat different purposes, not the same as your purposes. Nobody can anticipate everything. Perhaps I did it the way I thought was best, but you have a better idea. Nobody can always get everything right.
fr: La raison d'avoir des logiciels libres est tr&egrave;s simple&nbsp;: vivre en libert&eacute; et, en particulier, d'&ecirc;tre libre de traiter les autres personnes d&eacute;cemment. Le logiciel non-libre dit que vous &ecirc;tes inutiles et divis&eacute;s. Il dit que vous ne pouvez m&ecirc;me pas dire ce que le programme fait; vous &ecirc;tes suppos&eacute;s croire ce que vous dit le d&eacute;veloppeur; et souvent, il ne vous dira pas ce qu'il fait vraiment. Et si &ccedil;a ne vous pla&icirc;t pas, vous ne pouvez pas le changer. M&ecirc;me si le d&eacute;veloppeur a fait le maximum pour rendre le programme utile, personne n'est parfait. Je pourrais &eacute;crire un programme, et vous pourriez le trouver &agrave; moiti&eacute; bien pour ce que vous voulez en faire. Peut-&ecirc;tre l'ai-je &eacute;crit pour des buts diff&eacute;rents des v&ocirc;tres. Personne ne peut tout anticiper. Peut-&ecirc;tre l'ai-je fait de la fa&ccedil;on que je pensais &ecirc;tre la meilleure, mais vous avez une meilleure id&eacute;e. Personne n'est parfait.

source: With non-free software you are stuck. You have to take it the way it is. You have to suffer with it. And most important with non-free software, you are forbidden to share with other people. Society depends on people helping each other. It is useful to live with neighbors who will help you when you ask for help. Of course, not always, nobody is forced to help another person, but if you are friends with people, often they will help you out. So, of course, we had better help other people if we want them to help us.
fr: Avec des logiciels non-libres, vous &ecirc;tes bloqu&eacute;s. Vous devez les utiliser tels qu'ils sont. Vous devez les subir. Et le plus important avec des logiciels non-libres, ilvous est interdit de les partager avec d'autres personnes. La soci&eacute;t&eacute; d&eacute;pend des gens qui s'entraident. Il est utile de vivre avec des voisins qui vous aideront quand vous leur demanderez. Bien s&ucirc;r, personne n'est forc&eacute; d'aider une autre personne, mais si vous &ecirc;tes amicaux avec les gens, souvent, ils vous aiderons. Aussi, nous ferions mieux d'aider les gens, si nous voulons qu'ils nous aident en retour.

source: So what is it like when someone says you are prohibited from helping someone else? Here is this useful knowledge, and you could help your neighbor by sharing it, but you are forbidden to share with other people. This is attacking the bonds of society, dissolving society into isolated individuals who cannot help each other.
fr: Alors, &ccedil;a ressemble &agrave; quoi, quand quelqu'un vous dit que vous n'avez pas le droit d'aider quelqu'un d'autre&nbsp;? Voici une connaissance utile et vous pourriez aider votre prochain en la partageant, mais il vous est interdit de partager avec d'autres personnes. Cela sape la coh&eacute;sion de la soci&eacute;t&eacute;, l'&eacute;clatant en individus isol&eacute;s qui ne peuvent s'entraider.

source: Free software is the contrast to this. Free software means that you have four essential freedoms. Freedom zero is the freedom to run the program for any purpose, in any way that you want to. Freedom one is the freedom to help yourself by studying the source code to see what the program does and then changing it to suit your needs. Freedom two is the freedom to help you neighbor by distributing copies to others. And freedom three is the freedom to help build your community by publishing an improved version so others can use your version instead, so others can get the benefit of your help. With these freedoms, the users control the software they use. If these freedoms are lacking, then the [software] owner controls the software and controls the users.
fr: Le logiciel libre est l'oppos&eacute; de cela. Le logiciel libre signifie que vous avez quatre libert&eacute;s essentielles. La libert&eacute; z&eacute;ro est la libert&eacute; d'ex&eacute;cuter le programme pour tout usage, de la mani&egrave;re que vous voulez. La libert&eacute; un est la libert&eacute; de vous aider en &eacute;tudiant le code source pour voir ce que fait le programme et le modifier pour qu'il s'adapte &agrave; vos besoins. La libert&eacute; deux est la libert&eacute; d'aider votre prochain en distribuant des copies aux autres. Et la libert&eacute; trois est la libert&eacute; d'aider &agrave; construire votre communaut&eacute; en publiant une version am&eacute;lior&eacute;e de sorte que d'autres b&eacute;n&eacute;ficient de votre aide en utilisant votre version &agrave; la place. Avec ces libert&eacute;s, les utilisateurs ont le contr&ocirc;le du logiciel qu'ils utilisent. Si ces libert&eacute;s manquent, alors le propri&eacute;taire (du logiciel) contr&ocirc;le le logiciel et contr&ocirc;le les utilisateurs.

source: We all know that computers do not make decisions themselves really. They do what people told them to do. But which people told them what to do? When you are using your computer, can you tell it what to do, or is someone else telling it what to do? Who controls your computer? This is the question of free software. The freedoms in the definition of free software, freedoms zero, one, two and three, the reason why these are the freedoms that matter is because these are the freedoms necessary for citizens to control their own computers. You need freedom zero in order to be able to do whatever job you want with your computer. You need freedom one so that you can make the software do what you want it to do. If you do not have freedom one, you are stuck; you are a prisoner of your software.
fr: Nous savons tous que les ordinateurs ne prennent pas r&eacute;ellement de d&eacute;cisions eux-m&ecirc;mes. Ils font ce que les gens leur disent de faire. Mais quels sont les gens qui leur disent que faire&nbsp;? Quand vous utilisez votre ordinateur, pouvez-vous lui dire quoi faire, ou est-ce quelqu'un d'autre qui le fait&nbsp;? Qui contr&ocirc;le votre ordinateur&nbsp;? C'est le propos du logiciel libre. Les libert&eacute;s dans la d&eacute;finition du logiciel libre, libert&eacute;s z&eacute;ro, un, deux et trois. La raison pour laquelle ce sont les libert&eacute;s qui comptent, c'est parce que ces libert&eacute;s sont n&eacute;cessaires aux citoyens pour contr&ocirc;ler leurs propres ordinateurs. Vous avez besoin de la libert&eacute; z&eacute;ro pour &ecirc;tre capable de faire le travail que vous voulez avec votre ordinateur. Vous avez besoin de la libert&eacute; un pour faire faire au logiciel ce que vous voulez qu'il fasse. Si vous n'avez pas la libert&eacute; un, vous &ecirc;tes bloqu&eacute;s; vous &ecirc;tes prisonnier de votre logiciel.

source: But not everybody is a programmer. If we had just freedom one, then programmers could change the software to do what they want. But if each programmer had to make his changes personally, we would not really have much control. We would be limited to what each of us, individually, could do. Non-programmers would get no benefit at all. That is why freedom three and two are crucial, because freedoms two and three allow a group of users to work together and make the software do what they jointly want. So you are not limited to changing it individually, personally. You and 50 other people who want the same thing, you can get together. If two or three of you are programmers, they can make the changes, and then they can distribute it to all the rest of you. You could all put money in and pay a programmer to make the changes you want. Your company could pay a programmer to make the changes your company wants. Then if you publish the improved version, everybody can use it. Thus, all of society gets control over what its software does.
fr: Mais tout le monde n'est pas programmeur. Si nous avions seulement la libert&eacute; un, alors les programmeurs pourraient modifier le logiciel pour faire ce qu'ils veulent. Mais si chaque programmeur devait faire ces changements personnellement, nous n'aurions pas vraiment de contr&ocirc;le. Nous serions limit&eacute;s &agrave; ce que chacun de nous, individuellement, pourrait faire. Les non-programmeurs n'en tireraient aucun b&eacute;n&eacute;fice. C'est pourquoi les libert&eacute;s trois et deux sont cruciales, parce qu'elles permettent &agrave; un groupe d'utilisateurs de travailler ensemble et de faire faire au logiciel ce qu'ils veulent, conjointement, qu'il fasse. Aussi, vous n'&ecirc;tes pas limit&eacute; &agrave; le changer vous-m&ecirc;me individuellement. Vous et cinquante autres personnes qui voulez la m&ecirc;me chose, vous pouvez l'obtenir ensemble. Si deux ou trois d'entre vous sont des programmeurs, ils peuvent faire les modifications, et ils peuvent les distribuer &agrave; tous les autres. Vous pourriez tous donner de l'argent et payer un programmeur pour faire les changements que vous voulez. Votre soci&eacute;t&eacute; pourrait payer un programmeur pour faire les changements que votre soci&eacute;t&eacute; souhaite. Ensuite, si vous publiez la version am&eacute;lior&eacute;e, tout le monde peut l'utiliser. Par cons&eacute;quent, toute la soci&eacute;t&eacute; a le contr&ocirc;le sur ce que son logiciel fait.

source: Free software is a method, a democratic method, for deciding the development of software. But it is democratic in an unusual way, because we do not hold an election and then tell everybody what to do. Nobody tells people what to do in the free software community; everybody makes his own decision. But what happens is this: If many people want the software to improve in that direction, many people will work on changing it, so the software will develop rapidly in that direction. If a few people want the software to develop in that direction, a few of them will make an effort, so it will develop slowly in that direction. If nobody wants it to develop in that direction, it will not. By each of us deciding what we are going to do, we all contribute to what happens and to deciding which direction the software will develop.
fr: Le logiciel libre est une m&eacute;thode, une m&eacute;thode d&eacute;mocratique, pour d&eacute;cider du d&eacute;veloppement d'un logiciel. Mais c'est d&eacute;mocratique d'une mani&egrave;re inhabituelle, car nous ne faisons pas d'&eacute;lection, et nous ne disons pas &agrave; chacun ce qu'il doit faire. Personne ne dit aux gens ce qu'ils doivent faire dans la communaut&eacute; du logiciel libre&nbsp;; chacun prend ses propres d&eacute;cisions. Mais voici commentcela fonctionne&nbsp;: si beaucoup de gens veulent que le logiciel s'am&eacute;liore dans une direction, beaucoup de gens travaillerons pour le modifier, aussi, le logiciel se d&eacute;veloppera rapidement dans cette direction. Si peu de gens veulent que le logiciel se d&eacute;veloppe dans cette direction, peu d'entre eux feront un effort, et alors il se d&eacute;veloppera lentement dans cette direction. Si personne ne veut qu'il se d&eacute;veloppe dans cette direction, il ne le sera pas. Parce que chacun de nous d&eacute;cide de ce qu'il va faire, nous contribuons tous &agrave; ce qui arrive et &agrave; la d&eacute;cision de la direction que prendra le logiciel.

source: So society collectively has control over how the software will develop overall. But you, individually, or any group or company can decide how to develop it themselves. The result is that free software tends to do what users want, instead of what the developers want.
fr: Donc, la soci&eacute;t&eacute; a un contr&ocirc;le collectif sur la mani&egrave;re dont se d&eacute;veloppera le logiciel. Mais vous pouvez, individuellement, ou tout groupe ou soci&eacute;t&eacute;, peut d&eacute;cider de le d&eacute;velopper eux-m&ecirc;mes. Le r&eacute;sultat est que le logiciel libre tend &agrave; faire ce que les utilisateurs veulent, plut&ocirc;t que ce que les d&eacute;veloppeurs veulent.

source: People often ask, &ldquo;If everybody is free to change the software, what does that do for compatibility?&rdquo; Well the fact is, users like compatibility. It is not the only thing they like. Sometimes, certain users want an incompatible change because it has other benefits, and if so they can do it. But most users want compatibility. The result is most free software developers try very hard to be compatible. Guess what would happen if I made an incompatible difference in my program and the users did not like it. Some user would change the program and make it compatible, and then most users would prefer his version. So his version would become popular and mine would be forgotten. Now, I do not want that to happen, of course. I want people to like and use my version, so I am going to recognize this in advance and I am going to make my version compatible from the beginning because I want people to like it. So in our community, the developers cannot resist what the users want. We have to go along or the users will go where they want and leave us behind.
fr: Les gens demandent souvent, &laquo;&nbsp;Si tout le monde est libre de modifier le logiciel, qu'advient-il de la compatibilit&eacute;&nbsp;?&nbsp;&raquo; En fait, les utilisateurs aiment la compatibilit&eacute;. Ce n'est pas la seule chose qu'ils appr&eacute;cient. Quelquefois, certains utilisateurs veulent un changement incompatible car il apporte d'autresb&eacute;n&eacute;fices, et si c'est le cas, ils peuvent le faire. Mais la plupart des utilisateurs veulent la compatibilit&eacute;. Le r&eacute;sultat est que la plupart des d&eacute;veloppeurs de logiciel libre essaient de toutes leurs forces d'&ecirc;tre compatibles. Imaginez ce qui arriverait si je cr&eacute;ais une modification incompatible dans mon programme et que les utilisateurs ne l'aiment pas. Un utilisateur modifierait le programme et le rendrait compatible, et alors la plupart des utilisateurs pr&eacute;f&eacute;reraient sa version. Donc sa version deviendrait populaire et la mienne serait oubli&eacute;e. Maintenant, je ne veux pas que cela arrive, bien s&ucirc;r. Je veux que les gens aiment et utilisent ma version, aussi, je vais le reconna&icirc;tre par avance et je rendrai ma version compatible d&egrave;s le d&eacute;but, car je veux que les gens la pr&eacute;f&egrave;rent. C'est pourquoi, dans notre communaut&eacute;, les d&eacute;veloppeurs ne peuvent pas r&eacute;sister &agrave; ce que veulent les utilisateurs. Nous devons les suivre, ou les utilisateurs iront o&ugrave; ils veulent et nous laisseront derri&egrave;re.

source: But if you look at non-free software developers, the ones who are very powerful, they can impose incompatibility and they are so powerful that the users cannot do anything. Microsoft is famous for this. They make an incompatible change in a protocol, and then the users are stuck with it. But it is not just Microsoft. Consider WAP, for instance. WAP contains modified versions of ordinary Internet protocols, modified to be incompatible, and the idea was they would make these telephones and they would say &ldquo;they can talk on the Internet&rdquo;, but since they did not use the ordinary Internet protocols, the incompatibility would be imposed on the user. That was their plan. It did not work, fortunately. But that is the danger you face when the users are not really in control: Somebody will try to impose incompatibility on the users.
fr: Mais si vous regardez du c&ocirc;t&eacute; des d&eacute;veloppeurs de logiciel non-libres, ceux qui sont tr&egrave;s puissants peuvent imposer l'incompatibilit&eacute; et ils sont si puissants que les utilisateurs ne peuvent rien y faire. Microsoft est r&eacute;put&eacute; pour cela. Ils cr&eacute;ent une incompatibilit&eacute; dans un protocole, et alors les utilisateurs sont bloqu&eacute;s avec cela. Mais il ne s'agit pas que de Microsoft. Consid&eacute;rez le WAP, par exemple. Le WAP contient des versions modifi&eacute;es de protocoles Internet ordinaires, modifi&eacute;s pour &ecirc;tre incompatibles, et l'id&eacute;e &eacute;tait qu'ils feraient ces t&eacute;l&eacute;phones et ils auraient dit &laquo;&nbsp;ils peuvent communiquer avec l'Internet&nbsp;&raquo;, mais puisqu'ils n'avaient pas utilis&eacute; les protocoles Internet ordinaires, l'incompatibilit&eacute; aurait &eacute;t&eacute; impos&eacute;e &agrave; l'utilisateur. C'&eacute;tait leur plan. Il n'a pas fonctionn&eacute;, heureusement. Mais c'est le danger que vous affrontez quand les utilisateurs n'ont pas vraiment le contr&ocirc;le, quelqu'un essaiera d'imposer l'incompatibilit&eacute; aux utilisateurs.

source: Free software is primarily a political, ethical and social issue. I have explained that level of it. It also has economic consequences. For instance, non-free software can be used to create very rich companies, where a few people collect money from everyone around the world, and those few get very rich and other people are deprived. There are many countries (Japan is not one of them, I guess) where the people who can afford a computer usually cannot afford to pay for the non-free software, for permission to use the non-free software. So in those countries, non-free software as a system creates tremendous deprivation. But in any country, money is squeezed out of most people and concentrated to a few who become very rich by non-free software. With free software, you cannot do that. You cannot squeeze a lot of money out of people, but you can do business with people as long as you are providing them with a real service.
fr: Le logiciel libre est fondamentalement une question politique, &eacute;thique et sociale. J'ai expliqu&eacute; cet aspect. Il a &eacute;galement des cons&eacute;quences &eacute;conomiques. Par exemple, des logiciels non-libres peuvent &ecirc;tre utilis&eacute;s pour cr&eacute;er de tr&egrave;s riches soci&eacute;t&eacute;s, o&ugrave; peu de gens r&eacute;coltent de l'argent de tout le monde autour du globe, et ces quelques personnes deviennent tr&egrave;s riches et les autres sont d&eacute;munis. Il y a beaucoup de pays (le Japon n'est pas l'un d'eux, je crois) o&ugrave; les gens qui ont les moyens d'avoir un ordinateur, ne peuvent habituellement pas se permettre de payer pour des logiciels non-libres, pour l'autorisation d'utiliser les logiciels non-libres. Aussi, dans ces pays, le syst&egrave;me des logiciels non-libres cr&eacute;e une terrible p&eacute;nurie. Mais dans chaque pays, l'argent est extorqu&eacute; &agrave; la plupart des gens et se concentre dans les poches de quelques personnes qui sont devenues tr&egrave;s riches gr&acirc;ce aux logiciels non-libres. Avec le logiciel libre, vous ne pouvez pas faire cela. Vous ne pouvez pas extorquer beaucoup d'argent aux gens, mais vous pouvez faire des affaires avec eux tant que vous leur fournissez un r&eacute;el service.
