Repository: gitGNU/gnu_www-fr
Catalog: philosophy/right-to-read.*.po
Languages: fr

source: The Right to Read - GNU Project - Free Software Foundation (FSF)
fr: Le droit de lire - GNU Project - Free Software Foundation (FSF)

source: The Right to Read
fr: Le droit de lire

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: <em>This article appeared in the February 1997 issue of <strong>Communications of the ACM</strong> (Volume 40, Number 2).</em>
fr: <em>Cet article a été publié dans la parution de février 1997 de Communications of the ACM (volume 40, numéro 2).</em>

source: From <cite>The Road To Tycho</cite>, a collection of articles about the antecedents of the Lunarian Revolution, published in Luna City in 2096.
fr: Extrait de «&nbsp;The Road to Tycho&nbsp;», une collection d'articles sur les antécédents de la Révolution lunaire, publiée à Luna City en 2096.

source: For Dan Halbert, the road to Tycho began in college&mdash;when Lissa Lenz asked to borrow his computer. Hers had broken down, and unless she could borrow another, she would fail her midterm project. There was no one she dared ask, except Dan.
fr: Pour Dan Halbert, la route vers Tycho commença à l'université &mdash; quand Lissa Lenz lui demanda de lui prêter son ordinateur. Le sien était en panne, et à moins qu'elle puisse en emprunter un autre, elle échouerait son projet de mi-session. Il n'y avait personne d'autre à qui elle osait demander, à part Dan.

source: This put Dan in a dilemma. He had to help her&mdash;but if he lent her his computer, she might read his books. Aside from the fact that you could go to prison for many years for letting someone else read your books, the very idea shocked him at first. Like everyone, he had been taught since elementary school that sharing books was nasty and wrong&mdash;something that only pirates would do.
fr: Ceci posa un dilemme à Dan. Il se devait de l'aider &mdash; mais s'il lui prêtait son ordinateur, elle pourrait lire ses livres. À part le fait que vous pouviez aller en prison pour plusieurs années pour avoir laissé quelqu'un lire vos livres, l'idée même le choqua au départ. Comme à tout le monde, on lui avait enseigné dès l'école primaire que partager des livres était malicieux et immoral &mdash; une chose que seuls les pirates font.

source: And there wasn't much chance that the SPA&mdash;the Software Protection Authority&mdash;would fail to catch him. In his software class, Dan had learned that each book had a copyright monitor that reported when and where it was read, and by whom, to Central Licensing. (They used this information to catch reading pirates, but also to sell personal interest profiles to retailers.) The next time his computer was networked, Central Licensing would find out. He, as computer owner, would receive the harshest punishment&mdash;for not taking pains to prevent the crime.
fr: Et il était improbable que la SPA &mdash; la Software Protection Authority &mdash; manquerait de le pincer. Dans ses cours sur les logiciels, Dan avait appris que chaque livre avait un moniteur de copyright qui rapportait quand et où il était lu, et par qui, à la Centrale des licences. (Elle utilisait ces informations pour attraper les lecteurs pirates, mais aussi pour vendre des renseignements personnels à des détaillants.) La prochaine fois que son ordinateur serait en réseau, la Centrale des licences se rendrait compte. Dan, comme propriétaire d'ordinateur, subirait les punitions les plus sévères &mdash; pour ne pas avoir tout tenté pour éviter le délit.

source: Of course, Lissa did not necessarily intend to read his books. She might want the computer only to write her midterm. But Dan knew she came from a middle-class family and could hardly afford the tuition, let alone her reading fees. Reading his books might be the only way she could graduate. He understood this situation; he himself had had to borrow to pay for all the research papers he read. (Ten percent of those fees went to the researchers who wrote the papers; since Dan aimed for an academic career, he could hope that his own research papers, if frequently referenced, would bring in enough to repay this loan.)
fr: Bien sûr, Lissa n'avait pas nécessairement l'intention de lire ses livres. Elle pourrait ne vouloir l'ordinateur que pour écrire son projet. Mais Dan savait qu'elle venait d'une famille de classe moyenne et qu'elle arrivait difficilement à payer ses frais de scolarité, sans compter ses frais de lecture. Lire les livres de Dan pourrait être sa seule façon d'obtenir son diplôme. Il comprenait cette situation; lui-même avait eu à emprunter pour payer pour tous les articles scientifiques qu'il avait eu à lire. (10% de ces frais allaient aux chercheurs qui écrivaient ces articles; puisque Dan visait une carrière académique, il pouvait espérer que si ses propres articles scientiques étaient souvent lus, il gagnerait un revenu suffisant pour rembourser sa dette).

source: Later on, Dan would learn there was a time when anyone could go to the library and read journal articles, and even books, without having to pay. There were independent scholars who read thousands of pages without government library grants. But in the 1990s, both commercial and nonprofit journal publishers had begun charging fees for access. By 2047, libraries offering free public access to scholarly literature were a dim memory.
fr: Par la suite, Dan apprendrait qu'il y eut un temps où n'importe qui pouvait aller à la bibliothèque et lire des articles de journaux, et même des livres, sans avoir à payer. Il y avait des universitaires indépendants qui lisaient des milliers de pages sans subventions des bibliothèques gouvernementales. Maisdans les années 1990, les éditeurs aussi bien commerciaux qu'à but non lucratif avaient commencé à facturer l'accès. En 2047, les bibliothèques offrant un accès public gratuit à la littérature scientifique n'étaient qu'un pâle souvenir.

source: There were ways, of course, to get around the SPA and Central Licensing. They were themselves illegal. Dan had had a classmate in software, Frank Martucci, who had obtained an illicit debugging tool, and used it to skip over the copyright monitor code when reading books. But he had told too many friends about it, and one of them turned him in to the SPA for a reward (students deep in debt were easily tempted into betrayal). In 2047, Frank was in prison, not for pirate reading, but for possessing a debugger.
fr: Il y avait des façons, bien sûr, de contourner la SPA et la Centrale des licences. Elles étaient elles-mêmes illégales. Dan avait eu un compagnon de classe dans son cours sur les logiciels, Frank Martucci, qui avait obtenu un outil illégal de déboguage, et l'avait utilisé pour outrepasser le code du moniteur de copyright quand il lisait des livres. Mais il en avait parlé à trop d'amis, et l'un d'eux l'a dénoncé auprès de la SPA pour une récompense (des étudiants criblés de dettes pouvaient facilement être tentés par la trahison). En 2047, Frank était en prison, non pas pour lecture pirate, mais pour possession d'un débogueur.

source: Dan would later learn that there was a time when anyone could have debugging tools. There were even free debugging tools available on CD or downloadable over the net. But ordinary users started using them to bypass copyright monitors, and eventually a judge ruled that this had become their principal use in actual practice. This meant they were illegal; the debuggers' developers were sent to prison.
fr: Dan apprendrait plus tard qu'il y eut un temps où n'importe qui pouvait posséder des outils de déboguage. Il y avait même des outils de déboguage disponibles gratuitement sur des CD ou qu'on pouvait télécharger du Net. Mais des usagers ordinaires commencèrent à s'en servir pour outrepasser les moniteurs de copyright, et finalement un juge a décidé que c'était devenu leur principale utilisation en pratique. Ceci voulait dire qu'ils étaient illégaux; les développeurs de ces débogueurs furent envoyés en prison.

source: Programmers still needed debugging tools, of course, but debugger vendors in 2047 distributed numbered copies only, and only to officially licensed and bonded programmers. The debugger Dan used in software class was kept behind a special firewall so that it could be used only for class exercises.
fr: Les programmeurs avaient encore besoin d'outils pour déboguer, bien sûr, mais les vendeurs de débogueurs en 2047 ne distribuaient que des copies numérotées, et seulement à des programmeurs officiellement licenciés et soumis. Le débogueur que Dan utilisait dans son cours sur les logiciels était gardé derrière un garde-barrière spécial afin qu'il ne puisse servir que pour les exercices du cours.

source: It was also possible to bypass the copyright monitors by installing a modified system kernel. Dan would eventually find out about the free kernels, even entire free operating systems, that had existed around the turn of the century. But not only were they illegal, like debuggers&mdash;you could not install one if you had one, without knowing your computer's root password. And neither the <abbr title="Federal Bureau of Investigation">FBI</abbr> nor Microsoft Support would tell you that.
fr: Il était aussi possible de contourner les moniteurs de copyright en installant un noyau système modifié. Dan apprendrait finalement l'existence de noyaux libres, et même de systèmes d'exploitation entièrement libres, qui avaient existé au tournant du siècle. Mais non seulement étaient-ils illégaux, comme les débogueurs, mais vous ne pouviez en installer un, si vous en aviez un, sans connaître le mot de passe de l'usager superviseur de votre ordinateur. Or, ni le FBI ni l'Aide technique Microsoft ne vous le révèlerait.

source: Dan concluded that he couldn't simply lend Lissa his computer. But he couldn't refuse to help her, because he loved her. Every chance to speak with her filled him with delight. And that she chose him to ask for help, that could mean she loved him too.
fr: Dan conclut qu'il ne pouvait simplement prêter son ordinateur à Lissa. Mais il ne pouvait refuser de l'aider, car il l'aimait. Chaque chance de lui parler le remplissait d'aise. Et le fait qu'elle l'avait choisi pour demander de l'aide pouvait signifier qu'elle l'aimait aussi.

source: Dan resolved the dilemma by doing something even more unthinkable&mdash;he lent her the computer, and told her his password. This way, if Lissa read his books, Central Licensing would think he was reading them. It was still a crime, but the SPA would not automatically find out about it. They would only find out if Lissa reported him.
fr: Dan résolut le dilemme en faisant une chose encore plus impensable &mdash; il lui prêta l'ordinateur, et lui dit son mot de passe. Ainsi, si Lissa lisait ses livres, la Centrale des licences penserait que c'était lui qui les lisait. C'était quand même un délit, mais la SPA ne s'en rendrait pas compte automatiquement. Ils ne s'en rendraient compte que si Lissa le dénonçait.

source: Of course, if the school ever found out that he had given Lissa his own password, it would be curtains for both of them as students, regardless of what she had used it for. School policy was that any interference with their means of monitoring students' computer use was grounds for disciplinary action. It didn't matter whether you did anything harmful&mdash;the offense was making it hard for the administrators to check on you. They assumed this meant you were doing something else forbidden, and they did not need to know what it was.
fr: Bien sûr, si l'école devait un jour apprendre qu'il avait donné son propre mot de passe à Lissa, ce serait la fin de leurs études, peu importe ce à quoi le mot de passe aurait servi. La politique de l'école était que toute interférence avec ses mécanismes de surveillance de l'utilisation des ordinateurs par les étudiants était punissable. Il n'importait pas qu'aucun mal n'ait été fait &mdash; l'offense était de se rendre difficile àsurveiller par les administrateurs. Ils supposaient que ça signifiait que vous faisiez quelque chose d'autre qui était interdit, et ils n'avaient pas besoin de savoir de quoi il s'agissait.

source: Students were not usually expelled for this&mdash;not directly. Instead they were banned from the school computer systems, and would inevitably fail all their classes.
fr: Les étudiants n'étaient habituellement pas expulsés pour cela &mdash; pas directement. Ils étaient plutôt bannis des systèmes informatiques de l'école, et échouaient inévitablement leurs cours.

source: Later, Dan would learn that this kind of university policy started only in the 1980s, when university students in large numbers began using computers. Previously, universities maintained a different approach to student discipline; they punished activities that were harmful, not those that merely raised suspicion.
fr: Plus tard, Dan apprendrait que ce genre de politique n'a commencé dans les universités que dans les années 1980, quand des étudiants commencèrent à être nombreux à utiliser des ordinateurs. Avant, les universités avaient une approche différente au sujet de la discipline auprès des étudiants; elles punissaient des activités qui causaient du tort, et non pas simplement celles qui soulevaient des doutes.

source: Lissa did not report Dan to the SPA. His decision to help her led to their marriage, and also led them to question what they had been taught about piracy as children. The couple began reading about the history of copyright, about the Soviet Union and its restrictions on copying, and even the original United States Constitution. They moved to Luna, where they found others who had likewise gravitated away from the long arm of the SPA. When the Tycho Uprising began in 2062, the universal right to read soon became one of its central aims.
fr: Lissa ne dénonça pas Dan à la SPA. La décision de Dan de l'aider mena à leur mariage, et les amena aussi à remettre en question ce qu'on leur avait enseigné durant leur enfance au sujet du piratage. Le couple se mit à lire sur l'histoire du copyright, sur l'Union soviétique et ses restrictions sur la copie, et même sur la Constitution originale des États-Unis. Ils déménagèrent à Luna, où ils trouvèrent d'autres gens qui comme eux avaient pris leurs distances par rapport au bras long de la SPA. Quand la révolte de Tycho commença en 2062, le droit universel de lire devint bientôt un de ses buts principaux.

source: Author's Note
fr: Note de l'auteur

source: The right to read is a battle being fought today. Although it may take 50 years for our present way of life to fade into obscurity, most of the specific laws and practices described above have already been proposed; many have been enacted into law in the US and elsewhere. In the US, the 1998 Digital Millenium Copyright Act (DMCA) established the legal basis to restrict the reading and lending of computerized books (and other works as well). The European Union imposed similar restrictions in a 2001 copyright directive. In France, under the DADVSI law adopted in 2006, mere possession of a copy of DeCSS, the free program to decrypt video on a DVD, is a crime.
fr: C'est aujourd'hui même qu'on se bat pour le droit de lire. Même si cela pourrait prendre 50 ans pour que notre façon de vivre actuelle s'efface dans l'obscurité, la plupart des lois et pratiques décrites précédemment ont déjà été proposées&nbsp;; plusieurs ont été décrétées légalement aux USA et ailleurs. Aux USA, le <acronym title="Digital Millenium Copyright Act">DMCA</acronym> (ndt&nbsp;: Loi sur le droit d'auteur du millénaire numérique) de 1998 a établi la base légale pour restreindre la lecture et le prêt de livres numérisés (et d'autres données également). L'Union Européenne a imposé des restrictions similaires dans une directive de 2001 concernant le copyright. En France, avec la loi <acronym title="Droit d'auteur et droits voisins dans la société de l'information">DADVSI</acronym>, la simple possession d'une copie de DeCSS, le programme libre permettant de déchiffrer une vidéo sur un DVD, est un délit.

source: In 2001, Disney-funded Senator Hollings proposed a bill called the SSSCA that would require every new computer to have mandatory copy-restriction facilities that the user cannot bypass. Following the Clipper chip and similar US government key-escrow proposals, this shows a long-term trend: computer systems are increasingly set up to give absentees with clout control over the people actually using the computer system. The SSSCA was later renamed to the unpronounceable CBDTPA, which was glossed as the &ldquo;Consume But Don't Try Programming Act&rdquo;.
fr: En 2001, le sénateur Hollings (disposant de fonds Disney) a proposé une loi appelée SSSCA qui exigerait que chaque nouvel ordinateur ait des fonctionnalités obligatoires de restriction des copies, restrictions que l'utilisateur ne pourrait pas contourner. Après le Clipper Chip et d'autres propositions similaires de «&nbsp;key-escrow&nbsp;» émanant du gouvernement américain, ceci démontre une tendance à long terme&nbsp;: les systèmes informatiques sont de plus en plus configurés pour donner à des absents un puissant contrôle sur les personnes qui utilisent effectivement ces systêmes informatiques. Le SSSCA a depuis été rebaptisé CBDTPA (on pourrait penser cela comme le «&nbsp;Consume But Don't Try Programming Act&nbsp;» &mdash; la loi «&nbsp;Consommez mais n'essayez pas de programmer&nbsp;»).

source: The Republicans took control of the US senate shortly thereafter. They are less tied to Hollywood than the Democrats, so they did not press these proposals. Now that the Democrats are back in control, the danger is once again higher.
fr: Les Républicains prirent le contrôle du Sénat américain peu de temps après. Ils sont moins liés à Hollywood que les Démocrates, aussi n'ont-ils pas pressé ces propositions. Maintenant que les Démocrates sont de retour aux commandes, le danger est encore une fois plus grand.

source: Since then, the US has imposed similar requirements on countries such as Australia and Mexico through bilateral &ldquo;free trade&rdquo; agreements, and on countries such as Costa Rica through another treaty, CAFTA. Ecuador's President Correa refused to sign a &ldquo;free trade&rdquo; agreement with the US, but I've heard Ecuador had adopted something like the DMCA in 2003.
fr: Depuis lors, les États-Unis ont imposé des conditions similaires à des pays comme l'Australie ou le Mexique, par le biais d'accords de «&nbsp;libre échange&nbsp;» bilatéraux, et à des pays tel que le Costa Rica par le biais du <acronym title="Central American Free Trade Agreement">CAFTA</acronym> (N.d.T.&nbsp; : Accord de libre échange d'Amérique Centrale). Le président Correa de l'Équateur a refusé de signer l'accord de «&nbsp;libre échange&nbsp;», mais l'Équateur a adopté quelque chose de similaire au <acronym title="Digital Millenium Copyright Act">DMCA</acronym> en 2003. La nouvelle constitution de l'Équateur peut fournir une opportunité de s'en débarrasser.

source: One of the ideas in the story was not proposed in reality until 2002. This is the idea that the <abbr>FBI</abbr> and Microsoft will keep the root passwords for your personal computers, and not let you have them.
fr: Une des idées dans cette histoire n'avait en fait pas été proposée jusqu'en 2002. C'est l'idée que le <acronym title="Federal Bureau of Investigations">FBI</acronym> et Microsoft garderaient le mot de passe administrateur (root) de votre ordinateur et ne vous autoriseraient pas à l'obtenir.

source: The proponents of this scheme have given it names such as &ldquo;trusted computing&rdquo; and &ldquo;Palladium&rdquo;. We call it <a href="/philosophy/can-you-trust.html">&ldquo;treacherous computing&rdquo;</a> because the effect is to make your computer obey companies even to the extent of disobeying and defying you. This was implemented in 2007 as part of <a href="http://badvista.org/">Windows Vista</a>; we expect Apple to do something similar. In this scheme, it is the manufacturer that keeps the secret code, but the <abbr>FBI</abbr> would have little trouble getting it.
fr: Les instigateurs de ce dessein lui ont donné des noms tels que «&nbsp;informatique de confiance&nbsp;» et «&nbsp;Palladium&nbsp;». Nous l'appelons <a href="/philosophy/can-you-trust.fr.html">«&nbsp;informatique déloyale&nbsp;»</a>, car le résultat est de faire obéir votre ordinateur à des sociétés plutôt qu'à vous. Ceci a été mis en &oelig;uvre en 2007 dans <a href="http://badvista.org/">Windows Vista</a>&nbsp;; nous nous attendons à ce que Apple fasse quelque chose de semblable. Dans cette construction, c'est le fabriquant qui conserve le code secret, mais le <acronym title="Federal Bureau of Investigations">FBI</acronym> aurait peu de peine à l'obtenir.

source: What Microsoft keeps is not exactly a password in the traditional sense; no person ever types it on a terminal. Rather, it is a signature and encryption key that corresponds to a second key stored in your computer. This enables Microsoft, and potentially any web sites that cooperate with Microsoft, the ultimate control over what the user can do on his own computer.
fr: Ce que conserve Microsoft n'est pas exactement un mot de passe au sens traditionnel du terme&nbsp;; personne ne le tape sur son clavier. C'est plutôt une signature et une clé de chiffrement qui correspondent à une seconde clé stockée sur votre ordinateur dans un endroit que vous ne pouvez lire. Ceci permet à Microsoft et potentiellement tout site Web coopérant avec lui, le contrôle sur ce que l'utilisateur peut faire avec son propre ordinateur.

source: When this story was first written, the SPA was threatening small Internet service providers, demanding they permit the SPA to monitor all users. Most ISPs surrendered when threatened, because they cannot afford to fight back in court. One ISP, Community ConneXion in Oakland, California, refused the demand and was actually sued. The SPA later dropped the suit, but obtained the DMCA, which gave them the power they sought.
fr: À l'époque où cette histoire a été écrite, la SPA menaçait de petits fournisseurs d'accès à Internet, en exigeant qu'ils lui permettent de surveiller tous les usagers. La plupart des fournisseurs capitulèrent lorsqu'ils furent menacés, parce qu'ils n'avaient pas les moyens decontre-attaquer en cour. (Atlanta Journal-Constitution, 1er octobre 1996, page D3.) Au moins un fournisseur, Community ConneXion à Oakland en Californie, a refusé la demande et a été réellement poursuivi. Plus tard, la SPA a laissé tomber la plainte, mais elle a obtenu le <acronym title="Digital Millenium Copyright Act">DMCA</acronym>, qui lui donne le pouvoir qu'ils recherchaient.

source: The university security policies described above are not imaginary. For example, a computer at one Chicago-area university displayed this message upon login:
fr: Les politiques universitaires de sécurité décrites précédemment ne sont pas imaginaires. Par exemple, un ordinateur dans une université de la région de Chicago affiche le message suivant quand on s'y branche (les guillemets sont dans l'original &mdash; ce qui suit est une traduction)&nbsp;:
