Repository: gitGNU/gnu_www-fr
Catalog: philosophy/right-to-read.*.po
Languages: fr

source: This system is for the use of authorized users only. Individuals using this computer system without authority or in the excess of their authority are subject to having all their activities on this system monitored and recorded by system personnel. In the course of monitoring individuals improperly using this system or in the course of system maintenance, the activities of authorized user may also be monitored. Anyone using this system expressly consents to such monitoring and is advised that if such monitoring reveals possible evidence of illegal activity or violation of University regulations system personnel may provide the evidence of such monitoring to University authorities and/or law enforcement officials.
fr: «&nbsp;Ce système est réservé aux usagers autorisés. Les individus qui utilisent ce système informatique sans autorisation ou au delà de leur autorisation pourront faire l'objet d'une surveillance et d'un enregistrement par le personnel de toutes leurs activités sur ce système. Lors de la surveillance d'individus utilisant le système inadéquatement, ou lors d'activités d'entretien du système, les activités d'usagers autorisés pourraient aussi être surveillées. Quiconque utilise ce système consent expressément à une telle surveillance et est avisé que si cette surveillance révèle des indices d'une possible activité illégale ou violation des règlements de l'Université, le personnel du système peut fournir ces indices aux autorités de l'Université et/ou aux forces de l'ordre&nbsp;».

source: This is an interesting approach to the Fourth Amendment: pressure most everyone to agree, in advance, to waive their rights under it.
fr: Il s'agit d'une approche intéressante face au Quatrième amendement&nbsp;: faire pression sur presque tout le monde pour qu'il accepte d'avance de renoncer aux droits qu'il leur accorde.

source: References
fr: Références

source: <a href="http://www.wired.com/wired/archive/4.01/white.paper_pr.html">An explanation of the White Paper: The Copyright Grab</a>, Pamela Samuelson, Wired, Jan. 1996
fr: <a href="http://www.wired.com/wired/archive/4.01/white.paper_pr.html">Une explication du libre blanc&nbsp;: The Copyright Grab</a>, Pamela Samuelson, Wired, Jan. 1996

source: <a href="http://www.public-domain.org/">Union for the Public Domain</a>&mdash;an organization which aims to resist and reverse the overextension of copyright and patent powers.
fr: <a href="http://www.public-domain.org/">Union for the Public Domain</a>&mdash; une organisation dont le but est de résister et de renverser la surextension des pouvoirs du copyright et des brevets.

source: This essay is published in <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>.
fr: Cet essai est publié dans <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>.

source: <strong>Other Texts to Read</strong>
fr: <strong>Autres textes à lire</strong>

source: <a href="/philosophy/philosophy.html">Philosophy of the GNU Project</a>
fr: <a href="/philosophy/philosophy.fr.html">Philosophie du projet GNU</a>

source: <a href="http://www.computerworld.com/managementtopics/management/opinion/story/0,10801,49358,00.html" id="COPYPROCTECTION">Copy Protection: Just Say No</a>, Published in Computer World.
fr: <a href="http://www.computerworld.com/managementtopics/management/opinion/story/0,10801,49358,00.html" id="COPYPROCTECTION">Copy Protection: Just Say No</a>, publié dans Computer World.

source: The <a href="#AuthorsNote">author's note</a> talks about the battle for the right to read and electronic surveillance. The battle is beginning now; here are links to two articles about technologies now being developed to deny you the right to read.
fr: La <a href="#AuthorsNote">note de l'auteur</a> parle de la bataille pour le droit de lire, et de la surveillance électronique. La bataille a déjà commencé, voici deux liens vers des articles présentant les technologies déjà développées pour interdire le droit à la lecture&nbsp;:

source: <a href="http://channels.microsoft.com/presspass/press/1999/Aug99/SeyboldPR.asp">Books inside Computers:</a> Software to control who can read books and documents on a PC.
fr: <a href="http://channels.microsoft.com/presspass/press/1999/Aug99/SeyboldPR.asp">Books inside Computers</a>&nbsp; Les logiciels pour contrôler qui peut lire des livres et des documents sur un PC.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.

source: Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
fr: Cette page peut-être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Pierre Sarrazin.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:
