Repository: gitGNU/gnu_www-fr
Catalog: philosophy/rms-kol.*.po
Languages: fr

source: Richard Stallman's speech in Kolkata (Calcutta), August 2006 - GNU Project - Free Software Foundation (FSF)
fr: Discours de Richard Stallman &agrave; Kolkata (Calcutta), ao&ucirc;t 2006 - GNU Project - Free Software Foundation (FSF)

source: Richard Stallman's speech in Kolkata (Calcutta), August 2006
fr: Discours de Richard Stallman &agrave; Kolkata (Calcutta), ao&ucirc;t 2006

source: by <strong>Richard Stallman</strong>
fr: par <strong>Richard Stallman</strong>

source: There are a number of reasons why I'm not a communist. The first of them is that I'm not against the idea of private business, as long as it does not oppose people's human rights and the interests of society. Business is legitimate as long as it treats the rest of society decently.
fr: Il y a beaucoup de raisons pour lesquelles je ne suis pas communiste. La premi&egrave;re d'entre-elles est que je ne suis pas contre l'id&eacute;e d'entreprise priv&eacute;e, tant qu'elle ne s'oppose pas aux droits de l'homme et aux int&eacute;r&ecirc;ts de la soci&eacute;t&eacute;. Les affaires sont l&eacute;gitimes tant qu'elles traitent le reste de la soci&eacute;t&eacute; d&eacute;cemment.

source: Computing is a new area of human life. So we have to think about the human rights associated with this. What are the human rights software users are entitled to? Four freedoms define Free Software. A programme is Free Software for a user if:
fr: L'informatique est un nouveau domaine dans la vie des hommes. Nous devons donc penser aux droits de l'homme associ&eacute;s &agrave; ceci. Quels sont les droits de l'homme auxquels un utilisateur de logiciels peut pr&eacute;tendre&nbsp;? Quatre libert&eacute;s d&eacute;finissent le logiciel libre. Un programme est un logiciel libre si on peut&nbsp;:

source: Freedom 0: Run the software as you wish.
fr: Libert&eacute; 0&nbsp;: ex&eacute;cuter le logiciel comme on l'entend.

source: Freedom 1: Share the source code and change it.
fr: Libert&eacute; 1&nbsp;: partager le code source et le modifier.

source: Freedom 2: Help your neighbour and distribute and publish.
fr: Libert&eacute; 2&nbsp;: aider son voisin et distribuer et publier.

source: Freedom 3: Help your community and distribute your modified versions.
fr: Libert&eacute; 3&nbsp;: aider sa communaut&eacute; en distribuant ses versions modifi&eacute;es.

source: With these 4 Freedoms, you can live an upright life with your community. If you use non-free, proprietary software, the developer has the power to decide what you can do. He can use that power over you. Like Microsoft. That game is evil. Nobody should play it. So its not a question of beating Microsoft at its game. I set out to get away from that game.
fr: Avec ces quatre libert&eacute;s, vous pouvez vivre une vie int&egrave;gre avec votre communaut&eacute;. Si vous utilisez des logiciels non-libres, propri&eacute;taires, le d&eacute;veloppeur a le pouvoir de d&eacute;cider ce que vous pouvez faire. Il peut utiliser ce pouvoir par devers vous. Comme Microsoft. Ce jeu est malsain. Personne ne devrait y jouer. C'est pourquoi il ne s'agit pas de battre Microsoft &agrave; son propre jeu. J'ai d&eacute;cid&eacute; de m'&eacute;loigner de ce jeu.

source: Once GNU-Linux was ready in 1992, it began to catch on. It was reliable, powerful, cheap and flexible. Thousands and millions of people began to use GNU-Linux. But the ideals of freedom began to be forgotten though. In 1998, people stopped talking about Free Software. Instead they said &ldquo;open source&rdquo;. That was a way of not saying &ldquo;free&rdquo; and not mentioning the ideas behind it. I don't disagree with that, but that's not what I am interested in. What I'm really interested in most of all is to teach people to value their freedoms and to fight for them. In software, as in the US, our freedom is threatened. So the basic things we need to do are: remember our freedom frequently, value it and insist on it. When someone says they protect me from terrorism by taking away my freedom&mdash;say No! Similarly, with software that threatens our freedom, that might give us some temporary comparative advantage&mdash;we should say No!
fr: Quand GNU/Linux fut pr&ecirc;t en 1992, il a commenc&eacute; &agrave; prendre. Il &eacute;tait fiable, puissant, peu cher et flexible. Des milliers et des millions de gens ont commenc&eacute; &agrave; utiliser GNU/Linux. Mais les id&eacute;aux de libert&eacute; ont commenc&eacute; &agrave; &ecirc;tre oubli&eacute;s cependant. En 1998, les gens ont arr&ecirc;t&eacute; de parler de logiciel libre. Ils utilisaient &agrave; la place &laquo;&nbsp;open source&nbsp;&raquo;. C'&eacute;tait une fa&ccedil;on de ne pas dire &laquo;&nbsp;libre&nbsp;&raquo; et de ne pas mentionner les id&eacute;es sous-jacentes. Je ne suis pas en d&eacute;saccord avec cela, mais ce n'est pas ce qui m'int&eacute;resse. Ce qui m'interesse par dessus tout est d'apprendre aux gens &agrave; accorder de l'importance &agrave; leurs libert&eacute;s et de se battre pour elles. Dans les logiciels, comme aux &Eacute;tats-Unis, notre libert&eacute; est menac&eacute;e. Donc, les choses &eacute;l&eacute;mentaires que nous devons faire sont&nbsp;: de se rappeler de notre libert&eacute; fr&eacute;quemment, de lui accorder de la valeur et d'insister dessus. Quand quelqu'un dit qu'il vous prot&egrave;ge du terrorisme en retirant votre libert&eacute;, dites Non&nbsp;! De la m&ecirc;me mani&egrave;re, avec des logiciels qui menacent notre libert&eacute;, qui pourraient nous donner quelque avantage comparatiftemporaire, nous devons dire Non&nbsp;!

source: West Bengal should not follow the world trend. It should stand up for freedom. That's different. No! I'm not going to let the world lead me where it wants to go. I'm going where freedom is. If you're going elsewhere&mdash;I'm not going there. It requires firmness, it requires a decision that says freedom matters and hence it must be promoted. Even if that's inconvenient. Freedom needs some sacrifices, some inconvenience, some price. But it's a small price to pay.
fr: Le Bengale occidental ne devrait pas suivre la tendance mondiale. Il devrait se lever pour la libert&eacute;. C'est diff&eacute;rent. Non&nbsp;! Je ne vais pas laisser le monde me mener o&ugrave; il veut aller. Je vais o&ugrave; se trouve la libert&eacute;. Si vous allez ailleurs, je n'y irai pas. Cela n&eacute;cessite de la fermet&eacute;, cela n&eacute;cessite une d&eacute;cision qui dit que la libert&eacute; compte et qu'elle doit par cons&eacute;quent &ecirc;tre promue. M&ecirc;me si c'est g&ecirc;nant. La libert&eacute; n&eacute;cessite des sacrifices, des inconv&eacute;nients et a un prix. Mais c'est un prix modique &agrave; payer.

source: By globalisation, people usually mean globalisation of the power of business. Business should not have political power. Otherwise democracy becomes sick. And with globalisation of business power, this political power is enhanced. Free trade treaties are designed to attack democracy. For instance, it explicitly allows any business to sue government if a law makes its profit less than it has been. Companies have to be paid for the permission to do anything of social or environmental importance. Not all free trade treaties do this explicitly. They do it implicitly. Companies can threaten to move away elsewhere. And they do use this threat. This actually happened some years ago, with the EU software patents. The govt of Denmark was threatened that if they did not support this the company would move the business elsewhere. This tiny threat was sufficient to blackmail the govt of Denmark. If you allow a foreign mega-corporation to buy a domestic corporation, you are allowing it to buy a weapon pointed against your country. The environment, public health, general standards of living&mdash;are all important, and free trade treaties should be abolished. They are harmful to freedom, health and the lives of people.
fr: Par mondialisation, les gens veulent dire habituellement mondialisation du pouvoir des entreprises. Les entreprises ne devraient pas avoir de pouvoir politique. Sinon, la d&eacute;mocratie tombe malade. Et avec la mondialisation du pouvoir des entreprises, ce pouvoir politique est accru. Les trait&eacute;s de libre &eacute;change sont con&ccedil;us pour attaquer la d&eacute;mocratie. Par exemple, ils permettent &agrave; toute entreprise de poursuivre en justice un gouvernement si une loi diminue ses b&eacute;n&eacute;fices. Les soci&eacute;t&eacute;s doivent &ecirc;tre pay&eacute;es pour donner l'autorisation de faire quoi que ce soit d'importance sociale ou environnementale. Tous les trait&eacute;s de libre &eacute;change ne font pas cela explicitement. Ils le font implicitement. Les entreprises peuvent menacer de d&eacute;m&eacute;nager ailleurs. Et elles utilisent cette menace. Ceci est en fait arriv&eacute; il y a quelques ann&eacute;es, avec les brevets logiciels de l'Union europ&eacute;enne. Le gouvernement du Danemark avait &eacute;t&eacute; menac&eacute; que s'ils ne soutenaient pas les brevets, l'entreprise d&eacute;m&eacute;nageraitailleurs. Cette petite menace fut suffisante pour faire chanter le gouvernement du Danemark. Si vous autorisez une m&eacute;ga-corporation &agrave; acqu&eacute;rir une soci&eacute;t&eacute; locale, vous l'autorisez &agrave; acheter une arme point&eacute;e sur votre pays. L'environnement, la sant&eacute; publique, le mode de vie, sont tous importants, et les trait&eacute;s de libre &eacute;change devraient &ecirc;tre abolis. Ils sont dangereux pour la libert&eacute;, pour la sant&eacute; et pour la vie des gens.

source: I do not accept the term &ldquo;intellectual property&rdquo;. The very term is biased and confusing. It talks about useful techniques and works. It presumes they are &ldquo;property&rdquo;. It prejudges such questions. There's also a more subtle problem. It lumps together all the diverse things and makes it look like you can talk about all of them together. Copyright, patents, trade laws&mdash;are all very different. It takes the geatest efforts of the best scholars to overcome the confusion caused by the term &ldquo;intellectual property&rdquo; and to discuss the details of these individual items. The <abbr title="General Agreement on Tariffs and Trade"> GATT</abbr> Treaty and the <abbr title="Trade-Related Aspects of Intellectual Property Rights">TRIPS</abbr>&mdash;actually it should be called Trade-related Impediments to Education and Science. Free trade and enhancement of world trade harms democracy. When you globalise something evil, it becomes a greater evil. And when you globalise something good, it becomes a greater good. Human knowledge and cooperation are such &ldquo;goods&rdquo;. The Free Software Movement is a part of that. It is the globalisation of one area of human knowledge, namely software. Through global cooperation like this, you get freedom and independence for every region and every country.
fr: Je n'accepte pas le terme &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;. Ce terme est trompeur et d&eacute;routant. Il parle de techniques et de travaux utiles. Il pr&eacute;suppose qu'ils sont une &laquo;&nbsp;propri&eacute;t&eacute;&nbsp;&raquo;. Il pr&eacute;juge de telles questions. Il y a &eacute;galement un probl&egrave;me plus subtil. Il met dans le m&ecirc;me sac des choses diff&eacute;rentes et les rend telles que vous pouvez parler d'elles toutes ensemble. Les lois sur le droit d'auteur, sur les brevets et sur les marques sont toutes tr&egrave;s diff&eacute;rentes. Cela demande de tr&egrave;s gros efforts aux meilleurs universitaires pour surmonter la confusion caus&eacute;e par le terme &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; et pour discuter des d&eacute;tails de ces &eacute;l&eacute;mentsindividuellement. Le trait&eacute; du <abbr title="General Agreement on Tariffs and Trade">GATT</abbr>&nbsp;<sup><a href="#TransNote1">1</a></sup> et l'<abbr title="Aspects des droits de propri&eacute;t&eacute; intellectuelle qui touchent au commerce">ADPIC</abbr> (il devrait &ecirc;tre en fait appel&eacute;&nbsp; &laquo;&nbsp;Obstacles commerciaux relatifs &agrave; l'enseignement et &agrave; la science&nbsp;&raquo;). Le libre &eacute;change et l'accroissement du commerce mondial mettent en danger la d&eacute;mocratie. Quand vous mondialisez quelque chose de n&eacute;faste, elle devient encore plus n&eacute;faste. Et quand vous mondialisez quelque chose de b&eacute;n&eacute;fique, elle devient encore plus b&eacute;n&eacute;fique. La connaissance et la coop&eacute;ration sont de tels &ldquo;biens&rdquo;. Le Mouvement pour le logiciel libre en fait partie. C'est la mondialisation d'un domaine de la connaissance, appel&eacute; logiciel. Par l'interm&eacute;diaire d'une telle coop&eacute;ration mondiale, vous obtenez la libert&eacute; et l'ind&eacute;pendance pour chaque r&eacute;gion et chaque pays.

source: Proprietary software is a colonial system. Its electronic colonialism. And not by a country, but by a corporation. Electronic colonial powers keep people divided and helpless. Look at the end-user licensing agreement. You don't have the source code, you are helpless. You can't share, and so you are kept divided. National colonial powers recruit local elites and pay them and keep them above the rest of the people, working for the colonial masters. Today we see electronic colonial powers recruit native zamindars to keep the system intact. Microsoft sets up a research facility and in exchange it keeps its grip firmly on everyone else. Govts and schools are in their grip. They know how to do this. They know how to buy govt support. But what's the govt buying? Dependency, not development. Only Free Software constitutes development. It enables any activity to be fully under the control of the people doing it. Free Software is appropriate technology. Proprietary software is not appropriate for any use.
fr: Le logiciel propri&eacute;taire est un syst&egrave;me colonial. C'est un colonialisme &eacute;lectronique. Et pas par un pays, mais par une entreprise. Les pouvoirs du colonialisme &eacute;lectronique maintiennent les gens divis&eacute;s et impuissants. Regardez l'accord de licence logicielle de l'utilisateur final. Vous ne disposez pas du code source, vous &ecirc;tes impuissant. Vous ne pouvez pas partager, vous &ecirc;tes donc isol&eacute;. Les puissances colonialistes locales recrutent parmi les &eacute;lites locales, les paient et les maintiennent au-dessus du peuple, pour travailler pour les ma&icirc;tres coloniaux. Nous voyons aujourd'hui que les puissances colonialistes &eacute;lectroniques recrutent des Zamindars&nbsp;<sup><a href="#TransNote2">2</a></sup> pour conserver le syst&egrave;me intact. Microsoft a &eacute;tabli un complexe de recherche et en &eacute;change il garde fermement la mainmise sur tous les autres. Les gouvernements et les &eacute;coles sont sous sa coupe. Ils savent comment faire cela. Ils savent comment acheter le soutien du gouvernement. Mais qu'ach&egrave;te le gouvernement&nbsp;? La d&eacute;pendance, pas le d&eacute;veloppement. Seul le logiciel libre constitue le d&eacute;veloppement. Il permet &agrave; toute activit&eacute; d'&ecirc;tre totalement sous le contr&ocirc;le des personnes qui le font. Le logiciel libre est une technologie appropri&eacute;e. Le logiciel propri&eacute;taire n'est appropri&eacute; pour aucun usage.

source: The West Bengal govt has an opportunity to adopt a policy of firm leadership in this regard. This will give a boost to human resource development. Free Software respects people's freedom. Govt has an influence on the future of society. Choosing which software to teach students: if you teach them Windows, they will be Windows users. For something else, they need to learn, and make the effort to learn something else. Microsoft knows this. So it donates Windows to schools. Addiction (through using unauthorised software use) only helps them. They didn't want to leave anything to choice, so they give Windows free to schools. Like injecting a dose. The first dose is gratis. Afterwards its not gratis, either for them or their employers. This is a way to impose their power on the rest of society and its future. Schools have a mission to society. This mission requires teaching students to live in freedom, teaching skills to make it easy to live in freedom. This means using Free Software.
fr: Le gouvernement du Bengale occidental a l'opportunit&eacute; de montrer l'exemple en adoptant une politique ferme &agrave; cet &eacute;gard. Ceci donnera une impulsion au d&eacute;veloppement des ressources humaines. Le logiciel libre respecte la libert&eacute; des gens. Le gouvernement a une influence sur l'avenir de la soci&eacute;t&eacute;. Le choix du logiciel &agrave; enseigner aux &eacute;tudiants&nbsp;: si vous leur enseignez Windows, ce seront des utilisateurs de Windows. Pour autre chose, ils auront besoin d'apprendre, et de faire l'effort d'apprendre autre chose. Microsoft sait cela. C'est pourquoi il donne Windows aux &eacute;coles. L'addiction (par l'utilisation de logiciels t&eacute;l&eacute;charg&eacute;s ill&eacute;galement) ne peut que les aider. Ils ne voulaient pas laisser le choix, ils ont donc donn&eacute; gratuitement Windows aux &eacute;coles. C'est comme injecter une dose. La premi&egrave;re dose est gratuite. Ensuite, ce n'est plus gratuit, m&ecirc;me pour eux ou leurs employeurs. C'est un moyen d'imposer leur pouvoir sur le reste de la soci&eacute;t&eacute; et de son futur. Les &eacute;coles ont une mission soci&eacute;tale. Cette mission n&eacute;cessite d'enseigner aux &eacute;tudiants de vivre en libert&eacute;, d'enseigner les m&eacute;thodes pour faciliter la vie en libert&eacute;. Ceci signifie d'utiliser des logiciels libres.

source: Free Software is good for computer science education, to maximise the potential of natural programmers. It gives students the opportunity to really learn. Its good for the natural programmers. If you have proprietary software, the teacher says &ldquo;I don't know&rdquo;, &ldquo;You are not allowed to know, it's a secret.&rdquo; So the alternative is to give him the source codes and let him read it all. They will then learn to be really good programmers. But the most crucial reason is for the sake of moral education. Teaching them to be good corporations and benevolent, helpful citizens. This has to be taught. School has to teach by example. If you bring software to class, you must share this with other kids. Or don't bring it. Schools must follow their own rule, by bringing Free Software to class. Schools should use 100% Free Software. No proprietary software should be used in schools. Public agencies, after a migration period, should use Free Software. All software development must run on Free Software platforms. And if its released to the public, it must be Free Software. (Free: as in free speech, not free beer.)
fr: Le logiciel libre est b&eacute;n&eacute;fique pour l'enseignement en informatique, pour optimiser le potentiel des programmeurs-n&eacute;s. Il donne aux &eacute;tudiants l'opportunit&eacute; de vraiment apprendre. C'est b&eacute;n&eacute;fique pour les programmeurs-n&eacute;s. Si vous utilisez des logiciels propri&eacute;taires, l'enseignant dit&nbsp;: &laquo;&nbsp;Je ne sais pas&nbsp;&raquo;, &laquo;&nbsp;Nous ne sommes pas autoris&eacute;s &agrave; le savoir, c'est un secret&nbsp;&raquo;. L'alternative est de leur donner le code source et de les laisser le lire enti&egrave;rement. Ils apprendront alors &agrave; &ecirc;tre de bons programmeurs. Mais la raison la plus cruciale, c'est l'int&eacute;r&ecirc;t de l'&eacute;ducation morale. Leur enseigner &agrave; &ecirc;tre de bons entrepreneurs, des b&eacute;n&eacute;voles et des citoyens secourables. Ceci doit &ecirc;tre enseign&eacute;. L'&eacute;cole doit enseigner par l'exemple. Si vous amenez un logiciel en classe, vous devez le partager avec les autres. Ou ne l'amenez pas. Les &eacute;coles doivent suivre leurs propres r&egrave;gles, en apportant des logiciels libres en classe. Les &eacute;coles doivent utiliser des logiciels 100% libres. Aucun logiciel propri&eacute;taire ne devrait &ecirc;tre utilis&eacute; dans les &eacute;coles. Les agences publiques, apr&egrave;s une p&eacute;riode de migration, devraient utiliser des logiciels libres. Le d&eacute;veloppement de logiciels doit se faire sur des plateformes libres. Et s'ils sont publi&eacute;s publiquement, ce doit &ecirc;tre des logiciels libres &mdash;&laquo;&nbsp;libre&nbsp;&raquo; comme dans &laquo;&nbsp;libert&eacute; d'expression&nbsp;&raquo;, pas comme dans &laquo;&nbsp;entr&eacute;e libre&nbsp;&raquo; (entr&eacute;e gratuite).

source: One easy and useful way to put Free Software in schools&mdash;is to participate in the &ldquo;1 Laptop per Child&rdquo; programme. India recently pulled out of this programme, I'm told. I'm told the Indian govt is making lots of laws to make multinational corporations happy. Maybe this was to make Microsoft happy. Even if India is not, West Bengal can participate in the 1 Laptop per child programme. I can put them in touch with the people developing that machine.
fr: Une mani&egrave;re simple et utile d'apporter des logiciels libres dans les &eacute;coles, est de participer au programme &laquo;&nbsp;1 Laptop per Child&nbsp;&raquo;&nbsp;<sup><a href="#TransNote3">3</a></sup>. On m'a dit que r&eacute;cemment, l'Inde s'&eacute;tait retir&eacute; de ce programme. On m'a dit que l'Indeest en train de pr&eacute;parer beaucoup de lois pour satisfaire les corporations multinationales. Peut-&ecirc;tre &eacute;tait-ce pour faire plaisir &agrave; Microsoft&nbsp;? M&ecirc;me si l'Inde ne participe pas au programme &laquo;&nbsp;Un ordinateur portable par enfant&nbsp;&raquo;, le Bengale occidental peut le faire. Je peux les mettre en contact avec les personnes qui con&ccedil;oivent cet ordinateur.

source: The Govt of India is considering a vicious new copyright law, imitating US law, in favour of large businesses, and against its citizens. The only emergency I can see that requires this being rushed through is catastrophic shortfall in the dream profits of some businesses! Foreigners should not have political power. In my case, I don't.
fr: Le gouvernement d'Inde envisage une nouvelle loi vicieuse sur le copyright, imitant la loi am&eacute;ricaine, en faveur des grosses entreprises et contre les citoyens. La seule urgence que je vois pour que ceci soit pr&eacute;cipit&eacute; c'est le manque &agrave; gagner catastrophique dans les r&ecirc;ves de profits de certaines entreprises&nbsp;! Les &eacute;trangers ne devraient pas avoir de pouvoir politique local. Dans mon cas, je n'en ai pas.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;: <ol><li id="TransNote1">GATT&nbsp;: Accord g&eacute;n&eacute;ral sur les tarifs douaniers et le commerce.</li><li id="TransNote2">Zamindar&nbsp;: propri&eacute;taire terrien semi-f&eacute;odal du Bengale (caste des Zamindars).</li><li id="TransNote3"><a href="http://www.laptop.org/index.fr.html">One Laptop per Child</a>&nbsp;:Un ordinateur portable par enfant.</li></ol>
