Repository: gitGNU/gnu_www-fr
Catalog: philosophy/rtlinux-patent.*.po
Languages: fr

source: GPL-compliant version of RTLinux Open Patent License in Works - GNU Project - Free Software Foundation (FSF)
fr: La version compatible GPL de la «&nbsp;Open RTLinux Patent License&nbsp;» effective - GNU Project - Free Software Foundation (FSF)

source: GNU, FSF, Free Software Foundation, Linux, RTLinux, violation, general, public, license, gpl, general public license, GNU/Linux, Yodaiken, patent
fr: GNU, FSF, Free Software Foundation, Linux, RTLinux, violation, générale, publique, licence, gpl, general public license, GNU/Linux, Yodaiken, brevet

source: The Free Software Foundation and Finite State Machine Labs (FSMLAbs) have come to an agreement on a fully GPL-compliant version of FSMLabs RTLinux Open Patent License.
fr: La Free Software Foundation et Finite State Machine Labs (FSMLAbs) sont arrivés à un accord sur une version totalement compatible de la licence FSMLabs RTLinux Open Patent License.

source: GPL-compliant version of RTLinux Open Patent License in Works
fr: Version compatible GPL de la licence RTLinux Open Patent License dans les œuvres

source: Here is our new announcement as of Oct 8 (its actual posting was delayed).
fr: Voici notre annonce du 8 octobre (sa publication a &eacute;t&eacute; retard&eacute;e).

source: The Free Software Foundation and Finite State Machine Labs Inc. (FSMLabs) today announced the release of the Open RTLinux patent license Version 2 fully compliant with the Free Software Foundation's GNU General Public License (GNU GPL). The Open Patent License grants the right to use U.S. Patent No. 5,995,745 in GPL-covered free software without payment of a royalty. This license protects GPL use of the RTLinux process.
fr: La Free Software Foundation et Finite State Machine Labs Inc. (FSMLabs) ont annonc&eacute; aujourd'hui la sortie de la «&nbsp;Open Patent RTLinux License&nbsp;» version 2 totalement compatible avec la Licence g&eacute;n&eacute;rale publique GNU (GPL GNU) de la Free Software Foundation. La «&nbsp;Open Patent RTLinux License&nbsp;» accorde le droit d'utiliser le brevet am&eacute;ricain n&deg; 5 995 745 dans des logiciels libres couverts par la GPL, sans paiement de droits. Cette licence prot&egrave;ge l'utilisation sous GPL du processus RTLinux.

source: FSMLabs and FSF expect the release of this license to accelerate the rate of the free software revolution in the fields of embedded and realtime computing. These areas have been isolated from the mainstream of progress in software development by proprietary software based on secrets and incompatibilities designed to lock customers into proprietary technology. The availability of superior free software has already lead to many innovative projects from large corporations thousands of individuals and small companies all over the world. FSF thanks FSMLabs for its continuing contributions to the free software community.
fr: FSMLabs et la FSF comptent sur la sortie de cette licence pour acc&eacute;l&eacute;rer le rythme de la r&eacute;volution logicielle dans les domaines de l'informatique embarqu&eacute;e et temps r&eacute;el. Ces domaines ont longtemps &eacute;t&eacute; &eacute;cart&eacute;s du courant de progr&egrave;s du d&eacute;veloppement logiciel par des logiciels propri&eacute;taires fond&eacute;s sur des secrets et des incompatibilit&eacute;s con&ccedil;us pour enfermer les utilisateurs dans une technologie propri&eacute;taire. La disponibilit&eacute; de logiciels libres sup&eacute;rieurs a d&eacute;j&agrave; conduit &agrave; beaucoup de projets innovants de la part de grandes soci&eacute;t&eacute;s, de milliers de particuliers et de petites soci&eacute;t&eacute;s de par le monde. La FSF remercie FSMLabs pour ses contributions continues &agrave; la communaut&eacute; du logiciel libre.

source: Here is the previous announcement, which was the subject of our <a href="/press/2001-09-18-RTLinux.html">18 September press release</a>.
fr: Voici l'annonce pr&eacute;c&eacute;dente, qui fut le sujet de notre <a href="/press/2001-09-18-RTLinux.html">&eacute;dition du 18 septembre.</a>.

source: The Free Software Foundation and Finite State Machine Labs (FSMLAbs) have come to an agreement on a fully GPL-compliant version of FSMLabs RTLinux Open Patent License. FSF and FSMLabs are working to finalize the license language; FSMLabs will be publishing on its website the text of that license, with a statement by FSF confirming its GPL-compliant status, in the very near future. FSF has already withdrawn its press statement issued Friday September 14 concerning RTLinux license terms. Our differences turned out to be mostly a result of unfortunate miscommunications and we urge everyone to put this dispute behind them. FSF and FSMLabs expect to continue their cooperation to secure availability of FSMLabs patented technology for use in GNU/Linux systems. The FSF thanks FSMLabs for its contribution of this patent license to the free software community, and for its longstanding support and publication of free software under the GPL.
fr: La Free Software Foundation et Finite State Machine Labs (FSMLAbs) sont arriv&eacute;s &agrave; un accord sur une version totalement compatible avec la GPL de la «&nbsp;Open Patent RTLinux License&nbsp;» de FSMLabs. La FSF et FSMLabs travaillent encore &agrave; finaliser la formulation de la licence; FSMLabs publiera sur son site Web le texte de cette licence, avec une d&eacute;claration de la FSF confirmant son statut compatible avec la GPL, tr&egrave;s prochainement. La FSF a d&eacute;j&agrave; retir&eacute; sa d&eacute;claration de presse parue vendredi 14 septembre concernant les termes de la licence RTLinux. Nos divergences se sont av&eacute;r&eacute;es &ecirc;tre le r&eacute;sultat d'un malencontreux manque de communication et nous pressons chacun d'oublier cette dispute. La FSF et FSMLabs comptent continuer leur coop&eacute;ration pour s&eacute;curiser la disponibilit&eacute; de la technologie brevet&eacute;e de FSMLabs au sein de syst&egrave;mes GNU/Linux. La FSF remercie FSMLabs pour sa contribution de cette licence de brevet &agrave; la communaut&eacute; du logiciel libre, et pour son soutien de longue date et la publication de logiciels libres sous GPL.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted in any medium without royalty provide the copyright notice and this notice are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
