Repository: gitGNU/gnu_www-fr
Catalog: philosophy/second-sight.*.po
Languages: fr

source: Free Software and (e-)Government - GNU Project - Free Software Foundation (FSF)
fr: Logiciels libres et (e-)gouvernement - GNU Project - Free Software Foundation (FSF)

source: Free Software and (e-)Government
fr: Logiciels libres et (e-)gouvernement

source: This article originally appeared in The Guardian &mdash; March 3, 2005
fr: Cet article a &eacute;t&eacute; publi&eacute; &agrave; l'origine dans le journal Guardian, le 3 mars 2005

source: by <a href="http://www.stallman.org/">Richard Stallman</a>
fr: par <a href="http://www.stallman.org/">Richard Stallman</a>

source: The UK government has funded the development of software useful for e-government, and now doesn't know what to do with it. Someone had the bright idea to hand it over to local councils, inviting them to turn themselves into software companies.
fr: Le gouvernement du Royaume-Uni a financ&eacute; le d&eacute;veloppement de logiciels utiles pour le e-gouvernement et ne sait maintenant pas quoi en faire. Quelqu'un a eu la brillante id&eacute;e de les remettre aux municipalit&eacute;s en les invitant &agrave; se transformer en soci&eacute;t&eacute;s de logiciels.

source: The public have already paid to develop this software. Isn't it absurd to make them pay, now, for permission to use it? Isn't it absurd to restrict what they can do with it? Alas, such absurdity is not unusual; it is standard practice for governments to deliver publicly funded software into private hands, to companies that make the public &mdash; and even the government &mdash; beg for permission to use it afterwards.
fr: Le public a d&eacute;j&agrave; pay&eacute; pour d&eacute;velopper ces logiciels. N'est-il pas absurde de le faire payer maintenant pour avoir le droit de les utiliser&nbsp;? N'est-il pas absurde de restreindre ce qu'il peut faire avec&nbsp;? H&eacute;las, une telle absurdit&eacute; n'est pas inhabituelle&nbsp;; c'est une pratique courante des gouvernements que de mettre dans le priv&eacute; des logiciels financ&eacute;s sur des fonds publics, de les mettre dans les mains de soci&eacute;t&eacute;s qui feront mendier au public (et m&ecirc;me au gouvernement) le droit de les utiliser ensuite.

source: Even worse, they impose frustrating restrictions on the users, denying them access to the software's source code, the plans that a programmer can read and understand and change. All the users get is an executable, a &ldquo;black box&rdquo;, so that they cannot adapt it, understand it or even verify what it does.
fr: Pire, ils imposent des restrictions frustrantes aux utilisateurs, leur emp&ecirc;chant d'acc&eacute;der au code source du logiciel, c'est-&agrave;-dire les plans qu'un programmeur peut lire, comprendre et modifier. Tout ce que les utilisateurs obtiennent, c'est un ex&eacute;cutable, une &laquo;&nbsp;bo&icirc;te noire&nbsp;&raquo;, de sorte qu'ils ne peuvent pas l'adapter, le comprendre ou m&ecirc;me v&eacute;rifier ce qu'elle fait.

source: There is a sensible motive for this senseless policy. The motive is to make sure that someone cares for the software, fixing the problems that inevitably appear and adapting it to new needs. People used to believe that having some company control all use of the software, and keep all users under its thumb, was the only way to do this.
fr: Il y a une explication sens&eacute;e &agrave; cette politique insens&eacute;e. Il s'agit de s'assurer que quelqu'un s'occupera du logiciel, corrigera les probl&egrave;mes qui appara&icirc;tront in&eacute;vitablement et adaptera le logiciel &agrave; de nouveaux besoins. Les gens avaient l'habitude de croire que d'avoir une soci&eacute;t&eacute; contr&ocirc;lant tous les usages du logiciel et gardant les utilisateurs sous sa f&eacute;rule, &eacute;tait la seule mani&egrave;re d'y arriver.

source: Today, we know another way: free software (also known as open source or Foss). Free software means the users are free to use this software, redistribute it, study it, or even extend it to do more jobs.
fr: Aujourd'hui, nous connaissons un autre moyen&nbsp;: le logiciel libre (&eacute;galement connu sous le terme &laquo;&nbsp;open source&nbsp;&raquo; ou &laquo;&nbsp;Foss&nbsp;&raquo; <sup><a href="#TransNote1">1</a></sup>. Un logiciel libre signifie que les utilisateurs sont libres de l'utiliser, de le redistribuer, de l'&eacute;tudier ou m&ecirc;me de l'&eacute;tendre pour qu'il fasse plus de choses.

source: The word &ldquo;free&rdquo; refers to freedom, not price; think &ldquo;free speech&rdquo;, not &ldquo;free beer&rdquo;. When there are users that value support and are willing to pay for it, free software means a free market for support, instead of a monopoly. Free software also offers government agencies a way to fulfil their responsibility to maintain sovereign control over the state's computers, and not let that control fall into private hands.
fr: Le mot &laquo;&nbsp;free&nbsp;&raquo; se r&eacute;f&egrave;re &agrave; la libert&eacute;, pas au prix; penser &agrave; &laquo;&nbsp;free speech&nbsp;&raquo; (discours libre), non &agrave; &laquo;&nbsp;free beer&nbsp;&raquo; (bi&egrave;re gratuite). L&agrave; o&ugrave; les utilisateurs attachent de l'importance au support et souhaitent payer pour cela, le logiciel libre permet un march&eacute; libre du support au lieu d'un monopole. Le logiciel libre offre &eacute;galement aux agences gouvernementales un moyen de remplir leurs obligations en conservant un contr&ocirc;le total sur l'&eacute;tat de leurs ordinateurs, en ne laissant pas ce contr&ocirc;le tomber en des mains priv&eacute;es.

source: Since 1984, groups of volunteers have developed and maintained powerful and useful free programs &mdash; a few at first, then entire operating systems such as GNU/Linux and BSD. Today, the <a href="/directory">Free Software Directory</a> lists almost 4,000 free software packages. The UK government has already decided to increase its use of free software; here is a perfect opportunity to both use it and contribute.
fr: Depuis 1984, des groupes de volontaires ont d&eacute;velopp&eacute; et maintenu des programmes libres utiles et puissants. Peu au d&eacute;but, puis des syst&egrave;mes d'exploitation complets tels que GNU+Linux et BSD. Aujourd'hui, le Free Software Directory - le r&eacute;pertoire des logiciels libres - (<a href="/directory">http://www.gnu.org/directory</a>) recense pratiquement 4000 paquetages de logiciels libres. Le gouvernement du Royaume-Uni a d&eacute;j&agrave; d&eacute;cid&eacute; d'augmenter son utilisation de logiciels libres&nbsp;; voici une parfaite opportunit&eacute; pour &agrave; la fois les utiliser et y contribuer.

source: The Office of the Deputy Prime Minister should make the e-government programs free software, set up a site to host their development, and hire a handful of people to oversee the work. Then governments around the world will begin to use this software, fix it, extend it, and contribute the improvements back.
fr: Le Cabinet du Premier ministre devrait rendre libres les programmes de e-gouvernement, cr&eacute;er un site pour h&eacute;berger leur d&eacute;veloppement et engager un petit nombre de personnes pour superviser le travail. Alors les gouvernements de par le monde commenceront &agrave; utiliser ces logiciels, &agrave; les corriger, &agrave; les &eacute;tendre et &agrave; contribuer en retour.

source: The whole world will benefit, and all the users will admire Britain's leadership.
fr: Le monde entier en b&eacute;n&eacute;ficiera et tous les utilisateurs admireront la houlette britannique.

source: -- Richard Stallman launched the GNU operating system (www.gnu.org) in 1984 and founded the Free Software Foundation (fsf.org) in 1985.
fr: -- Richard Stallman a lanc&eacute; le syst&egrave;me d'exploitation GNU (www.gnu.org) en 1984 et a fond&eacute; la Free Software Foundation (fsf.org) (la Fondation pour le logiciel libre) en 1985.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;:<br /><ol><li id="TransNote1">FOSS&nbsp;: Free and Open Source Software - Logiciel libre et open source.</li></ol>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2005 Richard Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2005 Richard Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
