Repository: gitGNU/gnu_www-fr
Catalog: philosophy/self-interest.*.po
Languages: fr

source: Self-Interest - GNU Project - Free Software Foundation (FSF)
fr: L'int&eacute;r&ecirc;t personnel - GNU Project - Free Software Foundation (FSF)

source: Self-Interest
fr: L'int&eacute;r&ecirc;t personnel

source: by <strong>Loyd Fueston</strong>
fr: par <strong>Loyd Fueston</strong>

source: Is Self-Interest Sufficient to Organize an Free Economy?
fr: L'int&eacute;r&ecirc;t personnel est-il suffisant pour organiser une &eacute;conomie libre&nbsp;?

source: The quick answer is, &ldquo;No.&rdquo; And few of the better-known theoreticians of the free-market have ever thought that self-interest was, or even could be, sufficient to organize, or long maintain, a free economy. Among those theoreticians, Adam Smith is often regarded as having been the primary philosopher of self-interest. In a book written to correct a number of misunderstandings of Smith's teachings, we find the following summaries of Smith's view about self-interest:
fr: La r&eacute;ponse rapide est &laquo;&nbsp;non&nbsp;&raquo;. Peu de th&eacute;oriciens des plus connus du march&eacute; libre ont effleur&eacute; l'id&eacute;e que l'int&eacute;r&ecirc;t personnel est ou pourrait &ecirc;tre suffisant pour organiser, maintenir dans le temps, une &eacute;conomie libre. Parmi ces th&eacute;oriciens, Adam Smith est souvent consid&eacute;r&eacute; comme le p&egrave;re de la philosophie de l'int&eacute;r&ecirc;t personnel. Dans un livre &eacute;crit pour rectifier certaines incompr&eacute;hensions dans l'enseignement de Smith, nous trouvons les r&eacute;sum&eacute;s suivants du point de vue de Smith sur l'int&eacute;r&ecirc;t personnel&nbsp;:

source: Far from being an individualist, Smith believed it is the influence of society that transforms people into moral beings. He thought that people often misjudge their own self-interest.
fr: &laquo;&nbsp;Loin d'&ecirc;tre un individualiste, Smith croyait que c'est l'influence de la soci&eacute;t&eacute; qui nous transforme en &ecirc;tres moraux. Il pensait que souvent, nous nous trompons sur notre propre int&eacute;r&ecirc;t personnel&nbsp;&raquo;.

source: Even more directly to the point:
fr: Encore plus directement&nbsp;:

source: [Adam Smith] regarded the attempt to explain all human behavior on the basis of self-interest as analytically misguided and morally pernicious.
fr: [Adam Smith] consid&eacute;rait la tentative d'expliquer tout comportement humain sur les bases de l'int&eacute;r&ecirc;t personnel comme mal orient&eacute;e analytiquement et pernicieuse moralement.

source: [Both quotes are from page 2 of &ldquo;Adam Smith: In His Time and Ours&rdquo;, Jerry Z. Muller, Princeton: Princeton University Press, 1993.]
fr: [Les deux citations sont tir&eacute;es de la page 2 de &laquo;&nbsp;Adam Smith&nbsp;: De son temps et du nôtre&nbsp;&raquo;, Jerry Z. Muller, Princeton&nbsp;: Princeton University Press, 1993.]

source: As Adam Smith certainly realized, self-interest will be one of the principal forces organizing economic activities in any society, but that is as true of the most repressive or brutal society as it is of a relatively free and open society. Most of us will not like the results of self-interest untempered by a respect for other creatures. As a recent example, in running their country to the disadvantage of most Soviet citizens, the leaders of the Communist Party and of the Soviet military and intelligence services were advancing their own self-interests, at least as they understood or misunderstood those interests.
fr: Comme Adam Smith l'a certainement compris, l'int&eacute;r&ecirc;t personnel sera l'une des principales forces organisant les activit&eacute;s &eacute;conomiques de toute soci&eacute;t&eacute;, mais c'est aussi vrai de la plus r&eacute;pressive et brutale soci&eacute;t&eacute; que d'une soci&eacute;t&eacute; relativement libre et ouverte. La plupart d'entre nous n'aimerait pas les cons&eacute;quences d'un int&eacute;r&ecirc;t personnel non adouci par le respect pour l'autre. Prenons un exemple r&eacute;cent&nbsp;: en menant leur pays au d&eacute;savantage de la plupart des citoyens sovi&eacute;tiques, les dirigeants du parti communiste, de l'arm&eacute;e sovi&eacute;tique et des services secrets, servaient leur propres int&eacute;r&ecirc;ts personnels, du moins selon ce qu'ils comprenaient ou pas de ces int&eacute;r&ecirc;ts.

source: The advantages enjoyed by Americans over citizens of the Soviet countries, and the advantages we still enjoy over the nominally free citizens of Russia and other eastern European countries, are those of a society organized to allow a high percentage of Americans to act in such a way as to serve both their self-interest and some substantial stock of moral principles. Not only our habits and customs, but also our positive laws &mdash; such as those of copyright &mdash; enter into that organization of our society, for good or bad, but not in a morally neutral manner.
fr: Les avantages dont les Am&eacute;ricains jouissent sur les citoyens des pays sovi&eacute;tiques et les avantages dont nous jouissons toujours sur les citoyens dits libres de Russie et des autres pays d'Europe de l'Est, sont ceux d'une soci&eacute;t&eacute; organis&eacute;e de fa&ccedil;on telle qu'elle permette &agrave; un fort pourcentage d'Am&eacute;ricains d'agir d'une mani&egrave;re qui serve &agrave; la fois leur int&eacute;r&ecirc;t personnel et &agrave; la fois quelques fonds substantiels de principes moraux. Outre nos us et coutumes, nos lois formelles &mdash;&nbsp;comme celles sur le copyright&nbsp;&mdash; entrent aussi en jeu dans l'organisation de notre soci&eacute;t&eacute;,en bien ou en mal, mais pas d'une mani&egrave;re moralement neutre.

source: Self-interest is not necessarily evil, though it can lead people to act in morally reprehensible ways. The love of self, and the consequent development of self-interest, is one aspect of a creature who is also a social, and hence moral, being. Self-interest itself can serve moral interests in a free society so long as that society has the proper foundations. The elements of those foundations include not only a populace sharing a substantial body of moral beliefs and habits but also the formal political structures, positive laws, and accepted court decisions capable of supporting both social order and personal freedom. Once those are in place, and once they have been internalized by the bulk of the citizens, then self-interest will provide a fuel of sorts to keep an economy functioning effectively without leading to immoral results on the whole. The question is always: Is our society organized properly, in its positive laws and in the habits we teach our children and reinforce in ourselves, so that self-interest and moral principles do not generally come into conflict?
fr: L'int&eacute;r&ecirc;t personnel n'est pas n&eacute;cessairement n&eacute;gatif, bien qu'il puisse nous conduire &agrave; agir de mani&egrave;re r&eacute;pr&eacute;hensible moralement. L'amour de soi et le d&eacute;veloppement de l'int&eacute;r&ecirc;t personnel qui en d&eacute;coule, est un aspect d'une personne en tant qu'&ecirc;tre social et par l&agrave; m&ecirc;me &ecirc;tre moral. L'int&eacute;r&ecirc;t personnel en lui-m&ecirc;me peut servir des int&eacute;r&ecirc;ts moraux dans une soci&eacute;t&eacute; libre tant que cette soci&eacute;t&eacute; &agrave; des fondations correctes. Les &eacute;l&eacute;ments de ces fondations incluent non seulement une population partageant un ensemble substantiel de convictions morales et d'habitudes, mais aussi de structures politiques formelles, de lois convaincues et de d&eacute;cisions de justice accept&eacute;es, capables de servir &agrave; la fois l'ordre social et la libert&eacute; individuelle. Une fois tout cela en place puis assimil&eacute; par la masse des citoyens,l'int&eacute;r&ecirc;t personnel va alors g&eacute;n&eacute;rer un r&eacute;servoir d'esp&egrave;ces afin de conserver une &eacute;conomie qui fonctionne correctement, sans mener &agrave; des r&eacute;sultats immoraux sur l'ensemble. La question est toujours&nbsp;: notre soci&eacute;t&eacute; est-elle organis&eacute;e correctement, dans ses lois et habitudes que nous enseignons &agrave; nos enfants et que nous renfor&ccedil;ons en nous, pour que l'int&eacute;r&ecirc;t personnel et les principes moraux &mdash;&nbsp;dans l'ensemble&nbsp;&mdash; ne rentrent pas en conflit&nbsp;?

source: Those people aware of modern mathematics or of programming techniques should appreciate the recursive, and inherently unstable, interactions between individual morality and social structure. To oversimplify in a useful manner: People with substantial moral beliefs organize societies along those beliefs and those societies then begin to form the habits and beliefs of children, immigrants, etc. according to those same beliefs. Always, it is a messy historical process which can be destroyed or rerouted into less desirable paths. There is inevitably a question as to whether we are straying from a proper path and also a question as to how robust the society is, i.e., how much of a disturbance it would take to destroy much of what is good about that society.
fr: Ceux qui connaissent les math&eacute;matiques modernes ou les techniques de programmation devraient appr&eacute;cier les interactions r&eacute;cursives et par nature instables, entre moralit&eacute; individuelle et structure sociale. Pour simplifier de fa&ccedil;on outranci&egrave;re et utile&nbsp;: qui poss&egrave;de des convictions morales fortes organise des soci&eacute;t&eacute;s qui s'accordent avec ces convictions et ces soci&eacute;t&eacute;s fa&ccedil;onnent alors les habitudes et convictions des enfants, des immigrants, etc&hellip; en fonction de ces m&ecirc;mes convictions. Il s'agit toujours d'un processus historique tr&egrave;s complexe qui peut &ecirc;tre d&eacute;truit ou d&eacute;tourn&eacute; dans des directions moins d&eacute;sirables. Il y a in&eacute;vitablement les questions de savoir si nous nous &eacute;garons d'un chemin d&eacute;sirable et quelle est la solidit&eacute; de la soci&eacute;t&eacute;&nbsp;; par exemple&nbsp;: combien il faudrait de troubles pour d&eacute;truire la plupart de ce qui est bon dans la soci&eacute;t&eacute;.

source: Sometimes, good people will decide that something has gone wrong and it is time to fight for a moral principle even if it becomes necessary to sacrifice, or at least qualify, their own self-interest. In the words of Thomas Sowell, a free-market theorist of our time:
fr: Parfois, des gens biens d&eacute;cideront que quelque chose est devenu mauvais et qu'il est temps de se battre pour un principe moral, m&ecirc;me s'il devient n&eacute;cessaire de sacrifier, ou au moins de r&eacute;duire leur int&eacute;r&ecirc;t personnel. D'apr&egrave;s Thomas Sowel, un th&eacute;oricien du march&eacute; libre contemporain&nbsp;:

source: There are, of course, noneconomic values. Indeed, there are <em>only</em> noneconomic values. Economics is not a value itself but merely a method of trading off one value against another. If statements about &lsquo;noneconomic values&rsquo; (or, more specifically, &lsquo;social values&rsquo; or &lsquo;human values&rsquo;) are meant to deny the inherent reality of trade-offs, or to exempt some particular value from the trade-off process, then such selfless ideals can be no more effectively demonstrated than by trading off financial gains in the interest of such ideals. This is an economic trade-off. <tt>[from page 79 of &ldquo;Knowledge &amp; Decisions&rdquo;, Thomas Sowell, New York: Basic Books, 1980.]</tt>
fr: Il y a, bien s&ucirc;r, des valeurs non &eacute;conomiques. De plus, il y a des valeurs <em>purement</em> non &eacute;conomiques. L'&eacute;conomie n'est pas une valeur en elle-m&ecirc;me, mais purement et simplement une m&eacute;thode de revente (dans le sens d'&eacute;change) d'une valeur contre une autre. Si les affirmations &agrave; propos de valeurs &laquo;&nbsp;non &eacute;conomiques&nbsp;&raquo; (ou plus sp&eacute;cifiquement, de &laquo;&nbsp;valeurs sociales&nbsp;&raquo; ou &laquo;&nbsp;valeurs humaines&nbsp;&raquo;) ont pour but de nier la r&eacute;alit&eacute; inh&eacute;rente des reventes, ou d'exempter quelques valeurs pr&eacute;cises de ce processus de revente, alors des id&eacute;aux aussi d&eacute;sint&eacute;ress&eacute;s ne peuvent pas &ecirc;tre d&eacute;montr&eacute;s plus efficacement qu'en pratiquant la reventedes gains financiers dans l'int&eacute;r&ecirc;t de tels id&eacute;aux. C'est un &eacute;change &eacute;conomique.&raquo; [page 79 de &laquo;&nbsp;Knowledge &amp; Decisions&nbsp;&raquo;, Thomas Sowell, New York&nbsp;: Basic Books, 1980.]

source: In context, Professor Sowell was not arguing against those imputing some sort of moral power to self-interest; he was instead arguing against those who think there should be an easy path to the reform of a society which may have a particular moral defect. Those are two sides to the same coin &mdash; serving self-interest may put a person in conflict with moral values and the attempt to serve moral values may lead to some sacrifice of one's self-interest.
fr: Si l'on se place dans le contexte, on voit que le professeur Sowell ne critiquait pas ceux qui imputent une sorte de puissance morale &agrave; l'int&eacute;r&ecirc;t personnel, mais qu'il critiquait en fait ceux qui pensent qu'il devrait y avoir un chemin facile &agrave; la r&eacute;forme d'une soci&eacute;t&eacute; qui aurait un d&eacute;faut moral particulier. Il y a toujours un c&ocirc;t&eacute; pile et un c&ocirc;t&eacute; face sur une m&ecirc;me pi&egrave;ce&nbsp;; servir son int&eacute;r&ecirc;t personnel pourrait mettre une personne en conflit avec des valeurs morales, tout comme essayer de servir des valeurs morales pourrait conduire &agrave; des sacrifices vis-&agrave;-vis de son int&eacute;r&ecirc;t personnel.

source: Self-interest can be a powerful fuel for a society, at least when the citizens of that society are well-formed individuals, but there is no mystical or magical aspect to self-interest that guarantees moral results. Self-interest will lead to generally moral results to the extent that moral constraints, external but mostly internal, guide the actions of the self-interested parties. A society with the proper constraints does not come into existence by some act of magic, but rather by the acts of people who are aiming at a higher purpose, whether the preservation of liberty in the society as a whole or the preservation of a cooperative spirit within communities of programmers, or maybe both of those at the same time.
fr: L'int&eacute;r&ecirc;t personnel peut &ecirc;tre un carburant efficace pour une soci&eacute;t&eacute;, du moins lorsque les citoyens de cette soci&eacute;t&eacute; sont des individus bien form&eacute;s, mais il n'y a pas d'aspect mystique ou magique &agrave; ce que l'int&eacute;r&ecirc;t personnel garantisse des r&eacute;sultats moraux. L'int&eacute;r&ecirc;t personnel m&egrave;nera g&eacute;n&eacute;ralement &agrave; des r&eacute;sultats moraux dans la mesure o&ugrave; ce sont les contraintes morales, externes mais pour la plupart internes, qui guident les actions des groupes ayant des int&eacute;r&ecirc;ts personnels. Une soci&eacute;t&eacute; avec des contraintes moralescorrectes ne na&icirc;t pas par magie, mais plut&ocirc;t gr&acirc;ce aux actions de personnes qui tendent vers un but plus haut, que ce soit la pr&eacute;servation de la libert&eacute; dans la soci&eacute;t&eacute; tout enti&egrave;re ou la pr&eacute;servation de l'esprit de coop&eacute;ration entre les communaut&eacute;s de programmeurs, oupeut-&ecirc;tre m&ecirc;me les deux &agrave; la fois.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Pierre-Yves Enderlin.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
