Repository: gitGNU/gnu_www-fr
Catalog: philosophy/selling.*.po
Languages: fr

source: Selling Free Software - GNU Project - Free Software Foundation (FSF)
fr: Vendre des logiciels libres - GNU Project - Free Software Foundation (FSF)

source: Selling Free Software
fr: Vendre des logiciels libres

source: Many people believe that the spirit of the GNU project is that you should not charge money for distributing copies of software, or that you should charge as little as possible &mdash; just enough to cover the cost.
fr: Beaucoup de personnes croient que l'esprit du projet GNU est de ne pas faire payer la distribution de copies de logiciels, ou alors le moins possible&nbsp;: juste assez pour couvrir les frais.

source: Actually we encourage people who redistribute <a href="/philosophy/free-sw.html">free software</a> to charge as much as they wish or can. If this seems surprising to you, please read on.
fr: En fait, nous encourageons ceux qui distribuent des <a href="/philosophy/free-sw.fr.html">logiciels libres</a> &agrave; les faire payer le prix qu'ils veulent ou peuvent. Si cela vous semble surprenant, continuez &agrave; lire.

source: The word &ldquo;free&rdquo; has two legitimate general meanings; it can refer either to freedom or to price. When we speak of &ldquo;free software&rdquo;, we're talking about freedom, not price. (Think of &ldquo;free speech&rdquo;, not &ldquo;free beer&rdquo;.) Specifically, it means that a user is free to run the program, change the program, and redistribute the program with or without changes.
fr: Le mot anglais &laquo;&nbsp;free&nbsp;&raquo; (libre) a deux sens, il peut aussi bien faire r&eacute;f&eacute;rence au prix qu'&agrave; la libert&eacute;. Quand nous parlons de &laquo;&nbsp;free software&nbsp;&raquo; (logiciel libre) nous parlons de la libert&eacute;, pas du prix. Plus particuli&egrave;rement, il signifie qu'un utilisateur est libre d'utiliser un programme, de le modifier et de le redistribuer, avec ou sans modifications.

source: Free programs are sometimes distributed gratis, and sometimes for a substantial price. Often the same program is available in both ways from different places. The program is free regardless of the price, because users have freedom in using it.
fr: Les logiciels libres sont parfois distribu&eacute;s gratuitement, et parfois contre r&eacute;mun&eacute;ration. Un m&ecirc;me programme est souvent disponible sous ces deux versions &agrave; partir de sources diff&eacute;rentes. Le programme est libre en d&eacute;pit de son prix, car les utilisateurs ont toute libert&eacute; dans son utilisation.

source: Since free software is not a matter of price, a low price isn't more free, or closer to free. So if you are redistributing copies of free software, you might as well charge a substantial fee and <em>make some money</em>. Redistributing free software is a good and legitimate activity; if you do it, you might as well make a profit from it.
fr: Puisque le prix n'a pas d'importance lorsque nous parlons de logiciel libre, un prix bas ne rend pas un logiciel plus &laquo;&nbsp;libre&nbsp;&raquo;. Ainsi, si vous redistribuez des copies de logiciels libres, vous pouvez aussi bien fixer un prix &eacute;lev&eacute; que <em>rentrer dans vos frais</em>. La redistribution de logiciels libres est une activit&eacute;honorable et totalement l&eacute;gale; si vous l'exercez, vous pouvez tr&egrave;s bien en tirer du profit.

source: Free software is a community project, and everyone who depends on it ought to look for ways to contribute to building the community. For a distributor, the way to do this is to give a part of the profit to the <a href="/fsf/fsf.html">Free Software Foundation</a> or some other free software development project. By funding development, you can advance the world of free software.
fr: Le logiciel libre est le projet de toute une communaut&eacute;, et tous ceux qui en d&eacute;pendent devraient chercher &agrave; soutenir la communaut&eacute;. Pour un distributeur, la mani&egrave;re d'y contribuer est de donner une part de ses b&eacute;n&eacute;fices &agrave; la <a href="/fsf/fsf.fr.html">FSF</a> ou &agrave; un autre projet de d&eacute;veloppement de logiciels libres. En soutenant des &eacute;quipes de d&eacute;veloppement, vous faites avancer le logiciel libre.

source: <strong>Distributing free software is an opportunity to raise funds for development. Don't waste it!</strong>
fr: <strong>La distribution de logiciels libres est une chance de rassembler des fonds pour le d&eacute;veloppement. Ne la laissez pas passer&nbsp;!</strong>

source: In order to contribute funds, you need to have some extra. If you charge too low a fee, you won't have anything to spare to support development.
fr: Pour faire un don, vous devez avoir des fonds en r&eacute;serve. Si vous fixez un prix trop faible, vous n'aurez pas de r&eacute;serve pour soutenir le d&eacute;veloppement.

source: Will a higher distribution price hurt some users?
fr: Est-ce qu'un prix plus &eacute;lev&eacute; l&eacute;sera des utilisateurs&nbsp;?

source: People sometimes worry that a high distribution fee will put free software out of range for users who don't have a lot of money. With <a href="/philosophy/categories.html#ProprietarySoftware">proprietary software</a>, a high price does exactly that &mdash; but free software is different.
fr: Certains s'inqui&egrave;tent parfois qu'un prix trop &eacute;lev&eacute; mette le logiciel libre hors de port&eacute;e des utilisateurs n'ayant pas beaucoup de moyens financiers. En ce qui concerne les <a href="/philosophy/categories.fr.html#ProprietarySoftware">logiciels propri&eacute;taires</a>, c'est exactement ce que fait un prix &eacute;lev&eacute;, mais c'est diff&eacute;rent pour le logiciel libre.

source: The difference is that free software naturally tends to spread around, and there are many ways to get it.
fr: La diff&eacute;rence est que le logiciel libre tend naturellement &agrave; se r&eacute;pandre, et qu'il y a diff&eacute;rentes fa&ccedil;ons de se le procurer.

source: Software hoarders try their damnedest to stop you from running a proprietary program without paying the standard price. If this price is high, that does make it hard for some users to use the program.
fr: Les rapaces du logiciel vendent leur &acirc;me au diable pour vous emp&ecirc;cher d'utiliser un programme propri&eacute;taire sans payer le prix fort. Si le prix est &eacute;lev&eacute;, il devient vraiment difficile pour certains utilisateurs d'utiliser le programme.

source: With free software, users don't <em>have</em> to pay the distribution fee in order to use the software. They can copy the program from a friend who has a copy, or with the help of a friend who has network access. Or several users can join together, split the price of one CD-ROM, then each in turn can install the software. A high CD-ROM price is not a major obstacle when the software is free.
fr: Avec le logiciel libre, les utilisateurs n'ont pas &agrave; payer la distribution pour utiliser le logiciel. Ils peuvent copier le programme &agrave; partir de la copie d'un ami, ou avec son aide s'il a acc&egrave;s au r&eacute;seau. Plusieurs utilisateurs peuvent &eacute;galement se cotiser pour acheter un CD-ROM et installer le logiciel chacun &agrave; son tour. Un prix &eacute;lev&eacute; n'est pas un obstacle majeur si le logiciel est libre.

source: Will a higher distribution price discourage use of free software?
fr: Est-ce qu'un prix plus &eacute;lev&eacute; d&eacute;couragera l'utilisation du logiciel libre&nbsp;?

source: Another common concern is for the popularity of free software. People think that a high price for distribution would reduce the number of users, or that a low price is likely to encourage users.
fr: Une autre inqui&eacute;tude est souvent exprim&eacute;e &agrave; propos de la popularit&eacute; du logiciel libre. Certains pensent qu'un prix &eacute;lev&eacute; r&eacute;duira le nombre d'utilisateurs ou qu'un prix faible encouragera certainement ces derniers.

source: This is true for proprietary software &mdash; but free software is different. With so many ways to get copies, the price of distribution service has less effect on popularity.
fr: C'est vrai dans le cas d'un logiciel propri&eacute;taire &mdash;&nbsp;mais c'est diff&eacute;rent dans le cas d'un logiciel libre. Il y a tellement de fa&ccedil;ons d'avoir des copies que le prix pay&eacute; en &eacute;change de la distribution a beaucoup moins d'effet sur la popularit&eacute;.

source: In the long run, how many people use free software is determined mainly by <em>how much free software can do</em>, and how easy it is to use. Many users will continue to use proprietary software if free software can't do all the jobs they want to do. Thus, if we want to increase the number of users in the long run, we should above all <em>develop more free software</em>.
fr: &Agrave; longue &eacute;ch&eacute;ance, le nombre d'utilisateurs du logiciel libre est d&eacute;termin&eacute; par <em>les capacit&eacute;s du logiciel libre</em> et par sa simplicit&eacute; d'utilisation. De nombreux utilisateurs continueront &agrave; utiliser des logiciels propri&eacute;taires si le logiciel libre ne peut pas faire tout ce qu'ils veulent. Ainsi, si nous voulons faire augmenter le nombre d'utilisateurs &agrave; longue &eacute;ch&eacute;ance, nous devons avant tout <em>d&eacute;velopper plus de logiciels libres</em>.

source: The most direct way to do this is by writing needed <a href="http://savannah.gnu.org/projects/tasklist">free software</a> or <a href="/doc/doc.html">manuals</a> yourself. But if you do distribution rather than writing, the best way you can help is by raising funds for others to write them.
fr: La fa&ccedil;on la plus directe est d'&eacute;crire vous-m&ecirc;me des <a href="http://savannah.gnu.org/projects/tasklist">logiciels libres</a> ou des <a href="/doc/doc.html#PleaseHelpWriteDocumentation">manuels</a> qui manquent. Mais si vous assurez la distribution plut&ocirc;t que la cr&eacute;ation, la meilleure fa&ccedil;on de nous aider est de lever des fonds pour aider les autres &agrave; en &eacute;crire.

source: The term &ldquo;selling software&rdquo; can be confusing too
fr: Les mots &laquo;&nbsp;vendre des logiciels&nbsp;&raquo; peut aussi induire en erreur

source: Strictly speaking, &ldquo;selling&rdquo; means trading goods for money. Selling a copy of a free program is legitimate, and we encourage it.
fr: <em>Stricto sensus</em>, &laquo;&nbsp;vendre&nbsp;&raquo; signifie &eacute;changer des biens contre de l'argent. Vendre une copie d'un logiciel libre est l&eacute;gal, et nous encourageons cette pratique.

source: So unless you're going to draw distinctions carefully, the way this article does, we suggest it is better to avoid using the term &ldquo;selling software&rdquo; and choose some other wording instead. For example, you could say &ldquo;distributing free software for a fee&rdquo;&mdash;that is unambiguous.
fr: Alors &agrave; moins que vous ne soyez pr&ecirc;ts &agrave; faire des distictions pr&eacute;cises, comme le fait cet article, nous vous sugg&eacute;rons d'&eacute;viter le terme &laquo;&nbsp;vendre des logiciels&nbsp;&raquo; et de choisir un autre vocabulaire &agrave; la place. Par exemple, vous pourriez dire &laquo;&nbsp;distribuer des logiciels libres contre r&eacute;mun&eacute;ration&nbsp;&raquo;, ce qui l&egrave;ve toute ambiguït&eacute;.

source: High or low fees, and the GNU GPL
fr: Prix &eacute;lev&eacute;s ou bas et la GNU GPL

source: Except for one special situation, the <a href="/copyleft/gpl.html">GNU General Public License</a> (GNU GPL) has no requirements about how much you can charge for distributing a copy of free software. You can charge nothing, a penny, a dollar, or a billion dollars. It's up to you, and the marketplace, so don't complain to us if nobody wants to pay a billion dollars for a copy.
fr: En dehors d'une seule situation sp&eacute;cifique, la <a href="/copyleft/gpl.html">Licence Publique G&eacute;n&eacute;rale GNU</a> (GNU GPL) n'a pas d'exigences en ce qui concerne le prix que vous pouvez demander pour la distribution d'un logiciel libre. Vous pouvez ne rien demander, ou alors un centime, un franc, un million de francs. Cela ne d&eacute;pend que de vous, de l'offre et de la demande, alors ne venez pas vous plaindre si personne ne veut payer un million de francs pour une copie.

source: The one exception is in the case where binaries are distributed without the corresponding complete source code. Those who do this are required by the GNU GPL to provide source code on subsequent request. Without a limit on the fee for the source code, they would be able set a fee too large for anyone to pay&mdash;such as a billion dollars&mdash;and thus pretend to release source code while in truth concealing it. So in this case we have to limit the fee for source, to ensure the user's freedom. In ordinary situations, however, there is no such justification for limiting distribution fees, so we do not limit them.
fr: La seule exception est le cas o&ugrave; les binaires sont distribu&eacute;s sans le code source complet. Ceux qui font cela sont oblig&eacute;s par la GNU GPL de donner le code source sur toutes demandes ult&eacute;rieures. Sans limite fix&eacute;e au prix du code source, ils peuvent fixer un prix trop &eacute;lev&eacute; pour que quelqu'un puisse payer (un million de francs, par exemple), et ainsi pr&eacute;tendre distribuer le code source alors qu'ils le dissimulent. Ainsi, nous devons dans ce cas limiter le prix du code source pour assurer la libert&eacute; de l'utilisateur. Cependant, dans des situations normales il n'y a pas de telle justification pour limiter le prix de distribution, alors nous ne le faisons pas.

source: Sometimes companies whose activities cross the line of what the GNU GPL permits plead for permission, saying that they &ldquo;won't charge money for the GNU software&rdquo; or such like. They don't get anywhere this way. Free software is about freedom, and enforcing the GPL is defending freedom. When we defend users' freedom, we are not distracted by side issues such as how much of a distribution fee is charged. Freedom is the issue, the whole issue, and the only issue.
fr: Parfois des entreprises, dont les activit&eacute;s franchissent la limite de ce que la GNU GPL permet, implorent des autorisations, en disant qu'ils &laquo;ne vont pas faire payer les logiciels GNU&raquo;, ou d'autres choses du m&ecirc;me style. Cela ne les m&eacute;nera pas loin. Le logiciel libre c'est avant tout la libert&eacute;, et faire respecter la GPL c'est d&eacute;fendre cette libert&eacute;. Quand nous d&eacute;fendons la libert&eacute; des utilisateurs, nous ne nous occupons pas de probl&egrave;mes annexes comme le prix de la distribution. La libert&eacute; est la question, la seule et l'unique.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Benjamin Drieu.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
