Repository: gitGNU/gnu_www-fr
Catalog: philosophy/shouldbefree.*.po
Languages: fr

source: The word &ldquo;free&rdquo; in &ldquo;free software&rdquo; refers to freedom, not to price; the price paid for a copy of a free program may be zero, or small, or (rarely) quite large.
fr: Le mot &laquo;&nbsp;free&nbsp;&raquo; dans &laquo;&nbsp;free software&nbsp;&raquo; signifie libre, et non gratuit [free d&eacute;signe les deux termes, en anglais]&nbsp;; le prix pay&eacute; pour une copie d'un programme libre peut &ecirc;tre nul, faible, ou (rarement) assez &eacute;lev&eacute;.

source: The issues of pollution and traffic congestion do not alter this conclusion. If we wish to make driving more expensive to discourage driving in general, it is disadvantageous to do this using toll booths, which contribute to both pollution and congestion. A tax on gasoline is much better. Likewise, a desire to enhance safety by limiting maximum speed is not relevant; a free-access road enhances the average speed by avoiding stops and delays, for any given speed limit.
fr: Les probl&egrave;mes de pollution et de congestion du trafic ne modifient pas cette conclusion. Si nous d&eacute;sirons rendre plus co&ucirc;teuse la conduite afin de la d&eacute;courager, il n'est pas avantageux de le faire en mettant en place des p&eacute;ages, qui participent et &agrave; la pollution et &agrave; la congestion. Une taxe sur l'essence serait bien mieux. Pareillement, le d&eacute;sir de renforcer la s&eacute;curit&eacute; en limitant la vitesse maximale n'est pas pertinent; un acc&egrave;s gratuit aux routes am&eacute;liore la vitesse moyenne en &eacute;vitant arr&ecirc;ts et retards, quelle que soit la limitation de vitesse.

source: One might regard a particular computer program as a harmful thing that should not be available at all, like the Lotus Marketplace database of personal information, which was withdrawn from sale due to public disapproval. Most of what I say does not apply to this case, but it makes little sense to argue for having an owner on the grounds that the owner will make the program less available. The owner will not make it <em>completely</em> unavailable, as one would wish in the case of a program whose use is considered destructive.
fr: On peut voir un logiciel particulier comme une chose nocive, qui ne devrait &ecirc;tre accessible &agrave; personne, &agrave; l'instar de la base de donn&eacute;es d'informations personnelles de Lotus (Marketplace), qui a &eacute;t&eacute; retir&eacute;e des ventes suite &agrave; la d&eacute;sapprobation du public. La plus grande partie de mon discours ne s'applique pas &agrave; ce cas, mais pr&eacute;f&eacute;rer un propri&eacute;taire dans la mesure o&ugrave; cela rendrait le programme moins disponible n'est pas tr&egrave;s sens&eacute;. Le propri&eacute;taire ne le rendra pas <em>compl&egrave;tement</em> indisponible, comme on pourrait le souhaiter pour un programme consid&eacute;r&eacute; comme nocif.

source: This essay is published in <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>
fr: Cet essai est publi&eacute; dans <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Benjamin Drieu.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
