Repository: gitGNU/gnu_www-fr
Catalog: philosophy/shouldbefree.*.po
Languages: fr

source: The third level of material harm affects software development. Software development used to be an evolutionary process, where a person would take an existing program and rewrite parts of it for one new feature, and then another person would rewrite parts to add another feature; in some cases, this continued over a period of twenty years. Meanwhile, parts of the program would be &ldquo;cannibalized&rdquo; to form the beginnings of other programs.
fr: Le troisi&egrave;me niveau de pr&eacute;judice mat&eacute;riel touche le d&eacute;veloppement logiciel. Il &eacute;tait autrefois un processus &eacute;volutif, o&ugrave; quelqu'un prenait un programme existant et en r&eacute;&eacute;crivait une partie pour ajouter une nouvelle fonctionnalit&eacute;; puis une autre personne en r&eacute;&eacute;crivait aussi une partie pour y ajouter une autre fonctionnalit&eacute;. Dans certains cas, cela a continu&eacute; ainsi sur une p&eacute;riode d'une vingtaine d'ann&eacute;es. Entre-temps, certaines parties du programme auront &eacute;t&eacute; &laquo;&nbsp;cannibalis&eacute;es&nbsp;&raquo; pour cr&eacute;er les pr&eacute;mices d'autres programmes.

source: The existence of owners prevents this kind of evolution, making it necessary to start from scratch when developing a program. It also prevents new practitioners from studying existing programs to learn useful techniques or even how large programs can be structured.
fr: L'existence de propri&eacute;taires emp&ecirc;che ce genre d'&eacute;volution, rendant n&eacute;cessaire de repartir de rien si on veut d&eacute;velopper un programme. Cela emp&ecirc;che &eacute;galement les nouveaux praticiens d'&eacute;tudier les programmes existants pour en apprendre des techniques utiles ou m&ecirc;me apprendre comment on structure de gros programmes.

source: Owners also obstruct education. I have met bright students in computer science who have never seen the source code of a large program. They may be good at writing small programs, but they can't begin to learn the different skills of writing large ones if they can't see how others have done it.
fr: Les propri&eacute;taires entravent aussi l'&eacute;ducation, l'apprentissage. J'ai rencontr&eacute; de brillants &eacute;tudiants en informatique qui n'avaient jamais vu le code source d'un gros logiciel. Ils peuvent &ecirc;tre bons &agrave; &eacute;crire de courts programmes, mais ils ne peuvent commencer &agrave; apprendre les techniques diff&eacute;rentes de l'&eacute;criture d'un vaste programme, s'ils ne peuvent observer comment d'autres l'ont fait.

source: In any intellectual field, one can reach greater heights by standing on the shoulders of others. But that is no longer generally allowed in the software field&mdash;you can only stand on the shoulders of the other people <em>in your own company</em>.
fr: Dans tout domaine intellectuel, on peut atteindre de plus grandes hauteurs en se tenant sur les &eacute;paules des autres. Mais ce n'est g&eacute;n&eacute;ralement plus permis dans le domaine logiciel &mdash;&nbsp;vous ne pouvez vous tenir sur les &eacute;paules que de ceux qui font partie de <em>votre propre compagnie</em>.

source: The associated psychosocial harm affects the spirit of scientific cooperation, which used to be so strong that scientists would cooperate even when their countries were at war. In this spirit, Japanese oceanographers abandoning their lab on an island in the Pacific carefully preserved their work for the invading U.S. Marines, and left a note asking them to take good care of it.
fr: Le pr&eacute;judice psycho-social qui s'y rattache affecte l'esprit de coop&eacute;ration scientifique, qui &eacute;tait autrefois si fort que les scientifiques coop&eacute;raient m&ecirc;me quand leurs pays &eacute;taient en guerre. C'est dans cet esprit que les oc&eacute;anographes japonais, abandonnant leur labo dans une &icirc;le du Pacifique, ont soigneusement conserv&eacute; leurs travaux pour les Marines qui commen&ccedil;aient &agrave; d&eacute;barquer, et laiss&egrave;rent un mot leur demandant d'en prendre bien soin.

source: Conflict for profit has destroyed what international conflict spared. Nowadays scientists in many fields don't publish enough in their papers to enable others to replicate the experiment. They publish only enough to let readers marvel at how much they were able to do. This is certainly true in computer science, where the source code for the programs reported on is usually secret.
fr: Les conflits de profits ont d&eacute;truit ce que les conflits internationaux avaient &eacute;pargn&eacute;. Aujourd'hui, les scientifiques de nombreuses disciplines ne donnent pas assez de d&eacute;tails dans leurs publications, qui permettraient aux autres de reproduire leur exp&eacute;rience. Ils ne publient que ce qui permet au lecteur d'&ecirc;tre impressionn&eacute;s par l'&eacute;tendue de leurs travaux. C'est particuli&egrave;rement vrai pour la recherche informatique, o&ugrave; le code source des programmes d&eacute;crits dans les publications est en g&eacute;n&eacute;ral secret.

source: It Does Not Matter How Sharing Is Restricted
fr: Peu importe comment le partage est restreint

source: I have been discussing the effects of preventing people from copying, changing, and building on a program. I have not specified how this obstruction is carried out, because that doesn't affect the conclusion. Whether it is done by copy protection, or copyright, or licenses, or encryption, or <acronym title="Read-only Memory">ROM</acronym> cards, or hardware serial numbers, if it <em>succeeds</em> in preventing use, it does harm.
fr: J'ai parl&eacute; des effets d'emp&ecirc;cher les gens de copier, de modifier ou de se baser sur un programme existant. Je n'ai pas pr&eacute;cis&eacute; comment cette obstruction &eacute;tait r&eacute;alis&eacute;e, car cela n'affecte pas la conclusion. Que ce soit par protection contre la copie, copyright, licences, cryptage, cartes ROM ou encore un num&eacute;ro de s&eacute;rie sur le mat&eacute;riel, si cela <em>r&eacute;ussit</em> &agrave; emp&ecirc;cher l'utilisation, alors il y a pr&eacute;judice.

source: Users do consider some of these methods more obnoxious than others. I suggest that the methods most hated are those that accomplish their objective.
fr: Les utilisateurs consid&egrave;rent certaines de ces m&eacute;thodes comme plus odieuses que d'autres. Je sugg&egrave;re que les m&eacute;thodes les plus d&eacute;test&eacute;es sont celles qui accomplissent leur objectif.

source: Software Should be Free
fr: Les logiciels devraient &ecirc;tre libres

source: I have shown how ownership of a program&mdash;the power to restrict changing or copying it&mdash;is obstructive. Its negative effects are widespread and important. It follows that society shouldn't have owners for programs.
fr: J'ai montr&eacute; comment le fait d'&ecirc;tre propri&eacute;taire d'un programme, le pouvoir de restreindre sa modification ou sa copie, est une entrave. Ses retomb&eacute;es n&eacute;gatives sont vastes et importantes. Il s'ensuit que la soci&eacute;t&eacute; devrait se passer de propri&eacute;taires de logiciels.

source: Another way to understand this is that what society needs is free software, and proprietary software is a poor substitute. Encouraging the substitute is not a rational way to get what we need.
fr: Une autre fa&ccedil;on de comprendre cela, est que ce dont a besoin la soci&eacute;t&eacute;, c'est de logiciels libres et que les logiciels propri&eacute;taires ne sont qu'un pauvre substitut. Encourager le substitut n'est pas une fa&ccedil;on rationnelle d'obtenir ce dont nous avons besoin.

source: Vaclav Havel has advised us to &ldquo;Work for something because it is good, not just because it stands a chance to succeed.&rdquo; A business making proprietary software stands a chance of success in its own narrow terms, but it is not what is good for society.
fr: Vaclav Havel nous a conseill&eacute; de &laquo;travailler pour une chose parce qu'elle est bien, pas parce qu'elle a des chances de r&eacute;ussir&raquo;. Un march&eacute; cr&eacute;ant des logiciels propri&eacute;taires a des chances de r&eacute;ussir selon son propre point de vue, mais ce n'est pas ce qui est bon pour la soci&eacute;t&eacute;.

source: Why People Will Develop Software
fr: Pourquoi les gens d&eacute;velopperont des logiciels

source: If we eliminate copyright as a means of encouraging people to develop software, at first less software will be developed, but that software will be more useful. It is not clear whether the overall delivered user satisfaction will be less; but if it is, or if we wish to increase it anyway, there are other ways to encourage development, just as there are ways besides toll booths to raise money for streets. Before I talk about how that can be done, first I want to question how much artificial encouragement is truly necessary.
fr: Si nous &eacute;liminons la propri&eacute;t&eacute; intellectuelle comme un moyen d'encourager les gens &agrave; d&eacute;velopper des logiciels, au d&eacute;but, peu de programmes seront d&eacute;velopp&eacute;s, mais ils seront plus utiles. Difficile de dire si la satisfaction d'ensemble des utilisateurs sera moindre. Mais si c'est le cas, ou si nous voulons malgr&eacute; tout l'augmenter, il y a d'autres moyens d'encourager le d&eacute;veloppement, tout comme il y a des alternatives aux postes de p&eacute;age pour tirer del'argent des routes. Mais avant de parler de la fa&ccedil;on dont cela peut se faire, je vais d'abord me demander dans quelle mesure un encouragement artificiel est vraiment n&eacute;cessaire.

source: Programming is Fun
fr: Programmer, c'est amusant

source: There are some lines of work that few will enter except for money; road construction, for example. There are other fields of study and art in which there is little chance to become rich, which people enter for their fascination or their perceived value to society. Examples include mathematical logic, classical music, and archaeology; and political organizing among working people. People compete, more sadly than bitterly, for the few funded positions available, none of which is funded very well. They may even pay for the chance to work in the field, if they can afford to.
fr: Certains domaines professionnels trouvent peu de candidats, sauf pour l'argent; la construction routi&egrave;re, par exemple. Il en est d'autres, touchant aux &eacute;tudes ou &agrave; l'art, dans lesquelles il y a peu de chance de devenir riche, mais o&ugrave; les gens s'engagent par fascination ou &agrave; cause de sa valeur per&ccedil;ue pour la soci&eacute;t&eacute;. On peut y inclure par exemple, les math&eacute;matiques logiques, la musique classique et l'arch&eacute;ologie; puis l'organisation politique au sein des travailleurs. Les gens concourent, plus tristement qu'&acirc;prement, pour les quelques situations assises disponibles, aucune d'entre elles n'&eacute;tant vraiment bien solide. Ils paieraient pour avoir la chance de travailler dans un de ces domaines, s'ils le pouvaient.

source: Such a field can transform itself overnight if it begins to offer the possibility of getting rich. When one worker gets rich, others demand the same opportunity. Soon all may demand large sums of money for doing what they used to do for pleasure. When another couple of years go by, everyone connected with the field will deride the idea that work would be done in the field without large financial returns. They will advise social planners to ensure that these returns are possible, prescribing special privileges, powers, and monopolies as necessary to do so.
fr: Un domaine peut se transformer du jour au lendemain, s'il commence &agrave; offrir la possibilit&eacute; de devenir riche. Si un travailleur devient riche, les autres r&eacute;clament la m&ecirc;me opportunit&eacute;. Bient&ocirc;t tous demanderont de fortes sommes d'argent pour ce qu'ils avaient l'habitude de faire pour le plaisir. Puis quelques ann&eacute;es passent, chaque personne en relation avec ce domaine tournera en d&eacute;rision l'id&eacute;e que le travail pourrait &ecirc;tre fait sans salaires mirobolants. Ils conseilleront aux acteurs sociaux de s'assurer que de tels salaires soient possibles, en prescrivant des privil&egrave;ges sp&eacute;ciaux et les pouvoirs, monopoles n&eacute;cessaires pour que cela puisse se faire.

source: This change happened in the field of computer programming in the past decade. Fifteen years ago, there were articles on &ldquo;computer addiction&rdquo;: users were &ldquo;onlining&rdquo; and had hundred-dollar-a-week habits. It was generally understood that people frequently loved programming enough to break up their marriages. Today, it is generally understood that no one would program except for a high rate of pay. People have forgotten what they knew fifteen years ago.
fr: Ce changement est apparu dans le domaine de la programmation cette derni&egrave;re d&eacute;cennie. Il y a quinze ans, des articles parlaient d'&laquo;&nbsp;accros &agrave; l'informatique&nbsp;&raquo;&nbsp;: les utilisateurs &eacute;taient &laquo;&nbsp;connect&eacute;s&nbsp;&raquo; et vivaient modestement. Il &eacute;tait g&eacute;n&eacute;ralement compris que les accros de la programmation pouvaient briser leur couple. Aujourd'hui, il est g&eacute;n&eacute;ralement admis que personne ne ferait de la programmation, sans salaire &eacute;lev&eacute;. Les gens ont oubli&eacute; ce qu'ils savaient il y a quinze ans.

source: When it is true at a given time that most people will work in a certain field only for high pay, it need not remain true. The dynamic of change can run in reverse, if society provides an impetus. If we take away the possibility of great wealth, then after a while, when the people have readjusted their attitudes, they will once again be eager to work in the field for the joy of accomplishment.
fr: M&ecirc;me si &agrave; un moment pr&eacute;cis, la plupart des gens travailleront dans un certain domaine uniquement pour un haut salaire, cela ne durera pas forc&eacute;ment. La tendance peut s'inverser, si la soci&eacute;t&eacute; donne une impulsion. Si nous laissons de c&ocirc;t&eacute; les possibilit&eacute;s de gros gains, peu de temps apr&egrave;s, quand les gens auront r&eacute;ajust&eacute; leurs attitudes, ils auront &agrave; nouveau &agrave; coeur de travailler dans leur domaine pour la joie de le faire.

source: The question, &ldquo;How can we pay programmers?&rdquo; becomes an easier question when we realize that it's not a matter of paying them a fortune. A mere living is easier to raise.
fr: La question &laquo;&nbsp;comment payer un programmeur&nbsp;&raquo; devient plus simple, quand nous r&eacute;alisons que ce n'est pas la peine de les payer une fortune. Il est plus facile de leur assurer un niveau de vie correct sans plus.

source: Funding Free Software
fr: Financer le logiciel libre

source: Institutions that pay programmers do not have to be software houses. Many other institutions already exist that can do this.
fr: Les institutions qui payent les programmeurs n'ont pas besoin d'&ecirc;tre des &laquo;&nbsp;bo&icirc;tes &agrave; logiciels&nbsp;&raquo;. Beaucoup d'autres institutions existantespeuvent le faire.

source: Hardware manufacturers find it essential to support software development even if they cannot control the use of the software. In 1970, much of their software was free because they did not consider restricting it. Today, their increasing willingness to join consortiums shows their realization that owning the software is not what is really important for them.
fr: Les constructeurs de mat&eacute;riels informatiques pensent qu'il est essentiel de supporter le d&eacute;veloppement logiciel, m&ecirc;me s'ils ne peuvent contr&ocirc;ler l'usage du logiciel. En 1970, la plupart de leurs logiciels &eacute;taient libres, car ils ne pensaient pas &agrave; les entraver. Aujourd'hui, la volont&eacute; croissante de se joindre &agrave; desconsortiums montre leur compr&eacute;hension que de poss&eacute;der le logiciel n'est pas ce qui est vraiment important pour eux.

source: Universities conduct many programming projects. Today they often sell the results, but in the 1970s they did not. Is there any doubt that universities would develop free software if they were not allowed to sell software? These projects could be supported by the same government contracts and grants that now support proprietary software development.
fr: Les universit&eacute;s m&egrave;nent de nombreux projets de programmation. Aujourd'hui, elles en vendent souvent les r&eacute;sultats, mais, dans les ann&eacute;es 70, elles ne le faisaient pas. Douterait-on que les universit&eacute;s d&eacute;velopperaient des logiciels libres si elles n'&eacute;taient pas autoris&eacute;es &agrave; vendre des logiciels&nbsp;? Ces projets pourraient recevoir le soutien de contrats gouvernementaux et de bourses qui soutiennent actuellement le d&eacute;veloppement de logiciels propri&eacute;taires.

source: It is common today for university researchers to get grants to develop a system, develop it nearly to the point of completion and call that &ldquo;finished&rdquo;, and then start companies where they really finish the project and make it usable. Sometimes they declare the unfinished version &ldquo;free&rdquo;; if they are thoroughly corrupt, they instead get an exclusive license from the university. This is not a secret; it is openly admitted by everyone concerned. Yet if the researchers were not exposed to the temptation to do these things, they would still do their research.
fr: Il est commun de nos jours que les chercheurs universitaires re&ccedil;oivent une bourse pour d&eacute;velopper un syst&egrave;me, qu'ils le d&eacute;veloppent presque jusqu'&agrave; la finalisation, qu'ils le d&eacute;clarent &laquo;fini&raquo;, puis qu'ils cr&eacute;ent des soci&eacute;t&eacute;s o&ugrave; ils le finiront effectivement et le rendrontutilisable. Parfois, ils d&eacute;clarent &laquo;libre&raquo; la version non termin&eacute;e; s'ils sont vraiment corrompus, ils obtiendront une licence exclusive de la part de l'universit&eacute;. Ce n'est pas un secret, c'est ouvertement admis par les personnes concern&eacute;es. Pourtant, si les chercheurs n'&eacute;taient pas expos&eacute;s &agrave; ces tentations, ils continueraient quand m&ecirc;me leurs recherches.

source: Programmers writing free software can make their living by selling services related to the software. I have been hired to port the <a href="/software/gcc/">GNU C compiler</a> to new hardware, and to make user-interface extensions to <a href="/software/emacs/">GNU Emacs</a>. (I offer these improvements to the public once they are done.) I also teach classes for which I am paid.
fr: Les programmeurs qui &eacute;crivent des logiciels libres peuvent gagner leur vie en vendant des services li&eacute;s au logiciel. J'ai re&ccedil;u des honoraires pour le portage du <a href="/software/gcc/gcc.html">compilateur GNU C</a> sur un nouveau mat&eacute;riel et pour faire des extensions d'interfaces utilisateurs pour <a href="/software/emacs/emacs.html">GNU Emacs</a>. (J'ai offert ces am&eacute;liorations au public, une fois qu'elles ont &eacute;t&eacute; r&eacute;alis&eacute;es). Je suis aussi pay&eacute; pour enseigner dans des classes.

source: I am not alone in working this way; there is now a successful, growing corporation which does no other kind of work. Several other companies also provide commercial support for the free software of the GNU system. This is the beginning of the independent software support industry&mdash;an industry that could become quite large if free software becomes prevalent. It provides users with an option generally unavailable for proprietary software, except to the very wealthy.
fr: Je ne suis pas seul &agrave; travailler de cette fa&ccedil;on; il existe maintenant une entreprise fructueuse, grandissante qui ne fait pas autrement. Plusieurs autres compagnies offrent aussi un support commercial aux logiciels libres issus du syst&egrave;me GNU. C'est le d&eacute;but d'une industrie ind&eacute;pendante du support du logiciel libre, uneindustrie qui pourrait prendre de fortes proportions, si le logiciel libre devenait courant. Elle offre aux utilisateurs des options qui sont g&eacute;n&eacute;ralement indisponibles dans le cas de logiciels propri&eacute;taires, sauf pour les plus riches.

source: New institutions such as the <a href="/fsf/fsf.html">Free Software Foundation</a> can also fund programmers. Most of the Foundation's funds come from users buying tapes through the mail. The software on the tapes is free, which means that every user has the freedom to copy it and change it, but many nonetheless pay to get copies. (Recall that &ldquo;free software&rdquo; refers to freedom, not to price.) Some users who already have a copy order tapes as a way of making a contribution they feel we deserve. The Foundation also receives sizable donations from computer manufacturers.
fr: De nouvelles institutions, comme la <a href="/fsf/fsf.fr.html">Free Software Foundation</a>, peuvent aussi financer les programmeurs. La majorit&eacute; des fonds de la Fondation vient de l'argent r&eacute;colt&eacute; dans la vente de bandes par correspondance. Le logiciel pr&eacute;sent sur la bande est libre, ce qui signifie que chaque utilisateur est libre de le copier et de le modifier, mais n&eacute;anmoins, beaucoup payent pour en obtenir des copies. (Rappelez-vous que &laquo;&nbsp;free software&nbsp;&raquo; veut dire libre, et non gratuit). Certains utilisateurs ach&egrave;tent des bandes, alors qu'ils en poss&egrave;dent d&eacute;j&agrave;, simplement parce qu'ils sentent que nous m&eacute;ritons cette contribution. La Fondation re&ccedil;oit aussi des donations consid&eacute;rables de la part de fabricants d'ordinateurs.

source: The Free Software Foundation is a charity, and its income is spent on hiring as many programmers as possible. If it had been set up as a business, distributing the same free software to the public for the same fee, it would now provide a very good living for its founder.
fr: La Free Software Foundation est une organisation caritative et ses revenus sont d&eacute;pens&eacute;s en employant le plus possible de programmeurs. Si elle avait &eacute;t&eacute; &eacute;rig&eacute;e en business, distribuant les m&ecirc;mes logiciels libres au public pour la m&ecirc;me somme, elle pourrait maintenant offrir un tr&egrave;s bon niveau de vie &agrave; son fondateur.

source: Because the Foundation is a charity, programmers often work for the Foundation for half of what they could make elsewhere. They do this because we are free of bureaucracy, and because they feel satisfaction in knowing that their work will not be obstructed from use. Most of all, they do it because programming is fun. In addition, volunteers have written many useful programs for us. (Even technical writers have begun to volunteer.)
fr: Parce que la Fondation est une organisation caritative, les programmeurs travaillent souvent pour la moiti&eacute; de qu'ils pourraient toucher ailleurs. Ils le font parce qu'ils sont libres de toute bureaucratie et parce qu'ils ressentent de la satisfaction &agrave; savoir que leur travail pourra &ecirc;tre utilis&eacute; par tous. Et, par-dessus tout, ils le font parce que programmer, c'est passionnant. Ajoutons que des volontaires nous ont &eacute;crit nombre de programmes (m&ecirc;me des r&eacute;dacteurs techniques ont r&eacute;cemment commenc&eacute; &agrave; se proposer).
