Repository: gitGNU/gnu_www-fr
Catalog: philosophy/shouldbefree.*.po
Languages: fr

source: This confirms that programming is among the most fascinating of all fields, along with music and art. We don't have to fear that no one will want to program.
fr: Ce qui confirme que la programmation est parmi les domaines les plus fascinants, au m&ecirc;me titre que la musique et les arts. Nous n'avons pas &agrave; craindre que plus personne ne veuille programmer.

source: What Do Users Owe to Developers?
fr: Que doivent les utilisateurs aux programmeurs&nbsp;?

source: There is a good reason for users of software to feel a moral obligation to contribute to its support. Developers of free software are contributing to the users' activities, and it is both fair and in the long-term interest of the users to give them funds to continue.
fr: Il y a une bonne raison &agrave; ce que les utilisateurs de logiciels se sentent oblig&eacute;s moralement &agrave; contribuer &agrave; leur soutien. Les d&eacute;veloppeurs de logiciels libres contribuent &agrave; l'activit&eacute; des utilisateurs, c'est &agrave; la fois loyal et &mdash;&nbsp;sur le long terme&nbsp;&mdash; aussi dans l'int&eacute;r&ecirc;t des utilisateurs que de les financer.

source: However, this does not apply to proprietary software developers, since obstructionism deserves a punishment rather than a reward.
fr: Cependant, ceci ne s'applique pas aux d&eacute;veloppeurs de logiciels propri&eacute;taires, vu que l'obstructionnisme appelle plut&ocirc;t une sanction qu'une r&eacute;compense.

source: We thus have a paradox: the developer of useful software is entitled to the support of the users, but any attempt to turn this moral obligation into a requirement destroys the basis for the obligation. A developer can either deserve a reward or demand it, but not both.
fr: Nous nous trouvons ainsi face &agrave; un paradoxe&nbsp;: le d&eacute;veloppeur de logiciels utiles a droit au soutien des utilisateurs, mais n'importe quelle tentative de transformer cette obligation morale en une exigence, d&eacute;truit les bases de l'obligation. Un d&eacute;veloppeur peut soit recevoir une r&eacute;compense, soit l'exiger, mais pas les deux.

source: I believe that an ethical developer faced with this paradox must act so as to deserve the reward, but should also entreat the users for voluntary donations. Eventually the users will learn to support developers without coercion, just as they have learned to support public radio and television stations.
fr: Je crois qu'un d&eacute;veloppeur moral faisant face &agrave; ce paradoxe doit agir de mani&egrave;re &agrave; m&eacute;riter la r&eacute;compense, mais devrait aussi encourager les utilisateurs &agrave; donner volontairement. T&ocirc;t ou tard, les utilisateurs apprendront &agrave; soutenir les d&eacute;veloppeurs d'eux-m&ecirc;mes, tout comme ils ont appris &agrave; soutenir les radios et les stations t&eacute;l&eacute; ind&eacute;pendantes.

source: What Is Software Productivity?
fr: Qu'est-ce que la productivit&eacute; logicielle&nbsp;?

source: If software were free, there would still be programmers, but perhaps fewer of them. Would this be bad for society?
fr: Si les logiciels &eacute;taient libres, il y aurait toujours des programmeurs, mais peut-&ecirc;tre en nombre moindre. Est-ce que cela serait mauvais pour la soci&eacute;t&eacute;&nbsp;?

source: Not necessarily. Today the advanced nations have fewer farmers than in 1900, but we do not think this is bad for society, because the few deliver more food to the consumers than the many used to do. We call this improved productivity. Free software would require far fewer programmers to satisfy the demand, because of increased software productivity at all levels:
fr: Pas forc&eacute;ment. Aujourd'hui, les nations riches ont moins de fermiers qu'en 1900, mais nous ne pensons certainement pas que cela est mauvais pour la soci&eacute;t&eacute;, car ceux qui restent produisent plus de nourriture pour les consommateurs que tous ceux, plus nombreux, jadis. Nous appelons cela l'am&eacute;lioration de la productivit&eacute;. Le logiciel libre devrait demander moins de programmeurs pour satisfaire la demande, &agrave; cause de l'augmentation de la productivit&eacute; logicielle &agrave; tous niveaux&nbsp;:

source: Wider use of each program that is developed.
fr: Une utilisation plus large de chaque programme d&eacute;velopp&eacute;.

source: The ability to adapt existing programs for customization instead of starting from scratch.
fr: La possibilit&eacute; d'adapter un programme existant pour le personnaliser au lieu de repartir de z&eacute;ro.

source: Better education of programmers.
fr: Une meilleure instruction des programmeurs.

source: The elimination of duplicate development effort.
fr: L'&eacute;limation des redondances dans l'effort de d&eacute;veloppement.

source: Those who object to cooperation claiming it would result in the employment of fewer programmers are actually objecting to increased productivity. Yet these people usually accept the widely-held belief that the software industry needs increased productivity. How is this?
fr: Ceux qui font objection &agrave; la coop&eacute;ration dans la mesure o&ugrave; elle diminuerait l'emploi des programmeurs s'opposent en fait &agrave; l'accroissement de la productivit&eacute;. Pourtant les m&ecirc;mes acceptent souvent la croyance largement r&eacute;pandue que l'industrie logicielle a besoin d'accro&icirc;tre sa productivit&eacute;. Comment cela se fait-il&nbsp;?

source: &ldquo;Software productivity&rdquo; can mean two different things: the overall productivity of all software development, or the productivity of individual projects. Overall productivity is what society would like to improve, and the most straightforward way to do this is to eliminate the artificial obstacles to cooperation which reduce it. But researchers who study the field of &ldquo;software productivity&rdquo; focus only on the second, limited, sense of the term, where improvement requires difficult technological advances.
fr: La &laquo;&nbsp;productivit&eacute; logicielle&nbsp;&raquo; peut vouloir dire deux choses&nbsp;: la productivit&eacute; g&eacute;n&eacute;rale de tout d&eacute;veloppement logiciel ou la productivit&eacute; de projets individuels. La productivit&eacute; g&eacute;n&eacute;rale, c'est ce que la soci&eacute;t&eacute; aimerait am&eacute;liorer et la voie la plus directe pour le faire est d'&eacute;liminer les obstacles artificiels &agrave; la coop&eacute;ration qui la r&eacute;duisent. Mais les chercheurs qui se penchent sur la &laquo;productivit&eacute; logicielle&raquo; se focalisent uniquement sur le deuxi&egrave;me sens, limit&eacute;, du terme, o&ugrave; l'am&eacute;lioration demande des avanc&eacute;es technologiques difficiles.

source: Is Competition Inevitable?
fr: Est-ce que la comp&eacute;tition est in&eacute;vitable&nbsp;?

source: Is it inevitable that people will try to compete, to surpass their rivals in society? Perhaps it is. But competition itself is not harmful; the harmful thing is <em>combat</em>.
fr: Est-il in&eacute;vitable que les gens se mettent en concurrence, qu'ils essayent de d&eacute;passer leurs rivaux dans la soci&eacute;t&eacute;&nbsp;? Peut-&ecirc;tre, oui. Mais la comp&eacute;tition en elle-m&ecirc;me n'est pas nocive&nbsp;: ce qui est nocif, c'est le <em>combat</em>.

source: There are many ways to compete. Competition can consist of trying to achieve ever more, to outdo what others have done. For example, in the old days, there was competition among programming wizards&mdash;competition for who could make the computer do the most amazing thing, or for who could make the shortest or fastest program for a given task. This kind of competition can benefit everyone, <em>as long as</em> the spirit of good sportsmanship is maintained.
fr: Il y a plusieurs fa&ccedil;ons de concourir. La comp&eacute;tition peut se pr&eacute;senter comme essayer d'aller plus loin, comme surpasser ce que d'autres ont d&eacute;j&agrave; r&eacute;alis&eacute;. Par exemple, jadis, il y avait concurrence entre les meilleurs programmeurs, afin que l'ordinateur fasse les choses les plus incroyables possible, ou encore &agrave; qui &eacute;crira le programme le plus court, le plus rapide pour une t&acirc;che donn&eacute;e. Ce genre de comp&eacute;tition est b&eacute;n&eacute;fique pour tous, <em>tant que</em> l'esprit de saine &eacute;mulation est maintenu.

source: Constructive competition is enough competition to motivate people to great efforts. A number of people are competing to be the first to have visited all the countries on Earth; some even spend fortunes trying to do this. But they do not bribe ship captains to strand their rivals on desert islands. They are content to let the best person win.
fr: Une comp&eacute;tition constructive est suffisante pour pousser les gens &agrave; de grands efforts. Certains concourent pour &ecirc;tre les premiers &agrave; avoir visit&eacute; tous les pays du globe&nbsp;; il y en a m&ecirc;me qui d&eacute;pensent des fortunes pour cela. Mais ils ne corrompent pas les capitaines de navire pour que leurs rivaux soient &eacute;chou&eacute;s une &icirc;le d&eacute;serte. Ils se satisfont de laisser le meilleur gagner.

source: Competition becomes combat when the competitors begin trying to impede each other instead of advancing themselves&mdash;when &ldquo;Let the best person win&rdquo; gives way to &ldquo;Let me win, best or not.&rdquo; Proprietary software is harmful, not because it is a form of competition, but because it is a form of combat among the citizens of our society.
fr: La comp&eacute;tition devient un combat quand les participants commencent &agrave; entraver les autres plut&ocirc;t que de progresser eux-m&ecirc;mes &mdash;&nbsp;c'est-&agrave;-dire quand le &laquo;&nbsp;que le meilleur gagne&nbsp;&raquo;fait la place au &laquo;&nbsp;laissez-moi gagner, que je sois le meilleur ou non&nbsp;&raquo;. Le logiciel propri&eacute;taire est nocif, non parce qu'il est une forme de comp&eacute;tition, mais parce qu'il est une forme de combat au sein des citoyens de notre soci&eacute;t&eacute;.

source: Competition in business is not necessarily combat. For example, when two grocery stores compete, their entire effort is to improve their own operations, not to sabotage the rival. But this does not demonstrate a special commitment to business ethics; rather, there is little scope for combat in this line of business short of physical violence. Not all areas of business share this characteristic. Withholding information that could help everyone advance is a form of combat.
fr: La comp&eacute;tition dans les affaires n'est pas forc&eacute;ment un combat. Par exemple, lorsque deux &eacute;piceries sont en comp&eacute;tition, tout leur effort tend vers l'am&eacute;lioration de leurs propres services, pas &agrave; saboter leur rival. Mais ce n'est pas ce qui d&eacute;montre un engagement moral dans les affaires; plut&ocirc;t qu'il existe une faible zone de combat dans ce genre de business, &agrave; la limite de la violence physique. Tous les domaines des affaires ne partagent pas cette caract&eacute;ristique. La r&eacute;tention d'information utile &agrave; tous, c'est une forme de combat.

source: Business ideology does not prepare people to resist the temptation to combat the competition. Some forms of combat have been banned with anti-trust laws, truth in advertising laws, and so on, but rather than generalizing this to a principled rejection of combat in general, executives invent other forms of combat which are not specifically prohibited. Society's resources are squandered on the economic equivalent of factional civil war.
fr: L'id&eacute;ologie, dans les affaires, ne pr&eacute;pare pas les gens &agrave; r&eacute;sister &agrave; la tentation de combattre, dans une comp&eacute;tition. Certaines formes de combat ont &eacute;t&eacute; interdites avec les lois anti-trusts, l'interdiction de la publicit&eacute; mensong&egrave;re, etc., mais plut&ocirc;t que de g&eacute;n&eacute;raliser le rejet du combat, les dirigeants inventent en g&eacute;n&eacute;ral d'autres formes de combat qui ne sont pas sp&eacute;cifiquement prohib&eacute;es. Les ressources de la soci&eacute;t&eacute; sont gaspill&eacute;es &eacute;conomiquement, &agrave; l'instar d'une guerre civile entre factions.

source: &ldquo;Why Don't You Move to Russia?&rdquo;
fr: &laquo;&nbsp;Pourquoi n'irais-tu pas en Russie&nbsp;?&nbsp;&raquo;

source: In the United States, any advocate of other than the most extreme form of laissez-faire selfishness has often heard this accusation. For example, it is leveled against the supporters of a national health care system, such as is found in all the other industrialized nations of the free world. It is leveled against the advocates of public support for the arts, also universal in advanced nations. The idea that citizens have any obligation to the public good is identified in America with Communism. But how similar are these ideas?
fr: Aux &Eacute;tats-Unis, toute personne favorable &agrave; autre chose que le plus flagrant laissez-faire &eacute;go&iuml;ste a souvent entendu ce genre de r&eacute;flexion. On l'entend, par exemple, &agrave; l'encontre des partisans d'un syst&egrave;me de sant&eacute; publique, comme on en trouve dans les autres nations industrialis&eacute;es. Ou encore &agrave; propos des partisans d'un soutien public des arts, tout aussi universel chez les nations avanc&eacute;es. L'id&eacute;e que les citoyens aient une quelconque obligation de participer au bien public est consid&eacute;r&eacute;e comme du communisme, aux &Eacute;tats-Unis. Mais ce terme est-il bien appropri&eacute;&nbsp;?

source: Communism as was practiced in the Soviet Union was a system of central control where all activity was regimented, supposedly for the common good, but actually for the sake of the members of the Communist party. And where copying equipment was closely guarded to prevent illegal copying.
fr: Le communisme, comme il &eacute;tait pratiqu&eacute; en Union Sovi&eacute;tique, &eacute;tait un syst&egrave;me de contr&ocirc;le centralis&eacute;, o&ugrave; toutes les activit&eacute;s &eacute;taient pass&eacute;es au crible du r&eacute;gime, soi-disant pour le bien public, mais en fait pour le bien des membres du Parti Communiste. Syst&egrave;me o&ugrave; les appareils permettant les copies &eacute;taient &eacute;troitement gard&eacute;s, pour emp&ecirc;cher les copies ill&eacute;gales.

source: The American system of software copyright exercises central control over distribution of a program, and guards copying equipment with automatic copying-protection schemes to prevent illegal copying.
fr: Le syst&egrave;me am&eacute;ricain de la propri&eacute;t&eacute; intellectuelle exerce un contr&ocirc;le central sur la distribution d'un programme et surveille les copieurs gr&acirc;ce &agrave; des <a href="http://www.dfc.org/">syst&egrave;mes automatiques de protection contre la copie</a>, pour emp&ecirc;cher les copies ill&eacute;gales.

source: By contrast, I am working to build a system where people are free to decide their own actions; in particular, free to help their neighbors, and free to alter and improve the tools which they use in their daily lives. A system based on voluntary cooperation and on decentralization.
fr: Par opposition, je travaille &agrave; b&acirc;tir un syst&egrave;me o&ugrave; les gens sont libres de d&eacute;cider de leurs propres actions; en particulier, libres d'aider leur voisin, de modifier et d'am&eacute;liorer les outils qu'ils utilisent dans leur vie quotidienne. Un syst&egrave;me bas&eacute; sur la coop&eacute;ration volontaire et la d&eacute;centralisation.

source: Thus, if we are to judge views by their resemblance to Russian Communism, it is the software owners who are the Communists.
fr: Du coup, si on doit juger ces points de vue par leurs ressemblances au communisme sovi&eacute;tique, alors ce sont les propri&eacute;taires de logiciels qui sont les communistes.

source: The Question of Premises
fr: La question des pr&eacute;misses

source: I make the assumption in this paper that a user of software is no less important than an author, or even an author's employer. In other words, their interests and needs have equal weight, when we decide which course of action is best.
fr: Je fais la supposition, dans cet article, que l'utilisateur d'un logiciel n'est pas moins important qu'un auteur ou m&ecirc;me l'employeur d'un auteur. Autrement dit, lorsqu'on d&eacute;cide quelle est la meilleure marche &agrave; suivre, leurs int&eacute;r&ecirc;ts et leurs besoins ont autant d'importance.

source: This premise is not universally accepted. Many maintain that an author's employer is fundamentally more important than anyone else. They say, for example, that the purpose of having owners of software is to give the author's employer the advantage he deserves&mdash;regardless of how this may affect the public.
fr: Cette pr&eacute;misse n'est pas universellement accept&eacute;e. Beaucoup maintiennent que l'employeur d'un auteur est fondamentalement plus important que n'importe qui d'autre. Ils disent, par exemple, que le but, d'avoir des propri&eacute;taires de logiciels, est de donner &agrave; l'employeur les avantages qui lui sont d&ucirc;s &mdash;&nbsp;ind&eacute;pendamment de l'effet sur le public.

source: It is no use trying to prove or disprove these premises. Proof requires shared premises. So most of what I have to say is addressed only to those who share the premises I use, or at least are interested in what their consequences are. For those who believe that the owners are more important than everyone else, this paper is simply irrelevant.
fr: Cela ne sert &agrave; rien de prouver ou non ces pr&eacute;misses. Prouver demande des pr&eacute;misses partag&eacute;es. C'est pourquoi la majorit&eacute; de mon discourss'adresse &agrave; ceux qui partagent les pr&eacute;misses que j'utilise, ou qui, au moins, sont int&eacute;ress&eacute;s par leurs cons&eacute;quences. Pour ceux qui croientque les propri&eacute;taires sont plus importants que tous les autres, pour ceux-l&agrave;, cet article n'est tout simplement pas pertinent.

source: But why would a large number of Americans accept a premise that elevates certain people in importance above everyone else? Partly because of the belief that this premise is part of the legal traditions of American society. Some people feel that doubting the premise means challenging the basis of society.
fr: Mais pourquoi un grand nombre d'Am&eacute;ricains accepteraient une pr&eacute;misse qui &eacute;l&egrave;verait certaines personnes au-dessus des autres&nbsp;? En partie &agrave; cause de la croyance que cette pr&eacute;misse fait partie des traditions l&eacute;gales de la soci&eacute;t&eacute; am&eacute;ricaine. Il y a des gens qui pensent que douter de la pr&eacute;misse, c'est d&eacute;fier les bases de la soci&eacute;t&eacute;.

source: It is important for these people to know that this premise is not part of our legal tradition. It never has been.
fr: Il est important pour ces gens de savoir que cette pr&eacute;misse ne fait pas partie de notre tradition l&eacute;gale. Ne l'a jamais &eacute;t&eacute;.

source: Thus, the Constitution says that the purpose of copyright is to &ldquo;promote the progress of science and the useful arts.&rdquo; The Supreme Court has elaborated on this, stating in &lsquo;Fox Film vs. Doyal&rsquo; that &ldquo;The sole interest of the United States and the primary object in conferring the [copyright] monopoly lie in the general benefits derived by the public from the labors of authors.&rdquo;
fr: Ainsi, la Constitution dit que le but du copyright est de &laquo;&nbsp;promouvoir le progr&egrave;s des sciences et des arts utiles&nbsp;&raquo;. La cour Supr&ecirc;me l'a &eacute;labor&eacute; ainsi, &eacute;non&ccedil;ant dans la &laquo;&nbsp;Fox Film contre Doyal&nbsp;&raquo; que &laquo;&nbsp;l'int&eacute;r&ecirc;t unique des &Eacute;tats-Unis ainsi que l'objet principal du monopole [du copyright], r&eacute;sident dans les b&eacute;n&eacute;fices que retire le public du travail des auteurs&nbsp;&raquo;.

source: We are not required to agree with the Constitution or the Supreme Court. (At one time, they both condoned slavery.) So their positions do not disprove the owner supremacy premise. But I hope that the awareness that this is a radical right-wing assumption rather than a traditionally recognized one will weaken its appeal.
fr: Nous ne sommes pas oblig&eacute;s d'approuver la Constitution ou la Cour Supr&ecirc;me (il fut un temps o&ugrave; les deux ont approuv&eacute; l'esclavage). Leurs positions ne r&eacute;futent donc pas la pr&eacute;misse de la supr&eacute;matie du propri&eacute;taire. Mais j'esp&egrave;re que la conscience qu'il s'agit d'une supposition de la droite radicale, plut&ocirc;t que d'une tradition reconnue, affaiblira son int&eacute;r&ecirc;t.

source: We like to think that our society encourages helping your neighbor; but each time we reward someone for obstructionism, or admire them for the wealth they have gained in this way, we are sending the opposite message.
fr: Nous aimons penser que notre soci&eacute;t&eacute; encourage &agrave; aider son voisin&nbsp;; mais chaque fois que nous r&eacute;compensons quelqu'un pour son obstructionnisme ou que nous l'admirons pour les richesses qu'il a accumul&eacute; ainsi, nous renvoyons le message contraire.

source: Software hoarding is one form of our general willingness to disregard the welfare of society for personal gain. We can trace this disregard from Ronald Reagan to Dick Cheney, from Exxon to Enron, from failing banks to failing schools. We can measure it with the size of the homeless population and the prison population. The antisocial spirit feeds on itself, because the more we see that other people will not help us, the more it seems futile to help them. Thus society decays into a jungle.
fr: La th&eacute;saurisation de logiciels est un exemple de notre volont&eacute; d'ignorer le bien-&ecirc;tre de la soci&eacute;t&eacute; pour le gain personnel. On peut en voir la trace depuis Ronald Reagan jusqu'&agrave; Dick Cheney, depuis Exxon &agrave; Enron, en passant par les &eacute;checs des banques et des &eacute;coles. Nous pouvons la mesurer &agrave; l'aune des sans-abri et de la population dans les prisons. L'esprit antisocial se nourrit de lui-m&ecirc;me, parce que plus on voit que les autres ne nous tendront pas la main, plus il nous semble futile de les aider. Ainsi, notre soci&eacute;t&eacute; d&eacute;g&eacute;n&egrave;re en jungle.

source: If we don't want to live in a jungle, we must change our attitudes. We must start sending the message that a good citizen is one who cooperates when appropriate, not one who is successful at taking from others. I hope that the free software movement will contribute to this: at least in one area, we will replace the jungle with a more efficient system which encourages and runs on voluntary cooperation.
fr: Si nous ne voulons pas vivre dans une jungle, nous devons changer nos attitudes. Nous devons commencer &agrave; lancer le message qu'un bon citoyen est un citoyen qui coop&egrave;re quand il le faut, que ce n'est pas celui qui r&eacute;ussit en volant les autres. J'esp&egrave;re que le mouvement du logiciel libre contribuera &agrave; cela&nbsp;: au moins dans un domaine, nous remplacerons la jungle par un syst&egrave;me plus efficace qui encouragera et se nourrira la coop&eacute;ration volontaire.

source: Footnotes
fr: Notes
