Repository: gitGNU/gnu_www-fr
Catalog: philosophy/shouldbefree.*.po
Languages: fr

source: However, taking account of the concomitant psychosocial harm, there is no limit to the harm that proprietary software development can do.
fr: Cependant, tenant compte des pr&eacute;judices psycho-sociaux concomitants, il n'y a pas de limite au pr&eacute;judice que peut provoquer le d&eacute;veloppement d'un logiciel propri&eacute;taire.

source: Obstructing Use of Programs
fr: L'entrave &agrave; l'utilisation de programmes

source: The first level of harm impedes the simple use of a program. A copy of a program has nearly zero marginal cost (and you can pay this cost by doing the work yourself), so in a free market, it would have nearly zero price. A license fee is a significant disincentive to use the program. If a widely-useful program is proprietary, far fewer people will use it.
fr: Le premier niveau de pr&eacute;judice g&ecirc;ne le simple emploi d'un programme. Une copie d'un programme a pratiquement un co&ucirc;t marginal de z&eacute;ro (et ce prix, vous pouvez le payer en faisant le travail vous-m&ecirc;me), ce qui veut dire que, dans un march&eacute; libre, elle aurait un prix avoisinant z&eacute;ro. Une taxe via une licence est un d&eacute;couragement significatif &agrave; l'utilisation d'un programme. Si un logiciel largement utile est propri&eacute;taire, beaucoup moins de gens l'utiliseront.

source: It is easy to show that the total contribution of a program to society is reduced by assigning an owner to it. Each potential user of the program, faced with the need to pay to use it, may choose to pay, or may forego use of the program. When a user chooses to pay, this is a zero-sum transfer of wealth between two parties. But each time someone chooses to forego use of the program, this harms that person without benefitting anyone. The sum of negative numbers and zeros must be negative.
fr: Il est facile de montrer que la contribution totale d'un programme &agrave; la soci&eacute;t&eacute; est r&eacute;duite si on lui assigne un propri&eacute;taire. Chaque utilisateur potentiel du logiciel, face &agrave; la n&eacute;cessit&eacute; de le payer pour l'utiliser, peut choisir de payer ou de renoncer &agrave; son usage. Si un utilisateur fait le choix de payer le programme, il y a un simple transfert de richesses entre deux parties. Mais chaque fois qu'une personne choisit d'outrepasser l'utilisation du programme, cela causedu tort &agrave; cette personne sans que quelqu'un y trouve son compte. La somme de nombres n&eacute;gatifs avec z&eacute;ro, &ccedil;a doit &ecirc;tre n&eacute;gatif.

source: But this does not reduce the amount of work it takes to <em>develop</em> the program. As a result, the efficiency of the whole process, in delivered user satisfaction per hour of work, is reduced.
fr: Mais cela ne r&eacute;duit pas la somme de travail qu'il faut pour <em>d&eacute;velopper</em> le programme. Donc l'efficacit&eacute; du processus, calcul&eacute;e en divisant la satisfaction des utilisateurs par le co&ucirc;t du d&eacute;veloppement, en est diminu&eacute;e.

source: This reflects a crucial difference between copies of programs and cars, chairs, or sandwiches. There is no copying machine for material objects outside of science fiction. But programs are easy to copy; anyone can produce as many copies as are wanted, with very little effort. This isn't true for material objects because matter is conserved: each new copy has to be built from raw materials in the same way that the first copy was built.
fr: Ceci refl&egrave;te la diff&eacute;rence cruciale entre la copie de programmes et celle de voitures, de chaises ou de sandwiches. &Agrave; part dans la science-fiction, il n'existe pas de machine pouvant reproduire les objets mat&eacute;riels. Mais les programmes sont faciles &agrave; copier; n'importe qui peut faire autant de copies que n&eacute;cessaire, sans gros effort. Ce qui n'est pas vrai dans le cas des objets mat&eacute;riels, vu que la mati&egrave;re est conserv&eacute;e&nbsp;: chaque copie n&eacute;cessite des mati&egrave;res premi&egrave;res, tout comme la premi&egrave;re.

source: With material objects, a disincentive to use them makes sense, because fewer objects bought means less raw material and work needed to make them. It's true that there is usually also a startup cost, a development cost, which is spread over the production run. But as long as the marginal cost of production is significant, adding a share of the development cost does not make a qualitative difference. And it does not require restrictions on the freedom of ordinary users.
fr: En ce qui concerne les objets mat&eacute;riels, d&eacute;courager leur usage est logique, car moins d'objets signifie moins de mati&egrave;res premi&egrave;res, moins de travail pour les construire. C'est vrai qu'il faut un co&ucirc;t pour d&eacute;marrer, pour d&eacute;velopper, co&ucirc;t r&eacute;parti sur l'ensemble de la production. Mais tant que le co&ucirc;t marginal est significatif, y ajouter un pourcentage des co&ucirc;ts de d&eacute;veloppement ne provoque pas de diff&eacute;rence qualitative. Et cela ne n&eacute;cessite pas de restrictions sur la libert&eacute; des utilisateurs.

source: However, imposing a price on something that would otherwise be free is a qualitative change. A centrally-imposed fee for software distribution becomes a powerful disincentive.
fr: Cependant, imposer un prix &agrave; quelque chose qui, autrement, aurait pu &ecirc;tre gratuit, c'est un changement qualitatif. Une taxe impos&eacute;e, centralis&eacute;e, sur la distribution de logiciels devient fortement d&eacute;courageante.

source: What's more, central production as now practiced is inefficient even as a means of delivering copies of software. This system involves enclosing physical disks or tapes in superfluous packaging, shipping large numbers of them around the world, and storing them for sale. This cost is presented as an expense of doing business; in truth, it is part of the waste caused by having owners.
fr: De plus, la production centrale, telle qu'elle est pratiqu&eacute;e de nos jours, est inefficace, y compris dans son r&ocirc;le de fournisseur de copies de logiciels. Ce syst&egrave;me implique d'empaqueter des disquettes ou des bandes dans un emballage superflu, de les envoyer en nombre dans le monde entier puis de les stocker avant leur vente. Ces co&ucirc;ts sont pr&eacute;sent&eacute;s comme &eacute;tant le prix &agrave; payer pour faire des affaires&nbsp;; en v&eacute;rit&eacute;, ils font partie du gaspillage caus&eacute; par la pr&eacute;sence d'un propri&eacute;taire.

source: Damaging Social Cohesion
fr: Endommager la coh&eacute;sion sociale

source: Suppose that both you and your neighbor would find it useful to run a certain program. In ethical concern for your neighbor, you should feel that proper handling of the situation will enable both of you to use it. A proposal to permit only one of you to use the program, while restraining the other, is divisive; neither you nor your neighbor should find it acceptable.
fr: Supposons que vous et votre voisin trouviez utile de faire tourner un certain programme. Dans un souci moral pour votre voisin, vous devriez sentir que la fa&ccedil;on correcte d'appr&eacute;hender la situation, est de permettre une utilisation de ce logiciel par vous deux. S'il n'y avait la possibilit&eacute; que pour un seul d'entre vous de faire tourner ceprogramme, il y aurait division&nbsp;; ni vous, ni votre voisin ne trouveriez cela acceptable.

source: Signing a typical software license agreement means betraying your neighbor: &ldquo;I promise to deprive my neighbor of this program so that I can have a copy for myself.&rdquo; People who make such choices feel internal psychological pressure to justify them, by downgrading the importance of helping one's neighbors&mdash;thus public spirit suffers. This is psychosocial harm associated with the material harm of discouraging use of the program.
fr: Signer un accord de licence logicielle typique revient &agrave; trahir votre voisin&nbsp;: &laquo;&nbsp;je fais la promesse de priver mon voisin de ce programme, ainsi je peux en avoir une copie pour moi-m&ecirc;me&nbsp;&raquo;. Les gens qui font de tels choix ressentent une pression psychologique interne pour se justifier, en diminuant l'importance d'aider leur voisin &mdash;&nbsp;c'est comme cela que le sens civique souffre. C'est un pr&eacute;judice psycho-social associ&eacute; au pr&eacute;judice mat&eacute;riel de d&eacute;courager l'utilisation du logiciel.

source: Many users unconsciously recognize the wrong of refusing to share, so they decide to ignore the licenses and laws, and share programs anyway. But they often feel guilty about doing so. They know that they must break the laws in order to be good neighbors, but they still consider the laws authoritative, and they conclude that being a good neighbor (which they are) is naughty or shameful. That is also a kind of psychosocial harm, but one can escape it by deciding that these licenses and laws have no moral force.
fr: Beaucoup d'utilisateurs reconnaissent inconsciemment le tort de refuser le partage&nbsp;; ils d&eacute;cident alors d'ignorer les licences et les lois, et de partager tout de m&ecirc;me les programmes. Mais ils s'en sentent souvent coupables. Ils savent qu'ils doivent enfreindre la loi pour &ecirc;tre de bons voisins, mais ils continuent de penser que les lois font autorit&eacute; et concluent qu'&ecirc;tre un bon voisin (ce qu'ils sont), c'est vilain et honteux. C'est aussi une forme de pr&eacute;judice psycho-social, mais on peut y &eacute;chapper en prenant la d&eacute;cision que ces licences et ces lois n'ont pas de force morale.

source: Programmers also suffer psychosocial harm knowing that many users will not be allowed to use their work. This leads to an attitude of cynicism or denial. A programmer may describe enthusiastically the work that he finds technically exciting; then when asked, &ldquo;Will I be permitted to use it?&rdquo;, his face falls, and he admits the answer is no. To avoid feeling discouraged, he either ignores this fact most of the time or adopts a cynical stance designed to minimize the importance of it.
fr: Les programmeurs souffrent aussi de pr&eacute;judices psycho-sociaux, sachant que bien des usagers ne pourront utiliser leurs travaux. Ceci conduit &agrave; une attitude de cynisme ou de d&eacute;n&eacute;gation. Un programmeur peut faire une description enthousiaste du travail qu'il pense techniquement excitant; puis, quand on lui demande &laquo;&nbsp;Est-ce qu'il me sera permis de l'utiliser&nbsp;?&nbsp;&raquo;, son visage se ferme et il doit bien admettre que non. Pour &eacute;viter de se sentir d&eacute;courag&eacute;, soit il ignore ce fait la plupart du temps, soit il adopte une attitude cynique afin d'en minimiser l'importance.

source: Since the age of Reagan, the greatest scarcity in the United States is not technical innovation, but rather the willingness to work together for the public good. It makes no sense to encourage the former at the expense of the latter.
fr: Depuis la p&eacute;riode reaganienne, la plus grande p&eacute;nurie, aux &Eacute;tats-Unis, ce n'est pas l'innovation technique, mais plut&ocirc;t la volont&eacute; de travailler ensemble pour le bien public. Cela n'a pas de sens d'encourager l'un au d&eacute;triment de l'autre.

source: Obstructing Custom Adaptation of Programs
fr: L'entrave &agrave; l'adaptation sur mesure des programmes

source: The second level of material harm is the inability to adapt programs. The ease of modification of software is one of its great advantages over older technology. But most commercially available software isn't available for modification, even after you buy it. It's available for you to take it or leave it, as a black box&mdash;that is all.
fr: Le deuxi&egrave;me niveau de pr&eacute;judice mat&eacute;riel est l'impossibilit&eacute; d'adapter les programmes. La facilit&eacute; de modification du logiciel est un de ses grands avantages sur les technologies plus anciennes. Mais la plupart des logiciels commerciaux ne peuvent &ecirc;tre modifi&eacute;s, m&ecirc;me apr&egrave;s les avoir achet&eacute;s. Ils sont &agrave; prendre ou &agrave; laisser, comme une bo&icirc;te noire, un point c'est tout.

source: A program that you can run consists of a series of numbers whose meaning is obscure. No one, not even a good programmer, can easily change the numbers to make the program do something different.
fr: Un programme que vous pouvez ex&eacute;cuter se compose d'une s&eacute;rie de nombres dont le sens est obscur. Personne, m&ecirc;me un bon programmeur, ne peut ais&eacute;ment changer les nombres afin que le logiciel ex&eacute;cute autre chose.

source: Programmers normally work with the &ldquo;source code&rdquo; for a program, which is written in a programming language such as Fortran or C. It uses names to designate the data being used and the parts of the program, and it represents operations with symbols such as &lsquo;+&rsquo; for addition and &lsquo;-&rsquo; for subtraction. It is designed to help programmers read and change programs. Here is an example; a program to calculate the distance between two points in a plane:
fr: Normalement, les programmeurs travaillent sur le &laquo;&nbsp;code source&nbsp;&raquo; d'un programme, &eacute;crit dans un langage de programmation comme le Fortran oule C. Ils utilisent des noms pour d&eacute;signer les donn&eacute;es utilis&eacute;es et des parties du programme, et ils repr&eacute;sentent les op&eacute;rations par des symboles comme le &laquo;&nbsp;+&nbsp;&raquo; pour une op&eacute;ration ou le &laquo;&nbsp;-&nbsp;&raquo; pour une soustraction. Le langage est con&ccedil;u pour aider les programmeurs &agrave; d&eacute;chiffrer et modifier les programmes. Voici un exemple&nbsp;: il s'agit d'un programme qui calcule la distance entre deux points d'un plan&nbsp;:

source: Here is the same program in executable form, on the computer I normally use:
fr: Voici le m&ecirc;me programme sous sa forme ex&eacute;cutable, sur l'ordinateur que j'utilise habituellement&nbsp;:

source: Source code is useful (at least potentially) to every user of a program. But most users are not allowed to have copies of the source code. Usually the source code for a proprietary program is kept secret by the owner, lest anybody else learn something from it. Users receive only the files of incomprehensible numbers that the computer will execute. This means that only the program's owner can change the program.
fr: Le code source est utile (au moins potentiellement) pour chaque utilisateur d'un programme. Mais la plupart des utilisateurs n'ont pas la permission d'avoir des copies du code source. Normalement, le code source d'un programme propri&eacute;taire est tenu secret par son propri&eacute;taire, emp&ecirc;chant quiconque d'en apprendre quelque chose. L'utilisateur re&ccedil;oit simplement des fichiers de nombres incompr&eacute;hensibles que l'ordinateur ex&eacute;cutera. Cela signifie que seul le propri&eacute;taire du logiciel peut changer le programme.

source: A friend once told me of working as a programmer in a bank for about six months, writing a program similar to something that was commercially available. She believed that if she could have gotten source code for that commercially available program, it could easily have been adapted to their needs. The bank was willing to pay for this, but was not permitted to&mdash;the source code was a secret. So she had to do six months of make-work, work that counts in the GNP but was actually waste.
fr: Un jour, une amie me dit qu'elle travaillait comme programmeur dans une banque depuis environ six mois, &eacute;crivant un programme similaire &agrave; quelque chose de commercialement disponible. Elle croyait que, si elle avait acc&egrave;s au code source de ce programme commercial, elle pourrait facilement l'adapter &agrave; ses besoins. La banque souhaitait payer pour cela, mais elle n'y fut pas autoris&eacute;e &mdash;&nbsp;le code source &eacute;tait un secret. Elle a d&ucirc; alors travailler d'arrache-pied pendant six mois, un travail qui compte pour le PNB, mais qui &eacute;tait en fait du gaspillage.

source: The <abbr title="Massachusetts Institute of Technology">MIT</abbr> Artificial Intelligence Lab (AI Lab) received a graphics printer as a gift from Xerox around 1977. It was run by free software to which we added many convenient features. For example, the software would notify a user immediately on completion of a print job. Whenever the printer had trouble, such as a paper jam or running out of paper, the software would immediately notify all users who had print jobs queued. These features facilitated smooth operation.
fr: Le Laboratoire d'Intelligence Artificielle du MIT re&ccedil;ut une imprimante graphique comme cadeau de la part de Xerox, aux alentours de 1977. Elle &eacute;tait pilot&eacute;e par un logiciel libre, auquel nous avons ajout&eacute; de nombreuses caract&eacute;ristiques bien commodes. Par exemple, le logiciel avertissait imm&eacute;diatement l'utilisateur de la fin du processus d'impression. Si l'imprimante venait &agrave; rencontrer un probl&egrave;me, comme un bourrage ou un manque de papier, le programme avertissait de suite tous ceux qui avaient des travaux d'impression en cours. Ces fonctionnalit&eacute;s facilitaient la vie.

source: Later Xerox gave the AI Lab a newer, faster printer, one of the first laser printers. It was driven by proprietary software that ran in a separate dedicated computer, so we couldn't add any of our favorite features. We could arrange to send a notification when a print job was sent to the dedicated computer, but not when the job was actually printed (and the delay was usually considerable). There was no way to find out when the job was actually printed; you could only guess. And no one was informed when there was a paper jam, so the printer often went for an hour without being fixed.
fr: Plus tard, Xerox offrit au labo d'I.A. une nouvelle imprimante, plus rapide, une des premi&egrave;res laser. Elle &eacute;tait pilot&eacute;e par un logiciel propri&eacute;taire qui tournait sur un poste d&eacute;di&eacute; et s&eacute;par&eacute;, nous ne pouvions donc ajouter aucune de nos fonctionnalit&eacute;s favorites. On pouvait s'arranger pour envoyer un message quand le travail d'impression se lan&ccedil;ait sur le poste d&eacute;di&eacute;, mais pas quand celui-ci se faisait effectivement (et les d&eacute;lais &eacute;taient habituellement importants). Il n'y avait aucun moyen de savoir si l'impression &eacute;tait faite; il fallait deviner. Et personne n'&eacute;tait inform&eacute; d'un bourrage papier, l'imprimante attendait ainsi souvent une heure avant d'&ecirc;tre recharg&eacute;e.

source: The system programmers at the AI Lab were capable of fixing such problems, probably as capable as the original authors of the program. Xerox was uninterested in fixing them, and chose to prevent us, so we were forced to accept the problems. They were never fixed.
fr: Les programmeurs syst&egrave;me du labo d'I.A. &eacute;taient capables de corriger de tels probl&egrave;mes, probablement tout aussi capables que les auteurs du programme. Xerox n'avait pas envie de les corriger et choisit de nous en emp&ecirc;cher, nous avons donc &eacute;t&eacute; forc&eacute;s de subir les probl&egrave;mes. Ils n'ont jamais &eacute;t&eacute; corrig&eacute;s.

source: Most good programmers have experienced this frustration. The bank could afford to solve the problem by writing a new program from scratch, but a typical user, no matter how skilled, can only give up.
fr: La plupart des bons programmeurs ont fait l'exp&eacute;rience de cette frustration. La banque pouvait se permettre de r&eacute;soudre son probl&egrave;me en &eacute;crivant un nouveau programme depuis le d&eacute;but, mais un utilisateur lambda, quelle que soit son habilet&eacute;, ne peut que laisser tomber.

source: Giving up causes psychosocial harm&mdash;to the spirit of self-reliance. It is demoralizing to live in a house that you cannot rearrange to suit your needs. It leads to resignation and discouragement, which can spread to affect other aspects of one's life. People who feel this way are unhappy and do not do good work.
fr: Laisser tomber provoque un pr&eacute;judice psycho-social &mdash;&nbsp;sur l'esprit d'ind&eacute;pendance. C'est d&eacute;moralisant d'habiter une maison qu'on ne peut r&eacute;arranger selon ses besoins. Cela conduit &agrave; la r&eacute;signation et au d&eacute;couragement, ce qui peut gagner d'autres aspects de la vie. Les gens qui se sentent ainsi ne sont pas heureux et ne font pas du bon travail.

source: Imagine what it would be like if recipes were hoarded in the same fashion as software. You might say, &ldquo;How do I change this recipe to take out the salt?&rdquo; and the great chef would respond, &ldquo;How dare you insult my recipe, the child of my brain and my palate, by trying to tamper with it? You don't have the judgment to change my recipe and make it work right!&rdquo;
fr: Imaginez ce que ce serait si les recettes &eacute;taient log&eacute;es &agrave; la m&ecirc;me enseigne que les logiciels. Vous vous diriez &laquo;&nbsp;Voyons, comment modifiercette recette pour qu'il n'y ait plus de sel&nbsp;?&nbsp;&raquo;, et le chef cuistot de vous r&eacute;pondre &laquo;&nbsp;Comment oses-tu insulter ma recette, fruit de mon cerveau et de mon palais, en tentant de la modifier&nbsp;? Tu n'as pas le jugement pour changer ma recette afin qu'elle marche mieux&nbsp;&raquo;.

source: &ldquo;But my doctor says I'm not supposed to eat salt! What can I do? Will you take out the salt for me?&rdquo;
fr: &laquo;Mais mon docteur m'a recommand&eacute; de ne pas manger sal&eacute;. Que puis-je faire&nbsp;? Pouvez-vous en &ocirc;ter le sel pour moi&nbsp;?&nbsp;&raquo;

source: &ldquo;I would be glad to do that; my fee is only $50,000.&rdquo; Since the owner has a monopoly on changes, the fee tends to be large. &ldquo;However, right now I don't have time. I am busy with a commission to design a new recipe for ship's biscuit for the Navy Department. I might get around to you in about two years.&rdquo;
fr: &laquo;Je serais heureux de le faire&nbsp;; mes honoraires ne sont que de 50000 dollars&raquo;. &Agrave; partir du moment o&ugrave; le propri&eacute;taire a le monopole sur lesmodifications, les honoraires tendent &agrave; gonfler. &laquo;&nbsp;De toute fa&ccedil;on, je n'ai pas le temps maintenant. Je suis pris par une commission afin de cr&eacute;er une nouvelle recette de biscuits marins pour le D&eacute;partement de la Marine. Je reprendrai contact avec toi d'ici &agrave; peu pr&egrave;s deux ans&nbsp;&raquo;.

source: Obstructing Software Development
fr: L'entrave au d&eacute;veloppement logiciel
