Repository: gitGNU/gnu_www-fr
Catalog: philosophy/shouldbefree.*.po
Languages: fr

source: Why Software Should Be Free - GNU Project - Free Software Foundation (FSF)
fr: Pourquoi les logiciels devraient &ecirc;tre libres - GNU Project - Free Software Foundation (FSF)

source: Why Software Should Be Free
fr: Pourquoi les logiciels devraient &ecirc;tre libres

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: (Version of April 24, 1992)
fr: (Version du 24 avril 1992)

source: The existence of software inevitably raises the question of how decisions about its use should be made. For example, suppose one individual who has a copy of a program meets another who would like a copy. It is possible for them to copy the program; who should decide whether this is done? The individuals involved? Or another party, called the &ldquo;owner&rdquo;?
fr: L'existence de logiciels soul&egrave;ve forc&eacute;ment la question de la fa&ccedil;on dont devraient &ecirc;tre prises les d&eacute;cisions concernant leur usage. Par exemple, supposons qu'une personne ayant une copie d'un programme, rencontre une autre personne qui en voudrait une copie. Il est possible pour eux de copier le programme; qui devrait d&eacute;cider si c'est possible&nbsp;? Les personnes elles-m&ecirc;mes&nbsp;? Ou une tierce personne, son &laquo;&nbsp;propri&eacute;taire&nbsp;&raquo;&nbsp;?

source: Software developers typically consider these questions on the assumption that the criterion for the answer is to maximize developers' profits. The political power of business has led to the government adoption of both this criterion and the answer proposed by the developers: that the program has an owner, typically a corporation associated with its development.
fr: Les d&eacute;veloppeurs de logiciels consid&egrave;rent typiquement que le crit&egrave;re de r&eacute;ponse suppos&eacute; est la maximisation de leurs profits. Le pouvoir politique des affaires a pouss&eacute; le gouvernement &agrave; adopter &agrave; la fois ce crit&egrave;re et la r&eacute;ponse propos&eacute;e par les d&eacute;veloppeurs&nbsp;: c'est-&agrave;-dire qu'un programme a un propri&eacute;taire, en g&eacute;n&eacute;ral une soci&eacute;t&eacute; associ&eacute;e &agrave; son d&eacute;veloppement.

source: I would like to consider the same question using a different criterion: the prosperity and freedom of the public in general.
fr: J'aimerais consid&eacute;rer la m&ecirc;me question en utilisant un crit&egrave;re diff&eacute;rent&nbsp;: la prosp&eacute;rit&eacute; et la libert&eacute; du public en g&eacute;n&eacute;ral.

source: This answer cannot be decided by current law&mdash;the law should conform to ethics, not the other way around. Nor does current practice decide this question, although it may suggest possible answers. The only way to judge is to see who is helped and who is hurt by recognizing owners of software, why, and how much. In other words, we should perform a cost-benefit analysis on behalf of society as a whole, taking account of individual freedom as well as production of material goods.
fr: Cette r&eacute;ponse ne peut pas &ecirc;tre d&eacute;cid&eacute;e par la loi actuelle &mdash;&nbsp;la loi devrait se conformer &agrave; la morale, pas l'inverse&nbsp;&mdash; ni par l'usage, bien qu'ils puissent sugg&eacute;rer des r&eacute;ponses possibles. La seule fa&ccedil;on d'en juger, est d'observer qui b&eacute;n&eacute;ficie et qui est l&eacute;s&eacute; en reconnaissant un propri&eacute;taire au logiciel, pourquoi et dans quelle mesure. En d'autres termes, nous devrions en &eacute;valuer le pour et le contre pour la soci&eacute;t&eacute; dans son ensemble, en prenant en compte aussi bien la libert&eacute; individuelle que la production de biens mat&eacute;riels.

source: In this essay, I will describe the effects of having owners, and show that the results are detrimental. My conclusion is that programmers have the duty to encourage others to share, redistribute, study, and improve the software we write: in other words, to write <a href="/philosophy/free-sw.html">&ldquo;free&rdquo; software</a>.<a href="#f1">(1)</a>
fr: Dans cet article, je d&eacute;crirai les effets d'avoir des propri&eacute;taires, et je montrerai que les r&eacute;sultats sont pr&eacute;judiciables. Ma conclusion est que les programmeurs ont le devoir d'encourager les autres &agrave; partager, distribuer, &eacute;tudier et am&eacute;liorer les logiciels que nous &eacute;crivons&nbsp;: autrement dit, d'&eacute;crire des <a href="/philosophy/free-sw.fr.html">logiciels libres</a>.<a href="#1">(1)</a>

source: How Owners Justify Their Power
fr: Comment les propri&eacute;taires justifient leur pouvoir

source: Those who benefit from the current system where programs are property offer two arguments in support of their claims to own programs: the emotional argument and the economic argument.
fr: Ceux-l&agrave;, qui b&eacute;n&eacute;ficient du syst&egrave;me actuel o&ugrave; les programmes sont propri&eacute;taires, proposent deux arguments en leur faveur&nbsp;: l'argument affectif et l'argument &eacute;conomique.

source: The emotional argument goes like this: &ldquo;I put my sweat, my heart, my soul into this program. It comes from <em>me</em>, it's <em>mine</em>!&rdquo;
fr: L'argument affectif ressemble &agrave; ceci&nbsp;: &laquo;&nbsp;j'ai mis ma sueur, mon cœur, mon &acirc;me dans ce programme. Il vient de <em>moi</em>, c'est <em>le mien</em>&nbsp;!&nbsp;&raquo;

source: This argument does not require serious refutation. The feeling of attachment is one that programmers can cultivate when it suits them; it is not inevitable. Consider, for example, how willingly the same programmers usually sign over all rights to a large corporation for a salary; the emotional attachment mysteriously vanishes. By contrast, consider the great artists and artisans of medieval times, who didn't even sign their names to their work. To them, the name of the artist was not important. What mattered was that the work was done&mdash;and the purpose it would serve. This view prevailed for hundreds of years.
fr: Cet argument ne n&eacute;cessite pas de r&eacute;futation s&eacute;rieuse. Les programmeurs peuvent cultiver ce sentiment de possession quand &ccedil;a les arrange; cen'est pas in&eacute;vitable. Consid&eacute;rez, par exemple, comment ces m&ecirc;mes programmeurs c&egrave;dent volontiers leurs droits &agrave; une grosse entreprise moyennant salaire&nbsp;; myst&eacute;rieusement, l'attachement affectif dispara&icirc;t. Faites le contraste avec ces grands artistes et artisans des temps m&eacute;di&eacute;vaux, qui ne signaient m&ecirc;me pas de leur nom leurs travaux. Pour eux, le nom de l'artiste n'avait pas d'importance. Ce qui importait, c'&eacute;tait que le travail, et son but aff&eacute;rent, aient &eacute;t&eacute; faits. Cette fa&ccedil;on de voir &agrave; pr&eacute;valu pendant des centaines d'ann&eacute;es.

source: The economic argument goes like this: &ldquo;I want to get rich (usually described inaccurately as &lsquo;making a living&rsquo;), and if you don't allow me to get rich by programming, then I won't program. Everyone else is like me, so nobody will ever program. And then you'll be stuck with no programs at all!&rdquo; This threat is usually veiled as friendly advice from the wise.
fr: L'argument &eacute;conomique est du style : &laquo;&nbsp;je veux devenir riche (ce qui en g&eacute;n&eacute;ral, se dit incorrectement &laquo;&nbsp;je veux gagner ma vie&nbsp;&raquo;), et si vous ne me permettez pas de devenir riche en programmant, eh bien je ne programmerai pas. Comme tout le monde me ressemble, personne n'&eacute;crirade programmes. Et vous serez coinc&eacute;s, car pas de programme du tout&nbsp;!&nbsp;&raquo; Cette menace est g&eacute;n&eacute;ralement d&eacute;guis&eacute;e en conseil amical venant de la bouche d'un sage.

source: I'll explain later why this threat is a bluff. First I want to address an implicit assumption that is more visible in another formulation of the argument.
fr: J'expliquerai plus tard pourquoi cette menace est du bluff. J'aimerais d'abord mettre le doigt sur une supposition implicite qui est plus &eacute;vidente dans une autre formulation de l'argument.

source: This formulation starts by comparing the social utility of a proprietary program with that of no program, and then concludes that proprietary software development is, on the whole, beneficial, and should be encouraged. The fallacy here is in comparing only two outcomes&mdash;proprietary software vs. no software&mdash;and assuming there are no other possibilities.
fr: Cette formulation part de la comparaison entre l'utilit&eacute; sociale d'un programme propri&eacute;taire et celle o&ugrave; il n'y a pas de programme, pour alors conclure que le d&eacute;veloppement de logiciels propri&eacute;taires est, globalement, b&eacute;n&eacute;fique et qu'il devrait &ecirc;tre encourag&eacute;. L'erreur, ici, vient de ne comparer que deux r&eacute;sultats &mdash;&nbsp;logiciel propri&eacute;taire contre pas de logiciel&nbsp;&mdash; et de supposer qu'il n'y a pas d'autres possibilit&eacute;s.

source: Given a system of software copyright, software development is usually linked with the existence of an owner who controls the software's use. As long as this linkage exists, we are often faced with the choice of proprietary software or none. However, this linkage is not inherent or inevitable; it is a consequence of the specific social/legal policy decision that we are questioning: the decision to have owners. To formulate the choice as between proprietary software vs. no software is begging the question.
fr: Dans un syst&egrave;me reconnaissant la propri&eacute;t&eacute; intellectuelle, le d&eacute;veloppement logiciel est habituellement li&eacute; &agrave; l'existence d'un propri&eacute;taire qui contr&ocirc;le l'utilisation du logiciel. Tant que ce lien existe, nous devons souvent faire face au choix d'un programme propri&eacute;taire ou pas de programme. Cependant, ce lien n'est pas inh&eacute;rent ou in&eacute;vitable; c'est une cons&eacute;quence d'une d&eacute;cision politique, l&eacute;gale et sociale sp&eacute;cifique, que nous contestons&nbsp;: la d&eacute;cision qu'il y ait des propri&eacute;taires. Formuler le choix entre logiciel propri&eacute;taire contre pas de logiciel, c'est faire une p&eacute;tition de principe.

source: The Argument against Having Owners
fr: L'argument contre le fait qu'il y ait des propri&eacute;taires

source: The question at hand is, &ldquo;Should development of software be linked with having owners to restrict the use of it?&rdquo;
fr: La question qu'il faut poser, c'est&nbsp;: &laquo;&nbsp;Est-ce que le d&eacute;veloppement de logiciels doit &ecirc;tre li&eacute; &agrave; un propri&eacute;taire qui en restreint l'usage&nbsp;?&nbsp;&raquo;

source: In order to decide this, we have to judge the effect on society of each of those two activities <em>independently</em>: the effect of developing the software (regardless of its terms of distribution), and the effect of restricting its use (assuming the software has been developed). If one of these activities is helpful and the other is harmful, we would be better off dropping the linkage and doing only the helpful one.
fr: Pour pouvoir en d&eacute;cider, il nous faut juger chaque effet des deux activit&eacute;s suivantes sur la soci&eacute;t&eacute;, <em>ind&eacute;pendamment</em>&nbsp;: l'effetdu d&eacute;veloppement de logiciels (ind&eacute;pendamment de ses termes de diffusion), et l'effet de la restriction de son emploi (supposant que le logiciel ait &eacute;t&eacute; d&eacute;velopp&eacute;). Si l'une de ces activit&eacute;s est utile et l'autre nocive, nous devrions les dissocier et nous lancer uniquement dans la premi&egrave;re.

source: To put it another way, if restricting the distribution of a program already developed is harmful to society overall, then an ethical software developer will reject the option of doing so.
fr: En d'autres termes, si restreindre la distribution d'un logiciel d&eacute;j&agrave; d&eacute;velopp&eacute; est pr&eacute;judiciable &agrave; la soci&eacute;t&eacute; dans son ensemble, alors un d&eacute;veloppeur moral rejettera cette activit&eacute;.

source: To determine the effect of restricting sharing, we need to compare the value to society of a restricted (i.e., proprietary) program with that of the same program, available to everyone. This means comparing two possible worlds.
fr: Pour d&eacute;terminer l'effet de la restriction du partage, nous avons besoin de comparer la valeur, pour la soci&eacute;t&eacute;, d'un programme restreint (par ex. propri&eacute;taire) avec le m&ecirc;me programme, mais disponible pour tout le monde. Ce qui signifie comparer deux mondes possibles.

source: This analysis also addresses the simple counterargument sometimes made that &ldquo;the benefit to the neighbor of giving him or her a copy of a program is cancelled by the harm done to the owner.&rdquo; This counterargument assumes that the harm and the benefit are equal in magnitude. The analysis involves comparing these magnitudes, and shows that the benefit is much greater.
fr: Cette analyse met aussi en exergue le simple contre-argument qui est parfois soulev&eacute; que &laquo;&nbsp;le b&eacute;n&eacute;fice pour le voisin en lui donnant unecopie d'un logiciel est annul&eacute; par le pr&eacute;judice fait au propri&eacute;taire&nbsp;&raquo;. Ce contre-argument suppose que les inconv&eacute;nients et b&eacute;n&eacute;fices sont &eacute;quivalents dans leur ampleur. L'analyse implique de comparer ces &eacute;tendues et elle montre que les b&eacute;n&eacute;fices sont bien plus importants.

source: To elucidate this argument, let's apply it in another area: road construction.
fr: Pour mettre en lumi&egrave;re cet argument, prenons un autre domaine d'application&nbsp;: la construction routi&egrave;re.

source: It would be possible to fund the construction of all roads with tolls. This would entail having toll booths at all street corners. Such a system would provide a great incentive to improve roads. It would also have the virtue of causing the users of any given road to pay for that road. However, a toll booth is an artificial obstruction to smooth driving&mdash;artificial, because it is not a consequence of how roads or cars work.
fr: Il serait possible de financer la contruction de toutes les routes avec des p&eacute;ages. Ce qui entra&icirc;nerait d'avoir des postes de p&eacute;age &agrave; tous les coins de rues. Un tel syst&egrave;me inciterait grandement &agrave; am&eacute;liorer l'&eacute;tat des routes. Il aurait aussi comme vertu de faire payer l'usager de la route concern&eacute;e. Cependant, le p&eacute;age n'est qu'une entrave artificielle &agrave; la fluidit&eacute; du trafic, artificielle dans le sens o&ugrave; elle n'est pas une cons&eacute;quence du fonctionnement des routes et des voitures.

source: Comparing free roads and toll roads by their usefulness, we find that (all else being equal) roads without toll booths are cheaper to construct, cheaper to run, safer, and more efficient to use.<a href="#f2">(2)</a> In a poor country, tolls may make the roads unavailable to many citizens. The roads without toll booths thus offer more benefit to society at less cost; they are preferable for society. Therefore, society should choose to fund roads in another way, not by means of toll booths. Use of roads, once built, should be free.
fr: Si on compare les routes avec ou sans p&eacute;age, nous voyons que (si tout se d&eacute;roule normalement) les routes sans p&eacute;age sont meilleur march&eacute; &agrave; construire et &agrave; maintenir, plus s&ucirc;res et plus efficaces &agrave; emprunter. <a href="#2">(2)</a> Dans les pays pauvres, les postes de p&eacute;age rendent les routes inaccessibles &agrave; bien des citoyens. Les routes sans p&eacute;age offrent ainsi plus de b&eacute;n&eacute;fices &agrave; moindre co&ucirc;t&nbsp;; elles sont pr&eacute;f&eacute;rables pour la soci&eacute;t&eacute;. C'est pourquoi la soci&eacute;t&eacute; devrait trouver d'autres moyens de financer les routes, sans recourir aux p&eacute;ages. L'usage des routes, une fois construites, devrait &ecirc;tre libre.

source: When the advocates of toll booths propose them as <em>merely</em> a way of raising funds, they distort the choice that is available. Toll booths do raise funds, but they do something else as well: in effect, they degrade the road. The toll road is not as good as the free road; giving us more or technically superior roads may not be an improvement if this means substituting toll roads for free roads.
fr: Quand les partisans des postes de p&eacute;age les proposent comme &eacute;tant <em>simplement</em> une fa&ccedil;on de lever des fonds, ils d&eacute;forment le choix offert. Les postes de p&eacute;age, effectivement, permettent de r&eacute;colter des fonds, mais elles occasionnent aussi autre chose&nbsp;: elles d&eacute;gradent les routes. La route &agrave; p&eacute;age n'est pas aussi bonne que celle sans p&eacute;age; nous donner plus de routes ou sup&eacute;rieures sur le plan technique, n'est peut-&ecirc;tre pas une am&eacute;lioration si cela signifie substituer aux routes gratuites des routes &agrave; p&eacute;age.

source: Of course, the construction of a free road does cost money, which the public must somehow pay. However, this does not imply the inevitability of toll booths. We who must in either case pay will get more value for our money by buying a free road.
fr: Bien entendu, construire des routes sans p&eacute;age co&ucirc;te de l'argent, que, d'une fa&ccedil;on ou d'une autre, le public doit payer. Mais ce n'est pas ce qui, in&eacute;vitablement, implique des postes de p&eacute;age. Nous, qui dans un cas comme dans l'autre, devrons payer, aurons tout int&eacute;r&ecirc;t pour notre porte-monnaie &agrave; acheter des routes sans p&eacute;age.

source: I am not saying that a toll road is worse than no road at all. That would be true if the toll were so great that hardly anyone used the road&mdash;but this is an unlikely policy for a toll collector. However, as long as the toll booths cause significant waste and inconvenience, it is better to raise the funds in a less obstructive fashion.
fr: Je ne suis pas en train de dire que les routes &agrave; p&eacute;age sont pires que pas de route du tout. Ce serait vrai si les p&eacute;ages &eacute;taient tels que presque personne n'emprunterait la route &mdash;&nbsp;mais ce n'est pas une politique plausible pour un collecteur de p&eacute;age. Cependant, tant que les postes de p&eacute;age causeront des gaspillages et des inconv&eacute;nients significatifs, il est plus avantageux de lever des fonds de fa&ccedil;on moins obstructive.

source: To apply the same argument to software development, I will now show that having &ldquo;toll booths&rdquo; for useful software programs costs society dearly: it makes the programs more expensive to construct, more expensive to distribute, and less satisfying and efficient to use. It will follow that program construction should be encouraged in some other way. Then I will go on to explain other methods of encouraging and (to the extent actually necessary) funding software development.
fr: Pour appliquer ce m&ecirc;me argument au d&eacute;veloppement logiciel, je vais maintenant montrer que d'avoir des &laquo;&nbsp;postes de p&eacute;age&nbsp;&raquo; sur des logiciels utiles, co&ucirc;te cher &agrave; la soci&eacute;t&eacute;&nbsp;: cela rend le programme plus co&ucirc;teux &agrave; &eacute;laborer, plus cher &agrave; distribuer et moins satisfaisant et efficace &agrave; utiliser. Je poursuivrai en disant que la construction du programme devra &ecirc;tre encourag&eacute;e autrement. Puis je m'attacherai &agrave; pr&eacute;senter d'autres m&eacute;thodes d'encouragement et de financement du d&eacute;veloppement logiciel (dans la mesure r&eacute;ellement n&eacute;cessaire).

source: The Harm Done by Obstructing Software
fr: Le tort fait en entravant le logiciel

source: Consider for a moment that a program has been developed, and any necessary payments for its development have been made; now society must choose either to make it proprietary or allow free sharing and use. Assume that the existence of the program and its availability is a desirable thing.<a href="#f3">(3)</a>
fr: Consid&eacute;rez un instant un programme qui a &eacute;t&eacute; d&eacute;velopp&eacute; et dont tous les financements n&eacute;cessaires &agrave; son &eacute;laboration ont &eacute;t&eacute; pris&nbsp;; maintenant, la soci&eacute;t&eacute; doit faire le choix entre le rendre propri&eacute;taire ou le rendre libre d'utilisation et de partage. Supposezqu'il est d&eacute;sir&eacute; que ce programme existe et soit disponible.<a href="#3">(3)</a>

source: Restrictions on the distribution and modification of the program cannot facilitate its use. They can only interfere. So the effect can only be negative. But how much? And what kind?
fr: Les restrictions sur la distribution et la modification du programme ne facilitent pas son utilisation. Elles ne peuvent qu'interf&eacute;rer. Ainsi, l'effet ne peut avoir qu'un impact n&eacute;gatif. Mais jusqu'&agrave; quel point&nbsp;? Et de quelle mani&egrave;re&nbsp;?

source: Three different levels of material harm come from such obstruction:
fr: On distingue trois niveaux de pr&eacute;judice mat&eacute;riel dans ce genre d'entrave&nbsp;:

source: Fewer people use the program.
fr: Moins de gens utilisent le programme.

source: None of the users can adapt or fix the program.
fr: Aucun des utilisateurs ne peut adapter ou corriger le programme.

source: Other developers cannot learn from the program, or base new work on it.
fr: Les autres d&eacute;veloppeurs ne peuvent rien apprendre du programme ou encore d&eacute;marrer un nouveau travail en se basant dessus.

source: Each level of material harm has a concomitant form of psychosocial harm. This refers to the effect that people's decisions have on their subsequent feelings, attitudes, and predispositions. These changes in people's ways of thinking will then have a further effect on their relationships with their fellow citizens, and can have material consequences.
fr: Chaque niveau de pr&eacute;judice mat&eacute;riel est concomitant &agrave; un pr&eacute;judice psycho-social. Cela se r&eacute;f&egrave;re aux effets qu'ont les d&eacute;cisions des gens sur leurs sentiments, attitudes et pr&eacute;dispositions futurs. Ces changements dans la fa&ccedil;on de penser des gens auront par la suite un effet sur leurs relations avec leurs concitoyens et peuvent avoir des cons&eacute;quences mat&eacute;rielles.

source: The three levels of material harm waste part of the value that the program could contribute, but they cannot reduce it to zero. If they waste nearly all the value of the program, then writing the program harms society by at most the effort that went into writing the program. Arguably a program that is profitable to sell must provide some net direct material benefit.
fr: Les trois niveaux de pr&eacute;judice mat&eacute;riel gaspillent une partie de la valeur que le programme pourrait offrir, mais ne peuvent la r&eacute;duire &agrave; z&eacute;ro. S'ils gaspillent la presque totalit&eacute; de la valeur du programme, alors l'&eacute;criture du programme cause du tort &agrave; la soci&eacute;t&eacute;, au plus &agrave; hauteur de l'effort qu'il a fallu fournir pour &eacute;crire ce programme. En effet, un programme dont la vente g&eacute;n&egrave;re des profits fournit s&ucirc;rement un net b&eacute;n&eacute;fice mat&eacute;riel direct.
