Repository: gitGNU/gnu_www-fr
Catalog: philosophy/social-inertia.*.po
Languages: fr

source: Overcoming Social Inertia - GNU Project - Free Software Foundation (FSF)
fr: Vaincre l'inertie sociale - GNU Project - Free Software Foundation (FSF)

source: Overcoming Social Inertia
fr: Vaincre l'inertie sociale

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: Almost two decades have passed since the combination of GNU and Linux first made it possible to use a PC in freedom. We have come a long way since then. Now you can even buy a laptop with GNU/Linux preinstalled from more than one hardware vendor&mdash;although the systems they ship are not entirely free software. So what holds us back from total success?
fr: Quinze ans ont pass&eacute; depuis que la combinaison de GNU et de Linux a permis pour la premi&egrave;re fois l'utilisation d'un PC en toute libert&eacute;. Pendant ce temps, nous avons parcouru beaucoup de chemin. Vous pouvez m&ecirc;me acheter un portable avec GNU/Linux pr&eacute;-install&eacute; chez plus d'un vendeur de mat&eacute;riel, bien que les syst&egrave;mes qu'ils fournissent ne soient pas totalement constitu&eacute;s de logiciels libres. Alors, qu'est-ce qui nous emp&ecirc;che d'obtenir un succ&egrave;s total&nbsp;?

source: A few years ago, Microsoft ads argued that Windows was cheaper to run than GNU/Linux. Their comparisons were debunked, but it is worth noting the deeper flaw in their argument, the implicit premise which cites a form of social inertia: &ldquo;Currently, more technical people know Windows than GNU/Linux.&rdquo; People who value their freedom would not give it up to save money, but many business executives believe ideologically that everything they possess, even their freedom, should be for sale.
fr: Il y a quelques ann&eacute;es, les publicit&eacute;s de Microsoft soutenaient que Windows revenait moins cher que GNU/Linux. Leurs comparaisons ont &eacute;t&eacute; d&eacute;mystifi&eacute;es, mais il est int&eacute;ressant de noter que le plus s&eacute;rieux de leurs arguments se r&eacute;duit &agrave; l'inertie sociale&nbsp;: &laquo;&nbsp;Actuellement, plus de personnes dans la technique connaissent Windows que GNU/Linux.&nbsp;&raquo; Les gens qui accordent de la valeur &agrave; leur libert&eacute; ne l'abandonneraient pas pour &eacute;conomiser de l'argent, mais beaucoup de dirigeants de soci&eacute;t&eacute;s croient id&eacute;ologiquement que tout ce qu'ils poss&egrave;dent, m&ecirc;me leur libert&eacute;, devrait &ecirc;tre &agrave; vendre.

source: Social inertia consists of people who have given in to social inertia. When you surrender to social inertia, you become part of the pressure it exerts on others; when you resist it, you reduce it. We conquer social inertia by identifying it, and resolving not to be part of it.
fr: L'inertie sociale se constitue de gens penchant vers l'inertie sociale. Quand vous vous laissez gagner par l'inertie sociale, vous l'alimentez&nbsp;; quand vous lui r&eacute;sistez, vous la r&eacute;duisez. Nous vainquons l'inertie en l'identifiant et en d&eacute;cidant de ne pas en faire partie.

source: Here a weakness holds our community back: most GNU/Linux users have never even heard the ideas of freedom that motivated the development of GNU, so they still judge matters based on short-term convenience rather than on their freedom. This makes them vulnerable to being led by the nose by social inertia, so that they become part of the inertia.
fr: Voici o&ugrave; la faiblesse philosophique de la plus grande partie de notre communaut&eacute; nous freine. La plupart des utilisateurs de GNU/Linux n'ont m&ecirc;me jamais entendu parlé des id&eacute;es de libert&eacute; qui ont motiv&eacute; le d&eacute;veloppement de GNU, ils jugent donc encore les choses selon des crit&egrave;res de commodit&eacute; &agrave; court terme plut&ocirc;t que de libert&eacute;. Cela les rend tout dispos&eacute;s &agrave; &ecirc;tre men&eacute;s par le bout du nez, via l'inertiesociale.

source: To build our community's strength to resist, we need to talk about free software and freedom&mdash;not merely about the practical benefits that open source supporters cite. As more people recognize what they need to do to overcome the inertia, we will make more progress.
fr: Pour changer cela, nous devons parler de logiciels libres et de libert&eacute; &mdash; pas seulement des b&eacute;n&eacute;fices pratiques comme ceux avanc&eacute;s par l'open source. Ainsi, nous pourrons &eacute;tayer la force de notre communaut&eacute; et nous parviendrons &agrave; vaincre l'inertie sociale.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
