Repository: gitGNU/gnu_www-fr
Catalog: philosophy/software-patents.*.po
Languages: fr

source: There was an Australian government study of the patent system in the 1980's. It concluded that aside from international pressure, there was no reason to have a patent system. It did no good for the public and recommended abolishing it if not for international pressure. One of the things they cited was that engineers don't try reading patents to learn anything, as it is too hard to understand them. They quoted one engineer saying &ldquo;I can't recognize my own inventions in patenteese&rdquo;.
fr: Il y a eu une &eacute;tude gouvernementale australienne sur le syst&egrave;me des brevets dans les ann&eacute;es 1980. Elle concluait que, en dehors de la pression internationale, il n'y avait aucune raison d'avoir un syst&egrave;me de brevets. Ce n'&eacute;tait pas bon pour le public et elle recommandait de l'abolir, s'il n'y avait la pression internationale. Une des choses qu'ils ont cit&eacute;es &eacute;tait que les ing&eacute;nieurs n'essayaient pas de lire les brevets pour apprendre des choses, car il est trop difficiles de les comprendre. Ils citaient aussi un ing&eacute;nieur qui disait&nbsp;: &laquo;&nbsp;Je ne reconnais pas mes propres inventions dans ces brevets&nbsp;&raquo;.

source: This is not just theoretical. Around 1990, a programmer named <a href="http://www.atarimagazines.com/startv2n3/hypercard.html">Paul Heckel</a> sued Apple claiming that Hypercard infringed a couple of his patents. When he first saw Hypercard, he didn't think it had anything to do with his patent, with his &ldquo;Inventions&rdquo;. It didn't look similar. When his lawyer told him that you could read the patents as covering part of Hypercard, he decided to attack Apple. When I had a speech about this at Stanford, he was in the audience, he said &ldquo;That's <a href="http://www.swiss.ai.mit.edu/6805/articles/int-prop/heckel-debunking.html"> not true</a>, I just didn't understand the extent of my protection!&rdquo; I said yes, that's what I said! So, in fact, you will have to spend a lot of time talking with lawyers to figure out what these patents prohibit you from doing. Ultimately they are going to say something like this: &ldquo;If you do something in here, you are sure to lose, If you do something here, there is a substantial chance of losing, and if you really want to be safe, stay out of this area. And, by the way, there is a sizable element of chance in the outcome of any law suit&rdquo;.
fr: Ce n'est pas seulement th&eacute;orique. Aux environs de 1990, un programmeur du nom de <a href="http://www.atarimagazines.com/startv2n3/hypercard.html">PaulHeckel</a> poursuivait Apple en revendiquant que Hypercard violait deux de ses brevets. Quand il vit Hypercard pour la premi&egrave;re fois, il ne pensait pas que cela avait quelque chose &agrave; voir avec ses brevets, avec ses &laquo;&nbsp;Inventions&nbsp;&raquo;. Cela n'y ressemblait pas. Quand son avocat luit dit que ses brevets pouvaient &ecirc;tre lus comme couvrant une partie de Hypercard, il d&eacute;cida d'attaquer Apple. Quand j'ai fait un discours &agrave; Stanford &agrave; ce sujet, il &eacute;tait pr&eacute;sent dans le public et il dit&nbsp;: &laquo;&nbsp;Ce n'est <a href="http://www.swiss.ai.mit.edu/6805/articles/int-prop/heckel-debunking.html">pas vrai</a>, je n'avais seulement pas compris l'&eacute;tendue de ma protection&nbsp;!&nbsp;&raquo;. J'ai dit&nbsp;: &laquo;&nbsp;Oui, c'est ce que j'ai dit&nbsp;!&nbsp;&raquo;. Donc, en fait, vous devrez passer beaucoup de temps &agrave; parler avec vos avocats pour trouver ce que ces brevets vous interdisent de faire. Finalement, ils diront quelque chose de ce genre&nbsp;: &laquo;&nbsp;Si vous faites ceci, vous &ecirc;tes s&ucirc;r de perdre; si vous faites cela, il y a de grandes chances que vous perdiez, et si vous voulez vraiment &ecirc;tre tranquille, restez en dehors de ce domaine. Et &agrave; propos, il y a une chance non n&eacute;gligeable qu'il en r&eacute;sulte un proc&egrave;s&nbsp;&raquo;.

source: Now, that you have a predictable terrain for doing business(!) what are you going to do? Well, there are three approaches that you might try. Any of which is applicable in some cases.
fr: Maintenant que vous savez o&ugrave; vous allez pour faire des affaires(!), qu'allez-vous faire&nbsp;? Bien, il y a trois approches que vous pourriez essayer. N'importe laquelle est applicable dans certain cas.

source: They are
fr: Ce sont

source: Avoiding the patent
fr: &Eacute;viter le brevet

source: Licensing the patent
fr: Obtenir une licence du brevet

source: Overturning the patent in court.
fr: Invalider le brevet au tribunal.

source: Let me describe these three approaches and what makes them workable or unworkable.
fr: Laissez-moi d&eacute;crire ces trois approches et ce qui les rend r&eacute;alisables ou irr&eacute;alisables.

source: 1) Avoiding the patent
fr: 1) &Eacute;viter le brevet

source: That means don't use the idea that the patent covers. This can be easy or hard, depending on what that idea is. In some cases, a feature is patented. Then you avoid the patent by not implementing that feature. Then it just matters how important is that feature. In some cases, you can live without it. A while ago, the users of the word processor XyWrite got a downgrade in the mail. The downgrade removed a feature which allowed you to pre-define abbreviations. That when you typed an abbreviation followed by a punctuation character, it would immediately replace itself with by some expansion. So that way you could define the abbreviation for some long phrase, type the abbreviation then the long phrase will be in your document. They wrote to me about this because they knew the <a href="/software/emacs/">Emacs</a> editor has a similar feature. In fact, it had it since the 70's. This was interesting because it showed me that I had at least one patentable idea in my life. I knew it was patentable because somebody else patented it afterward! Actually, they had tried these various approaches. First they tried negotiating with the patent holder, who turned out not to negotiate in good faith. Then they looked at whether they could have a chance of overturning the patent. What they decided to do was take out the feature. You can live without this feature. If the word processor lacks only this feature, maybe people will still use it. But as various features start getting hit, eventually you end up with a program people think is not very good and they are likely to reject it. That is a rather narrow patent on a very specific feature.
fr: Cela veut dire de ne pas utiliser l'id&eacute;e couverte par le brevet. Cela peut &ecirc;tre facile ou difficile, en fonction de ce sur quoi porte l'id&eacute;e. Dans certains cas, une fonctionnalit&eacute; est brevet&eacute;e. Alors, vous &eacute;vitez le brevet en ne mettant pas en &oelig;uvre cette fonctionnalit&eacute;. Ensuite, cela d&eacute;pend juste de l'importance de la fonctionnalit&eacute;. Dans certains cas, vous pouvez vivre sans. Il y a quelques temps, les utilisateurs du traitement de texte &laquo;&nbsp;XyWrite&nbsp;&raquo; ont re&ccedil;u une mise &agrave; jour r&eacute;gressive par courrier. Cette mise &agrave; jour supprimait une fonctionnalit&eacute; qui permettait de pr&eacute;d&eacute;finir des abr&eacute;viations. C'est-&agrave;-dire, quand vous tapez une abr&eacute;viation suivie d'un caract&egrave;re de ponctuation, elle est imm&eacute;diatement remplac&eacute;e par une extension. Ainsi, vous pouvez d&eacute;finir une abr&eacute;viation pour une phrase longue, taper l'abr&eacute;viation, et alors la phrase longue sera ins&eacute;r&eacute;e dans le document. Ils m'&eacute;crivirent &agrave; ce sujet car ils savaient que l'&eacute;diteur &laquo;&nbsp;<a href="/software/emacs/emacs.html">Emacs</a>&nbsp;&raquo; offrait une fonctionnalit&eacute; similaire. En fait, c'est le cas depuis les ann&eacute;es 70. C'&eacute;tait int&eacute;ressant car cela m'a montr&eacute; que j'avais eu au moins une id&eacute;e brevetable dans ma vie. Je savais que c'&eacute;tait brevetable parce que quelqu'un d'autre l'a brevet&eacute; apr&egrave;s&nbsp;! En fait, ils avaient essay&eacute; ces diff&eacute;rentes approches. D'abord ils ont essay&eacute; de n&eacute;gocier avec le d&eacute;tenteur du brevet, qui finit par ne pas n&eacute;gocier de bonne foi. Puis, ils cherch&egrave;rent s'ils pouvaient avoir une chance d'invalider le brevet. Ce qu'ils d&eacute;cid&egrave;rent de faire, c'est d'ôter la fonctionnalit&eacute;. Vous pouvez vivre sans cette fonctionnalit&eacute;. S'il ne manque que celle-l&agrave; au traitement de texte, les gens continueront peut-&ecirc;tre &agrave; l'utiliser. Mais au fur et &agrave; mesure que diverses fonctionnalit&eacute;s sont touch&eacute;es, vous arrivez finalement &agrave; un programme dont les gens pensent qu'il n'est pas tr&egrave;s bon et il est probable qu'ils le rejettent. C'est un brevet de plut&ocirc;t petite &eacute;tendue sur une fonctionnalit&eacute; tr&egrave;s sp&eacute;cifique.

source: What do you do with the <a href="http://www.delphion.com/details?pn=US04873662__">British Telecom patent</a> on traversing hyper links together with dial-up access? Traversing hyper links is absolutely essential to a major use of computers these days. Dial-up access is also essential. How do you do without this feature, which, by the way, isn't even one feature, it is really a combination of two just arbitrarily juxtaposed. It is rather like having a patent on a sofa and television in the same room.
fr: Que faites-vous du <a href="http://www.delphion.com/details?pn=US04873662__">brevet British Telecom</a> sur les liens hypertexte traversant ainsi que les acc&egrave;s par ligne commut&eacute;e&nbsp;? Les liens hypertexte sont absolument essentiels &agrave; la plupart des utilisations d'un ordinateur de nos jours. Et les acc&egrave;s par ligne commut&eacute;e sont aussi essentielles. Comment feriez-vous sans cette fonctionnalit&eacute;, qui, soit dit en passant, n'est m&ecirc;me pas une fonctionnalit&eacute;, mais en fait la combinaison de deux d'entre elles seulement juxtapos&eacute;es arbitrairement. C'est un peu comme avoir un canap&eacute; et une t&eacute;l&eacute;vision dans la m&ecirc;me pi&egrave;ce.

source: Sometimes the idea that's patented will be so broad and basic that it basically rules out an entire field. For instance, the idea of Public Key Encryption which was patented in the US. The patent expired in 1997. Until then, it largely blocked the use of Public Key Encryption in the US. A number of programs that people started to develop got crushed. They were never really available because the patent holders threatened them. Then, one program got away. The program <a href="http://www.pgpi.org/">PGP</a>, which initially was released as free software. Apparently, the patent holders by the time they got around to attacking, realized they might get too much bad publicity. So they imposed restrictions making it for non-commercial use only, which meant it couldn't catch on too much. So they greatly limited the use of Public Key Encryption for a decade or more. There was no way around that patent. There was nothing else you could do like that.
fr: Quelquefois, l'id&eacute;e qui est brevet&eacute;e sera tellement large et basique qu'elle r&eacute;gira un domaine tout entier. Par exemple, l'id&eacute;e de chiffrement &agrave; cl&eacute; publique qui a &eacute;t&eacute; brevet&eacute;e aux &Eacute;tats-Unis. Le brevet a expir&eacute; en 1997. Jusque l&agrave;, il bloquait grandement l'utilisation du chiffrement &agrave; cl&eacute; publique aux &Eacute;tats-Unis. De nombreux programmes que les gens ont commenc&eacute; &agrave; d&eacute;velopper furent an&eacute;antis. Ils ne furent jamais vraiment disponibles car les d&eacute;tenteurs du brevet les mena&ccedil;aient. Puis, un programme partit. Le programme <a href="http://www.pgpi.org/">PGP</a>, qui &eacute;tait initialement publi&eacute; comme logiciel libre. Apparemment, les d&eacute;tenteurs du brevet, comme ils se pr&eacute;paraient &agrave; attaquer comme ils l'avaient pr&eacute;vu, r&eacute;alis&egrave;rent qu'ils pourraient avoir une trop mauvaise publicit&eacute;. Ils impos&egrave;rent alors des restrictions pour qu'il soit &agrave; usage non-commercial seulement, ce qui signifiait qu'il ne pourrait pas avoir trop de succ&egrave;s. Ils limit&egrave;rent ainsi grandement l'utilisation du chiffrement &agrave; cl&eacute; publique pour une d&eacute;cennie ou plus. Il n'y avait pas moyen de contourner ce brevet. Il n'y avait rien d'autre que vous pouviez faire comme cela.

source: Sometimes a specific algorithm gets patented. For instance, there is a patent on an optimized version of the Fast Fourier Transform. It runs about twice as fast. You can avoid that by using the ordinary FFT in your program. That part of your program will take twice as long. Maybe that doesn't really matter, maybe that is a small part of the program's running time. Maybe if it is twice as slow, you won't really notice. Or maybe that means your program won't run at all because it will take twice real time to do its job. The effects vary.
fr: Quelquefois, un algorithme sp&eacute;cifique est brevet&eacute;. Par exemple, il y a un brevet sur une version optimis&eacute;e de la transformation rapide de Fourier. Il s'ex&eacute;cute environ deux fois plus vite. Vous pouvez contourner cela en utilisant la transformation rapide de Fourier ordinaire dans votre programme. Cette partie de votre programme prendra deux fois plus de temps. Peut-&ecirc;tre que cela n'a pas vraiment d'importance, peut-&ecirc;tre est-ce une petite partie du temps d'ex&eacute;cution de votre programme. Peut-&ecirc;tre que s'il est deux fois plus lent, vous ne le remarquerez m&ecirc;me pas. Ou peut-&ecirc;tre cela signifie que votre programme ne fonctionnera pas car il prendra deux fois le temps r&eacute;el pour faire son travail. Les effets varient.

source: In some cases, you can find a better algorithm. This may or may not do you any good. Because we couldn't use compress, in the GNU project we started looking for some other algorithm for data compression. Somebody wrote to us saying he had one. He had written a program and he decided to contribute it to us. We were going to release it. Just by chance, I happened to see a copy of the New York Times. It happened to have the weekly patent column in it. I didn't see a copy of the Times more than once every few months. So I looked at it and it said that somebody had got a patent for &ldquo;Inventing a new method of compressing data&rdquo;. I figured I better take a look at this patent. I got a copy and it turned out to cover the program that we were just a week away from releasing. That program died before it was born. Later on we did find another algorithm which was un-patented. That became the program <a href="/software/gzip/"> gzip</a>, which is now effectively the de-facto standard for data compression. As an algorithm to use in a program for data compression, it was fine. Anyone who wanted to do data compression could use gzip instead of compress. But the same patented LZW compression algorithm was also used in image formats such as the <a href="/philosophy/gif.html">GIF</a> format. But there because the job people wanted to do was not to simply compress data but to make an image that people could display with their software, it turned out extremely hard to switch over to a different algorithm. We have not been able to do it in 10 years! Yes, people use the gzip algorithm to define <a href="http://www.w3.org/Graphics/PNG/">another image format</a>, once people started getting threatened with law suits for using GIF files. When we started saying to people stop using GIF files, switch over to this, people said &ldquo;We can't switch. The browsers don't support the new format yet&rdquo;. The browser developers said &ldquo;We're not in a hurry about this. After all, nobody is using this file format&rdquo;.
fr: Dans certains cas, vous pouvez trouver un meilleur algorithme. Cela peut ou non &ecirc;tre b&eacute;n&eacute;fique pour vous. Parce que nous ne pouvions pas utiliser &laquo;&nbsp;compress&nbsp;&raquo; dans le projet GNU nous avons commenc&eacute; &agrave; chercher d'autres algorithmes pour la compression de donn&eacute;es. Quelqu'un nous &eacute;crivit en disant qu'il en avait un. Il avait &eacute;crit un programme et d&eacute;cid&eacute; de contribuer pour nous. Nous allions publier le programme. Par chance, je suis tomb&eacute; sur un exemplaire du New York Times dans lequel il y avait la colonne hebdomadaire sur les brevets. Je n'avais pas vu d'exemplaires du Times plus d'une fois en quelques mois. Alors je l'ai regard&eacute; et cela disait que quelqu'un avait obtenu un brevet pour l'&laquo;&nbsp;invention d'une nouvelle m&eacute;thode de compression de donn&eacute;es&nbsp;&raquo;. Je me suis dit qu'il valait mieux que je jette un &oelig;il &agrave; ce brevet. J'ai obtenu une copie et il s'av&eacute;ra qu'il couvrait le programme que nous &eacute;tions juste &agrave; une semaine de publier. Ce programme mourut avant de na&icirc;tre. Plus tard, nous trouvions un autre algorithme qui n'&eacute;tait pas brevet&eacute;. Cela devint le programme <a href="/software/gzip/gzip.html">gzip</a>, qui est &agrave; pr&eacute;sent effectivement le standard de facto pour la compression de donn&eacute;es. En tant qu'algorithme &agrave; utiliser dans un programme pour la compression de donn&eacute;es, il &eacute;tait bien. Quiconque voulait faire de la compression de donn&eacute;es pouvait utiliser &laquo;gzip&raquo; plut&ocirc;t que &laquo;compress&raquo;. Mais ce m&ecirc;me algorithme de compression brevet&eacute; LZW &eacute;tait aussi utilis&eacute; dans les formats d'image tel que le format <a href="/philosophy/gif.fr.html">GIF</a>. Mais l&agrave;, parce que le travail que les gens voulaient voir effectu&eacute; n'&eacute;tait pas simplement de compresser des donn&eacute;es, mais de faire des images que les gens pourraient afficher dans leurs logiciels, il se r&eacute;v&eacute;la extr&ecirc;mement difficile de passer &agrave; un algorithme diff&eacute;rent. Nous n'avons pas &eacute;t&eacute; capables de la faire en 10 ans&nbsp;! Oui, les gens ont utilis&eacute; l'algorithme gzip pour d&eacute;finir un <a href="http://www.w3.org/Graphics/PNG/">autre format d'image</a>, quand ils ont commenc&eacute; &agrave; &ecirc;tre menac&eacute;s de poursuites judiciaires pour l'utilisation de fichiers GIF. Quand nous avons commenc&eacute; &agrave; dire aux gens d'arr&ecirc;ter d'utiliser des fichiers GIF, de passer aux fichiers PNG, les gens dirent&nbsp; &laquo;&nbsp;Nous ne pouvons pas changer. Les navigateurs ne g&egrave;rent pas encore le nouveau format&nbsp;&raquo;. Les d&eacute;veloppeurs de navigateurs dirent&nbsp;: &laquo;&nbsp;Il n'y a pas d'urgence l&agrave;-dessus. Apr&egrave;s tout, personne n'utilise ce format de fichier&nbsp;&raquo;.

source: In effect, society had so much inertia in the use of the GIF format, we have not been able to get people to switch. Essentially, the community's use of the GIF format is still pushing sites into using GIF format with the result that they are vulnerable to these threats.
fr: En effet, il y avait tant d'inertie dans la soci&eacute;t&eacute; dans l'utilisation du format GIF, que nous n'avons pas &eacute;t&eacute; capables d'obtenir des gens qu'ils changent. Essentiellement, l'utilisation dans la communaut&eacute; du format GIF pousse encore les sites &agrave; utiliser ce format avec comme r&eacute;sultat qu'ils sont vuln&eacute;rables &agrave; ces menaces de proc&egrave;s.

source: In fact, the situation is even more bizarre. There are in fact two patents covering the LZW compression algorithm. The patent office couldn't even tell that they were issuing two patents on the same thing. They couldn't keep track. There is a reason for this. It takes a while of study of these two patents to see that they really cover the same thing.
fr: En fait, la situation est encore plus bizarre. Il y a en fait deux brevets couvrant l'algorithme de compression LZW. L'office des brevets ne pouvait m&ecirc;me pas dire qu'il avait accord&eacute; deux brevets sur la m&ecirc;me chose. Il n'en retrouvait pas trace. Il y a une raison &agrave; cela. Cela prend du temps d'&eacute;tudier ces deux brevets pour voir s'ils couvrent r&eacute;ellement la m&ecirc;me chose.

source: If they were patents on some chemical process, it would be much easier. You could see what substances were being used, what the inputs were, what the outputs were, which physical actions are being taken. No matter how they are described, you'd see what they were and then you would see that they are similar.
fr: S'il s'agissait de brevets sur un processus chimique, cela serait beaucoup plus facile. Vous pourriez voir quelles substances ont &eacute;t&eacute; utilis&eacute;es, quels &eacute;taient les apports, quels &eacute;taient les rendements, quelles actions physiques sont entr&eacute;es en jeu. Peu importe la fa&ccedil;on dont ils sont d&eacute;crits, vous verriez ce qu'ils sont et vous verriez s'ils sont similaires.

source: If something is purely mathematical, there are many ways of describing it, which are a lot more different. They are not superficially similar. You have to really understand them to see they are talking about the same thing. The patent office doesn't have time. The US Patent Office as of a few years ago, was spending on average 17 hours per patent. This is not long enough to think carefully about them, so, of course they make mistakes like that. In fact, I told you about the program that died before it was born. That algorithm also had two patents issued for it in the US. Apparently, it is not that unusual.
fr: Si une chose est purement math&eacute;matique, il y a de nombreuses fa&ccedil;ons de la d&eacute;crire, qui sont bien plus diff&eacute;rentes. Elles ne sont pas similaires de mani&egrave;re superficielle. Vous devez r&eacute;ellement les comprendre pour voir si cela parle de la m&ecirc;me chose. L'office des brevets n'a pas le temps de le faire. L'Office am&eacute;rician des brevets et des marques (USPTO) depuis quelques ann&eacute;es, a pass&eacute; en moyenne 17 heures par brevet. Ce n'est pas assez pour y r&eacute;fl&eacute;chir avec attention, donc, bien s&ucirc;r, il commet des erreurs comme celle-l&agrave;. En fait, je vous parlais du programme mort avant de na&icirc;tre. Cet algorithme avait &eacute;galement deux brevets accord&eacute;s aux &Eacute;tats-Unis. Apparemment, ce n'est pas si inhabituel.

source: Avoiding the patents may be easy, may be impossible. It may be easy but it makes your program useless. It varies depending on the situation.
fr: &Eacute;viter les brevets peut &ecirc;tre facile ou impossible. Cela peut &ecirc;tre facile mais cela rend votre programme inutile. C'est fonction de la situation.
