Repository: gitGNU/gnu_www-fr
Catalog: philosophy/software-libre-commercial-viability.*.po
Languages: fr

source: Software Libre and Commercial Viability
fr: Logiciel libre et viabilit&eacute; commerciale

source: (Nov 12th 1998, published in February 1999)
fr: (12 nov. 1998, publi&eacute; en f&eacute;vrier 1999)

source: by <strong>Alessandro Rubini</strong>
fr: par <strong>Alessandro Rubini</strong>

source: Fortunately, Linus' project of world domination is going to come true fairly soon. The trend toward this goal can be verified by checking how the press is behaving towards GNU/Linux solutions, looking at how several educational entities are going to introduce Free Software in the schools and verifying its usual technical excellence.
fr: Heureusement, le projet de Linus visant la domination mondiale va devenir vrai dans un proche avenir. La tendance en faveur de cet objectif peut &ecirc;tre v&eacute;rifi&eacute;e en regardant comment la presse se comporte envers les solutions GNU/Linux, en observant comment plusieurs entit&eacute;s du monde &eacute;ducatif introduisent le logiciel libre dans les &eacute;coles, et en v&eacute;rifiant son excellence technique habituelle.

source: Today in 1998 (yes, it is still 1998 as I write), the most important job remaining, in my opinion, is propagating the social and commercial implications of Free Software. While I greatly appreciated Russell Nelson's article &ldquo;Open Source Software Model&rdquo; in the July issue of <i>LJ</i>, I feel the need to expand on the points he briefly touched.
fr: Aujourd'hui, en 1998 (oui, c'est encore l'ann&eacute;e 1998 &agrave; l'heure o&ugrave; j'&eacute;cris ces lignes), le boulot restant le plus important, &agrave; mon avis, est de diss&eacute;miner les implications sociales et commerciales du logiciel libre. Tout en appr&eacute;ciant grandement l'article de Russel Nelson &laquo;&nbsp;Open Source Software Model&nbsp;&raquo; (Mod&egrave;le du logiciel open source) dans l'&eacute;dition du <cite>LJ</cite> (Linux Journal) de juillet, je ressens le besoin d'approfondir les points qu'il a bri&egrave;vement abord&eacute;s.

source: Please note that I'm not an expert in economics or politics. I'm just a build-it-yourself kind of technical guy whose discussion is based on his own experience in the battle for survival, in the hopes of helping someone else adapt to new environmental conditions. Some of these ideas have already been discussed with friends or on the Free Software Business mailing list (<a href="mailto:fsb-subscribe@crynwr.com">&lt;fsb-subscribe@crynwr.com&gt;</a>), which I joined after reading Russell's article.
fr: Veuillez noter que je ne suis un expert ni en &eacute;conomie ni en politique. Je ne suis qu'un technicien du genre &laquo;&nbsp;fais-le toi-m&ecirc;me&nbsp;&raquo; dont les arguments sont fond&eacute;s sur sa propre exp&eacute;rience dans son combat pour la survie, dans l'espoir d'aider quelqu'un d'autre &agrave; s'adapter aux nouvelles conditions de son environnement. J'ai discut&eacute; de certaines de ces id&eacute;es avec des amis ou sur la liste de diffusion des &laquo;&nbsp;Free Software Business&nbsp;&raquo; (fsb-subscribe&#64;crynwr.com), &agrave; laquelle je me suis inscrit apr&egrave;s avoir lu l'article de Russell.

source: Viability for Individual Consultants
fr: Viabilit&eacute; pour les consultants individuels

source: The best feature of any computer system is flexibility &mdash; allowing users to tailor its behaviour to their own needs. This flexibility is often completely unknown to the general computer user, because proprietary software solutions tend to hide functionality behind a rigid external interface which denies any divergence from the expected behaviour&mdash;a <i>user's</i> behaviour.
fr: La meilleure caract&eacute;ristique de tout syst&egrave;me informatique est sa flexibilit&eacute;, qui permet aux utilisateurs de modifier son comportement selon ses propres besoins. Cette flexibilit&eacute; est souvent compl&egrave;tement inconnue de l'utilisateur lambda d'un ordinateur, parce que les solutions bas&eacute;es sur des logiciels propri&eacute;taires ont tendance &agrave; cacher les fonctionnalit&eacute;s derri&egrave;re une interface externe rigide, qui emp&ecirc;che toute d&eacute;viation du comportement attendu&nbsp;: un comportement d'<i>utilisateur</i>.

source: When adopting Free Software, users are able to discover the real power of computer systems. Today I talked with a commercial consultant who never thought that programs could be adapted to one's needs. He confessed his company has always acted the other way around&mdash;they adapted their needs to the software they use. Most users are victims of their software and don't even realize it.
fr: En adoptant le logiciel libre, les utilisateurs deviennent capables de d&eacute;couvrir la v&eacute;ritable puissance des syst&egrave;mes informatiques. Aujourd'hui, j'ai parl&eacute; avec un consultant commercial qui n'avait jamais pens&eacute; que des logiciels pouvaient &ecirc;tre adapt&eacute;s aux besoins de chacun. Il a confi&eacute; que sa soci&eacute;t&eacute; a toujours agi de la mani&egrave;re oppos&eacute;e&nbsp;: ils ont adapt&eacute; leurs besoins aux logiciels qu'ils utilisaient. La plupart des utilisateurs sont victimes de leurs logiciels, et ils ne le r&eacute;alisent m&ecirc;me pas.

source: Educating the user base about the extendibility of software will open new markets to independent consultants, creating new employment opportunities. Every user has different needs and solving these needs often means calling for technical support from people who tailor or enhance the relevant software. While this is not even imaginable with proprietary programs, source availability allows any problem that might arise to be quickly solved and new features to be easily added. While you may think this would quickly lead to a <i>perfect</i> software package, individual needs are so diverse and specialized that a package can't satisfy everyone.
fr: Informer la base des utilisateurs &agrave; propos du caract&egrave;re extensible des logiciels va ouvrir aux consultants ind&eacute;pendants de nouveaux march&eacute;s, en cr&eacute;ant de nouvelles opportunit&eacute;s d'emploi. Chaque utilisateur a diff&eacute;rents besoins, et trouver une solution &agrave; ces besoins est souvent synonyme d'un appel pass&eacute; via le service technique aux gens qui adaptent ou am&eacute;liorent le logiciel en question. Alors que ceci n'est m&ecirc;me pas imaginable avec les logiciels propri&eacute;taires, disposer du code source permet &agrave; tout probl&egrave;me qui pourrait se poser d'&ecirc;tre r&eacute;solu rapidement, et de pouvoir ajouter facilement de nouvelles fonctionnalit&eacute;s. Vous pourriez imaginer que ceci conduirait rapidement &agrave; un paquetage logiciel <i>parfait</i>&nbsp;: les besoins individuels sont si divers etsp&eacute;cialis&eacute;s qu'aucun paquetage ne saurait satisfaire tout le monde.

source: For example, I and others wrote a program for a local physiology center to analyze data for a typical kind of experiment. During two years of use, the physicians found so many ways to enhance the program that it is now reported as better than the commercial solutions. The total of all fees they paid during these years reveals the program to be more expensive in the end than some of the commercial alternatives. This fact is not relevant to my clients, as they have exactly what they want and they know they can have more should the need arise. The program is obviously Free Software and other centers expressed interest in getting a copy.
fr: Par exemple, avec d'autres, j'ai &eacute;crit un programme qui analyse les donn&eacute;es d'un certain type d'exp&eacute;riences, pour un centre local de physiologie. Durant deux ans d'utilisation, les m&eacute;decins ont trouv&eacute; tellement de fa&ccedil;ons d'am&eacute;liorer ce programme qu'il est d&eacute;sormais reconnu comme meilleur que les solutions commerciales. Le montant total de toutes les d&eacute;penses qu'ils ont effectu&eacute;es pendant ces ann&eacute;es r&eacute;v&egrave;le que le programme a finalement co&ucirc;t&eacute; plus cher que certaines alternatives commerciales. Ce fait n'est pas pertinent aux yeux de mes clients, puisqu'ils ont exactement ce qu'ils veulent et qu'ils savent qu'ils peuvent obtenir davantage si le besoin s'en faisait ressentir. Ce programme est bien entendu du logiciel libre, et d'autres centres ont exprim&eacute; leur int&eacute;r&ecirc;t pour en obtenir une copie.

source: As more and more people are choosing Free Software to address their needs, I'm sure some software companies will try to demonize GNU/Linux and both the Free Software and the Open Source movements because they are losing their own market share. Such companies will probably try to demonstrate that IT employment is decreasing and that humankind is being damaged by the general adoption of Free Software. This whole argument is bogus; computers exist to be programmed, and the more you allow programming them, the more you build employment opportunities. If you count the number of people who offer Free Software consulting, you will greatly exceed any shrinkage of proprietary companies. Sticking to my previous example, the physiology lab hired my company to write the program, and other centers interested in the product are willing to hire a local consultant for installing, maintaining and enhancing our package. Did I say &ldquo;enhance&rdquo;? Isn't the program working? Yes, the program is working well, but there <i>is</i> room for enhancement of the product. The local lab decided to stop development &ldquo;because we must run our experiment rather than invent new software features&rdquo;. As anyone knows, every program has a bug and a missing feature, and this is where we build our credibility: bugs <i>can</i> be fixed and features <i>can</i> be implemented. As I suggested before, the more you make things programmable, the more they will be programmed.
fr: Comme de plus en plus de gens choisissent le logiciel libre pour combler leurs besoins, je suis certain que certaines soci&eacute;t&eacute;s de logiciels vont tenter de sataniserGNU/Linux, le logiciel libre et les mouvements open source, parce qu'ils perdent leur propre part de march&eacute;. De telles soci&eacute;t&eacute;s vont probablement tenter de d&eacute;montrer que l'emploi en informatique diminue et que l'humanit&eacute; est affect&eacute;e par l'adoption globale du logiciel libre. Tout cet argument est erron&eacute;. Les ordinateurs sont faits pour &ecirc;tre programm&eacute;s, et plus vous permettez de les programmer, plus vous cr&eacute;ez des opportunit&eacute;s d'emploi. Si vous comptez le nombre de gens qui offrent de la consultance en logiciel libre, vous allez d&eacute;passer largement la diminution dans les soci&eacute;t&eacute;s de logicielspropri&eacute;taires. En reprenant mon exemple pr&eacute;c&eacute;dent, le laboratoire de physiologie a embauch&eacute; ma soci&eacute;t&eacute; pour &eacute;crire leprogramme, et d'autres centres int&eacute;ress&eacute;s par le produit veulent employer un consultant local pour l'installation, la maintenance et l'am&eacute;lioration de notre package. J'ai dit &laquo;&nbsp;am&eacute;liorer&nbsp;?&nbsp;&raquo; Le programme ne fonctionne-t-il pas&nbsp;? Oui, il fonctionne bien, mais <i>il existe</i> de la place pouram&eacute;liorer le produit. Le laboratoire local a d&eacute;cid&eacute; d'arr&ecirc;ter le d&eacute;veloppement &laquo;&nbsp;parce que nous devons r&eacute;aliser notre exp&eacute;rience plut&ocirc;t que d'inventer de nouvelles fonctionnalit&eacute;s logicielles&nbsp;&raquo;. Et comme chacun sait, tout programme comporte des bogues et des fonctionnalit&eacute;s qui manquent. Et c'est ici que nous construisons notre cr&eacute;dibilit&eacute;&nbsp;: les bogues <i>peuvent</i> &ecirc;tre corrig&eacute;s et les fonctionnalit&eacute;s <i>peuvent</i> &ecirc;tre mises en œuvre. Comme je le sugg&eacute;rais pr&eacute;c&eacute;demment, plus vous rendez les choses programmables, plus elles seront programm&eacute;es.

source: Why should there be more employment opportunities in IT than there are now? First of all, because Free Software users have more requests for new features than users of proprietary products do, as explained above. Next, because anyone can build her own professionalism without paying tributes to access the sources of information. I built my own expertise by studying source code and trying things out on my own low-end PC. Now I am confident I can solve any problem my clients might have, and my clients know I can (provided I am given enough time to deal with the problem).
fr: Pourquoi devrait-il y avoir plus d'opportunit&eacute;s d'emploi en informatique (IT) qu'il en existe &agrave; l'heure actuelle&nbsp;? Premi&egrave;rement, parce que les utilisateurs de logiciel libre demandent plus de nouvelles fonctionnalit&eacute;s que les utilisateurs de produits propri&eacute;taires, comme expliqu&eacute; ci-dessus. Ensuite, parce que chacun peut b&acirc;tir sa propre exp&eacute;rience professionnelle sans devoir payer de tribut pour pouvoir acc&eacute;der aux sources d'information. J'ai b&acirc;ti ma propre expertise en &eacute;tudiant du code source et en essayant des choses sur mon propre ordinateur bas de gamme. Maintenant, je suis suffisamment confiant pour &ecirc;tre capable de r&eacute;soudre tous les probl&egrave;mes que pourraient rencontrer mes clients, et mes clients savent que j'en suis capable (&agrave; condition que j'aie suffisamment de temps pour attaquer le probl&egrave;me).

source: Another critical point in addition to source availability is standardization on file formats, a field where proprietary products are revealing their worst features. Let's imagine an environment where every file format in the system was known: you could, for example, create indexes from any document that is produced, thus easing later retrieval. This can be accomplished off-line without any load on non-technical personnel. Asynchronous reuse of data is &ldquo;rocket science&rdquo; for many users, because they are accustomed to programs that use proprietary file formats (and operating systems with no real multi-tasking or &ldquo;cron&rdquo; capabilities). As soon as free standards are adopted, users begin asking for customizations and are willing to pay for anything that will increase their productivity. Moreover, free standards guarantee that customers are not making the wrong bet, as they won't ever be stuck with unusable data if the software market changes.
fr: Un autre point tr&egrave;s important en plus de l'accessibilit&eacute; au code source est la standardisation des formats de fichier &mdash;&nbsp;un domaine o&ugrave; les produits propri&eacute;taires ont montr&eacute; leurs pires caract&eacute;ristiques. Imaginons un environnement o&ugrave; tous les formats de fichiers du syst&egrave;me sont connus. Vous pourriez, par exemple, cr&eacute;er des index de tous les documents produits, facilitant donc une r&eacute;cup&eacute;ration ult&eacute;rieure. Ceci peut &ecirc;tre accompli sans &ecirc;tre en ligne et sans charge suppl&eacute;mentaire par du personnel non technique. La r&eacute;utilisation asynchrone de donn&eacute;es est une discipline en plein essor pour de nombreux utilisateurs, parce qu'ils sont accoutum&eacute;s aux programmes qui utilisent des formats de fichiers propri&eacute;taires (et auxsyst&egrave;mes d'exploitation sans v&eacute;ritable syst&egrave;me multit&acirc;che ou possibilit&eacute; de faire tourner des travaux &laquo;&nbsp;cron&nbsp;&raquo;). D&egrave;s que des standards libres sont adopt&eacute;s, les utilisateurs commencent &agrave; demander des personnalisations et veulent bien payer pour tout ce qui augmente leur productivit&eacute;. De plus, les standards libres garantissent que les clients ne font pas un mauvais pari, puisqu'ils ne seront jamais coinc&eacute;s avec des donn&eacute;es inutilisables en cas de changement dans le march&eacute; du logiciel.

source: While the conventional model of software distribution concentrates all knowledge in a few companies (or one of them), open standards leverage technical knowledge to anyone willing to learn. Whereas a proprietary product can be supported only by a limited number of qualified consultants (whose number and quality is centrally managed), the number of consultants supporting a Free Software solution is virtually unlimited and the offer can quickly adapt to the request.
fr: Tandis que le mod&egrave;le conventionnel de distribution de logiciel concentre toute la connaissance dans quelques soci&eacute;t&eacute;s (ou m&ecirc;me une seule d'entre elles), les standards ouverts fournissent de l'information technique &agrave; qui veut bien apprendre. L&agrave; o&ugrave; les produits propri&eacute;taires n'ont l'expertise que d'un nombre limit&eacute; de consultants qualifi&eacute;s (dont le nombre et la qualit&eacute; sont g&eacute;r&eacute;s de mani&egrave;re centralis&eacute;e), le nombre de consultant qui ont l'expertise d'une solution &agrave; base de logiciel libre est virtuellement illimit&eacute;&nbsp;; et l'offre peut s'adapter rapidement &agrave; la demande.

source: In a world where computers are just tools to accomplish some other goals, easy customization and quick maintenance are basic requirements of power users. In my opinion, Free Software will quickly gain the trust it needs to be a real market phenomenon. As soon as you start to trust some Free Software products, you learn that they deserve more. GNU/Linux fans must be ready to offer support in order to fulfill the upcoming need for consultants.
fr: Dans un monde o&ugrave; les ordinateurs ne sont que de simples outils pour accomplir d'autres t&acirc;ches, une personnalisation simple et une maintenance rapide sont des exigences de base des utilisateurs chevronn&eacute;s (power users). &Agrave; mon avis, Le logiciel libre va bient&ocirc;t atteindre le degr&eacute; de confiance n&eacute;cessaire pour devenir un v&eacute;ritable ph&eacute;nom&egrave;ne de march&eacute;. D&egrave;s que vous commencez &agrave; faire confiance &agrave; certains produits &agrave; base de logiciel libre, vous apprenez qu'ils m&eacute;ritent plus encore. Les fans de GNU/Linux doivent &ecirc;tre pr&ecirc;ts &agrave; offrir du support, de mani&egrave;re &agrave; combler le futur besoin de consultants.

source: Viability for Support Companies
fr: Viabilit&eacute; pour les soci&eacute;t&eacute;s de support

source: Obviously, independent consultants don't cover all the needs of computer users. Several activities can't be handled by individuals. Red Hat and S.u.S.E. are demonstrating that creating and maintaining a distribution can be a good source of revenue even when the product is freely redistributable. Debian-based efforts are on the way, although less advanced&mdash;mainly because both Red Hat and S.u.S.E. bundled proprietary products with libre packages in order to survive while the market share was low, while Debian has always been completely detached from proprietary products, and still is.
fr: &Eacute;videmment, les consultants ind&eacute;pendants ne couvrent pas tous les besoins de tous les utilisateurs d'ordinateurs. Plusieurs activit&eacute;s ne peuvent &ecirc;tre prises en charge par des individus. Red Hat et S.u.S.E. prouvent que cr&eacute;er et maintenir une distribution peut &ecirc;tre une bonne source de revenus, m&ecirc;me quand le produit est librement redistribuable. Les efforts bas&eacute;s sur Debian sont sur la bonne voie, m&ecirc;me si moins avanc&eacute;s &mdash;&nbsp;principalement parce que Red Hat et S.u.S.E. m&ecirc;laient des produits propri&eacute;taires aux paquetages libres pour survivre lorsque la part de march&eacute; &eacute;tait faible, tandis que Debian a toujours &eacute;t&eacute; compl&egrave;tement d&eacute;tach&eacute;e des produits propri&eacute;taires, et le reste toujours.

source: In addition to &ldquo;creating and packaging&rdquo; or &ldquo;collecting and packaging&rdquo; jobs, companies can specialize in technical support, covering the situations where computer systems are of critical importance. Big business realities using computer systems in their productive environment won't be satisfied with either the external consultant or the in-house technician. They need to rely on an external structure that guarantees round-the-clock operation of their technological aids.
fr: En plus de leur boulot consistant &agrave; &laquo;&nbsp;cr&eacute;er et empaqueter&nbsp;&raquo; ou &agrave; &laquo;&nbsp;rassembler et empaqueter&nbsp;&raquo;, les soci&eacute;t&eacute;s peuvent se sp&eacute;cialiser dans le support technique, couvrant les situations o&ugrave; les syst&egrave;mes informatiques sont d'une importance critique. La r&eacute;alit&eacute; des grosses soci&eacute;t&eacute;s utilisant des syst&egrave;mes informatiques dans leur environnement de production ne peut &ecirc;tre satisfaite ni par un consultant externe ni par un technicien interne. Ils ont besoin de se fier &agrave; une structure externe qui garantisse le fonctionnement 24h sur 24 de leurs aides technologiques.

source: Even if GNU/Linux or any other operating system is demonstrated to be completely reliable, power users will need to rely on a support company as a form of insurance. The more important computers are for a production environment, the more people are willing to pay to be reassured that everything will go on working and to have someone &ldquo;responsible&rdquo; to call in case of any failure. Such a &ldquo;power user&rdquo; support contract could also include a provision for refunds in case of down time. Big support companies will be able to efficiently deal with it, and clients will be happy to pay high rates even if they never need to call for assistance.
fr: M&ecirc;me si l'on d&eacute;montre que GNU/Linux ou d'autres syst&egrave;mes d'exploitation sont compl&egrave;tement fiables, les utilisateurs chevronn&eacute;s (power users) veulent se fier &agrave; une soci&eacute;t&eacute; de support comme forme d'assurance. Plus les ordinateurs sont importants pour un environnement de production, plus les gens veulent payer pour s'assurer que tout va continuer &agrave; fonctionner et pour pouvoir, en cas d'incident, appeler une personne &laquo;&nbsp;responsable&nbsp;&raquo;. Un contrat de support pour un tel utilisateur chevronn&eacute; peut aussi inclure une clause de remboursement en cas de non disponibilit&eacute; (down time). Les grosses soci&eacute;t&eacute;s de support seront capables de g&eacute;rer cela de mani&egrave;re efficace, et les clients seront heureux de payer de forts montants m&ecirc;me s'ils n'ont jamais besoin d'appeler &agrave; l'aide.

source: In short, I see no need for software companies to keep exclusive rights on their products; the support environment is big enough to offer good business positions in Information Technologies. Those who want to be at the top could use some of the revenue to pay for Free Software development, thus gaining access to the best software before anyone else and associating their name with software products. As a matter of fact, this practice is already pursued by the big distributions.
fr: En r&eacute;sum&eacute;, je ne vois nul n&eacute;cessit&eacute; pour une soci&eacute;t&eacute; de logiciel de conserver des droits exclusifs sur ses produits&nbsp;: la part du support est suffisamment importante pour offrir de bonnes positions &eacute;conomiques dans les technologies de l'information (IT). Ceux qui sont au sommet pourraient utiliser une partie des revenus pour financer le d&eacute;veloppement de logiciel libre, obtenant ainsi acc&egrave;s aux meilleurs logiciels avant tout le monde et associant ainsi leur nom aux produits logiciels. En fait, cette pratique est d&eacute;j&agrave; suivie par les grosses distributions.
