Repository: gitGNU/gnu_www-fr
Catalog: philosophy/software-patents.*.po
Languages: fr

source: If I wanted to put an &lsquo;If&rsquo; statement in a &lsquo;While&rsquo; statement, I don't have to worry about whether the &lsquo;If&rsquo; statement will oscillate at a certain frequency and rub against the &lsquo;While&rsquo; statement and eventually they will fracture. I don't have to worry whether it will oscillate at a certain higher frequency and induce a signal in the value of some other variable. I don't have to worry about how much current that &lsquo;If&rsquo; statement will draw and whether it can dissipate the heat there inside that while statement. Whether there will be a voltage drop across the while statement that will make the &lsquo;If&rsquo; statement not function. I don't have to worry that if i run this program in a salt water environment that the salt water may get in between the &lsquo;If&rsquo; statement and the &lsquo;While&rsquo; statement and cause corrosion. I don't have to worry when I refer to the value of a variable whether I am exceeding the fan-out limit by referring to it 20 times. I don't have to worry, when I refer to the variable, how much capacitance it has and whether there has been sufficient time to charge up the value. I don't have to worry when I write the program, about how I am going to physically assemble each copy and whether I can manage to get access to put that &lsquo;If&rsquo; statement inside the &lsquo;While&rsquo; statement. I don't have to worry about how I am going to gain access in case that &lsquo;If&rsquo; statement breaks, to remove it and replace it with a new one. So many problems that we don't have to worry about in software. That makes it fundamentally easier. It is fundamentally easier to write a program than to design a physical object that's going to work. This may seem strange because you have probably heard people talking about how hard software is to design and how this is a big problem and how we are going to solve it. They are not really talking about the same question as I am. I am comparing physical and software systems of the same complexity, the same number of parts. I am saying the software system is much easier to design than the physical system. But the intelligence of people in these various fields is the same, so what do we do when we are confronted with an easy field? We just push it further! We push our abilities to the limit. If systems of the same size are easy, let's make systems which are ten times as big, then it will be hard! That's what we do! We make software systems which are far bigger in terms of number of parts than physical systems. A physical system whose design has a million different pieces in it is a mega project. A computer program whose design has a million pieces in it, is maybe 300,000 lines, a few people will write that in a couple of years. That is not a particularly giant program. GNU Emacs now has several million pieces in its design I think. It has a million lines of code. This is a project done with essentially no funding whatsoever. Mostly done by people in their spare time.
fr: Si je voulais mettre une d&eacute;claration &laquo;&nbsp;If&nbsp;&raquo; dans une d&eacute;claration &laquo;&nbsp;While&nbsp;&raquo;, je n'ai pas besoin de me soucier de savoir si la d&eacute;claration &laquo;&nbsp;If&nbsp;&raquo; oscillera &agrave; une certaine fr&eacute;quence et entrera finalement en r&eacute;sonnance pour se fissurer.Je n'ai pas besoin de me soucier de savoir si elle oscillera &agrave; une certaine haute fr&eacute;quence et induira un signal dans la valeur d'una autre variable. Je n'ai pas besoin de savoir combien de courant cette d&eacute;claration &laquo;&nbsp;If&nbsp;&raquo; consommera et si elle peut dissiper la chaleur &agrave; l'int&eacute;rieur de cette d&eacute;claration &laquo;&nbsp;While&nbsp;&raquo;. Ou s'il y aura une chute de tension dans la d&eacute;claration &laquo;&nbsp;While&nbsp;&raquo; qui fera que la d&eacute;claration &laquo;&nbsp;If&nbsp;&raquo; ne fonctionnera pas. Je n'ai pas besoin de me soucier si j'ex&eacute;cute ce programme dans un environnement d'eau sal&eacute;e que l'eau sal&eacute;e s'infiltrera entre la d&eacute;claration &laquo;&nbsp;If&nbsp;&raquo; et la d&eacute;claration &laquo;&nbsp;While&nbsp;&raquo; et provoquera une corrosion. Je n'ai pas besoin de me soucier quand je me r&eacute;f&egrave;re &agrave; la valeur d'une variable si j'exc&egrave;de la limite de ventilation en m'y r&eacute;f&eacute;rant 20 fois. Je n'ai pas besoin de me soucier, quand je me r&eacute;f&egrave;re &agrave; la variable, de la capacitance qu'elle a et s'il y a eu suffisamment de temps pour charger la valeur. Je n'ai pas besoin de me soucier quand j'&eacute;cris un programme de savoir comment je vais assembler physiquement chaque copie et si je peux r&eacute;ussir &agrave; obtenir un acc&egrave;s pour mettre cette d&eacute;claration &laquo;&nbsp;If&nbsp;&raquo; dans la d&eacute;claration &laquo;&nbsp;While&nbsp;&raquo;. Je n'ai pas besoin de me soucier sur la fa&ccedil;on d'avoir un acc&egrave;s au cas o&ugrave; la d&eacute;claration &laquo;&nbsp;If&nbsp;&raquo; se casse, pour la supprimer et la remplacer par une nouvelle. Il y a tant de probl&egrave;mes dont nous n'avons pas &agrave; nous soucier dans le logiciel. Cela rend le logiciel fondamentalement plus facile. Il est beaucoup plus facile d'&eacute;crire un programme que de concevoir un objet physique qui doit fonctionner. Cela peut sembler &eacute;trange car vous avez probablement entendu des gens dire combien il &eacute;tait difficile de concevoir un logiciel et que c'&eacute;tait un gros probl&egrave;me et la fa&ccedil;on dont ils allaient r&eacute;soudre cela. Ils ne parlent pas vraiement de la m&ecirc;me chose que moi. Je compare des syst&egrave;mes physiques et logiciels de m&ecirc;me complexit&eacute;, de m&ecirc;me nombre de parties. Je dis qu'un syst&egrave;me logiciel est bien plus facile &agrave; concevoir qu'un syst&egrave;me physique. Mais l'intelligence des gens dans ces divers domaines est la m&ecirc;me, alors que faisons-nous quand nous sommes confront&eacute;s &agrave; un domaine facile&nbsp;? Nous allons encore plus loin&nbsp;! Nous poussons nos capacit&eacute;s &agrave; leurs limites. Si des syst&egrave;mes de m&ecirc;me taille sont simples, faisons alors des syst&egrave;mes dix fois plus gros, alors ce sera difficile&nbsp;! C'est ce que nous faisons&nbsp;! Nous faisons des syst&egrave;mes logiciels qui sont bien plus grands, en termes de nombre d'&eacute;l&eacute;ments que les syst&egrave;mes physiques. Un syst&egrave;me physique dont la conception rec&egrave;le un million d'&eacute;l&eacute;ments diff&eacute;rents est un m&eacute;ga projet. Un programme d'ordinateur dont la conception rec&egrave;le un million d'&eacute;l&eacute;ments, fait peut-&ecirc;tre 300000 lignes, quelques personnes &eacute;criront cela en deux ans. Ce n'est pas un programme particuli&egrave;rement imposant. Je pense que GNU Emacs a maintenant quelques millions d'&eacute;l&eacute;ments dans sa conception. Il fait un million de lignes de code. C'est un projet r&eacute;alis&eacute; essentiellement sans fonds, &eacute;crit pour la plupart par des personnes sur leur temps libre.

source: There is another big saving. If you have designed a physical product, the next thing you have to do is design the factory to make it. To build this factory may cost millions or tens of millions whereas to make copies of the program, you just have to type &lsquo;copy&rsquo;. The same copy command will copy any program. You want copies on CD then fine. You burn a master CD and send it off to a CD plant. They will use the same equipment which will copy any contents on a CD. You don't have to build a factory to make this product. There is tremendous simplification and tremendous reduction in costs of designing things. The result is, say for an automobile company, who will spend 50 million dollars to build a factory, to build a new model of auto, they can hire some lawyers to cope with patent license negotiations. They can even cope with a law suit if they wanted to. To design a program of the same complexity may cost 50 thousand or 100 thousand dollars. By comparison, the cost of dealing with the patent system is crushing. Or actually designing a program with the same complexity as the mechanical design of an auto is probably a month's work. How many parts does an auto have&hellip; that is if it is an auto which doesn't have computers in it.[<a href="#f1">1</a>] There are not that many parts. That is not to say designing a good one is easy but just that there are not that many different things in it.
fr: C'est une autre grosse source d'&eacute;conomie. Si vous avez con&ccedil;u un produit mat&eacute;riel, la chose suivante que vous devrez faire est de concevoir l'usine pour le fabriquer. Construire cette usine peut co&ucirc;ter des millions ou des dizaines de millions l&agrave; o&ugrave; la copie du programme ne co&ucirc;te que de taper &laquo;&nbsp;copy&nbsp;&raquo;. La m&ecirc;me commande copy copiera n'importe quel programme. Vous voulez des copies sur CD, tr&egrave;s bien. Vous gravez un CD master et vous l'envoyez &agrave; une usine de gravage de CD. Ils utiliseront le m&ecirc;me &eacute;quipement qui copiera n'importe quel contenu sur un CD. Vous n'avez pas besoin de b&acirc;tir une usine pour fabriquer ce produit. Il y a une &eacute;norme simplification et une &eacute;norme r&eacute;duction des co&ucirc;ts. Le r&eacute;sultat est, disons pour une soci&eacute;t&eacute; automobile&nbsp;: elle d&eacute;pensera 50 millions de dollars pour b&acirc;tir l'usine, pour fabriquer un nouveau mod&egrave;le de voiture, pour engager des avocats qui s'occuperont des n&eacute;gociations sur les licences de brevets. Ils peuvent m&ecirc;me faire face &agrave; un proc&egrave;s s'ils le voulaient. Concevoir un programme de m&ecirc;me complexit&eacute; peut co&ucirc;ter 50000 ou 100000 dollars. En comparaison, le co&ucirc;t pour traiter avec le syst&egrave;me de brevets est &eacute;crasant. En fait, concevoir un programme de la m&ecirc;me complexit&eacute; que la conception m&eacute;canique d'une voiture prend probablement un mois. Combien d'&eacute;l&eacute;ments contient une voiture, qui ne contient pas d'ordinateur [<a href="#f1">1</a>]. Il n'y a pas tant d'&eacute;l&eacute;ments que cela. Cela ne veut pas dire que concevoir une bonne voiture est simple mais juste qu'elle ne rec&egrave;le pas tant d'&eacute;l&eacute;ments diff&eacute;rents que cela.

source: The result is software really is different from other fields because we are working with mathematical stuff designing something is far, far easier and the result is that we regularly make systems which are much, much larger and do so with just a few people. The result is that the patent system then instead of being close to one product, one patent, we are in a system where one product involves many, many ideas which could be patented already.
fr: Le logiciel est vraiment diff&eacute;rent des autres domaines car nous travaillons sur des objets math&eacute;matiques, dont la conception est bien, bien plus facile, ce qui a pour r&eacute;sultat que nous faisons des syst&egrave;mes qui sont bien, bien plus grands et avec juste quelques personnes. Le r&eacute;sultat est qu'avec le syst&egrave;me de brevets, au lieu d'&ecirc;tre proche d'un produit &eacute;gale un brevet, nous sommes dans un syst&egrave;me ou un produit met en jeu vraiment beaucoup d'id&eacute;es qui pourraient d&eacute;j&agrave; &ecirc;tre brevet&eacute;es.

source: The best way to explain it by analogy is with symphonies. A symphony is also long and has many notes in it, and probably uses many musical ideas. Imagine if the governments of Europe in the 1700's had decided they wanted to promote the progress of symphonic music by establishing a European Musical Patent Office that would give patents for any kind of musical ideas which you could state in words. Then imagine it is around 1800 and you are Beethoven and you want to write a symphony. You will find that getting your symphony so that it doesn't infringe any patents is going to be harder than writing a good symphony. When you complain about this, the patent holders would say &ldquo;Ah Beethoven, you are just bitching because you have no ideas of your own. All you want to do is rip off our inventions&rdquo;. Beethoven, as it happens, had a lot of new musical ideas but he had to use a lot of existing musical ideas in order to make recognizable music. In order to make music that listeners could possibly like, that they could recognize as music. Nobody is so brilliant that he can re-invent music and make something that people would want to listen to. <a href="http://en.wikipedia.org/wiki/Pierre_Boulez">Pierre Boulez</a> said he would try to do that, but who listens to Pierre Boulez? Nobody is so brilliant he can re-invent all of computer science, completely new. If he did, he would make something that the users would find so strange that they wouldn't want to use it. If you look at a word processor today, you would find, I think, hundreds of different features. If you develop a nice new innovative word processor, that means there are some new ideas in it, but there must be hundreds of old ideas in it. If you are not allowed to use them, you cannot make an innovative word processor.
fr: La meilleure fa&ccedil;on de l'expliquer est par analogie avec les symphonies. Une symphonie est &eacute;galement longue et contient beaucoup de notes, et elle utilise probablement beaucoup d'id&eacute;es musicales. Imaginez si les gouvernements d'Europe dans les ann&eacute;es 1700 avaient d&eacute;cid&eacute; de promouvoir la musique symphonique en &eacute;tablissant un Office europ&eacute;en des brevets musicaux qui aurait donn&eacute; des brevets pour toutes sortes d'id&eacute;es musicales qui pourraient se d&eacute;cliner en mots. Imaginez-vous alors aux environs de 1800, vous &ecirc;tes Beethoven et vous voulez &eacute;crire une symphonie. Vous trouverez alors qu'&eacute;crire votre symphonie de sorte qu'elle ne viole pas de brevets deviendra plus difficile que d'&eacute;crire une bonne symphonie. Quand vous vous en plaindrez, les d&eacute;tenteurs de brevets vous diront&nbsp;: &laquo;&nbsp;Ah Beethoven, vous rousp&eacute;tez car vous n'avez pas d'id&eacute;es personnelles. Tout ce que vous voulez, c'est piquer nos inventions&nbsp;&raquo;. Beethoven avait beaucoup de nouvelles id&eacute;es musicales mais il a d&ucirc; utiliser beaucoup d'id&eacute;es existantes pour faire une musique reconnaissable, afin de faire de la musique que les auditeurs puissent aimer, et qu'ils reconnaissent comme musique. Personne n'est si brillant qu'il puisse r&eacute;inventer la musique et faire quelque chose que les gens voudraient &eacute;couter. <a href="http://fr.wikipedia.org/wiki/Pierre_Boulez">Pierre Boulez</a> disait qu'il essaierait de le faire, mais qui &eacute;coute Pierre Boulez&nbsp;? Personne n'est si brillant qu'il puisse r&eacute;inventer l'informatique totalement. S'il le faisait, il ferait quelque chose que les utilisateurs trouveraient si &eacute;trange qu'ils ne voudraient pas l'utiliser. Si vous regardez un traitement de texte aujourd'hui, vous trouverez, je pense, des centaines de fonctionnalit&eacute;s diff&eacute;rentes. Si vous d&eacute;veloppez un joli traitement de texte innovant, cela signifie qu'il y a de nouvelles id&eacute;es dedans, mais il doit y avoir aussi des centaines d'id&eacute;es anciennes aussi. Si vous n'avez pas le droit de les utiliser, vous ne pouvez pas faire de traitement de texte innovant.

source: Because the work of software development is so big, the result is that we don't need any artificial scheme to incentivize new ideas. You just have people writing software and they will have some new ideas. If you want to write a program and you want to make it good, so some ideas will come to you and some you will see a way to use. What used to happen, because I was in the software field before there were software patents, was most of the developers would publish any new ideas that they thought were noteworthy, that they thought that they might get any credit or respect for. The ideas that were too small or not impressive enough, they would not publish because that would be silly. Now the patent system is supposed to encourage disclosure of ideas. In fact, in the old days, nobody kept the ideas secret. They kept the code secret, it's true. The code, after all, represented the bulk of the work. They would keep the code secret and publish the ideas so that way the employees would get some credit and feel good. After software patents, they still kept the code secret and they patented the ideas, so in fact, disclosure has not been encouraged in any meaningful sense.
fr: Parce que le travail de d&eacute;veloppement est si cons&eacute;quent, nous n'avons pas besoin besoin de plan artificiel pour inciter &agrave; trouver de nouvelles id&eacute;es. Vous avez juste des gens qui &eacute;crivent des logiciels et ils auront de nouvelles id&eacute;es. Si vous voulez &eacute;crire un programme et que vous voulez qu'il soit bon, alors des id&eacute;es vous viendront et vous trouverez un moyen de les utiliser. Ce qui se passait, car j'&eacute;tais dans le domaine logiciel avant qu'il y ait les brevets logiciels,c'&eacute;tait que la plupart des d&eacute;veloppeurs publiaient toute nouvelle id&eacute;e qu'ils jugeaient importante, dont ils pensaient qu'ils pourraient retirer un certain cr&eacute;dit ou respect. Les id&eacute;es mineures ou pas assez importantes n'&eacute;taient pas publi&eacute;es car cela aurait &eacute;t&eacute; stupide. Maintenant, le syst&egrave;me de brevets est suppos&eacute; encourager la divulgation de id&eacute;es. En fait, auparavant, personne ne gardait les id&eacute;es secr&egrave;tes. Ils gardaient le code secret, c'est vrai. Le code, apr&egrave;s tout, repr&eacute;sentait la majeure partie du travail. Ils gardaient le code secret et publiaient les id&eacute;es, de sorte que les employ&eacute;s obtiennent quelque cr&eacute;dit et soient satisfaits. Apr&egrave;s les brevets logiciels, ils gardent toujours le code secret et ont brevet&eacute; les id&eacute;es, donc, en fait, la divulgation n'a pas &eacute;t&eacute; encourag&eacute;e dans un quelconque sens pertinent.

source: The same things are kept secret now as what were kept secret before, but the ideas which used to be published so that we could use them are now likely to be patented and off-limits for 20 years. What can a country do to change this? How should we change the policy to solve this problem?
fr: Les m&ecirc;mes choses sont gard&eacute;es secr&egrave;tes maintenant comme c'&eacute;tait le cas auparavant, mais les id&eacute;es qui &eacute;taient publi&eacute;es de sorte que l'on puisse les utiliser sont maintenant brevet&eacute;es et hors d'atteinte pendant 20 ans. Que peut faire un pays pour changer cela&nbsp;? Comment peut-on changer la politique pour r&eacute;soudre ce probl&egrave;mes&nbsp;?

source: There are two places you can attack it. One is the place where patents are being applied for and issued, in the patent office. The other is when patents are being applied&mdash;that is, the question of what does a patent cover.
fr: Il y a deux points que vous pouvez attaquer. L'un est l'endroit o&ugrave; sont demand&eacute;s et accord&eacute;s les brevets, &agrave; l'office des brevets. L'autre, c'est quand les brevets ont &eacute;t&eacute; appliqu&eacute;s &mdash;&nbsp;c'est-&agrave;-dire, la question de ce que le brevet couvre.

source: Changing the criteria for issuing patents or simply keeping a good criteria for issuing patents, can work in a country which has not authorized software patents before, for instance, for the most part, in Europe. Simply to clearly re-enforce the European Patent Office's rules which say that software is not patentable. This is a good solution for Europe. Europe is now considering a directive on software patents. The directive I suppose may be broader than that but one of its important implications is for software patents. Simply by modifying this to say software ideas cannot be patented will keep the problem out of Europe for the most part, except for some countries that may have admitted the problem on their own. Unfortunately one of them being the UK. Unfortunately for you.
fr: Changer le crit&egrave;re pour accorder les brevets ou simplement conserver un bon crit&egrave;re, peut fonctionner dans un pays qui n'a pas autoris&eacute; les brevets logiciels auparavant, par exemple, en grande partie, en Europe. Simplement pour clairement faire respecter les r&egrave;gles de l'Office europ&eacute;en des brevets qui dit que le logiciel n'est pas brevetable. C'est une bonne solution pour l'Europe. L'Europe est en train d'examiner une directive sur les brevets logiciels. Je suppose que le directive est peut-&ecirc;tre plus &eacute;tendue que cela mais une de ses importantes implications concernent les brevets logiciels. Simplement en modifiant ceci pour dire que les id&eacute;es logicielles ne peuvent pas &ecirc;tre brevetables pr&eacute;servera l'Europe de ce probl&egrave;me en grande partie, except&eacute;s quelques pays qui ont pu reconna&icirc;tre le probl&egrave;me de leur c&ocirc;t&eacute;. Malheureusement, l'un d'eux est le Royaume-Uni. Malheureusement pour vous.

source: That approach won't work in the US. The reason is that the US already has large numbers of software patents and any change in the criteria for issuing patents won't get rid of the existing ones.[<a href="#f2">2</a>] In fact, these patents are not officially labeled as software patents. I say software patents but what do I really mean? Patents which might potentially apply to software. Patents which might potentially get you sued for writing software. The patent office doesn't divide patents into software patents and other patents. So, in fact, any patent might conceivably get you sued for writing software if it could apply to some software. So in the US the solution would have to be done through changing the applicability, the scope of patents saying that a pure software implementation running on general purpose computer hardware which does not in itself infringe the patent, is not covered by any patent and you cannot get sued for it. That is the other kind of solution.
fr: Cette approche ne fonctionnerait pas aux &Eacute;tats-Unis. La raison est que les &Eacute;tats-Unis ont d&eacute;j&agrave; un grand nombre de brevets logiciels et que tout changement dans le crit&egrave;re de d&eacute;livrance de brevet ne d&eacute;barassera pas des brevets existants [<a href="#f2">2</a>]. En fait ces brevets ne sont pas officiellement &eacute;tiquet&eacute;s comme brevets logiciels. Je dis brevets logiciels mais qu'est-ce que je veux r&eacute;ellement dire&nbsp;? Des brevets qui peuvent potentiellement s'appliquer aux logiciels. Des brevets qui pourraient potentiellement vous faire poursuivre en justice pour avoir &eacute;crit un logiciel. L'office des brevets ne divise pas les brevets logiciels d'un c&ocirc;t&eacute; et les autres de l'autre. Donc, il est concevable que tout brevet pourrait vous amener devant le tribunal pour avoir &eacute;crit un logiciel s'il pouvait s'appliquer au domaine du logiciel. Aussi, aux &Eacute;tats-Unis, la solution passerait par un changement de la demande de brevet, l'&eacute;tendue du brevet pr&eacute;cisant qu'une pure mise en &oelig;uvre logicielle ex&eacute;cut&eacute;e sur un ordinateur universel qui n'enfreint pas en soi de brevet, n'est pas couverte par un brevet et vous ne pouvez pas &ecirc;tre poursuivi pour cela. C'est l'autre type de solution.
