Repository: gitGNU/gnu_www-fr
Catalog: philosophy/software-patents.*.po
Languages: fr

source: The patent office does things that are so obviously foolish, you wouldn't even have to know the state of the art to see they are foolish. This is not limited to software. I once saw the famous Harvard mouse patent which was obtained after Harvard genetically engineered a strain of mouse with a cancer causing gene. The cancer causing gene was already known and was inserted using known techniques into an already existing strain of mouse. The patent they got covered inserting any cancer causing gene into any kind of mammal using any method whatsoever. You don't have to know anything about genetic engineering to realize that is ridiculous.
fr: L'office des brevets fait des choses si manifestement stupides, que vous n'avez pas besoin de conna&icirc;tre l'&eacute;tat de l'art pour voir que c'est stupide. Ce n'est pas limit&eacute; au logiciel. J'ai vu une fois le fameux brevet sur la souris de Harvard qui a &eacute;t&eacute; obtenu apr&egrave;s que Harvard ait g&eacute;n&eacute;tiquement modifi&eacute; une lign&eacute;e de souris avec un g&egrave;ne provoquant le cancer. Le g&egrave;ne en question &eacute;tait d&eacute;j&agrave; connu et &eacute;tait ins&eacute;r&eacute; selon des m&eacute;thodes connues sur une lign&eacute;e de souris existante. Le brevet qu'ils ont obtenu couvrait l'introduction d'un g&egrave;ne provoquant le cancer pour n'importe quel type de mammif&egrave;res, quelque soit la m&eacute;thode utilis&eacute;e. Vous n'avez pas besoin de conna&icirc;tre quoi que ce soit en manipulation g&eacute;n&eacute;tique pour r&eacute;aliser que c'est ridicule.

source: I am told that this over claiming is normal practice and that the US Patent Office sometimes invited patent applicants to make their claims broader. Basically make the claims broader until you think they are running into something else that's unambiguous prior art. See how much land grab in mental space you can get away with.
fr: On m'a dit que cette surench&egrave;re de revendication est une pratique normale et que l'Office am&eacute;ricain des brevets et des marques invitait parfois les postulants au brevet &agrave; rendre leur revendication plus &eacute;tendue. En fait, rendre la revendication plus &eacute;tendue jusqu'&agrave; ce que vous pensiez qu'elle empi&egrave;te sur quelque chose d'autre qui est ant&eacute;rieure sans ambigu&iuml;t&eacute;. Voyez tout ce que vous pouvez imaginer que cela recouvre.

source: When programmers look at a lot of software patents, they say this is ridiculously obvious! Patent bureaucrats have all sorts of excuses to justify ignoring what programmers think. They say &ldquo;Oh! But you have to consider it in terms of the way things were 10 or 20 years ago&rdquo;. Then they discovered that if they talk something to death then you can eventually lose your bearings. Anything can look unobvious if you tear it apart enough, analyze it enough. You simply lose all standard of obviousness or at least lose the ability to justify any standard of obvious or unobvious. Then, of course, they describe the patent holders as brilliant inventors, all of them. Therefore we can't question their entitlement to power over what we can do.
fr: Quand les programmeurs regardent des brevets, ils disent pour beaucoup d'entre eux, que c'est si ridiculement &eacute;vident&nbsp;! Les bureaucrates des brevets ont toutes sortes d'excuses pour justifier d'ignorer ce que pensent les programmeurs. Ils disent&nbsp;: &laquo;&nbsp;Oh&nbsp;! mais vous devez consid&eacute;rer cela en vous pla&ccedil;ant 10 ou 20 ans en arri&egrave;re&nbsp;&raquo;. Puis, ils d&eacute;couvrirent qu'en diss&eacute;quant les choses vous pouviez finalement perdre vos positions. Tout peut para&icirc;tre non &eacute;vident si vous le d&eacute;cortiquez ou si vous l'analysez suffisamment. Vous perdez tout simplement votre bon sens ou au moins la capacit&eacute; &agrave; d&eacute;cider de ce qui est &eacute;vident et de ce qui ne l'est pas. Ensuite, bien s&ucirc;r, ils d&eacute;crivent les d&eacute;tenteurs du brevet comme de brillants inventeurs, tous. Par cons&eacute;quent, nous ne pouvons pas remettre en question leur droit &agrave; exercer leur pouvoir sur ce que nous pouvons faire.

source: If you go to court, the judges are likely to be a little more stringent about the idea of what is obvious or not. But the problem is that it costs millions of dollars to do that. I heard of one patent case, the defendant I remember was Qualcomm, and I believe the ruling was ultimately 13 million dollars of which most went to pay the lawyers on both sides. There were a few million dollars left over for the plaintiff, because they lost.
fr: Si vous allez en justice, les juges sont probablement un peu plus rigoureux sur l'id&eacute;e de ce qui est &eacute;vident ou pas. Mais le probl&egrave;me, c'est que cela co&ucirc;te des millions de dollars de faire cela. J'ai entendu parler d'une affaire de brevet, je me rappelle que le d&eacute;fendeur &eacute;tait Qualcomm, et je crois que la d&eacute;cision de la cour fut 13 millions dollars dont la plus grande partie pour payer les honoraires des avocats des deux c&ocirc;t&eacute;s. Il restait quelques millions de dollars pour le plaignant car ils avaient perdu.

source: To a large extent, the question of the validity of a patent will depend on historical accidents. Lots of historical accidents such as precisely what was published when and which of those things somebody manages to find. Which of them didn't get lost, precise dates and so-on. Many historical accidents determine whether a patent is valid. In fact, it is a weird thing that the <a href="http://www.delphion.com/details?pn=US04873662__">British Telecom following hyper links together with telephone access patent</a>, I think, was applied for in 1975. I think it was in 1974 that I developed the info package for the first time. The info package allows you to traverse hyper links and people did use telephones to dial up and access the system. So in fact, I produced a piece of prior art for that patent. So that is the second patentable idea I have had in my life, but I don't think I have any proof of that. I didn't think this was interesting enough to publish it. After all, the idea of following hyper links I got from the demo of Engelbart's editor. He is the one who had an idea which was interesting to publish. What I done I called poor mans hypertext as I had to implement it in the context of TECO. It was not as powerful as his hypertext but it was at least useful for browsing documentation, which it all it was meant for, and as for there being dial-up access to the system, well, there was, but it didn't occur to me that the one had anything particular to do with the other. I wasn't going to publish a paper saying &ldquo;Oh! I implemented this poor man's hypertext, and guess what! There are dial-up lines on the computer too!&rdquo; I suspect there is no way to tell precisely on what dates I implemented this. And was it published in any sense? Well, we invited guests to come in across the ARPAnet, and log in on our machine, so they could have browsed documentation using info and seen the thing. If they had asked us, they would have found we have dial-up access. But as you can see, historical accident determines whether you have prior art.
fr: Dans une large mesure, la question de la validit&eacute; d'un brevet d&eacute;pendra des al&eacute;as historiques. Des hasards historiques tels que ce qui a &eacute;t&eacute; publi&eacute; pr&eacute;cis&eacute;ment et quand&nbsp;; et laquelle de ces choses a d&eacute;j&agrave; &eacute;t&eacute; trouv&eacute;e. Lesquelles n'ont pas &eacute;t&eacute; perdues, les dates pr&eacute;cises, etc. Beaucoup d'al&eacute;as historiques d&eacute;finissent si un brevet est valide. En fait, c'est une chose bizarre que le<a href="http://www.delphion.com/details?pn=US04873662__">brevet de British Telecom pour suivre les hyperliens avec un acc&egrave;s t&eacute;l&eacute;phonique</a>, ait &eacute;t&eacute; demand&eacute; en 1975, je pense. Je pense que c'est en 1974 que j'ai d&eacute;velopp&eacute; le paquetage &laquo;&nbsp;info&nbsp;&raquo; pour la premi&egrave;re fois. Le paquetage &laquo;&nbsp;info&nbsp;&raquo; vous permet de traverser les hyperliens et les gens utilisaient des t&eacute;l&eacute;phones pour appeler et acc&eacute;der au syst&egrave;me. Donc en fait, j'ai produit quelque chose d'ant&eacute;rieur pour ce brevet. C'est donc la deuxi&egrave;me id&eacute;e brevetable que j'ai eu dans ma vie, mais je ne pense pas avoir une preuve de cela. Je ne pensais que c'&eacute;tait suffisamment int&eacute;ressant pour le publier. Apr&egrave;s tout, j'ai eu l'id&eacute;e de suivre les hyperliens suite &agrave; une d&eacute;mo de l'&eacute;diteur de Engelbart. C'&eacute;tait lui qui avait une id&eacute;e int&eacute;ressante &agrave; publier. J'ai appel&eacute; ce que j'ai fait &laquo;&nbsp;l'hypertexte du pauvre&nbsp;&raquo; car j'avais &agrave; le mettre en &oelig;uvre dans le contexte de TECO. Ce n'&eacute;tait pas aussi puissant que son hypertexte mais c'&eacute;tait au moins utile pour naviguer dans la documentation, ce qui &eacute;tait le but, et pour ce qui est des acc&egrave;s t&eacute;l&eacute;phoniques, et bien, il y en avait, mais il ne m'est pas venu &agrave; l'esprit que cela avait quelque chose &agrave; voir avec le reste. Je n'allais publier un papier disant&nbsp;: &laquo;&nbsp;Oh&nbsp;! J'ai mis en &oelig;uvre cet hypertexte du pauvre, et devinez quoi! Il y a aussi des lignes t&eacute;l&eacute;phoniques sur l'ordinateur&nbsp;!&nbsp;&raquo;. Je suppose que je n'ai aucun moyen de dire pr&eacute;cis&eacute;ment &agrave; quelle date j'ai mis en &oelig;uvre ceci. Et &eacute;tait-ce publi&eacute; d'une mani&egrave;re ou d'une autre&nbsp;? Bien, nous avons invit&eacute; des gens &agrave; venir &agrave; travers ARPAnet et &agrave; se connecter sur notre machine, pour qu'il puissent naviguer dans la documentation en utilisant &laquo;&nbsp;info&nbsp;&raquo; et voir la chose. S'ils nous l'avaient demand&eacute;, ils auraient trouv&eacute; que nous avions un acc&egrave;s t&eacute;l&eacute;phonique. Mais comme vous pouvez le voir, le hasard historique d&eacute;termine si vous avez l'ant&eacute;riorit&eacute; sur l'invention.

source: Now of course, there is a publication made by Engelbart about hypertext, which they are going to show. I don't think it says anything about having dial-ups on the computer however, so whether it will suffice is not clear. So, this is an option, the possibility of going to court to overturn the patent.
fr: Maintenant, bien s&ucirc;r, il y a une publication faite par Engelbart sur l'hypertexte qu'ils vont produire. Je ne pense pas que cela dise quoi que ce soit sur le fait d'avoir une connexion t&eacute;l&eacute;phonique sur l'ordinateur cependant, donc cela suffira-t-il, ce n'est pas clair. La possibilit&eacute; d'aller en justice pour invalider le brevet est donc un choix.

source: Because of the expense, it is often out of the question even if you can find solid prior art that ought to be sufficient to overturn the patent. As a result, an invalid patent, a patent that nominally shouldn't have existed (but in fact lots and lots of them do) is a dangerous weapon. If somebody attacks you with an invalid patent, that can really cause a lot of trouble for you. You might be able to bluff them away by showing them the prior art. It depends upon whether they can get scared off that way or they might think &ldquo;well, you are just bluffing, we figure you can't really go to court, you can't afford it so we'll sue you anyway&rdquo;.
fr: &Agrave; cause de la d&eacute;pense, c'est souvent hors de question m&ecirc;me si vous pouvez trouver quelque solide r&eacute;alisation ant&eacute;rieure qui serait suffisante pour invalider le brevet. En cons&eacute;quence, un brevet invalide, c'est-&agrave;-dire un brevet qui n'aurait pas d&ucirc; exister (mais en fait c'est le cas pour beaucoup d'entre eux) est une arme dangereuse. Si quelqu'un vous attaque avec un brevet invalide, cela peut vraiment vous causer beaucoup de probl&egrave;mes. Vous pourriez &ecirc;tre capable de vous sortir d'affaire en les bluffant en leur montrant la r&eacute;alisation ant&eacute;rieure. Cela d&eacute;pend s'ils peuvent &ecirc;tre effray&eacute;s de cette mani&egrave;re ou ils pourraient penser &laquo;&nbsp;Bien, vous bluffez, nous pensons que vous ne pouvez pas vraiment vous permettre d'aller en justice, donc nous vous poursuivrons en justice de toute fa&ccedil;on&nbsp;&raquo;.

source: All of these three possibilities are things that sometimes you can manage to use, but often you can't. So you have to face patent after patent after patent. Each time you may be able to find one of these three possibilities you can use, then there is another patent then another and another. It gets like crossing a minefield. Each step you take, each design decision, probably won't step on a patent, so you can take a few steps and probably there won't be an explosion. But the chance you will get all the way through the minefield and get to develop the program you want to develop without ever stepping on a patent gets less and less as the program gets bigger.
fr: Vous pouvez quelquefois r&eacute;ussir &agrave; utiliser ces trois possibilit&eacute;s, mais souvent, ce n'est pas le cas. Alors vous devez affronter brevet apr&egrave;s brevet apr&egrave;s brevet. Chaque fois, vous pouvez &ecirc;tre en mesure d'utiliser une des trois possibilit&eacute;s, mais alors il y a un autre brevet puis un autre et un autre. C'est comme traverser un champ de mines. Chaque pas que vous faites, chaque d&eacute;cision de conception ne tombera probablement pas sur un brevet, vous pouvez alors avancer de quelques pas et il n'y aura probablement pas d'explosion. Mais la probabilit&eacute; que vous avez de marcher au travers du champ de mines et de d&eacute;velopper le programme que vous voulez sans tomber sur un brevet s'amenuisera au fur et &agrave; mesure que le programme grossit.

source: Now, people used to say to me, &ldquo;Well, there are patents in other fields, why should software be exempt?&rdquo;. Note the bizarre assumption in there that somehow we are all supposed to suffer through the patent system. It is like saying &ldquo;Some people get cancer. Why should you be exempt?&rdquo; As I see it, each person who doesn't get cancer is good. But there is, behind that, a less biased question, which is a good question which is: Is software different from other fields? Should patent policy be different in different fields? If so, why?
fr: Les gens ont l'habitude de me dire&nbsp;&laquo;&nbsp;Bien, il y a des brevets dans d'autres domaines, pourquoi le logiciel devrait &ecirc;tre exempt&eacute;&nbsp;?&nbsp;&raquo;. Remarquez la bizarre supposition qui dit que d'une mani&egrave;re ou d'une autre, nous sommes tous suppos&eacute;s souffrir du syst&egrave;me des brevets. C'est comme de dire&nbsp;: &laquo;&nbsp;Des gens ont le cancer. Pourquoi ne l'auriez-vous pas&nbsp;?&nbsp;&raquo;. De mon point de vue, chaque personne qui n'a pas le cancer est dans une bonne situation. Mais il y a derri&egrave;re cela une question moins trompeuse, qui est une bonne question&nbsp;: &laquo;&nbsp;Le logiciel est-il diff&eacute;rent des autres domaines&nbsp;? La politique des brevets devrait-elle &ecirc;tre diff&eacute;rente pour diff&eacute;rents domaines&nbsp;? Si oui, pourquoi&nbsp;?

source: Let me address that question: patents relate to different fields differently because in various fields patents relate to products differently.
fr: Laissez-moi r&eacute;pondre &agrave; cette question&nbsp;: les brevets traitent des diff&eacute;rents champs diff&eacute;remment car dans des domaines tr&egrave;s vari&eacute;s les brevets traitent des produits diff&eacute;remment.

source: On one extreme we have pharmaceuticals where a given chemical formula would be patented, so that patent covers one and only one product. Some other product wouldn't be covered by the existing patent. If there is to be a patent for this new product, the patent holder would be whoever developed the new product.
fr: D'un c&ocirc;t&eacute; nous avons des produits pharmaceutiques o&ugrave; une formule chimique donn&eacute;e serait brevet&eacute;e, et donc le brevet ne couvre qu'un seul produit. D'autres produits ne seraient donc pas couverts par le brevet existant. S'il devait y avoir un brevet pour ce nouveau produit, le d&eacute;tenteur du brevet serait celui qui a d&eacute;velopp&eacute; le nouveau produit.

source: That fits in with the naive idea of the patent system that we have, that if you are designing a new product, you are going to get &ldquo;The Patent&rdquo;. The idea that there is one patent per product and that it covers the idea of that product. In some fields it is closer to being true. In other fields it is further from being true. This is because software packages are usually very big. They use many different ideas in a new combination. If the program is new and not just copied, then it is probably using a different combination of ideas combined, of course, with newly written code, because you can't just magically say the names of these ideas and have them work. You have to implement them all. You have to implement them all in that combination. The result is that even when you write a program, you are using lots of different ideas, any one of them might be patented by somebody. A pair of them may be patented as a combination by somebody. There might be several different ways of describing one idea which might be patented by various different people. So there are possibly thousands of things, thousands of points of vulnerability in your program, which might be patented by somebody else already. This is why software patents tend to obstruct the progress of software&mdash;the work of software development. If it were one patent-one product, then these patents wouldn't obstruct the development of products because if you developed a new product, it wouldn't be patented by somebody else already. But when one product corresponds to many different ideas combined, it becomes very likely your new product is going to be patented by somebody else already. In fact, there is economic research now showing just how imposing a patent system on a field where there is incremental innovation, can retard progress. You see, the advocates of software patents say &ldquo;well yes, there may be problems but more important than any problems, the patents must promote innovation and that is so important it doesn't matter what problems you cause&rdquo;. Of course, they don't say that out loud because it is ridiculous but implicitly they want you to believe that as long as it promotes progress, that outweighs any possible cost. But actually, there is no reason to believe it does promote progress. We now have a model showing precisely how patents can retard progress. The case where that model can fit describes the software field pretty well; Incremental innovation.
fr: Cela cadre avec l'id&eacute;e na&iuml;ve que dans le syst&egrave;me de brevets que nous avons, si vous d&eacute;veloppez un nouveau produit, vous obtiendrez &laquo;&nbsp;LeBrevet&nbsp;&raquo;. L'id&eacute;e qu'il y a un brevet par produit et qu'il couvre l'id&eacute;e de ce produit. Dans certains domaines, c'est presque vrai. Dans d'autres, c'est loin d'&ecirc;tre vrai, car les paquetages logiciels sont habituellement tr&egrave;s gros. Ils utilisent beaucoup d'id&eacute;es diff&eacute;rentes dans une nouvelle combinaison. Si le programme est nouveau et pas seulement une copie, alors il est probable qu'il utilise une combinaison diff&eacute;rente d'id&eacute;es associ&eacute;es bien s&ucirc;r &agrave; du code nouvellement &eacute;crit, parce que vous ne pouvez pas lancer comme &ccedil;a des id&eacute;es et comme par magie les voir fonctionner. Vous avez &agrave; les mettre en &oelig;uvre toutes. Vous devrez les mettre en &oelig;uvre toutes dans cette combinaison. Le r&eacute;sultat en est que m&ecirc;me si vous &eacute;crivez un programme, vous utilisez beaucoup d'id&eacute;es diff&eacute;rentes n'importe laquelle d'entre elles pourrait avoir &eacute;t&eacute; brevet&eacute;e par quelqu'un. L'association de deux peut avoir &eacute;t&eacute; brevet&eacute;e en tant que combinaison par quelqu'un. Il pourrait y avoir plusieurs fa&ccedil;ons diff&eacute;rentes de d&eacute;crire une id&eacute;e qui pourrait &ecirc;tre brevet&eacute;e par diverses personnes. Donc il y a probablement des milliers de choses, des milliers de points de vuln&eacute;rabilit&eacute; dans votre programme, qui pourraient d&eacute;j&agrave; &ecirc;tre brevet&eacute;es par quelqu'un d'autre. C'est pourquoi les brevets logiciels tendent &agrave; emp&ecirc;cher le progr&egrave;s dans les logiciels &mdash;&nbsp;le travail de d&eacute;veloppement de logiciels. S'il y avait un brevet pour un produit, alors ces brevets n'emp&ecirc;cheraient pas le d&eacute;veloppement de produits car si vous avez d&eacute;velopp&eacute; un nouveau produit, il ne sera pas d&eacute;j&agrave; brevet&eacute; par quelqu'un d'autre. Mais quand un produit correspond &agrave; l'association de beaucoup d'id&eacute;es diff&eacute;rentes, il est tr&egrave;s probable que votre nouveau produit soit d&eacute;j&agrave; brevet&eacute; par quelqu'un d'autre. En fait, il y a une &eacute;tude &eacute;conomique qui montre que d'imposer un syst&egrave;me de brevets sur un domaine o&ugrave; l'innovation est incr&eacute;mentale, peut retarder le progr&egrave;s. Les partisans des brevets logiciels disent&nbsp;: &laquo;&nbsp;Oui, il peut y avoir des probl&egrave;mes mais le plus important, c'est que les brevets doivent promouvoir l'innovation et c'est si important que peu importe les probl&egrave;mes qu'ils causent&nbsp;&raquo;. Bien s&ucirc;r, ils ne disent pas &ccedil;a tr&egrave;s fort car c'est ridicule mais implicitement ils veulent que vous croyez que tant que les brevets promeuvent le progr&egrave;s, cela surpasse tous les co&ucirc;ts. Mais en fait, il n'y a aucune raison de croire que les brevets participent au progr&egrave;s. Nous avons maintenant un mod&egrave;le qui montrent pr&eacute;cis&eacute;ment comment les brevets peuvent retarder le progr&egrave;s. Les cas o&ugrave; ce mod&egrave;le peut s'appliquer correspond tr&egrave;s bien au domaine du logiciel&nbsp;; innovation incr&eacute;mentale.

source: Why is software on that extreme of the spectrum? The reason is that in software we are developing idealized mathematical objects. You can build a complicated castle and have it rest on a thin line and it will stay up because it doesn't weigh anything. In other fields, people have to cope with the perversity of matter&mdash;of physical objects. Matter does what it is going to do. You can try to model it and if the actual behavior doesn't fit the model then tough on you, because the challenge is to make physical objects that really work.
fr: Pourquoi le logiciel est-il sur cette extr&eacute;mit&eacute; du spectre&nbsp;? La raison est que dans le logiciel nous d&eacute;veloppons des objets math&eacute;matiques id&eacute;alis&eacute;s. Vous pouvez b&acirc;tir un ch&acirc;teau compliqu&eacute; et le faire reposer sur une ligne t&eacute;nue et il restera debout car il ne p&egrave;se rien. Dans d'autres domaines, les gens doivent composer avec la perversit&eacute; de la mati&egrave;re &mdash;&nbsp;des objets physiques. La mati&egrave;re fait ce qu'elle doit faire. Vous pouvez essayer de la modeler et si son comportement de fait ne s'ajuste pas au mod&egrave;le alors c'est dur pour vous, car le d&eacute;fi est de r&eacute;aliser des objets physiques qui fonctionnent vraiment.
