Repository: gitGNU/gnu_www-fr
Catalog: philosophy/software-literary-patents.*.po
Languages: fr

source: Software Patents and Literary Patents - GNU Project - Free Software Foundation (FSF)
fr: Brevets logiciels et brevets littéraires - GNU Project - Free Software Foundation (FSF)

source: Software Patents and Literary Patents
fr: Brevets logiciels et brevets littéraires

source: by <strong><a href="http://stallman.org/">Richard Stallman</a></strong>
fr: par <strong><a href="http://stallman.org/">Richard Stallman</a></strong>

source: Those who imagine effects like those of copyright law cannot grasp the disastrous effects of software patents. We can use Victor Hugo as an example to illustrate the difference.
fr: Ceux qui imaginent des effets comme ceux-ci sur la loi sur le droit d'auteur ne peuvent pas envisager d'appréhender les effets réels des brevets logiciels. Nous pouvons utiliser Victor Hugo comme exemple pour illustrer cette différence.

source: A novel and a modern complex program have certain points in common: each one is large, and implements many ideas in combination. So let's follow the analogy, and suppose that patent law had been applied to novels in the 1800s; suppose that states such as France had permitted the patenting of literary ideas. How would this have affected Victor Hugo's writing? How would the effects of literary patents compare with the effects of literary copyright?
fr: Un roman et un programme moderne complexe ont certains points en commun&nbsp;: chacun d'eux est grand et met en &oelig;uvre beaucoup d'idées. Alors poursuivons l'analogie et supposons que la loi sur les brevets ait été appliquée aux romans dans les années 1800&nbsp;; supposons que des états comme la France ait permis le brevetage des idées littéraires. Comment cela aurait-il affecté l'écriture de Victor Hugo&nbsp;? Les effets des brevets littéraires seraient-ils comparables aux effets du droit d'auteur littéraire&nbsp;?

source: Patents work differently. Patents cover ideas; each patent is a monopoly on practicing some idea, which is described in the patent itself. Here's one example of a hypothetical literary patent:
fr: Les brevets fonctionnent différemment. Les brevets couvrent les idées&nbsp;; chaque brevet est un monopole sur la pratique d'une certaine idée, qui est décrite dans le brevet lui-même. Voici un exemple d'un brevet littéraire hypothétique&nbsp;:

source: Claim 1: a communication process that represents in the mind of a reader the concept of a character who has been in jail for a long time and becomes bitter towards society and humankind.
fr: Revendication 1&nbsp;: un processus de communication qui représente dans l'esprit d'un lecteur le concept d'un personnage qui a été en prison longtemps et qui devient amer envers la société et l'humanité.

source: Claim 2: a communication process according to claim 1, wherein said character subsequently finds moral redemption through the kindness of another.
fr: Revendication 2&nbsp;: un processus de communication conformément à la revendication 1, où ledit personnage trouve finalement la rédemption morale dans la gentillesse d'un autre.

source: Claim 3: a communication process according to claims 1 and 2, wherein said character changes his name during the story.
fr: Revendication 3&nbsp;: un processus de communication conformément à la revendication 1 et 2, où ledit personnage change de nom pendant l'histoire.

source: Now consider this hypothetical literary patent:
fr: Considérons maintenant ce brevet littéraire hypothétique&nbsp;:

source: Claim 1: a communication process that represents in the mind of a reader the concept of a character who has been in jail for a long time and subsequently changes his name.
fr: Revendication 1&nbsp;: un processus de communication qui représente dans l'esprit d'un lecteur le concept d'un personnage qui a été en prison longtemps et qui change finalement de nom.

source: Claim 1: a communication process that represents in the mind of a reader the concept of a character who finds moral redemption and then changes his name.
fr: Revendication 1&nbsp;: un processus de communication qui représente dans l'esprit d'un lecteur le concept d'un personnage qui trouve la rédemption morale et qui change ensuite de nom.

source: Jean Valjean would have been forbidden by this patent too.
fr: Jean Valjean aurait violé ce brevet aussi.

source: This patent also could have been violated:
fr: Ce brevet pourrait aussi avoir été violé&nbsp;:

source: Claim 1: a communication process that presents a character whose given name matches the last syllable of his family name.
fr: Revendication 1&nbsp;: un processus de communication qui présente un personnage dont le prénom correspond à la dernière syllabe de son nom de famille.

source: through the name &ldquo;Jean Valjean&rdquo;, but at least this patent would have been easy to avoid.
fr: à cause de du nom «&nbsp;Jean Valjean&nbsp;», mais au moins ce brevet aurait pu être facilement évité.

source: You might think that these ideas are so simple that no patent office would have issued them. We programmers are often amazed by the simplicity of the ideas that real software patents cover&mdash;for instance, the European Patent Office has issued a patent on the progress bar, and a patent on accepting payment via credit cards. These patents would be laughable if they were not so dangerous.
fr: Vous pourriez penser que ces idées sont si simples qu'aucun office de brevets n'accorderait de brevets pour cela. Nous autres programmeurs sommes souvent abasourdis par la simplicité des idées que les brevets logiciels réels couvrent&mdash;par exemple, l'Office européen des brevets a accordé un brevet sur la barre de progression et un brevet sur le paiement par cartes de crédit. Ces brevets seraient risibles s'ils n'étaient pas si dangereux.

source: However, a very broad patent could have made all these issues irrelevant. Imagine a patent with broad claims like these:
fr: Cependant, un brevet très étendu aurait pu rendre tous ces problèmes insignifiants. Imaginez des brevets avec des revendications étendues comme celles-ci&nbsp;:

source: A narration structure sometimes resembling a fugue or improvisation.
fr: Une structure de narration ressemblant parfois à une fugue ou une improvisation.

source: Intrigue articulated around the confrontation of specific characters, each in turn setting traps for the others.
fr: Une intrigue articulée autour de la confrontation de personnages spécifiques, chacun tendant des pièges aux autres.

source: Narration that presents many layers of society.
fr: Une narration qui présente plusieurs couches de la société.

source: Narration that shows the wheels of hidden conspiracy.
fr: Une narration qui montre les rouages d'une conspiration secrète.

source: Who would the patent holders have been? They could have been other novelists, perhaps Dumas or Balzac, who had written such novels&mdash;but not necessarily. It isn't required to write a program to patent a software idea, so if our hypothetical literary patents follow the real patent system, these patent holders would not have had to write novels, or stories, or anything&mdash;except patent applications. Patent parasite companies, businesses that produce nothing except threats and lawsuits, are booming nowadays.
fr: Quels auraient pu être les détenteurs de brevets&nbsp;? Cela aurait pu être d'autres romanciers, peut-être Dumas ou Balzac, qui avaient écrit des romans similaires&mdash;mais pas nécessairement. Il n'est pas nécessaire d'écrire un programme pour breveter une idée logicielle, donc, si nos brevets littéraires hypothétiques suivaient le système de brevets réels, ces détenteurs de brevets n'auraient pas à écrire de romans ou d'histoires ou quoi que ce soit&mdash;sauf les demandes de brevets. Des sociétés parasites, des sociétés qui ne produisent rien d'autres que des menaces et des poursuites judiciaires, fleurissent aujourd'hui.

source: Given these broad patents, Victor Hugo would not have reached the point of asking what patents might get him sued for using the character of Jean Valjean, because he could not even have considered writing a novel of this kind.
fr: Avec des brevets étendus comme ceux-là, Victor Hugo n'aurait pas dépassé le stade du questionnement de savoir quels brevets auraient pu lui valoir des poursuites pour l'utilisation du personnage de Jean Valjean, car il n'aurait même pas envisagé d'écrire un roman de cette façon.

source: The way to prevent software patents from bollixing software development is simple: don't authorize them. This ought to be easy, since most patent laws have provisions against software patents. They typically say that &ldquo;software per se&rdquo; cannot be patented. But patent offices around the world are trying to twist the words and issuing patents on the ideas implemented in programs. Unless this is blocked, the result will be to put all software developers in danger.
fr: Le moyen d'empêcher les brevets logiciels de mettre la pagaille dans le développement de logiciels est simple&nbsp;: ne pas les autoriser. Cela doit être simple, puisque la plupart des lois sur les brevets ont des clauses contre les brevets logiciels. Elles disent typiquement&nbsp;: «&nbsp;un logiciel en soi&nbsp;» ne peut pas être breveté. Mais les bureaux des brevets de par le monde essaient de déformer les mots et de publier des brevets sur les idées mises en œuvre dans les programmes. À moins que ceci ne soit bloqué, le résultat sera de mettre tous les développeurs de logiciels en danger.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.<br />Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
