Repository: gitGNU/gnu_www-fr
Catalog: philosophy/software-patents.*.po
Languages: fr

source: Software Patents - GNU Project - Free Software Foundation
fr: Les brevets logiciels - GNU Project - Free Software Foundation

source: Software patents &mdash; Obstacles to software development
fr: Les brevets logiciels &mdash; Obstacles au d&eacute;veloppement des logiciels

source: by <strong>Richard Stallman</strong>
fr: par <strong>Richard Stallman</strong>

source: <i> This is transcription of a talk presented by Richard M. Stallman 2002-03-25 at the University of Cambridge <a href="http://www.cl.cam.ac.uk/">Computer Laboratory</a>, organized by the <a href="http://www.fipr.org/">Foundation for Information Policy Research</a>. This transcript and <a href="http://audio-video.gnu.org/audio/">audio recording</a> by Nicholas Hill, HTML editing and links by Markus Kuhn. The original version is hosted at <a href="http://www.cl.cam.ac.uk/~mgk25/stallman-patents.html"> http://www.cl.cam.ac.uk/~mgk25/stallman-patents.html</a>. </i>
fr: <i>Ceci est la transcription d'un discours de Richard M. Stallman du 25 mars 2002 au <a href="http://www.cl.cam.ac.uk/">Laboratoire informatique</a> de l'Universit&eacute; de Cambridge, organis&eacute; par la <a href="http://www.fipr.org/">Foundation for Information Policy Research</a>. Cette transcription et son <a href="http://audio-video.gnu.org/audio/">enregistrement audio</a> ont &eacute;t&eacute; effectu&eacute;s par Nicholas Hill, la mise en page HTML et les liens par Markus Kuhn. La version originale est h&eacute;berg&eacute;e sur <a href="http://www.cl.cam.ac.uk/~mgk25/stallman-patents.html">http://www.cl.cam.ac.uk/~mgk25/stallman-patents.html</a>.</i>

source: You might have been familiar with my work on <a href="/philosophy/free-sw.html">free software</a>. This speech is not about that. This speech is about a way of <a href="http://www.progfree.org/Patents/against-software-patents.html"> misusing laws</a> to make software development a dangerous activity. This is about what happens when patent law gets applied to the field of software.
fr: Vous &ecirc;tes peut-&ecirc;tre familier avec mon travail sur les <a href="philosophy/free-sw.fr.html">logiciels libres</a>. Ce discours ne parle pas de cela. Il aborde le <a href="http://www.progfree.org/Patents/against-software-patents.html">mauvais usage des lois</a> qui fait du d&eacute;veloppement de logiciels une activit&eacute; dangereuse. Il s'agit de ce qui arrive lorsque la l&eacute;gislation sur les brevets est appliqu&eacute;e au domaine du logiciel.

source: It is not about patenting software. That is a very bad way, a misleading way to describe it, because it is not a matter of patenting individual programs. If it were, it would make no difference, it would be basically harmless. Instead, it is about patenting ideas. Every patent covers some idea. <a href="http://www.progfree.org/Patents/patents.html"> Software patents</a> are patents that cover software ideas, ideas which you would use in developing software. That is what makes them a dangerous obstacle to all software development.
fr: Il ne s'agit pas du brevetage des logiciels. C'est une tr&egrave;s mauvaise fa&ccedil;on, biais&eacute;e, pour qualifier ce discours, car il n'y est pas question de brevetage de programmes individuels. Si c'&eacute;tait le cas, cela ne ferait pas de diff&eacute;rence et serait basiquement inoffensif. Il s'agit plut&ocirc;t du brevetage des id&eacute;es. Chaque brevet couvre une certaine id&eacute;e. Les <a href="http://www.progfree.org/Patents/patents.html">brevets logiciels</a> sont des brevets qui couvrent des id&eacute;es sur le logiciel, des id&eacute;es que vous utiliseriez dans le d&eacute;veloppement de logiciels. C'est ce qui en fait un dangereux obstacle pour tout d&eacute;veloppement de logiciels.

source: You may have heard people using a misleading term &ldquo;<a href="http://www.wipo.org/about-ip/en/">Intellectual Property</a>&rdquo;. This term, as you can see, is biased. It makes an assumption that whatever it is you are talking about, the way to treat it is as a kind of property, which is one among many alternatives. This term &ldquo;Intellectual Property&rdquo; pre-judges the most basic question in whatever area you are dealing with. This is not conducive to clear and open minded thinking.
fr: Vous avez peut-&ecirc;tre entendu des gens utiliser un terme biais&eacute;&nbsp;: &laquo;&nbsp;<a href="http://www.wipo.org/about-ip/fr/">propri&eacute;t&eacute; intellectuelle</a>&nbsp;&raquo;. Ce terme, comme vous pouvez le voir est trompeur. Il pr&eacute;tend que quel que soit ce dont vous parlez, il faut le traiter comme une sorte de propri&eacute;t&eacute;, ce qui est une des nombreuses possibilit&eacute;s. Ce terme de &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; pr&eacute;juge la plus simple question quel que soit le domaine o&ugrave; vous &eacute;voluez. Cela ne favorise pas une pens&eacute;e claire et ouverte.

source: There is an additional problem which has nothing to do with promoting any one opinion. It gets in the way of understanding even the facts. The term &ldquo;intellectual property&rdquo; is a catch-all. It lumps together completely disparate areas of law such as copyrights and patents, which are completely different. Every detail is different. It also lumps together trademarks which are even more different, and various other things more or less commonly encountered. None of them has anything in common with any of the others. Their origins historically are completely separate. The laws were designed independently. They covered different areas of life and activities. The public policy issues they raise are completely unrelated. So, if you try to think about them by lumping them together, you are guaranteed to come to foolish conclusions. There is literally no sensible intelligent opinion you can have about &ldquo;Intellectual Property&rdquo;. If you want to think clearly, don't lump them together. Think about copyrights and then think about patents. Learn about copyright law and separately learn about patent law.
fr: Il y a un probl&egrave;me suppl&eacute;mentaire qui n'a rien &agrave; voir avec la promotion d'une quelconque opinion. Il r&eacute;side dans la fa&ccedil;on de comprendre m&ecirc;me les faits. Le terme &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; est un fourre-tout. Il englobe des domaines l&eacute;gaux compl&egrave;tement diff&eacute;rents tels que les droits d'auteur et les brevets qui sont totalement diff&eacute;rents. Chaque d&eacute;tail est diff&eacute;rent. Il met &eacute;galement dans le m&ecirc;me panier les marques d&eacute;pos&eacute;es qui sont encore plus diff&eacute;rentes et diverses autres choses rencontr&eacute;es plus ou moins souvent. Aucun d'entre eux n'a quoi que ce soit en commun avec les autres. Historiquement, leurs origines sont totalement s&eacute;par&eacute;es. Les lois qui les r&eacute;gissent ont &eacute;t&eacute; con&ccedil;ues ind&eacute;pendamment. Ils couvrent des domaines et activit&eacute;s diff&eacute;rentes. Les probl&egrave;mes de politique publique qu'ils soul&egrave;vent sont totalement ind&eacute;pendants. Aussi, si vous essayez de penser &agrave; ces questions comme un tout, vous &ecirc;tes assur&eacute; d'en venir &agrave; des conclusions stupides. On ne peut litt&eacute;ralement pas avoir d'opinion intelligente et sens&eacute;e sur la &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;. Si vous voulez r&eacute;fl&eacute;chir clairement, ne m&eacute;langez pas ces questions. R&eacute;fl&eacute;chissez aux droits d'auteur puis aux brevets. Informez-vous sur la l&eacute;gislation relative aux droits d'auteur, puis, s&eacute;par&eacute;ment, sur celle relative aux brevets.

source: To give you some of the biggest differences between copyrights and patents: Copyrights cover the details of expression of a work. Copyrights don't cover any ideas. Patents only cover ideas and the use of ideas. Copyrights happen automatically. Patents are issued by a patent office in response to an application.
fr: Pour donner un exemple de quelques-unes des plus grandes diff&eacute;rences entre les droits d'auteurs et les brevets&nbsp;: les droits d'auteur couvrent les d&eacute;tails de l'expression d'une &oelig;uvre. Les droits d'auteur ne traitent pas des id&eacute;es. Les brevets ne concernent que les id&eacute;es et l'utilisation des id&eacute;es. Le droit d'auteur s'applique automatiquement. Les brevets proviennent d'un office des brevets en r&eacute;ponse &agrave; une demande de brevet.

source: Patents cost a lot of money. They cost even more paying the lawyers to write the application than they cost to actually apply. It takes typically some years for the application to get considered, even though patent offices do an extremely sloppy job of considering.
fr: Les brevets co&ucirc;tent beaucoup d'argent. En fait, cela co&ucirc;te m&ecirc;me plus de payer les avocats qui r&eacute;digent la demande que le d&eacute;p&ocirc;t de brevet lui-m&ecirc;me. Cela prend typiquement quelques ann&eacute;es pour qu'une demande soit prise en compte, m&ecirc;me si les offices de brevets font un travail d'analyse extr&ecirc;mement d&eacute;sordonn&eacute;.

source: Copyrights last tremendously long. In some cases they can last as long as 150 years, where patents last 20 years, which is long enough that you can outlive them but still quite long by a timescale of a field such as software.
fr: Les droits d'auteur sont terriblement longs. Dans certains cas, ils peuvent durer jusqu'&agrave; 150 ans, alors que les brevets ne s'appliquent que 20 ans, ce qui est assez long pourleur survivre mais tr&egrave;s long &agrave; l'&eacute;chelle d'un domaine tel que celui des logiciels.

source: Think back about 20 years ago when a PC was a new thing. Imagine being constrained to develop software using only the ideas that were known in 1982.
fr: Rappelez-vous il y a environ 20 ans lorsque le PC venait de na&icirc;tre. Imaginez &ecirc;tre oblig&eacute; de d&eacute;velopper des logiciels en utilisant seulement les id&eacute;es qui &eacute;taient connues en 1982.

source: Copyrights cover copying. If you write a novel that turns out to be word-for-word the same with <cite>Gone with the Wind</cite> and you can prove you never saw <cite>Gone with the Wind</cite>, that would be a defense to any accusation of copyright infringement.
fr: Le droit d'auteur couvre le plagiat. Si vous &eacute;crivez un roman qui s'av&egrave;re &ecirc;tre mot pour mot identique &agrave; <cite>Autant en emporte le vent</cite> et que vous pouvez prouver que vous n'avez jamais vu <cite>Autant en emporte le vent</cite>, cela pourrait &ecirc;tre une d&eacute;fense contre une accusation d'infraction &agrave; la loi sur les droits d'auteur.

source: A patent is an absolute monopoly on using an idea. Even if you could prove you had the idea on your own, it would be entirely irrelevant if the idea is patented by somebody else.
fr: Un brevet est un monopole absolu sur l'utilisation d'une id&eacute;e. M&ecirc;me si vous pouviez prouver que vous avez eu l'id&eacute;e par vous-m&ecirc;me, cela serait totalement sans importance si l'id&eacute;e est brevet&eacute;e par quelqu'un d'autre.

source: I hope you will forget about copyrights for the rest of this talk because this talk is about patents and you should never lump together copyrights and patents. It is about your understanding of these legal issues. It is like what would happen in your understanding of practical chemistry if you confused water and ethanol.
fr: J'esp&egrave;re que vous oublierez les droits d'auteur pendant le reste de cette discussion car elle traite des brevets et vous ne devriez jamais m&eacute;langer droits d'auteur et brevets. Il s'agit de votre appr&eacute;hension de ces probl&egrave;mes l&eacute;gaux. C'est ce qui arriverait &agrave; votre compr&eacute;hension de la chimie si vous confondiez l'eau et l'&eacute;thanol.

source: When you hear people describe the patent system, they usually describe it from the point of view of somebody who is hoping to get a patent- what it would be like for you to get a patent. What it would be like for you to be walking down the street with a patent in your pocket so that every so often you can pull it out and point it out at somebody and say &ldquo;Give Me Your Money!&rdquo;. There is a reason for this bias, which is that most of the people who will tell you about this patent system have a stake in it, so they want you like it.
fr: Quand vous entendez quelqu'un d&eacute;crire le syst&egrave;me des brevets, il le d&eacute;crit g&eacute;n&eacute;ralement du point de vue d'une personne qui esp&egrave;re obtenir un brevet &mdash;&nbsp;de ce que cela donnerait pour vous d'obtenir un brevet. De ce que cela ferait pour vous de vous promener dans la rue avec un brevet en poche, de le sortir aussi souvent que vous le voulez et de le brandir &agrave; quelqu'un en disant &laquo;&nbsp;Donnez-moi votre argent&nbsp;&raquo;. Il y a une raison pour ce pr&eacute;jug&eacute;, qui est que la plupart des gens qui vous parleront ainsi du syst&egrave;me de brevet, y ont un int&eacute;r&ecirc;t et c'est pourquoi ils veulent que vous l'appr&eacute;ciiez.

source: There is another reason&mdash;the patent system is a lot like a lottery because only a tiny fraction of patents actually bring any benefit to those who hold the patents. In fact, &lsquo;<a href="http://www.economist.com/displayStory.cfm?Story_ID=S%26%29%28%20%2EP1%2F%25%0A"> The Economist</a>&rsquo; once compared it to a time consuming lottery. If you have seen ads for lotteries, they always invite you to think about winning. They don't invite you to think about losing, even though losing is far more likely. It is the same with ads for the patent system. They always invite you to think about being the one who wins.
fr: Il y a une autre raison&nbsp;: le syst&egrave;me de brevets ressemble beaucoup &agrave; une loterie car seule une fraction t&eacute;nue des brevets profitent effectivement aux d&eacute;tenteurs de brevets. En fait, le journal &laquo;&nbsp;<a href="http://www.economist.com/displayStory.cfm?Story_ID=S%26%29%28%20%2EP1%2F%25%0A">TheEconomist</a>&nbsp;&raquo; l'a une fois compar&eacute; &agrave; une loterie. Si vous avez d&eacute;j&agrave; vu des publicit&eacute;s pour des loteries, elles vous invitent toujours &agrave; penser que vous allez gagner. Elles ne vous sugg&egrave;rent pas que vous aller perdre, m&ecirc;me s'il est plus que probable de perdre. Il en est de m&ecirc;me avec les publicit&eacute;s pour le syst&egrave;me des brevets. Elles vous invitent toujours &agrave; penser que vous serez le gagnant.

source: To balance this bias, I am going to describe the patent system from the point of view of its victims. That is from the point of view of somebody who wants to develop software but is forced to contend with a system of software patents that might result in getting sued.
fr: Pour contrebalancer ce pr&eacute;jug&eacute;, je vais vous d&eacute;crire le syst&egrave;me des brevets du point de vue de ses victimes. C'est-&agrave;-dire du point de vue dequelqu'un qui veut d&eacute;velopper un logiciel mais qui est oblig&eacute; d'affronter le syst&egrave;me de brevets logiciels et dont l'issue pourrait &ecirc;tre un proc&egrave;s.

source: So, what is the first thing you are going to do after you have had an idea of what kind of program you are going to write? The first thing you might want to try to do to deal with the patent system is find out what patents may cover the program you want to write. This is impossible. The reason is that some of the patent applications that are pending are secret. After a certain amount of time they may get published, like 18 months. But that is plenty of time for you to write a program and even release it not knowing that there is going to be a patent and you are going to get sued. This is not just academic. In 1984, the compress program was written, a program for data compression. At the time, there was no patent on the LZW compression algorithm which it used. Then in 1985, the US issued a patent on this algorithm and over the next few years, those who distributed the compress program started getting threats. There was no way that the author of compress could have realized that he was likely to get sued. All he did was use an idea that he found in a journal just like programmers have always done. He hadn't realized that you could no longer safely use ideas that you found in a journal.
fr: Alors, quelle est la premi&egrave;re chose que vous allez faire apr&egrave;s avoir eu une id&eacute;e du genre de programme que vous voulez &eacute;crire&nbsp;? La premi&egrave;re chose que vous voudriez essayer de faire pour traiter avec le syst&egrave;me de brevets est de d&eacute;couvrir les brevets qui pourraient couvrir le programme que vous voulez &eacute;crire. C'est impossible. La raison en est que les demandes de brevets en attente sont confidentielles. Apr&egrave;s un certain temps, elles peuvent &ecirc;tre publi&eacute;es, disons 18 mois. Mais cela fait beaucoup de temps pour vous pour &eacute;crire un programme et m&ecirc;me le publier en ne sachant pas s'il y aura un brevet et si vous allez &ecirc;tre poursuivi. Ce n'est pas qu'une hypoth&egrave;se. En 1984, le programme &laquo;compress&raquo; &eacute;tait &eacute;crit, un programme permettant la compression de donn&eacute;es. &Agrave; l'&eacute;poque, il n'y avait pas de brevet sur l'algorithme de compression LZW qui &eacute;tait utilis&eacute;. Puis, en 1985, les &Eacute;tats-Unis ont sorti un brevet sur cet algorithme et les ann&eacute;es qui suivirent, ceux qui distribuaient le programme &laquo;&nbsp;compress&nbsp;&raquo; ont commenc&eacute; &agrave; &ecirc;tre menac&eacute;s. Il n'y avait aucun moyen pour que l'auteur de &laquo;compress&raquo; ait pu r&eacute;aliser qu'il allait probablement &ecirc;tre poursuivi. Tout ce qu'il a fait fut d'utiliser une id&eacute;e qu'il avait trouv&eacute; dans un journal, comme les programmeurs l'ont toujours fait. Il n'avait pas r&eacute;alis&eacute; qu'on ne pouvait plus utiliser en toute s&eacute;curit&eacute; des id&eacute;es trouv&eacute;es dans un journal.

source: Let's forget about that problem&hellip; The issued patents are published by the patent office so you can find the whole long list of them and see exactly what they say. Of course, you couldn't actually read that whole list as there are too many of them. In the US, there are hundreds of thousands of software patents.
fr: Oublions ce probl&egrave;me. Les brevets accord&eacute;s sont publi&eacute;s par l'office des brevets de sorte que vous pouvez consulter toute leur longue liste et voir exactement ce qu'ils disent. Bien s&ucirc;r, vous ne pourriez en fait pas lire toute la liste car il y en a beaucoup trop. Aux &Eacute;tats-Unis, il y a des centaines de milliers de brevets logiciels.

source: There is no way you can keep track of what they are all about. You would have to try to search for relevant ones. Some people say that should be easy in these modern days of computers. You could search for key words and so-on. That one works to a certain extent. You will find some patents in the area. You won't necessarily find them all however. For instance, there was a software patent which may have expired by now on natural order recalculation in spread sheets. This means basically that when you make certain cells depend upon other cells, it always recalculates everything after the things it depends on, so that after one re-calculation, everything is up to date. The first spread sheets did their recalculation top-down, so if you made a cell depend on a cell lower down, and you had a few such steps, you had to recalculate several times to get the new values to propagate upwards. You were supposed to have things depend upon cells above them. Then someone realized why don't I do the recalculation so that everything gets recalculated after the things it depends upon? This algorithm is known as topological sorting. The first reference to it I could find was in 1963. The patent covered several dozen different ways you could implement topological sorting but you wouldn't have found this patent by searching for spreadsheet. You couldn't have found it by searching for natural order or topological sort. It didn't have any of those terms in it. In fact, it was described as a method of compiling formulas into object code. When I first saw it, I thought it was the wrong patent.
fr: Il n'y a aucun moyen pour que vous puissiez savoir ce dont ils traitent tous. Vous essayeriez de rechercher les brevets pertinents. Certains disent que cela devrait &ecirc;tre facile de nos jours avec les ordinateurs. Vous pourriez rechercher des mots-cl&eacute;s, etc. Cela marche jusqu'&agrave; un certain point. Vous trouverez quelques brevets dans le domaine. Mais vous ne les trouverez pas n&eacute;cessairement tous cependant. Par exemple, il y avait un brevet logiciel qui doit avoir expir&eacute; maintenant, sur le recalcul de l'ordre naturel dans les tableurs. Ce qui signifie en gros que quand vous rendez certaines cellules d&eacute;pendantes d'autres cellules, cela recalcule toujours tout apr&egrave;s les cellules les cellules dont elles d&eacute;pendent, de sorte qu'apr&egrave;s un recalcul, tout est &agrave; jour. Les premiers tableurs faisaient le recalcul du haut vers le bas, donc si faisiez d&eacute;pendre une cellule d'une cellule plus bas dans la feuille, et que vous aviez quelques &eacute;tapes similaires, vous deviez faire le recalcul plusieurs fois pour que les nouvelles valeurs se propagent. Vous &eacute;tiez suppos&eacute;s avoir des cellules d&eacute;pendant de cellules situ&eacute;es au-dessus d'elles. Alors, quelqu'un s'est dit&nbsp;: &laquo;Pourquoi ne ferai-je pas le recalcul de sorte que tout soit recalcul&eacute; en fonction des d&eacute;pendances, quelle que soit la position dans la feuille&nbsp;? Cet algorithme est connu sous le nom de tri topologique. La premi&egrave;re r&eacute;f&eacute;rence &agrave; cet algorithme que j'ai pu trouver datait de 1963. Le brevet couvrait plusieurs dizaines de moyens diff&eacute;rents pour mettre en &oelig;uvre le tri topologique mais vous n'auriez pas pu trouver ce brevet en recherchant &laquo;&nbsp;tableurs&nbsp;&raquo;. Vous n'auriez pas pu le trouver en recherchant &laquo;&nbsp;ordre naturel&nbsp;&raquo; ou &laquo;&nbsp;tri topologique&nbsp;&raquo;. Il ne contenanit aucun de ces termes. En fait, il &eacute;tait d&eacute;crit comme une m&eacute;thode de compilation de formules en code objet. Quand je l'ai vu la premi&egrave;re fois, j'ai pens&eacute; que ce n'&eacute;tait pas le bon brevet.

source: Let's suppose that you got a list of patents. So you want to see know what you are not allowed to do. When you try studying these patents, you will discover they are very hard to understand as they are written in tortuous legal language, whose meaning is very hard to understand. The things patent offices say often don't mean what they seem to mean.
fr: Supposons que vous ayez une liste de brevets. Vous voulez donc conna&icirc;tre ce que vous n'&ecirc;tes pas autoris&eacute; &agrave; faire. Quand vous essayez d'&eacute;tudier ces brevets, vous d&eacute;couvrez qu'ils sont tr&egrave;s difficiles &agrave; comprendre car ils sont &eacute;crits dans un langage juridique tortueux, dont la signification est tr&egrave;s dure &agrave; saisir. Ce que disent les offices de brevet ne veut souvent pas dire ce qu'ils semblent dire.
