Repository: gitGNU/gnu_www-fr
Catalog: philosophy/software-patents.*.po
Languages: fr

source: Here is another point I should mention: Sometimes a company or consortium can make a format or protocol the de-facto standard. Then, if that format or protocol is patented, that is a real disaster for you. There are even official standards that are restricted by patents. There was a big political uproar last September when the <a href="http://www.w3.org/TR/patent-practice">World Wide Web Consortium</a> was proposing to start adopting standards that were covered by patents. The community objected so they reversed themselves. They went back to insisting that any patents had to be freely implementable by anyone and that the standards had to be free for anyone to implement. That is an interesting victory. I think that was the first time any standards body has made that decision. It is normal for standards bodies to be willing to put something in a standard which is restricted by patents and people are not allowed to go ahead and implement it freely. We need to go to other standards bodies and call on them to change their rules.
fr: Voici un autre point que je dois mentionner&nbsp;: quelquefois une soci&eacute;t&eacute; ou un consortium peut faire d'un format ou d'un protocole le standard de facto. Alors, si ce format ou ce protocole est brevet&eacute;, c'est un vrai d&eacute;sastre pour vous. Il y a m&ecirc;me des standards officiels qui sont restreints par des brevets. Il y a eu une grande indignation politique en septembre dernier quand le <a href="http://www.w3.org/TR/patent-practice">World Wide Web Consortium</a> a propos&eacute; de commencer &agrave; adopter des standards qui &eacute;taient couverts par des brevets. La communaut&eacute; a object&eacute; et ils ont donc fait marche arri&egrave;re. Ils recommenc&egrave;rent alors &agrave; insister sur le fait que tout brevet devait pouvoir &ecirc;tre librement mis en &oelig;uvre par quiconque et que les standards devaient &ecirc;tre libres pour quiconque pour leur mise en &oelig;uvre. C'est une victoire int&eacute;ressante. Je pense que c'&eacute;tait la premi&egrave;re fois qu'un organisme de standardisation avait pris cette d&eacute;cision. Il est normal pour les organismes de standardisation de souhaiter mettre quelque chose dans un standard qui est restreint par des brevets mais les gens ne sont pas autoris&eacute;s &agrave; avancer et &agrave; le mettre en &oelig;uvre librement. Nous avons besoin d'aller trouver d'autres organismes de standardisation et les appeler &agrave; changer leur r&egrave;gles.

source: 2) Licensing the patent
fr: 2) Obtenir une licence du brevet

source: The second possibility instead of avoiding the patent is to get a license for the patent. This is not necessarily an option. The patent holder does not have to offer you a license, it is not required. 10 Years ago, the league for programming freedom got a letter asking for help from somebody whose family business was making gambling machinery for casinos and they used computers back then. He received a threat from another company that said we have the patents. You are not allowed to make these things. Shut down.
fr: La seconde possibilit&eacute;, au lieu d'&eacute;viter le brevet, est d'obtenir une licence pour le brevet. Ce n'est pas n&eacute;cessairement un choix. Le d&eacute;tenteur du brevet n'est pas oblig&eacute; de vous offrir une licence, ce n'est pas requis. Il y a 10 ans, la Ligue pour la libert&eacute; de la programmation a re&ccedil;u une lettre demandant de l'aide, d'une personne dont la soci&eacute;t&eacute; familiale fabriquait des machines &agrave; sous pour les casinos et ils utilisaient des ordinateurs pour les faire fonctionner. Il a re&ccedil;u une menace d'une autre soci&eacute;t&eacute; qui disait&nbsp;: &laquo;&nbsp;Nous avons les brevets&nbsp;&raquo;. Vous n'&ecirc;tes pas autoris&eacute;s &agrave; faire ces choses. Fermez boutique.

source: I looked at that patent. It covered having a number of computers on a network for playing games such that each computer supported more than one game and allowed you to play more than one game at a time.
fr: J'ai regard&eacute; le brevet. Il couvrait&nbsp; Avoir des ordinateurs sur un r&eacute;seau pour des jeux tel que chaque ordinateur g&egrave;re plus d'un jeu et permette de jouer &agrave; plus d'un jeu &agrave; la fois.

source: You will find patent office really think that there is something brilliant about doing more than one of anything. They don't realize that in computer science, that's the most obvious way to generalize anything. You did it once and now you can do it any number of times, you can make a subroutine. They think that if you do anything more than once, that somehow means you are brilliant and that nobody can possibly argue with you and that you have the right to boss them around. Anyway, he was not offered a license. He had to shut down. He couldn't even afford really to go to court. I would say that particular patent was an obvious idea. It is possible that a judge might have agreed, but we will never know because he could not afford to go to court.
fr: Vous trouverez que l'office des brevets pense r&eacute;ellement qu'il y a quelque chose de brillant &agrave; faire plus d'une chose &agrave; la fois. Ils ne r&eacute;alisent pas qu'en informatique, c'est la fa&ccedil;on la plus &eacute;vidente pour tout g&eacute;n&eacute;raliser. vous l'avez fait une fois et maintenant vous pouvez le faire autant de fois que vous le voulez, vous pouvez faire un sous-programme. Ils pensent que si vous faites quelque plus d'une fois, cela signifie que d'une fa&ccedil;on ou d'une autre vous &ecirc;tes brillant et que vraiment personne ne peut argumenter avec vous et que vous avez le droit de donner des ordres &agrave; tout le monde. enfin, on ne lui a pas propos&eacute; de licence. Il devait fermer. Il ne pouvait vraiment pas se permettre d'aller en justice. Je dirais que ce brevet en particulier &eacute;tait une id&eacute;e &eacute;vidente. Il est possible qu'un juge ait pu en &ecirc;tre d'accord, mais nous ne le saurons jamais car il ne pouvait pas se permettre d'aller au proc&egrave;s.

source: However, a lot of patent holders do offer licenses. They often charge a lot of money for that though. The company licensing the natural order recalculation patent was demanding 5% of the gross sales of every spreadsheet in the US. I am told that was the cheap pre-lawsuit price. If you actually made them sue you and they won, they'd demand more. You might be able to afford that 5% for licensing this one patent, but what if you need to license 20 different patents to make the program? Then all the money you take in goes on patents. What if you need to license 21 patents?
fr: Cependant, beaucoup de d&eacute;tenteurs de brevets offrent des licences. Ils demandent souvent beaucoup d'argent pour cela. La soci&eacute;t&eacute; qui d&eacute;tenait le brevet du recalcul en ordre naturel demandait 5% des ventes brutes de chaque tableur aux &Eacute;tats-Unis pour la licence. On m'a dit que c'&eacute;tait le prix bon march&eacute; avant poursuites juduciaires. Si vous allez au proc&egrave;s et qu'ils gagnent, ils demanderaient plus. Vous pourriez vous permettre de donner 5% pour avoir une licence pour ce brevet-l&agrave;, mais que faire si vous avez besoin des licences pour 20 brevets diff&eacute;rents pour faire votre programme&nbsp;? Alors, tout l'argent que vous gagnez irait dans les brevets. Et si vous aviez besoin de licences pour 21 brevets&nbsp;?

source: People in business told me that practically speaking, 2 or 3 of them would make any business unfeasible.
fr: Des hommes d'affaires m'ont dit qu'en pratique, deux ou trois emp&ecirc;cheraient de faire marcher une affaire.

source: There is a situation where licensing patents is a very good solution. That is if you are a multinational mega-corporation. Because these companies own a lot of patents, and they cross-license with each other. That way, they escape most of the harm that the patent system does and they only get the good. IBM published an <a href="http://progfree.org/Links/prep.ai.mit.edu/ibm.think.article"> article</a> in Think magazine. I believe it was issue No. 5 of 1990 on IBM's patent portfolio, which said that IBM got two kinds of benefit from its 9000 US patents. I believe the number is larger today. These were first, collecting royalties and second, getting access to the patents of others. They said that the latter benefit is an order of magnitude greater. So the benefit that IBM got from being allowed to use the ideas that were patented by others was 10 times the direct benefit IBM could get from licensing patents. What does this really mean?
fr: Il y a une situation o&ugrave; les licences de brevets sont une tr&egrave;s bonne solution. C'est-&agrave;-dire si vous &ecirc;tes une tr&egrave;s grosse soci&eacute;t&eacute; multinationale. Car ces soci&eacute;t&eacute;s poss&egrave;dent beaucoup de brevets, et font des licences crois&eacute;es entre elles. De cette fa&ccedil;on, elles &eacute;chappent &agrave; la plupart des dommages occasionn&eacute;s par le syst&egrave;me de brevets et n'en prennent que le bon c&ocirc;t&eacute;. IBM a publi&eacute; un <a href="http://progfree.org/Links/prep.ai.mit.edu/ibm.think.article">article</a> dans le magazine &laquo;&nbsp;Think&nbsp;&raquo;. Je crois que c'&eacute;tait le num&eacute;ro 5 de l'ann&eacute;e 1990 sur le portefeuille de brevets d'IBM, qui disait qu'IBM obtenait deux types de b&eacute;n&eacute;fice de ses 9000 brevets am&eacute;ricains. Je crois que le nombre est plus important aujourd'hui. Le premier &eacute;tait de percevoir des royalties et le second, d'avoir acc&egrave;s aux brevets des autres. Ils disaient que le second est plus grand d'un ordre de grandeur. Donc, le b&eacute;n&eacute;fice qu'IBM retirait d'&ecirc;tre autoris&eacute; &agrave; utiliser les id&eacute;es qui &eacute;taient brevet&eacute;es par d'autres &eacute;tait 10 fois le b&eacute;n&eacute;fice direct qu'il en retirait en donnant des licences de ses propres brevets. Qu'est-ce que cela signifie r&eacute;ellement&nbsp;?

source: What is the benefit that IBM gets from this access to the patents of others? It is basically the benefit of being excused from the trouble that the patent system can cause you. The patent system is like a lottery. What happens with any given patent could be nothing, could be a windfall for some patent holder or a disaster for everyone else. But IBM being so big, for them, it averages out. They get to measure the average harm and good of the patent system. For them, the trouble of the patent system would have been 10 times the good. I say would have been because IBM through cross-licensing avoids experiencing that trouble. That trouble is only potential. It doesn't really happen to them. But when they measure the benefits of avoiding that trouble, they estimate it as 10 times the value of the money they collect from their patents.
fr: Quel est le b&eacute;n&eacute;fice qu'obtient IBM de son acc&egrave;s aux brevets des autres&nbsp;? C'est en fait le b&eacute;n&eacute;fice d'&ecirc;tre excus&eacute; des ennuis que peut vous causer le syst&egrave;mes de brevets. Le syst&egrave;me de brevets est comme une loterie. Ce qui peut arriver avec n'importe quel brevet, c'est soit rien,soit une aubaine pour le d&eacute;tenteur du brevet ou un d&eacute;sastre pour quelqu'un d'autre. Mais IBM est si gros que pour eux, cela s'&eacute;quilibre. Ils ont l'occasion de mesurer la moyenne entre les dommages et les b&eacute;n&eacute;fices du syst&egrave;me de brevets. Pour eux, les ennuis du syst&egrave;me de brevets auraient &eacute;t&eacute; 10 fois ceux des b&eacute;n&eacute;fices. Je dis auraient &eacute;t&eacute; car IBM par ses &eacute;changes de licences crois&eacute;es &eacute;vite d'avoir &agrave; affronter les ennuis. Ces ennuis sont seulement potentiels. Cela ne leur est pas r&eacute;ellement arriv&eacute;. Mais quand ils mesurent les b&eacute;n&eacute;fices retir&eacute;s pour avoir &eacute;viter ces ennuis, ils les estiment &agrave; 10 fois la valeur de l'argent qu'ils ont retir&eacute; de leurs brevets.

source: This phenomenon of cross-licensing refutes a common myth, the myth of the starving genius. The myth that patents &ldquo;protect&rdquo; the &ldquo;small inventor&rdquo;. Those terms are propaganda terms. You shouldn't use them. The scenario is like this: Suppose there is a brilliant designer of whatever of whatever. Suppose he has spent years starving in the attic designing a new wonderful kind of whatever and now wants to manufacture it and isn't it a shame the big companies are going to go into competition with him, take away all the business and he'll &ldquo;starve&rdquo;. I will have to point out that people in high tech fields are not generally working on their own and that ideas don't come in a vacuum, they are based on ideas of others and these people have pretty good chances of getting a job if they need to these days. So this scenario, the idea that a brilliant idea came from this brilliant person working alone is unrealistic and the idea that he is in danger of starving is unrealistic. But it is conceivable that somebody could have an idea and this idea along with 100 or 200 other ideas can be the basis of making some kind of product and that big companies might want to compete with him. So let's see what happens if he tries to use a patent to stop them. He says &ldquo;Oh No, IBM. You cannot compete with me. I've got this patent. IBM says let's see. Let's look at your product. Hmmm. I've got this patent and this one and this one and this one and this one and this one, which parts of your product infringe. If you think you can fight against all of them in court, I will just go back and find some more. So, why don't you cross license with me?&rdquo; And then this brilliant small inventor says &ldquo;Well, OK, I'll cross license&rdquo;. So he can go back and make these wonderful whatever it is, but so can IBM. IBM gets access to his patent and gets the right to compete with him, which means that this patent didn't &ldquo;protect&rdquo; him at all. The patent system doesn't really do that.
fr: Ce ph&eacute;nom&egrave;ne de licences crois&eacute;es r&eacute;fute un mythe commun, le mythe du g&eacute;nie qui meurt de faim. Le mythe qui dit que les brevets &laquo;&nbsp;prot&egrave;ge&nbsp;&raquo; le &laquo;&nbsp;petit inventeur&nbsp;&raquo;. Ces termes sont des termes de propagande. Vous ne devriez pas les utiliser. Le sc&eacute;nario se pr&eacute;sente comme ceci&nbsp;: supposez qu'il y ait un brillant concepteur de quoi que soit. Supposez qu'il ait pass&eacute; des ann&eacute;es &agrave; mourir de faim dans son grenier pour concevoir un nouveau type de truc formidable et qu'il veuille maintenant le fabriquer&nbsp;; n'est-ce pas une honte que les grosses soci&eacute;t&eacute;s entrent en concurrence avec lui, lui retirant toute l'affaire et qu'il &laquo;&nbsp;meure de faim&nbsp;&raquo;. Je voudrais faire remarquer que les gens dans les domaines de la haute technologie ne travaillent g&eacute;n&eacute;ralement pas seuls dans leur coin et que les id&eacute;es ne viennent pas du n&eacute;ant, elles sont bas&eacute;es sur les id&eacute;es d'autres personnes, lesquelles ont de tr&egrave;s fortes chances d'obtenir un travail si elles en ont besoin de nos jours. Aussi, ce sc&eacute;nario, l'id&eacute;e qu'une id&eacute;e g&eacute;niale vienne &agrave; l'esprit de cette personne brillante travaillant seule est irr&eacute;aliste tout comme celle qu'il serait en danger de mourir de faim. Mais il est concevable que quelqu'un puisse avoir une id&eacute;e et cette id&eacute;e combin&eacute;e avec 100 ou 200 autres id&eacute;es peut &ecirc;tre la base pour faire un produit et que les grosses soci&eacute;t&eacute;s puissent entrer en concurrence avec lui. Alors voyons ce qu'il arrive s'il essaie d'utiliserun brevet pour les arr&ecirc;ter. Il dit&nbsp;: &laquo;&nbsp;Oh non, IBM. Vous ne pouvez pas me concurrencer. J'ai ce brevet. IBM dit voyons cela. Regardons votre produit. Hmmm. J'ai ce brevet et celui-ci, et celui-ci et celui-ci et celui-ci et celui-ci et celui-ci, que des parties de votre produit violent. Si vous pensez que vous pouvez vous battre contre tous ces brevets au tribunal, je ferai juste demi-tour et j'en trouverai d'autres. Alors, pourquoi n'&eacute;changerions-nous pas des licences crois&eacute;es&nbsp;?&nbsp;&raquo;.Et ensuite, ce brillant petit inventeur dit&nbsp;: &laquo;&nbsp;Bien, d'accord, nous croiserons nos licences&nbsp;&raquo;. Alors il peut rentrer et faire son merveilleux truc, mais IBM aussi. IBM a l'acc&egrave;s &agrave; son brevet et a de droit de le concurrencer, ce qui signifie que ce brevet n'a pas du tout &laquo;prot&eacute;g&eacute;&raquo; l'inventeur.Le syst&egrave;me de brevets ne prot&egrave;ge vraiment pas.

source: The mega-corporations avoid, for the most part, the harm of the patent system. They see mainly the good side. That is why they want to have software patents. They are the ones who will benefit from it. But if you are a small inventor or work for a small company, the small company is not going to be able to do this. They try. The problem is that they cannot get enough patents to do this. Any given patent is pointing in a certain direction. So if a small company has patents pointing there, there and there and somebody over there points a patent at them and says give me your money, they are helpless. IBM can do it because with these 9000 patents, they are pointing everywhere, no matter where you are, there is probably an IBM patent pointing at you. So IBM can almost always make you cross license. Small companies can only occasionally make someone cross-license. They will say they want patents for defensive purposes but they won't get enough to be able to defend themselves.
fr: Les tr&egrave;s grosses soci&eacute;t&eacute;s &eacute;vitent, pour la plupart, les d&eacute;g&acirc;ts provoqu&eacute;s par le syst&egrave;me des brevets. Elles n'en voient principalement que le bon c&ocirc;t&eacute;. C'est pourquoi elles veulent avoir des brevets logiciels. Ce sont celles qui en b&eacute;n&eacute;ficient. Mais si vous &ecirc;tes un petit inventeur ou que vous travaillez pour une petite soci&eacute;t&eacute;, la petite soci&eacute;t&eacute; ne sera pas capable de faire cela. Elles essaient. Le probl&egrave;me est qu'elles ne peuvent pas obtenir assez de brevets pour faire cela. Chaque brevet d&eacute;signe une certaine direction. Donc, si une petite soci&eacute;t&eacute; a des brevets qui pointent l&agrave;, l&agrave; et l&agrave; et que quelqu'un dirige un de ses brevets dessus et dit&nbsp;: &laquo;&nbsp;Donnez-moi votre argent&nbsp;&raquo;, il sont impuissants. IBM peut le faire gr&acirc;ce &agrave; ses 9000 brevets, ils d&eacute;signent tout, peu importe o&ugrave; vous vous situez, il y a probablement un brevet IBM qui vous d&eacute;signe. C'est pourquoi IBM peut presque toujours faire des licences crois&eacute;es. Les petites soci&eacute;t&eacute;s ne peuvent qu'occasionnellement faire des licences crois&eacute;es. Elles diront qu'elles veulent des brevets pour se d&eacute;fendre mais elles ne pourront en obtenir suffisamment pour &ecirc;tre capables de se d&eacute;fendre.

source: There are cases where even IBM cannot make someone cross-license. That is when there is a company whose sole business is taking a patent and squeezing money out of people. The company that had the natural order recalculation patent was exactly such a company. Their sole business was to threaten to sue people and collect money from people who were really developing something.
fr: Il y a de cas o&ugrave; m&ecirc;me IBM ne peut pas faire de licences crois&eacute;es. C'est-&agrave;-dire quand il y a une seule soci&eacute;t&eacute; qui a un brevet et qui extorque de l'argent aux gens. La soci&eacute;t&eacute; qui poss&egrave;de le brevet du recalcul en ordre naturel est exactement ce genre de soci&eacute;t&eacute;. Leur seul commerce est de menacer de proc&egrave;s les gens et de r&eacute;colter de l'argent des gens qui font r&eacute;ellement du d&eacute;veloppement.

source: There are no patents on legal procedures. I guess the lawyers understand what a pain it would be to have to deal with the patent system themselves. The result is that there is no way to get a patent to make that company cross license with you. So they go around squeezing everyone. But I guess companies like IBM figure that is part of the price of doing business so they can live with it.
fr: Il n'y a pas de proc&eacute;dures l&eacute;gales pour les brevets. Je pense que les avocats savent la difficult&eacute; que ce serait d'avoir &agrave; traiter avec le syst&egrave;me des brevets eux-m&ecirc;mes. Le r&eacute;sultat est qu'il n'y a aucun moyen d'obtenir un brevet pour forcer une soci&eacute;t&eacute; &agrave; faire des licences crois&eacute;es. Alors, ils circulent et extorquent tout le monde. Mais je pense que des soci&eacute;t&eacute;s comme IBM se disent que c'est le prix &agrave; payer et s'en accommodent.

source: So that is the possibility of licensing a patent which may or may not be possible and you may or may not be able to afford it.
fr: Voil&agrave; donc, en mati&egrave;re de licence des brevets, ce qui peut &ecirc;tre possible ou non et ce que vous pouvez ou non vous permettre.

source: 3) Overturning a patent in court
fr: 3) Invalider le brevet au tribunal

source: Supposedly, in order to be patented, something has to be new, useful and unobvious. That is the language used in the US. I think other countries have different language which is pretty much equivalent to it. Of course, when the patent office gets into the game, they start interpreting new and unobvious. New turns out to mean we don't have it in our files and unobvious tends to mean unobvious to someone with an IQ of 50.
fr: Afin d'obtenir un brevet, l'invention propos&eacute;e est suppos&eacute;e &ecirc;tre nouvelle, utile et non &eacute;vidente. C'est la formulation utilis&eacute;e aux &Eacute;tats-Unis. Je pense que les autres pays utilisent une formulation diff&eacute;rente qui en est tr&egrave;s proche. Bien s&ucirc;r, quand l'office des brevets entre en jeu, ils commencent par interpr&ecirc;ter nouveau et non &eacute;vident. Nouveau finit par signifier nous ne l'avons pas dans nos fichiers et non &eacute;vident finit par signifier non &eacute;vident pour quelqu'un avec un Q.I. de 50.

source: Somebody who studies most of the software patents issued in the US, or at least he used to, I don't know if he can still keep up with them, said that 90% of them wouldn't pass the crystal city test, which meant if the people in the patent office went outside to the news stand and got some computer magazines, they would see that these ideas are already known.
fr: Quelqu'un qui &eacute;tudie la plupart des brevets accord&eacute;s aux &Eacute;tats-Unis, ou du moins, qui le faisait, je ne sais pas s'il arrive toujours &agrave; les suivre, a dit que 90% d'entre eux ne passerait pas le test de la Ville de Cristal, ce qui voulait dire que si quelqu'un de l'office des brevets sortait et allait chez le marchands de journaux acheter quelques magazines d'informatique, il verrait que ces id&eacute;es sont d&eacute;j&agrave; connues.
