Repository: gitGNU/gnu_www-fr
Catalog: philosophy/software-patents.*.po
Languages: fr

source: The first kind of solution, the solution that operates on what types of patents can be valid is a good solution for Europe to use.
fr: Le premier type de solution, la solution qui op&egrave;re sur les types de brevets qui sont valides est une bonne solution &agrave; utiliser pour l'Europe.

source: When the US started having software patents, there was no political debate. In fact, nobody noticed. The software field, for the most part, didn't even notice. There was a supreme court decision in 1981 which considered a patent on a process for curing rubber. The ruling was that the fact that the apparatus included a computer and a program as part of the process to cure the rubber did not make it un-patentable. The appeals court the next year which considers all patent cases, reversed the qualifiers. They said the fact that there is a computer and a program in this makes it patentable. The fact that there is a computer and program in anything makes it patentable. This is why the US started having business procedure patents. This is because the business procedures were carried out on a computer and that made them patentable. So this ruling was made and I think the natural order recalculation patent was one of the first or might have been even the first. Throughout the 80's we didn't know about this.
fr: Quand les &Eacute;tats-Unis ont commenc&eacute; &agrave; avoir des brevets logiciels, il n'y a pas eu de d&eacute;bat politique. En fait, personne ne l'a remarqu&eacute;. Dans le domaine du logiciel, pour la plupart, personne ne l'a m&ecirc;me remarqu&eacute;. Il y a eu une d&eacute;cision de la Cour supr&ecirc;me en 1981 qui traitait d'un brevet sur un processus de vulcanisation de caoutchouc. Le jugement disait que le fait que l'appareillage incluait un ordinateur et un programme comme partie int&eacute;grante du processus pour vulcaniser le caoutchouc ne le rendait pas non brevetable. La Cour d'appel l'ann&eacute;e suivante qui examine tous les cas de brevets annula les restrictions. Elle dit que les fait qu'il y ait un ordinateur et un programme inclus le rendait brevetable. Le fait qu'il y ait un ordinateur et un programme dans n'importe quoi le rendait brevetable. C'est pourquoi les &Eacute;tats-Unis ont commenc&eacute; &agrave; avoir des brevets sur les proc&eacute;d&eacute;s commerciaux. C'est pourquoi les proc&eacute;d&eacute;s commerciaux furent ex&eacute;cut&eacute;s sur ordinateur et que cela les rendaient brevetables. Donc, cette d&eacute;cision &eacute;tait rendue et je pense que le brevet sur le recalcul en ordre naturel &eacute;tait le premier ou avait pu &ecirc;tre le premier. Pendant les ann&eacute;es 1980, nous ne savions pas cela.

source: It was around 1990 that programmers in the US started to become aware that they were faced with a danger from software patents. So i saw how the field worked before and how the field worked after. I saw no particular speed up in progress after 1990. There was no political debate in the US, but in Europe there has been a big political debate. Several years ago there was a push to amend the Munich treaty that established the <a href="http://www.epo.org/"> European Patent Office</a>. It has a <a href="http://www.epo.org/patents/law/legal-texts/html/epc/1973/e/ar52.html"> clause saying that software is not patentable</a>. The push was to amend that to start allowing software patents. But the community took notice of this. It was actually free software developers and free software users who took the lead.
fr: C'est aux environs de 1990 que les d&eacute;veloppeurs aux &Eacute;tats-Unis ont commenc&eacute; &agrave; &ecirc;tre conscients qu'ils affrontaient un danger avec les brevets logiciels. J'ai donc vu comment fonctionnait l'informatique avant et apr&egrave;s. Je n'ai pas vu une acc&eacute;l&eacute;ration particuli&egrave;re apr&egrave;s 1990. Il n'y avait pas de d&eacute;bat politique aux &Eacute;tats-Unis, mais en Europe, il y a eu un grand d&eacute;bat politique. Plusieurs ann&eacute;es auparavant, il y avait eu un effort pour amender le Trait&eacute; de Munich qui &eacute;tablissait le <a href="http://www.european-patent-office.org/index.fr.php">Office europ&eacute;en des brevets</a>. Il y avait une <a href="http://www.european-patent-office.org/legal/epc/f/ar52.html#A52">clause disant que le logiciel n'&eacute;tait pas brevetable</a>. L'effort consistait &agrave; amender cela pour autoriser les brevets logiciels. Mais la communaut&eacute; s'en aper&ccedil;ut. Ce furent en fait les d&eacute;veloppeurs et les utilisateurs de logiciel libres qui prirent la t&ecirc;te de l'opposition.

source: We are not the only ones threatened by software patents. All software developers are threatened by software patents and even software users are threatened by software patents. For instance, Paul Heckel, when Apple wasn't very scared of his threats, he threatened to start suing Apple's customers. Apple found that very scary. They figured they couldn't afford to have their customers being sued like that, even if they would ultimately win. So the users can get sued too, either as a way of attacking a developer or just as a way to squeeze money out of them on their own or to cause mayhem.
fr: Nous ne sommes pas les seuls menac&eacute;s par les brevets logiciels. Tous les d&eacute;veloppeurs de logiciels sont menac&eacute;s par les brevets logiciels et m&ecirc;me les utilisateurs. Par exemple, Paul Heckel, quand Apple n'avait pas tr&egrave;s peur de ses menaces, mena&ccedil;a de commencer &agrave; poursuivre les clients d'Apple. Apple eut tr&egrave;s peur. Ils ont pens&eacute; qu'ils ne pouvaient pas se permettre de voir leurs clients poursuivis comme cela, m&ecirc;me si en fin de compte, ils auraient gagn&eacute;. Donc, les utilisateurs peuvent &ecirc;tre poursuivis aussi, soit comme un moyen d'attaquer un d&eacute;veloppeur ou comme un moyen de leur extorquer de l'argent soit pour semer la pagaille.

source: All software developers and users are vulnerable. But it was the free software community in Europe that took the lead in organizing opposition. In fact, twice now the countries that govern the European Patent Office voted not to amend that treaty. Then the EU took a hand and the directorates of the EU were divided on the issue.
fr: Tous les d&eacute;veloppeurs et les utilisateurs de logiciels sont vuln&eacute;rables. Mais ce fut la communaut&eacute; du logiciel libre en Europe qui prit la t&ecirc;te de l'organisation de l'opposition. En fait, par deux fois maintenant, les pays qui dirigent l'Office europ&eacute;en des brevets ont vot&eacute; pour ne pas amender le trait&eacute;. Alors la Commission europ&eacute;enne s'en m&ecirc;la et les Commissions parlementaires &eacute;taient divis&eacute;es sur le probl&egrave;me.

source: The one whose job is to promote software is against software patents it seems. They were not in charge with this issue. It is the open market directorate who is in charge and is lead by somebody who is in favor of software patents. They basically disregarded public opinion which has been expressed to them. They have proposed a directive to allow software patents.[<a href="#f3">3</a>] The French government has already said they are against it. People who are working in various other governments in Europe to oppose software patents and it is vital to start doing so here.
fr: Celle dont le travail est de promouvoir le logiciel est contre les brevets logiciels semble-t-il. Ils n'&eacute;taient pas en charge de ce probl&egrave;me. C'est la Commission parlementaire juridique et du march&eacute; int&eacute;rieur qui est en charge de cela et qui est men&eacute;e par une personne qui est en faveur des brevets logiciels. En fait, ils ont ignor&eacute; l'opinion publique qui s'&eacute;tait exprim&eacute;e. Ils ont propos&eacute; une directive pour autoriser les brevets logiciels [<a href="#f3">3</a>]. Le gouvernement fran&ccedil;ais a d&eacute;j&agrave; dit qu'il &eacute;tait contre. Les gens qui travaillent dans les divers autres gouvernements s'opposent aux brevets logiciels et il est vital de commencer &agrave; faire la m&ecirc;me chose ici.

source: According to <a href="http://www.ffii.org/~phm/index.en.html">Hartmut Pilch</a>, who is one of the leaders in the European struggle against software patents, the main impetus comes from the <a href="http://www.patent.gov.uk/">UK Patent office</a>. The UK Patent Office is simply biased in favor of software patents. It had a public consultation and most of the responses were opposed to software patents. They then wrote a report saying that people seem to be content with them, completely disregarding the answers. You see, the free software community said please send the answers to them and please send your answers to us too and we'll publish them. So they published these answers which were generally opposed. You'd have never guessed that from the report that the UK Patent Office published.
fr: Selon <a href="http://www.ffii.org/~phm/index.fr.html">Hartmut Pilch</a>, qui est un des leaders dans la bataille europ&eacute;enne contre les brevets logiciels, l'&eacute;lan principal provient de l'<a href="http://www.patent.gov.uk/">Office britannique des brevets</a>. L'Office britannique des brevets est tout simplement partial en faveur des brevets logicels. Il a eu une consultation publique et la plupart des r&eacute;ponses &eacute;taient oppos&eacute;es aux brevets logiciels. Ils ont ensuite &eacute;crit un rapport disant que les gens semblaient en &ecirc;tre satisfaits, ignorant compl&egrave;tement les r&eacute;ponses. Vous voyez, la communaut&eacute; du logiciel libre leur a demand&eacute; de leur envoyer les r&eacute;ponses ainsi qu'&agrave; eux, pour qu'ils puissent les publier. Ils ont alors publi&eacute; ces r&eacute;ponses qui &eacute;taient g&eacute;n&eacute;ralement oppos&eacute;es. Vous n'auriez jamais pu deviner que le rapport que l'Office britannique des brevets a publi&eacute; en &eacute;tait tir&eacute;.

source: They (the UK Patent and Trademark Office) use a term that they call technical effect. This is a term which can stretch tremendously. You are supposed to think it means a program idea would only be patentable if it relates closely to specific physical activities. If that is the interpretation, it would mostly solve the problem. If the only software ideas that can be patented were those that really did relate to a particular technical, specific physical result that you might have patented if you didn't use a program, that would be OK. The problem is that you can stretch that term. You can describe the result you get by running any program as a physical result. How does this physical result different from every other? Well it is as a result of this computation. The result is that the UK Patent Office is proposing something that looks like it leads to mostly solving the problem and really gives carte blanche for patenting almost anything.
fr: Ils (l'Office britannique des brevets et des marques) utilisent un terme qu'ils appellent effet technique. C'est un terme que l'on peut &eacute;tirer &eacute;norm&eacute;ment. Vous &ecirc;tes suppos&eacute; penser que cela signifie qu'une id&eacute;e de programme ne serait brevetable que si elle se rapporte &eacute;troitement &agrave; des activit&eacute;s physiques sp&eacute;cifiques. Si c'est l'interpr&eacute;tation, cela r&eacute;soudrait en grande partie le probl&egrave;me. Si les seules id&eacute;es logicielles qui peuvent &ecirc;tre brevet&eacute;es &eacute;taient celles qui sont vraiment reli&eacute;es &agrave; une technique particuli&egrave;re un r&eacute;sultat physique sp&eacute;cifique que vous auriez pu breveter si vous n'aviez pas utilis&eacute; de programme, ce serait OK. Le probl&egrave;me, c'est que vous pouvez &eacute;tirer ce terme. Vous pouvez d&eacute;crire le r&eacute;sultat que vos obtenez en ex&eacute;cutant un programme comme r&eacute;sultat physique. En quoi ce r&eacute;sultat physique diff&egrave;re de tout autre&nbsp;? Eh bien, c'est le r&eacute;sultat de ce calcul. Ce qui en r&eacute;sulte, c'est que l'Office britannique des brevets propose quelque chose qui semble mener &agrave; resoudre presque tout le probl&egrave;me et qui donne vraiment carte blanche pour breveter pratiquement tout.

source: The people in the same ministry are also involved in the copyright issue which really has nothing to do with software patents except that it is being handled by the same people. It is a question of interpreting the recent EU copyright directive, a horrible law like the <a href="http://www.eff.org/IP/DMCA/">Digital Millennium Copyright Act in the US</a>. But there is some latitude for countries to decide how to implement it. The UK is proposing the most draconian possible way of implementing this directive. You could greatly reduce the harm that it does by implementing it properly. The UK wants to maximize the tyrannical effect of this directive. It seems there is a certain group, the <a href="http://www.dti.gov.uk/">Department of Trade and Industry</a>, who need to be reined in. It is necessary to put a check on their activities. Stop their creating new forms of power.
fr: Les personnes dans le m&ecirc;me minist&egrave;re sont &eacute;galement impliqu&eacute;es dans le probl&egrave;me du droit d'auteur, qui n'a vraiment rien &agrave; voir avec les brevets logiciels except&eacute; qu'il est trait&eacute; par les m&ecirc;mes personnes. C'est une question d'interpr&eacute;tation d'une r&eacute;cente directive europ&eacute;enne sur le copyright, une loi horrible comme la <a href="http://www.eff.org/IP/DMCA/">Digital Millennium Copyright Act aux &Eacute;tats-Unis</a>. Mais il y a une certaine latitude pour les pays pour d&eacute;cider comment la mettre en &oelig;uvre. Le Royaume-Uni propose le moyen le plus draconien pour mettre en &oelig;uvre cette directive. Vous pourriez grandement r&eacute;duire le mal qu'elle fait en la mettant en &oelig;uvre proprement. Le Royaume-Uni veut maximiser l'effet tyrannique de cette directive. Il semble qu'il y ait un certain groupe, le <a href="http://www.dti.gov.uk/">Minist&egrave;re du commerce et de l'industrie</a>, qui a besoin de tirer les r&ecirc;nes. Il est n&eacute;cessaire de v&eacute;rifier leur activit&eacute;, de les emp&ecirc;cher de cr&eacute;er de nouvelles formes de pouvoir.

source: Software patents tie up every software developer and every computer user in a new in a new form of bureaucrat. If the businesses that use computers realized how much trouble this can cause for them, they would be up in arms and I am sure they can stop it. Business doesn't like being tied up in bureaucracy.
fr: Les brevets logiciels attachent chaque d&eacute;veloppeur et chaque utilisateur de logiciel dans une nouvelle forme de bureaucratie. Si les soci&eacute;t&eacute;s qui utilisent des ordinateurs r&eacute;alisaient tous les ennuis que cela peut leur causer, ils partiraient en guerre et je suis s&ucirc;r qu'ils peuvent l'arr&ecirc;ter. Les soci&eacute;t&eacute;s n'aiment pas &ecirc;tre retenues dans la bureaucratie.

source: Sometimes, of course, it serves an important purpose. There are some areas where we wish the UK government did a more careful job in tying certain businesses up in bureaucracy, like when it involves moving animals around.[<a href="#f4">4</a>] But in some cases, when it doesn't serve any purpose except to create artificial monopolies so that somebody can interfere with software development, squeeze money out of developers and users, then we should reject it.
fr: Quelquefois, bien s&ucirc;r, cela sert une cause importante. Il y a certains domaines o&ugrave; nous souhaitons que le gouvernement britannique fasse un travail plus attentif en appliquant la bureaucratie avec certaines soci&eacute;t&eacute;s, comme lorsqu'il s'agit de l'importation d'animaux [<a href="#f4">4</a>]. Mais dans certains cas, cela ne sert aucune cause sauf de cr&eacute;er des monopoles artificiels de sorte que quelqu'un puisse interf&eacute;rer dans le d&eacute;veloppement logiciel, extorquer de l'argent aux d&eacute;veloppeurs et aux utilisateurs, et l&agrave;, nous devons alors le rejeter.

source: We need to make management aware of what software patents will do to them. Get their support in <a href="http://swpat.ffii.org/index.en.html">fighting against software patents in Europe</a>.
fr: Nous devons rendre les directions conscientes de ce que peuvent faire les brevets logiciels. Obtenez leur soutien en <a href="http://swpat.ffii.org/index.fr.html">combattant les brevets logiciels en Europe</a>.

source: The battle is not over. It still can be won.
fr: La bataille n'est pas finie. Elle peut encore &ecirc;tre gagn&eacute;e.

source: Footnotes
fr: Notes

source: There are approximately 300-400 unique parts in an automatic transmission, and a transmission is generally the most complicated component of an auto. To design a transmission may take six months to a year, and even then it may take longer to actually get it built and functioning. However, a program with 500 to 600 functional parts would have 200 to 300 lines of actual code, and would probably take a good programmer a day to a week to write, test and debug.
fr: Il y a approximativement 300 &agrave; 400 pi&egrave;ces uniques dans une transmission automatique et une transmission est g&eacute;n&eacute;ralement le composant le plus compliqu&eacute; dans une auto. Concevoir une transmission peut prendre de six mois &agrave; un an et cela peut m&ecirc;me prendre en fait plus de temps pour la faire construire et fonctionner. Cependant, un programme avec 500 &agrave; 600 parties fonctionnelles a environ 200 &agrave; 300 lignes de code et cela ne prendrait &agrave; un bon programmeur que d'un jour &agrave; une semaine pour &eacute;crire, tester et d&eacute;boguer.

source: I say &ldquo;software patents&rdquo; but what do I really mean? The U.S. patent office doesn't officially divide patents into software patents and other patents. So, in fact, any patent might conceivably get you sued for writing software if it could apply to some software. Software patents are patents that might potentially apply to software, patents that might potentially get you sued for writing software.
fr: Je dis &laquo;&nbsp;brevets logiciels&nbsp;&raquo; mais qu'est-ce que je veux r&eacute;ellement dire&nbsp;? L'Office am&eacute;ricain des brevets ne s&eacute;pare pas officiellement les brevets logiciels des autres brevets. Donc en fait, tout brevet pourrait vous valoir des poursuites pour avoir &eacute;crit du logiciel s'il peut s'appliquer &agrave; un logiciel. Les brevets logiciels sont des brevets qui peuvent s'appliquer potentiellement &agrave; du logiciel, des brevets qui peuvent potentiellement vous valoir des poursuites pour avoir &eacute;crit du logiciel.

source: On 6 July 2005, the European Parliament rejected the software patent directive by 648 out of 680 votes. However, we must not forget the issue of software patents, as those who were pressing for patenting are trying to revive the recently thrown-out directive. We also have to ensure that the European Patent Office (EPO) and the national offices in different EU countries stop conceding patents for software included in other kinds of inventions.
fr: Le 6 juillet 2005, le Parlement europ&eacute;en a rejet&eacute; la directive sur les brevets logiciels par 648 voix sur 680. Cependant, nous ne devons pas oublier le probl&egrave;me des brevets logiciels car ceux qui avaient fait pression pour ce brevetage essaient de ressusciter cette directive rejet&eacute;e r&eacute;cemment. Nous devons aussi nous assurer que l'Office europ&eacute;en des brevets (EPO) et que les divers offices nationaux des diff&eacute;rents pays europ&eacute;ens arr&ecirc;tent d'accorder des brevets pour des logiciels int&eacute;gr&eacute;s dans d'autres sortes d'inventions.

source: To make it harder for foot-and-mouth disease to spread.
fr: Pour limiter la propagation de la fi&egrave;vre aphteuse.

source: This essay is published in <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>.
fr: Cet essai est publi&eacute; dans <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="//contact">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2002 Richard Stallman. <br /> Verbatim copying and distribution of this entire speech is permitted provided this notice is preserved.
fr: Copyright &copy; 2002 Richard Stallman. <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
