Repository: gitGNU/gnu_www-fr
Catalog: philosophy/software-libre-commercial-viability.*.po
Languages: fr

source: Viability for Education Centers
fr: Viabilit&eacute; pour les milieux &eacute;ducatifs

source: Needless to say, schools and universities have the best interest in teaching information technologies using Free Software tools. Due to its technical superiority, Free Software environments have more to offer to the students, but also need more technical knowledge to be proficiently administered. I see no money saved here in choosing Free operating systems over proprietary ones, but educational entities could better spend their money on hiring system administrators than on subsidizing some already-too-wealthy commercial software company. While my country, Italy, is stuck with a few rules that offer more support for buying things rather than for employing people, other countries are already moving in the right direction&mdash;Mexico and France, for example, have announced plans to use GNU/Linux in their public schools.
fr: Inutile de le dire, les &eacute;coles et universit&eacute;s ont le plus grand int&eacute;r&ecirc;t &agrave; enseigner des technologies informatiques utilisant des outils en logiciel libre. Gr&acirc;ce &agrave; leur sup&eacute;riorit&eacute; technique, les environnements de logiciel libre ont plus &agrave; offrir aux &eacute;tudiants, mais n&eacute;cessitent &eacute;galement plus de connaissances techniques pour &ecirc;tre administr&eacute;es de mani&egrave;re comp&eacute;tente. Je ne vois pas d'&eacute;conomies ici par le fait de choisir les syst&egrave;mes d'exploitation libres plut&ocirc;t que propri&eacute;taires, mais les milieux &eacute;ducatifs pourraient mieux utiliser leur argent en embauchant des administrateurs syst&egrave;me plut&ocirc;t que de financer une soci&eacute;t&eacute; de logiciels commerciaux d&eacute;j&agrave; trop riche. M&ecirc;me si mon pays, l'Italie, est coinc&eacute;e par des r&egrave;gles qui facilitent plut&ocirc;t l'achat de choses plut&ocirc;t que l'emploi de personnel, d'autres pays vont d&eacute;j&agrave; dans la bonne direction&nbsp;: Mexico et la France, par exemple, ont annonc&eacute; des projets visant &agrave; l'utilisation de GNU/Linux dans leurs &eacute;coles publiques.

source: One more point leads toward Free Software in education: when students get jobs, they prefer to use tools they learned at school in order to minimize extra learning efforts. This fact should lead colleges to teach only those tools not owned by anyone&mdash;those that are libre. Schools should teach proprietary software only if two conditions apply: no viable alternative is available, and the company that distributes such software <i>pays</i> the school for teaching its product. Paying someone for a product in order to advertising it for him is definitely nonsense.
fr: Un point suppl&eacute;mentaire en faveur des logiciels libres dans l'&eacute;ducation&nbsp;: lorsque les &eacute;tudiants acc&egrave;dent &agrave; un emploi, ils pr&eacute;f&egrave;rent employer les outils qu'ils ont appris &agrave; utiliser &agrave; l'&eacute;cole, pour r&eacute;duire les efforts suppl&eacute;mentaires d'apprentissage. Ce fait seul devrait conduire les &eacute;coles &agrave; n'enseigner que les outils n'appartenant &agrave; personne &mdash;&nbsp;ceux qui sont libres. Les &eacute;coles ne devraient enseigner les logiciels propri&eacute;taires que si deux conditions sont r&eacute;unies&nbsp;: aucune alternative viable n'est disponible, et que la soci&eacute;t&eacute; qui distribue un tel logiciel <i>paie</i> l'&eacute;cole pour qu'elle enseigne ce produit. Payer quelqu'un pour obtenir un produit pour en faire &agrave; sa place la publicit&eacute;, c'est nettement une absurdit&eacute;.

source: Social Issues
fr: Aspects sociaux

source: A few social issues relate to choosing one software model over another one. Although I mark them as social, they have economic implications as well.
fr: Un certain nombre d'aspects sociaux sont li&eacute;s aux choix d'un mod&egrave;le de logiciel plut&ocirc;t qu'un autre. M&ecirc;me si je les consid&egrave;re comme sociaux, ces aspects ont &eacute;galement des implications &eacute;conomiques.

source: While Free Software may not be cheaper than proprietary software if you bill for your own time, some environments use different rates in converting time to money. Most emerging countries have good intellectual resources but little money, and they usually have many not-so-new computers as well. Proprietary operating systems are unaffordable for them, but free solutions are viable and productive. Actually, the &ldquo;Halloween&rdquo; document supports my point by underlining that &ldquo;Linux&rdquo; is growing very fast in the Far East. Charity organizations usually have this same environment&mdash;little money and a good amount of human resources. This leads straight to the Free Software model for any IT requirement.
fr: M&ecirc;me si le logiciel libre peut ne pas &ecirc;tre meilleur march&eacute; que les logiciels propri&eacute;taires si vous facturez votre temps pass&eacute;, certains environnements utilisent des rapports diff&eacute;rents pour convertir le temps en argent. La plupart des pays en voie de d&eacute;veloppement poss&egrave;dent de bonnes ressources intellectuelles et peu d'argent, et ils ont g&eacute;n&eacute;ralement aussi beaucoup d'ordinateurs pas tr&egrave;s neufs. Les syst&egrave;mes d'exploitation propri&eacute;taires sont &agrave; des prix inabordables pour eux, mais les solutions libres sont viables et productives. En fait, les &laquo;&nbsp;<a href="http://www.opensource.org/halloween/">Documents Halloween</a>&nbsp;&raquo; confirment mon point de vue lorsqu'ils soulignent que &laquo;&nbsp;Linux&nbsp;&raquo; se r&eacute;pand tr&egrave;s rapidement dans les pays de l'Extr&ecirc;me Orient. Les organisations humanitaires se situent habituellement dans un environnement identique&nbsp;: peu de moyens financiers et un nombre important de ressources humaines. Ceci conduit directement au mod&egrave;le du logiciel libre pour tout besoin en informatique (IT).

source: These ideas will probably suggest that free availability of information looks fairly leftist in spirit, as &ldquo;information to the masses&rdquo; looks quite similar to the old adage &ldquo;power to the masses&rdquo;. What is usually ignored is the strong rightist flavour of the Free Software movement. The Free Software arena is fiercely meritocratic and a perfect environment for free competition, where the laws of the market ensure that only the best ideas and the best players survive. Proprietary standards, on the other hand, tend to diminish competition by decreasing innovation and consolidating previous results.
fr: Ces id&eacute;es sugg&egrave;rent sans doute que le libre acc&egrave;s &agrave; l'information a l'air d'&ecirc;tre une id&eacute;e de gauche dans l'esprit, tout comme l'expression &laquo;&nbsp;information pour les masses&nbsp;&raquo; ressemble au vieil adage &laquo;&nbsp;le pouvoir aux masses&nbsp;&raquo;. Ce qui est g&eacute;n&eacute;ralement ignor&eacute;, c'est le fort parfum de droite du mouvement du logiciel libre. Le domaine du logiciel libre est fortement &laquo;m&eacute;ritocratique&raquo; et un environnement parfait pour une libre comp&eacute;tition, o&ugrave; les lois de march&eacute; assurent que seules les meilleures id&eacute;es et les meilleurs joueurs survivront. La fa&ccedil;on de voir dans le propri&eacute;taire, d'un autre c&ocirc;t&eacute;, tend &agrave; restreindre la comp&eacute;tition en r&eacute;duisant l'innovation et en consolidant les r&eacute;sultats pr&eacute;c&eacute;dents.

source: Limits of the Free Software Model
fr: Limites du mod&egrave;le logiciel libre

source: Naturally, I'm aware that not every software package can easily be turned into Free Software. I'm not talking about office products&mdash;I'm confident some good projects will supply this need, sooner or later.
fr: Naturellement, je suis au courant que tous les paquetages de logiciels ne peuvent pas facilement se tourner vers le logiciel libre. Je ne parle pas des produits bureautiques &mdash;&nbsp;je suis confiant dans le fait que de bons projets combleront ce manque, t&ocirc;t ou tard.

source: Rather, I'm talking about all environments where a strong competition exists for a product only loosely based on its software component. For example, industrial equipment might include a computer and some commodity hardware (a robot, custom I/O peripherals, <abbr title="Programmable logic controller">PLC</abbr>s, etc.); the software application hosted in the computer is a minor part of the whole, but its features greatly affect the overall value of the equipment. Producing and debugging such applications usually require huge investments; free redistribution of source code is thus prevented as a form of protection against competitors.
fr: Je parle plut&ocirc;t de tous les environnements o&ugrave; existe une forte comp&eacute;tition pour un produit &agrave; peine bas&eacute; sur son composant logiciel. Par exemple, un &eacute;quipement industriel peut comporter un ordinateur et un peu de hardware appropri&eacute; (un robot, un p&eacute;riph&eacute;rique d'entr&eacute;e/sortiesp&eacute;cialis&eacute;, des <abbr title="Programmable logic controller">PLC</abbr>, etc). L'application logicielle h&eacute;berg&eacute;e sur l'ordinateur est une partie minoritaire de l'ensemble, mais ses fonctionnalit&eacute;s d&eacute;terminent grandement la valeur globale de cet &eacute;quipement. Produire et d&eacute;boguer de telles applications demandent la plupart du temps des investissements consid&eacute;rables. La libre redistribution du code source est donc emp&ecirc;ch&eacute;e, sous la forme d'une protection contre la concurrence.

source: Another meaningful example is cell telephones. They include a lot of software, even though this software is almost invisible to the end user, who perceives the device as a telephone and not a computer. Such software is the component that defines the overall capabilities of the device; because of its major functional role in the device it is strictly proprietary.
fr: Un autre exemple significatif est celui des t&eacute;l&eacute;phones portables. Ils incluent beaucoup de logiciel, m&ecirc;me s'ils sont quasiment invisibles &agrave; l'utilisateur final, qui per&ccedil;oit l'engin comme un t&eacute;l&eacute;phone et pas comme un ordinateur. Un tel logiciel est le composant qui d&eacute;finit les capacit&eacute;s globalesde l'appareil. &Agrave; cause de son r&ocirc;le principalement fonctionnel dans l'appareil, il est strictement propri&eacute;taire.

source: Unfortunately, I see no easy way to liberalize this type of code. Although I don't care too much about cell phones (I don't use them :), I would really like to see free industrial applications because their technological content is usually worth reusing and adapting to new problems.
fr: Malheureusement, je ne vois pas de moyen facile de lib&eacute;rer ce type de code. M&ecirc;me si je ne me tracasse pas trop &agrave; propos des t&eacute;l&eacute;phones portables (Je ne les utilise pas :-)), je souhaiterais vraiment voir des applications industrielles libres, parce que leur contenu technologique vaut g&eacute;n&eacute;ralement la peine d'&ecirc;tre r&eacute;utilis&eacute; et adapt&eacute; &agrave; de nouveaux probl&egrave;mes.

source: Alessandro writes Free Software for a living and advocates Free Software for a mission. He hopes his upcoming child will keep off computers, recalling the good old times when such beasts where confined to their technical zoos. He reads e-mail as <a href="mailto:rubini@gnu.org">&lt;rubini@gnu.org&gt;</a> trying to reply to everyone.
fr: Alessandro cr&eacute;e des logiciels libres pour vivre et pr&eacute;conise le logiciel libre comme une mission. Il esp&egrave;re que son enfant qui va na&icirc;tre restera &agrave;l'&eacute;cart des ordinateurs, en se rappelant le bon vieux temps o&ugrave; de telles b&ecirc;tes &eacute;taient confin&eacute;es dans leurs zoos techniques. On peut lui adresser des courriels &agrave; rubini&#64;gnu.org et il essaie de r&eacute;pondre &agrave; tout le monde.

source: Reprinted with permission of Linux Journal.
fr: Reproduit avec la permission du Linux Journal.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and redistribution of this entire article are permitted in any medium provided this notice and the copyright notice are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Christophe Chisogne.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
