Repository: gitGNU/gnu_www-fr
Catalog: philosophy/speeches-and-interview.*.po
Languages: fr

source: Philosophy of the GNU Project - GNU Project - Free Software Foundation (FSF)
fr: Philosophie du Projet GNU - GNU Project - Free Software Foundation (FSF)

source: Speeches and Interviews (in reverse chronological order)
fr: Discours et entretiens (en ordre chronologique inverse)

source: <a href="http://broadcast.oreilly.com/2009/04/stallman-discusses-free-softwa.html">Transcript of an interview with Richard Stallman</a> conducted by Federico Biancuzzi for O'Reilly Media. As well as a wide-ranging discussion of developments in Free Software licencing the interview covers issues including the history and current activities of the FSF, the spread of DMCA-like laws around the world, software patents and the need for free device drivers.
fr: <a href="http://broadcast.oreilly.com/2009/04/stallman-discusses-free-softwa.html">Transcription d'un entretien avec Richard Stallman</a> mené par Federico Biancuzzi pour O'Reilly Media. L'entretien couvre une discussion large sur les licences de logiciels libres ainsi que l'histoire et les activités actuelles de la FSF, l'expansion de lois similaires à la loi DMCA dans le monde, les brevets logiciels et le besoin de pilotes de périphériques libres.

source: <a href="http://nb.inode.co.nz/articles/rmsrnz/index.html">Transcript of an interview</a> with Richard Stallman for Radio New Zealand, conducted by Kim Hill on August 9, 2008. It covers various topics &mdash; free software, the dawn of the free software movement, the fallacy of the term &ldquo;intellectual property&rdquo;, Google's services and New Zealand's Copyright laws.
fr: <a href="http://nb.inode.co.nz/articles/rmsrnz/index.html">Transcription d'un entretien</a> avec Richard Stallman sur Radio New Zealand, men&eacute; par Kim Hill le 9 ao&ucirc;t 2008. Il couvre divers sujet&nbsp;: les logiciels libres, la naissance du mouvement pour le logiciel libre, l'idée fausse du terme «&nbsp;propriété intellectuelle&nbsp;», les services de Google et les lois sur le droit d'auteur en Nouvelle Zélande.

source: <a href="http://www.zeuux.org/philosophy/billxu-rms-fsm-ancient-to-gplv2.html"> Free Software Movement: From Genesis to the GNU GPL version 2</a>, an interview with Richard Stallman conducted by Bill Xu (<a href="http://www.zeuux.org/philosophy/billxu-rms-fsm-ancient-to-gplv2.cn.html">Chinese version</a> also available).
fr: <a href="http://www.zeuux.org/philosophy/billxu-rms-fsm-ancient-to-gplv2.html">Mouvement du logiciel libre&nbsp;: De la g&eacute;n&egrave;se de la GNU GPL version 2</a>,un entretien de Richard Stallman contient par Bill Xu (La <a href="http://www.zeuux.org/philosophy/billxu-rms-fsm-ancient-to-gplv2.cn.html">version chinoise</a> est &eacute;galement disponible).

source: <a href="http://audio-video.gnu.org/video/copy_vs_comm.ogg">Video recording of Copyright vs. Community speech</a> with <a href="http://audio-video.gnu.org/video/copy_vs_comm.txt">brief text description</a>, given by Richard Stallman on July 5, 2007 in Missassauga, Ontario, Canada.
fr: <a href="http://audio-video.gnu.org/video/copy_vs_comm.ogg">Enregistrement vid&eacute;o du discours Copyright contre communaut&eacute;</a> avec une <a href="http://audio-video.gnu.org/video/copy_vs_comm.txt">br&egrave;ve description</a>, donn&eacute; par Richard Stallman le 5 juillet 2007 &agrave; Missassauga, Ontario, Canada.

source: <a href="/philosophy/rms-kol.html">Transcript of a speech</a> given by <a href="http://www.stallman.org">Richard Stallman</a> about free software and the West Bengal government, in Kolkata (formerly Calcutta) on August, 2006.
fr: <a href="/philosophy/rms-kol.fr.html">Transcription d'un discours</a> donn&eacute; par <a href="http://www.stallman.org"> Richard Stallman</a> &agrave; Kolkata (anciennement Calcutta) en ao&ucirc;t 2006.

source: <a href="http://questionsplease.org/Questions_please_1.ogg">Jonathan Roberts interviews Richard Stallman and others</a> on free software.
fr: <a href="http://questionsplease.org/Questions_please_1.ogg">Johnathan Roberts s'entretient avec Richard Stallman et d'autres</a> sur les logiciels libres.

source: <a href="http://www.zeuux.org/law/billxu-rms-drm.html">Bill Xu interviews Richard Stallman on DRM</a>. You can also read it <a href="http://www.zeuux.org/law/billxu-rms-drm.cn.html">in Chinese</a>.
fr: <a href="http://www.zeuux.org/law/billxu-rms-drm.html">Bill Xu s'entretient avec Richard Stallman sur les DRM</a>. Vous pouvez aussi consulter cet entretien <a href="http://www.zeuux.org/law/billxu-rms-drm.cn.html">en chinois</a>.

source: Eben Moglen, <a href="http://punkcast.com/964/">&ldquo;Free Software and Free Media&rdquo;</a>, at the Jefferson Market Library in New York, New York, May 3, 2006 for the Metropolitan NY Chapter of the Internet Society
fr: Eben Moglen, <a href="http://punkcast.com/964/">&laquo;&nbsp;Free Software and Free Media&nbsp;&raquo;</a>(Logiciels libres et m&eacute;dias libres), &agrave; labiblioth&egrave;que Jefferson Market Library de New York, le 3 mai 2006 pour le Metropolitan NY Chapter of the Internet Society.

source: <a href="http://www.zmag.org/content/showarticle.cfm?SectionID=13&amp;ItemID=9350"> Richard Stallman interviewed</a> by Justin Podur on &ldquo;Free Software as a Social Movement&rdquo;, 01 December 2005
fr: <a href="http://www.zmag.org/content/showarticle.cfm?SectionID=13&amp;ItemID=9350">Interview de Richard Stallman</a> par Justin Podur sur &laquo;&nbsp;Le logiciel libre en tant que mouvement social&nbsp;&raquo;, le 1er d&eacute;cembre 2005

source: <a href="http://www.oreillynet.com/lpt/a/6222">Richard Stallman interviewed</a> by Federico Biancuzzi about the importance of the GPL, for ONLamp.com, 22 September 2005
fr: <a href="http://www.oreillynet.com/lpt/a/6222">Richard Stallman interrog&eacute;</a> par Federico Biancuzzi pour ONLamp.com, le 22 septembre 2005.

source: <a href="http://wm-eddie.info/rms.html">Presentation of the goals and philosophy of the GNU operating system</a> by <a href="http://www.stallman.org">Richard Stallman</a> in University of Pittsburgh, April 7th 2005
fr: <a href="http://wm-eddie.info/rms.html">Pr&eacute;sentation des buts et de la philosophie du syst&egrave;me d'exploitation GNU</a> par <a href="http://www.stallman.org">Richard Stallman</a> &agrave; l'Universit&eacute; de Pittsburgh, le 7 avril 2005.

source: <a href="http://www.stallman.org">Richard Stallman</a>'s <a href="http://www.ofb.biz/modules.php?name=News&amp;file=article&amp;sid=353"> interview</a> with Timothy R. Butler on &ldquo;The state of GNU/Linux&rdquo;, 31 March 2005.
fr: Entretien de <a href="http://www.stallman.org">Richard Stallman</a><a href="http://www.ofb.biz/modules.php?name=News&amp;file=article&amp;sid=353"> avec Timothy R. Butler</a> le 31 mars 2005.

source: <a href="/philosophy/nit-india.html">Transcript of a speech</a> on free software given by <a href="http://www.stallman.org"> Richard M. Stallman</a> at National Institute of Technology, Trichy, India, 17 February 2004.
fr: <a href="/philosophy/nit-india.fr.html">Transcription d'un discours</a> donn&eacute; par <a href="http://www.stallman.org">Richard M. Stallman</a>au National Institute of Technology, Trichy, Inde, le 17 f&eacute;vrier 2004.

source: <a href="http://www.stallman.org">Richard Stallman</a>'s <a href="http://www.neteco.com/50117-richard-gnu-stallman-president-de-la-free-software-foundation.html"> interview with NetEconomie.com</a> (In French) 10 December 2004
fr: Entretien de <a href="http://www.stallman.org">Richard Stallman</a><a href="http://www.neteco.com/50117-richard-gnu-stallman-president-de-la-free-software-foundation.html">avec NetEconomie.com</a> le 10 décembre 2004.

source: <a href="patent-practice-panel.html">Transcript of a panel presentation</a>, &ldquo;New developments in patent practice: assessing the risks and cost of portfolio licensing and hold-ups&rdquo;, given by Daniel B. Ravicher as the executive director of the Public Patent Foundation on Wednesday, November 10, 2004, at a conference organized by the Foundation for a Free Information Infrastructure (FFII) in Brussels, Belgium
fr: <a href="/philosophy/patent-practice-panel.fr.html">Transcription d'une pr&eacute;sentation &agrave; la table ronde</a>, &laquo;&nbsp;Nouveaux d&eacute;veloppements dans la pratique des brevets&nbsp;: &eacute;valuer les risques et les co&ucirc;ts d'un portefeuille de licences et de hold-ups&nbsp;&raquo;, donn&eacute; par Daniel B. Ravicher en tant que directeur g&eacute;n&eacute;ral de la Public Patent Foundation le mercredi 10 novembre 2004, lors d'une conf&eacute;rence organis&eacute;e par la Foundation for a Free Information Infrastructure (FFII) &agrave; Bruxelles, Belgique.

source: <a href="http://www.ariel.com.au/a/rms-unsw.html">Synopsis of a speech</a> given by <a href="http://www.stallman.org">Richard M. Stallman</a> about software patents on 14 October 2004.
fr: <a href="http://www.ariel.com.au/essays/rms-unsw-2004-10-14.html">R&eacute;sum&eacute; d'un discours</a> donn&eacute; par <a href="http://www.stallman.org">Richard M. Stallman</a> sur les brevets logiciels le 14 octobre 2004.

source: <a href="/philosophy/rms-interview-edinburgh.html">Interview</a> with Richard Stallman that took place at the School of Informatics, Edinburgh University, on 27<sup>th</sup> May 2004. Originally published at Indymedia, most of the questions are about the the relationship between the free software movement and other social movements, and the different values of the &ldquo;open source&rdquo; campaign.
fr: <a href="/philosophy/rms-interview-edinburgh.fr.html">Entretien</a> avec Richard Stallman &agrave; la School of Informatics, université d'Édimbourg, le 27 mai 2004. Initialement publié sur Indymedia, la plupart des questions porte sur le mouvement pour le logiciel libre et les autres mouvements sociaux, et les valeurs différentes pour la campagne pour l'«&nbsp;open source&nbsp;».

source: <a href="http://laurel.datsi.fi.upm.es/~fsanchez/rms/" > Web page with interviews/audio/video from speeches in Madrid (May 2004)</a> given by <a href="http://www.stallman.org">Richard M. Stallman</a> (site is in Spanish)
fr: <a href="http://laurel.datsi.fi.upm.es/~fsanchez/rms/">Page Web avec des entretiens audio et vid&eacute;o de discours donn&eacute;s &agrave; Madrid (en mai 2004)</a> par <a href="http://www.stallman.org">Richard M. Stallman</a> (le site est en espagnol).

source: <a href="/philosophy/moglen-harvard-speech-2004.html" >Transcript of a speech</a> about copyright law and SCO given by <a href="http://emoglen.law.columbia.edu/" >Prof. Eben Moglen</a> at Harvard on 23 February, 2004.
fr: <a href="/philosophy/moglen-harvard-speech-2004.fr.html">Transcription d'un discours</a> donn&eacute; par le <a href="http://emoglen.law.columbia.edu/">Professeur Eben Moglen</a> &agrave; Harvard le 23 f&eacute;vrier 2004.

source: <a href="/philosophy/wsis-2003.html">Transcript of a speech</a> about free software and sustainable development given by <a href="http://www.stallman.org">Richard M. Stallman</a> at WSIS, 16 July 2003.
fr: <a href="/philosophy/wsis-2003.fr.html">Transcription d'un discours</a> sur les logiciels libres et le développement durable donn&eacute; par <a href="http://www.stallman.org">Richard M. Stallman</a> au SMSI, le 16 juillet 2003.

source: <a href="/philosophy/rieti.html">Transcript of a speech</a> about the future of free software given by <a href="http://www.stallman.org">Richard M. Stallman</a>, 21 April 2003.
fr: Transcription d'un <a href="/philosophy/rieti.fr.html">discours</a> donn&eacute; par <a href="http://www.stallman.org">Richard M. Stallman</a> le 21 avril 2003.

source: <a href="http://audio-video.gnu.org/audio/audio.html#RUTGERS2003">Audio recording of a speech, <cite>Software Freedom and the GNU Generation</cite>, given by Bradley M. Kuhn</a> 22 April 2003.
fr: <a href="http://audio-video.gnu.org/audio/audio.html#RUTGERS2003">Enregistrement audio d'un discours, <cite>Software Freedom and the GNU Generation</cite>, donn&eacute; par Bradley M. Kuhn</a> le 22 avril 2003.

source: <a href="/philosophy/2002-linuxexpo-paris.fr.html">Transcript of a speech</a> given <em>in French</em> by Richard Stallman at &ldquo;LinuxExpo&rdquo;, Paris, 2002.
fr: <a href="/philosophy/2002-linuxexpo-paris.fr.html">Transcription d'un discours</a> donn&eacute; <em>en fran&ccedil;ais</em> par Richard Stallman &agrave; &laquo;&nbsp;LinuxExpo&nbsp;&raquo;, Paris, 2002.

source: <a href="http://audio-video.gnu.org/audio/audio.html#CAMB2002">Audio recording of a speech, <cite>Software Patents:Obstacles to software development</cite>, given by Richard M. Stallman at the University of Cambridge, England</a> 25th March 2002. A <a href="/philosophy/software-patents.html">transcript of the speech</a> is also available.
fr: <a href="http://audio-video.gnu.org/audio/audio.html#CAMB2002">Enregistrement audio d'une conf&eacute;rence en anglais, <cite>Software Patents: Obstacles to software development</cite>, donn&eacute;e par Richard M. Stallman &agrave; l'Universit&eacute; de Cambridge, Angleterre</a> le 25 mars 2002. Une <a href="/philosophy/software-patents.fr.html">transcription du discours</a> est &eacute;galement disponible.

source: <a href="http://www.stallman.org">Richard Stallman</a> interview in 2002, talking about <a href="/philosophy/rms-hack.html">the hacker community and ethics </a>, this interview is also <a href="http://www.uta.fi/~fiteva/rms_int_fi.html">available in Finnish</a>.
fr: <a href="http://www.stallman.org">Richard Stallman</a> entretien de 2002 sur <a href="/philosophy/rms-hack.fr.html">&eacute;thique et communaut&eacute; du hacker</a>, cet entretien est aussi <a href="http://www.uta.fi/~fiteva/rms_int_fi.html">disponible en finnois</a>.

source: <a href="http://www.stallman.org">Richard Stallman</a>'s <a href="http://www.mytech.it/mytech/internet/art006010045404.jsp"> interview, <cite>Perch&eacute; l'open source non &egrave; tutto</cite>, in italian,</a> to the Mytech website, 22 April 2003. (The title reads, <cite>Because Open Source is not all</cite>.)
fr: Entretien de <a href="http://www.stallman.org">Richard Stallman</a><a href="http://www.mytech.it/mytech/internet/art006010045404.jsp"><cite>Perch&eacute; l'open source non &egrave;tutto</cite> (<cite>Parce que l'open source n'est pas tout</cite>.), en italien,</a> sur le site Web Mytech, le 22 avril 2003.

source: <a href="http://audio-video.gnu.org/audio/audio.html#QMUL2002">Audio recording of a speech, <cite>Copyright vs Community in the age of computer Networks</cite>, given by Richard M. Stallman at Queen Mary University of London, England</a> 12th Feb 2002.
fr: <a href="http://audio-video.gnu.org/audio/audio.html#QMUL2002">Enregistrement audio d'une conf&eacute;rence en anglais, <cite>Copyright vs Community in the age of computer Networks</cite>, donn&eacute;e par Richard M. Stallman &agrave; la Queen Mary University de Londres, Angleterre</a> le 12 f&eacute;vrier 2002.

source: <a href="http://audio-video.gnu.org/audio/francais/rms-speech-paris-30-jan-2002.ogg">Audio recording in French of a speech, <cite>l'&eacute;thique du syst&egrave;me GNU/Linux et de la communaut&eacute; des logiciels libres, les t&acirc;ches &agrave; accomplir et les risques &agrave; envisager</cite>, given by Richard M. Stallman at CNIT &agrave; la D&eacute;fense, Paris, France.</a> 27th Jan 2002. (A number of other speeches in several languages are also available on <a href="http://audio-video.gnu.org/">audio-video.gnu.org</a>.
fr: <a href="http://audio-video.gnu.org/audio/francais/rms-speech-paris-30-jan-2002.ogg">Enregistrement audio d'une conf&eacute;rence en fran&ccedil;ais, <cite>l'&eacute;thique du syst&egrave;me GNU/Linux et de la communaut&eacute; des logiciels libres, les t&acirc;ches &agrave; accomplir et les risques &agrave; envisager</cite>, donn&eacute;e par Richard M. Stallman au CNIT &agrave; la D&eacute;fense, Paris, France.</a> le 27 janvier 2002. (D'autres discours en d'autres langues sont aussi disponibles sur <a href="http://audio-video.gnu.org/">audio-video.gnu.org</a>.

source: <a href="http://www.april.org/actions/rms/20011120/stream.html">Audio recordings and a partial transcript</a> of the conference given by <a href="http://www.stallman.org">Richard M. Stallman</a> to the French National Assembly on 20th November 2001.
fr: <a href="http://www.april.org/actions/rms/20011120/stream.html">Enregistrement audio et transcription partielle d'une</a> conf&eacute;rence donn&eacute;e par <a href="http://www.stallman.org">Richard M. Stallman</a> l'Assembl&eacute;e Nationale fran&ccedil;aise le 20 novembre 2001.

source: <a href="/philosophy/stallman-mec-india.html">Transcript of the speech, <cite>The Danger of Software Patents</cite></a> by <a href="http://www.stallman.org">Richard M. Stallman</a> given at Government Model Engineering College, India on 24th July 2001. Also, the MEC has posted an <a href="http://www.mec.ac.in/events/rms/">audio recording and transcript</a> at their website.
fr: <a href="/philosophy/stallman-mec-india.html">Transcription du discours, <cite>The Danger of Software Patents</cite>(<cite>Le danger des brevets logiciels</cite>)</a> par <a href="http://www.stallman.org">Richard M. Stallman</a> donn&eacute; au Government Model Engineering College, Inde le 24 juillet 2001. &Eacute;galement, le MEC a publi&eacute; un <a href="http://www.mec.ac.in/events/rms/">enregistrement audio et une transcription</a> sur leur site Web

source: <a href="http://www.stallman.org">Richard Stallman</a>'s <a href="/philosophy/luispo-rms-interview.html"> interview</a> about free software and business with Louis Suarez-Potts in May of 2001.
fr: <a href="/philosophy/luispo-rms-interview.fr.html">Interview</a> de <a href="http://www.stallman.org">Richard Stallman</a> par Louis Suarez-Potts en Mai 2001.

source: <a href="http://audio-video.gnu.org/audio/audio.html#NYU2001">Audio recording of a speech, <cite>Free Software: Freedom and Cooperation</cite>, given by Richard M. Stallman at New York University</a>. A <a href="/events/rms-nyu-2001-transcript.html">transcript of the speech</a> is also available.
fr: <a href="http://audio-video.gnu.org/audio/audio.html#NYU2001">Enregistrement audio d'une conf&eacute;rence en anglais, <cite>Free Software: Freedom and Cooperation</cite>, donn&eacute;e par Richard M. Stallman &agrave; l'Universit&eacute; de New York</a>. Une <a href="/events/rms-nyu-2001-transcript.fr.html">transcription de la conf&eacute;rence</a> est &eacute;galement disponible.

source: <a href="/philosophy/copyright-and-globalization.html">Transcript of a speech, <cite>Copyright and Globalization in the Age of Computer Networks</cite>, given by Richard M. Stallman at MIT</a>.
fr: <a href="/philosophy/copyright-and-globalization.fr.html">Transcription d'une conf&eacute;rence, <cite>Droit d'auteur et mondialisation &agrave; l'&acirc;ge des r&eacute;seaux informatiques</cite>, donn&eacute;e par Richard M. Stallman au MIT</a>.

source: <a href="http://audio-video.gnu.org/audio/audio.html#MIT2001">Audio recording of a speech, <cite>Copyright and Globalization in the Age of Computer Networks</cite>, given by Richard M. Stallman at MIT</a>.
fr: <a href="http://audio-video.gnu.org/audio/audio.html#MIT2001">Enregistrement audio d'une conf&eacute;rence en anglais, <cite>Copyright and Globalization in the Age of Computer Networks</cite>, donn&eacute;e par Richard M. Stallman au MIT</a>.

source: <a href="http://audio-video.gnu.org/audio/audio.html#ArsDigita2001">Audio recording of a speech, <cite>The Free Software Movement and the GNU/Linux Operating System</cite>, given by Richard M. Stallman at ArsDigita University</a>.
fr: <a href="http://audio-video.gnu.org/audio/audio.html#ArsDigita2001">Enregistrement audio d'une conf&eacute;rence en anglais, <cite>The Free Software Movement and the GNU/Linux Operating System</cite>, donn&eacute;e par Richard M. Stallman &agrave; l'Universit&eacute; ArsDigita</a>.

source: <a href="http://audio-video.gnu.org/audio/audio.html#SLOV2000">Audio recording of a speech, <cite>The Free Software Movement and the GNU/Linux Operating System</cite>, given by Richard M. Stallman at Auditorium Smelt, Ljubljana, Slovenia</a>.
fr: <a href="http://audio-video.gnu.org/audio/audio.html#SLOV2000">Enregistrement audio d'un discours, <cite>The Free Software Movement and the GNU/Linux Operating System</cite> (<cite>Le mouvement du logiciel libre et le syst&egrave;me d'exploitation GNU/Linux</cite>), donn&eacute; par Richard M. Stallman &agrave; l'Auditorium Smelt, Laybach, Slov&eacute;nie</a>.

source: <a href="http://audio-video.gnu.org/audio/audio.html#LinuxTag2000">Audio recording of a speech, <cite>The Free Software Movement and the GNU/Linux Operating System</cite>, given by Richard M. Stallman at LinuxTag 2000</a>.
fr: <a href="http://audio-video.gnu.org/audio/audio.html#LinuxTag2000">Enregistrement audio d'une conf&eacute;rence en anglais, <cite>The Free Software Movement and the GNU/Linux Operating System</cite>, donn&eacute;e par Richard M. Stallman au LinuxTag 2000</a>.

source: <a href="http://audio-video.gnu.org/audio/audio.html#CGLUG2000">Audio recording of a speech, <cite>The Free Software Movement and the GNU/Linux Operating System</cite>, given by Richard M. Stallman at the University of Cincinnati</a>.
fr: <a href="http://audio-video.gnu.org/audio/audio.html#CGLUG2000">Enregistrement audio d'une conf&eacute;rence en anglais, <cite>The Free Software Movement and the GNU/Linux Operating System</cite>, donn&eacute;e par Richard M. Stallman &agrave; l'Universit&eacute; de Cincinnati</a>.

source: <a href="http://www.april.org/actions/rms/10111998/texte.html">Transcription (in French)</a> of a speech that <a href="http://www.stallman.org/">Richard Stallman</a> gave in 1998 at the University of Paris.
fr: <a href="http://www.april.org/actions/rms/10111998/texte.html">Transcription</a> d'un discours que <a href="http://www.stallman.org/">Richard Stallman</a> a donné en 1998 à l'Université Paris 8 de Saint Denis.

source: <a href="/philosophy/greve-clown.html">English translation of a speech</a> about the history and philosophy of the GNU Project that Georg Greve gave in 1998 at the GNU/Linux Cluster &ldquo;CLOWN&rdquo; in Germany (<a href="/philosophy/greve-clown.de.html">German original</a>).
fr: <a href="/philosophy/greve-clown.fr.html">Traduction d'un discours en allemand</a> que Georg Greve a donn&eacute; en 1998 au GNU/Linux Cluster &laquo;&nbsp;CLOWN&nbsp;&raquo; en Allemagne (<a href="/philosophy/greve-clown.de.html">original en allemand</a>).

source: <a href="/gnu/byte-interview.html">BYTE Interview</a> in July 1986 with <a href="http://www.stallman.org/">Richard Stallman</a> about the development of the GNU system.
fr: <a href="/gnu/byte-interview.fr.html">Entretien pour BYTE</a>en juillet 1986 avec <a href="http://www.stallman.org/">Richard Stallman</a> sur le développement du système GNU.

source: A <a href="/philosophy/stallman-kth.html">speech</a> that <a href="http://www.stallman.org/">Richard Stallman</a> gave in 1986 at the Royal Institute of Technology in Sweden about the hacker community and the early days of the free software movement.
fr: Une <a href="/philosophy/stallman-kth.fr.html">conf&eacute;rence</a> que <a href="http://www.stallman.org/">Richard Stallman</a> a donn&eacute;e en 1986 &agrave; l'Institut royal de technologie de Su&egrave;de sur la communauté des hackers et sur les premiers jours du mouvement pour le logiciel libre.

source: An <a href="http://audio-video.gnu.org/audio/francais">index of French recordings at audio-video.gnu.org</a> is also available.
fr: Un <a href="http://audio-video.gnu.org/audio/francais">index des enregistrements en fran&ccedil;ais &agrave; audio-video.gnu.org</a> est &eacute;galement disponible.
