Repository: gitGNU/gnu_www-fr
Catalog: philosophy/stallman-kth.*.po
Languages: fr

source: Speech in Sweden - GNU Project - Free Software Foundation (FSF)
fr: Conf&eacute;rence en Su&egrave;de - GNU Project - Free Software Foundation (FSF)

source: RMS lecture at KTH (Sweden), 30 October 1986
fr: Conf&eacute;rence de RMS au KTH (Su&egrave;de), le 30 octobre 1986

source: <em>(Kungliga Tekniska H&ouml;gskolan (Royal Institute of Technology))<br /> Stockholm, Sweden</em>
fr: <em>(Kungliga Tekniska H&ouml;gskolan (Institut Royal de Technologies))<br />Stockholm Su&egrave;de</em>

source: <em> Arranged by the student society<br /> &ldquo;Datorf&ouml;reningen Stacken&rdquo;<br /> 30 October 1986 </em>
fr: <em>organis&eacute; par l'association des &eacute;tudiants<br />&laquo;&nbsp;Datorf&ouml;reningen Stacken&nbsp;&raquo;<br />le 30 octobre 1986</em>

source: <strong>[Note: This is a slightly edited transcript of the talk. As such it contains false starts, as well as locutions that are natural in spoken English but look strange in print. It is not clear how to correct them to written English style without &lsquo;doing violence to the original speech&rsquo;.]</strong>
fr: <strong>[Note&nbsp;: Ceci une transcription l&eacute;g&egrave;rement r&eacute;vis&eacute;e de l'entretien. En tant que tel, il contient des faux d&eacute;parts en plus de locutionsnaturelles en anglais parl&eacute; mais qui paraissent bizarres dans une publication. Il n'est pas &eacute;vident de savoir comment le traduire dans un anglais correct sans faire violence au discours original.]</strong>

source: Anyway, should I set up this system to notify you about the parts of the talk, or do you just like to sit through all of it? (Answer: Yeaaah)
fr: Bon, dois-je installer ce syst&egrave;me pour vous signaler les diff&eacute;rentes parties de l'entretien ou vous avez juste envie de le suivre jusqu'au bout&nbsp;?(R&eacute;ponse&nbsp;: Yeaaah&nbsp;!)

source: When I started programming, it was 1969, and I did it in an IBM laboratory in New York. After that I went to a school with a computer science department that was probably like most of them. There were some professors that were in charge of what was supposed to be done, and there were people who decided who could use what. There was a shortage of terminals for most people, but a lot of the professors had terminals of their own in their offices, which was wasteful, but typical of their attitude. When I visited the Artificial Intelligence lab at MIT I found a spirit that was refreshingly different from that. For example: there, the terminals was thought of as belonging to everyone, and professors locked them up in their offices on pain of finding their doors broken down. I was actually shown a cart with a big block of iron on it, that had been used to break down the door of one professors office, when he had the gall to lock up a terminal. There were very few terminals in those days, there was probably something like five display terminals for the system, so if one of them was locked up, it was a considerable disaster.
fr: Quand j'ai commenc&eacute; &agrave; programmer, c'&eacute;tait en 1969. Dans un laboratoire d'IBM &agrave; New York. Ensuite, je suis all&eacute; dans une &eacute;cole qui avait, probablement comme la plupart, un service informatique. Il y avait quelques professeurs responsables de ce qu'on &eacute;tait cens&eacute; y faire et il y avait des gens qui d&eacute;cidaient de qui pouvait se servir de quoi. Il y avait une p&eacute;nurie de terminaux pour la plupart d'entre nous. Or pas mal de professeurs en avaient un personnellement dans leurs bureaux, ce qui &eacute;tait du gaspillage, mais typique de leur attitude. Quand j'ai visit&eacute; le laboratoire d'Intelligence Artificielle au M.I.T., j'ai trouv&eacute; un esprit qui diff&eacute;rait de celui-ci de fa&ccedil;on rafra&icirc;chissante. Par exemple&nbsp;: l&agrave;, on consid&eacute;rait que les terminaux &eacute;taient &agrave; tout le monde et les professeurs s'&eacute;taient enferm&eacute;s &agrave; clef dans leurs bureaux &agrave; force de voir leurs portes d&eacute;fonc&eacute;es. On m'a montr&eacute; une fois un chariot avec un grand bloc de fer au-dessus. Celui qui avait &eacute;t&eacute; utilis&eacute; pour d&eacute;foncer la porte du bureau d'un des professeurs quand il a eu le culot d'y enfermer un terminal. Il y en avait tr&egrave;s peu &agrave; cette &eacute;poque. Il y avait &agrave; peu pr&egrave;s quelque chose comme cinq terminaux &agrave; &eacute;cran pour tout le syst&egrave;me, aussi si l'un d'entre eux &eacute;tait bloqu&eacute;, c'&eacute;tait un vrai d&eacute;sastre.

source: In the years that followed I was inspired by that ideas, and many times I would climb over ceilings or underneath floors to unlock rooms that had machines in them that people needed to use, and I would usually leave behind a note explaining to the people that they shouldn't be so selfish as to lock the door. The people who locked the door were basically considering only themselves. They had a reason of course, there was something they thought might get stolen and they wanted to lock it up, but they didn't care about the other people they were affecting by locking up other things in the same room. Almost every time this happened, once I brought it to their attention, that it was not up to them alone whether that room should be locked, they were able to find a compromise solution: some other place to put the things they were worried about, a desk they could lock, another little room. But the point is that people usually don't bother to think about that. They have the idea: &ldquo;This room is Mine, I can lock it, to hell with everyone else&rdquo;, and that is exactly the spirit that we must teach them not to have.
fr: Dans les ann&eacute;es qui ont suivi, j'ai &eacute;t&eacute; inspir&eacute; par ces id&eacute;es et de nombreuses fois j'ai escalad&eacute; les plafonds ou sous les plancherspour d&eacute;bloquer les salles qui contenaient des machines dont les gens avaient besoin. Et je laissais derri&egrave;re un mot qui expliquait aux gens qu'il ne devaient pas &ecirc;tre aussi &eacute;go&iuml;ste pour fermer la porte. Les gens qui fermaient la porte, au fond, ne pensaient qu'&agrave; eux. Ils avaient une raison de le faire, bien-s&ucirc;r. Ils pensaient quelque part qu'ils pouvaient &ecirc;tre vol&eacute;s et d&eacute;siraient fermer &agrave; clef. Mais ils ne pensaient pas aux autres qui souffraient d'avoir des choses enferm&eacute;es dans la m&ecirc;me salle. Presque &agrave; chaque fois que cela s'est produit &mdash;&nbsp;apr&egrave;s avoir port&eacute; &agrave; leur attention qu'il neleur appartenait pas de d&eacute;cider de la fermeture de la porte&nbsp;&mdash; ils &eacute;taient capables de trouver un compromis. Mais le probl&egrave;me, c'est que les gens ne prennent pas la peine d'y penser. Ils se disent&nbsp;: &laquo;&nbsp;Cette salle est &agrave; moi, je peux la fermer, que les autres aillent au diable&nbsp;!&nbsp;&raquo;, et c'est exactement l'esprit que nous devons leur apprendre &agrave; ne pas avoir.

source: But this spirit of unlocking doors wasn't an isolated thing, it was part of an entire way of life. The hackers at the AI lab were really enthusiastic about writing good programs, and interesting programs. And it was because they were so eager to get more work done, that they wouldn't put up with having the terminals locked up, or lots of other things that people could do to obstruct useful work. The differences between people with high morale who really care about what they're trying to do, and people who think of it as just a job. If it's just a job, who cares if the people who hired you are so stupid they make you sit and wait, it's their time, their money but not much gets done in a place like that, and it's no fun to be in a place like that.
fr: Mais cet esprit d'ouvrir les portes n'&eacute;tait pas un comportement isol&eacute;, il faisait partie d'une fa&ccedil;on de vivre &agrave; part enti&egrave;re. Les hackers du laboratoire d'I.A. &eacute;taient vraiment tr&egrave;s motiv&eacute;s pour &eacute;crire de bons programmes. Et des programmes int&eacute;ressants. Ils &eacute;taient &agrave; ce point impatients que le travail se fasse, qu'ils n'acceptaient pas de voir les terminaux enferm&eacute;s ou quoi que ce soit d'autre que les gens pouvaient faire pour entraver le travail utile. C'est la diff&eacute;rence entre les personnes au moral d'acier qui s'inqui&egrave;tent vraiment de ce qu'elles essayent de faire et les gens qui prennent &ccedil;a juste pour un boulot. Mais si c'est juste un boulot, qui s'inqui&egrave;te vraiment de savoir si les gens qui vous embauchent sont assez stupides pour vous inciter &agrave; vous reposer et attendre&nbsp;? C'est leur temps, leur argent, mais pas grand-chose ne se fait dans un endroit comme &ccedil;a. Ce n'est pas dr&ocirc;le d'&ecirc;tre dans un endroit comme &ccedil;a.

source: Another thing that we didn't have at the AI lab was file protection. There was no security at all on the computer. And we very consciously wanted it that way. The hackers who wrote the Incompatible Timesharing System decided that file protection was usually used by a self-styled system manager to get power over everyone else. They didn't want anyone to be able to get power over them that way, so they didn't implement that kind of a feature. The result was, that whenever something in the system was broken, you could always fix it. You never had to sit there in frustration because there was NO WAY, because you knew exactly what's wrong, and somebody had decided they didn't trust you to do it. You don't have to give up and go home, waiting for someone to come in in the morning and fix the system when you know ten times as well as he does what needs to be done.
fr: Une autre chose que nous n'avions pas au laboratoire d'I.A., c'&eacute;tait la protection des dossiers. Il n'y avait aucune s&eacute;curit&eacute; sur l'ordinateur. Et nous l'avons tr&egrave;s consciemment voulu comme &ccedil;a. Les hackers qui ont &eacute;crit le &laquo;&nbsp;Syst&egrave;me de r&eacute;partition du temps incompatible&nbsp;&raquo; (Incompatible Timesharing System) avaient jug&eacute; que la protection des dossiers n'&eacute;tait qu'un moyen comme un autre pour un soi-disant directeur de syst&egrave;me, d'avoir du pouvoir sur tout le monde. Ils n'ont pas voulu que n'importe qui puisse avoir du pouvoir sur eux comme &ccedil;a. Aussi, ils n'ont pas mis en applicationce genre de dispositif. R&eacute;sultat, chaque fois que quelque chose &eacute;tait cass&eacute; dans le syst&egrave;me, vous pouviez toujours le r&eacute;parer. Vous n'aviez jamais &agrave; vous asseoir impuissant parce qu'il n'y avait PAS D'ISSUE, alors que vous saviez parfaitement quoi faire mais parce qu'il avait &eacute;t&eacute; d&eacute;cid&eacute; de ne pas vous faire confiance pour &ccedil;a. Vous n'aviez pas &agrave; laisser tomber et rentrer &agrave; la maison en attendant que quelqu'un vienne le matin pour r&eacute;parer le syst&egrave;me, alors que vous saviez dix fois mieux que lui ce qu'il fallait faire.

source: And we didn't let any professors or bosses decide what work was going to be done either, because our job was to improve the system! We talked to the users of course; if you don't do that you can't tell what's needed. But after doing that, we were the ones best able to see what kind of improvements were feasible, and we were always talking to each other about how we'd like to see the system changed, and what sort of neat ideas we'd seen in other systems and might be able to use. So the result is that we had a smoothly functioning anarchy, and after my experience there, I'm convinced that that is the best way for people to live.
fr: Et nous n'avons laiss&eacute; aucun professeur, aucun patron non plus d&eacute;cider quel travail allait &ecirc;tre effectu&eacute;, parce que notre travail c'&eacute;tait d'am&eacute;liorer le syst&egrave;me&nbsp;! Nous parlions aux utilisateurs &eacute;videmment; si vous ne faites pas &ccedil;a, vous ne pouvez pas savoir ce qui est n&eacute;cessaire. Nous &eacute;tions les seuls, les plus aptes &agrave; savoir quel genre d'am&eacute;liorations &eacute;taient possibles. Et nous parlions toujours entre nous pour savoir comment nous voulions voir le syst&egrave;me &eacute;voluer, quelles sortes d'id&eacute;es ordonn&eacute;es vues dans d'autres syst&egrave;mes, nous pouvions utiliser. Ainsi au final, nous avions une anarchie de fonctionnement sans douleur et apr&egrave;s mon exp&eacute;rience l&agrave;-bas, je fus convaincu que c'&eacute;tait la meilleure fa&ccedil;on de vivre pour les gens.

source: Unfortunately the AI lab in that form was destroyed. For many years we were afraid the AI lab would be destroyed by another lab at MIT, the Lab for Computer Science, whose director was a sort of empire builder type, doing everything he could to get himself promoted within MIT, and make his organization bigger, and he kept trying to cause the AI lab to be made a part of his lab, and nobody wanted to do things his way because he believed that people should obey orders and things like that.
fr: Malheureusement le laboratoire d'I.A. sous cette angle a &eacute;t&eacute; d&eacute;truit. Pendant des ann&eacute;es nous avions craint que le laboratoire ne soit d&eacute;truit par un autre labo du M.I.T., le laboratoire d'Informatique dont le directeur &eacute;tait le genre de type &agrave; construire un empire. Il faisait tout ce qu'il pouvait pour avoir une promotion &agrave; l'int&eacute;rieur du M.I.T. et faire grossir son organisation. Personne ne voulait faire les choses &agrave; sa mani&egrave;re &eacute;tant donn&eacute; qu'il croyait que les gens devaient ob&eacute;ir aux ordres et d'autres choses dans le style.

source: But that danger we managed to defend against, only to be destroyed by something we had never anticipated, and that was commercialism. Around the early 80's the hackers suddenly found that there was now commercial interest in what they were doing. It was possible to get rich by working at a private company. All that was necessary was to stop sharing their work with the rest of the world and destroy the MIT-AI lab, and this is what they did despite all the efforts I could make to prevent them.
fr: Mais ce danger, nous avions r&eacute;ussi &agrave; nous en d&eacute;fendre. Il a &eacute;t&eacute; d&eacute;truit par quelque chose que nous n'avions pas pr&eacute;vu&nbsp;: l'esprit commercial. Vers le d&eacute;but des ann&eacute;es 80, les hackers ont soudainement compris qu'il y avait maintenant un int&eacute;r&ecirc;t commercial &agrave; faire ce qu'ils faisaient. Il &eacute;tait possible de devenir riche en travaillant pour des compagnies priv&eacute;es. Tout ce qu'il suffisait de faire, c'&eacute;tait de cesser de partager le travail et d&eacute;truire le labo d'I.A. du M.I.T. Et c'est ce qu'ils ont fait, malgr&eacute; tous mes efforts pour les en emp&ecirc;cher.

source: Essentially all the competent programmers except for me, at the AI lab were hired away, and this caused more than a momentary change, it caused a permanent transformation because it broke the continuity of the culture of hackers. New hackers were always attracted by the old hackers; there were the most fun computers and the people doing the most interesting things, and also a spirit which was a great deal of fun to be part of. Once these things were gone, there is nothing to recommend the place to anyone new, so new people stopped arriving. There was no-one they could be inspired by, no-one that they could learn those traditions from. In addition no-one to learn how to do good programming from. With just a bunch of professors and graduate students, who really don't know how to make a program work, you can't learn to make good programs work. So the MIT AI lab that I loved is gone and after a couple of years of fighting against the people who did it to try to punish them for it I decided that I should dedicate my self to try to create a new community with that spirit.
fr: L'essentiel des programmeurs comp&eacute;tents du laboratoire du M.I.T., except&eacute; moi, ont &eacute;t&eacute; embauch&eacute;s ailleurs et cela a caus&eacute; bien plus qu'un changement provisoire. Cela a caus&eacute; une m&eacute;tamorphose d&eacute;finitive, parce que &ccedil;a a bris&eacute; la continuit&eacute; de la culture des hackers. Les nouveaux hackers sont toujours attir&eacute;s par les anciens. Il y avait l&agrave; les ordinateurs les plus dr&ocirc;les et des gens qui faisaient les choses les plus int&eacute;ressantes avec. Et aussi un esprit qu'il &eacute;tait tr&egrave;s plaisant &agrave; partager. Une fois ceci mort, il n'y avait plus d'endroit &agrave; recommander aux nouveaux. Aussi, ils ont cess&eacute; d'arriver. Il n'y avait plus personne qui aurait pu les inspirer, personne dont ils auraient pu apprendre les traditions. De plus personne de qui apprendre &agrave; bien programmer. Avec juste une petite &eacute;quipe de professeurs et d'&eacute;tudiants dipl&ocirc;m&eacute;s qui ne savaient pas vraiment comment faire marcher un programme, vous ne pouviez pas apprendre &agrave; faire fonctionner un bon programme. Aussi le labo d'I.A. du M.I.T. que j'aimais a disparu. Et apr&egrave;s quelques ann&eacute;es pass&eacute;es &agrave; me battre contre les gens qui avait fait &ccedil;a, pour essayer de les punir pour &ccedil;a, j'ai d&eacute;cid&eacute; de me consacrer &agrave; cr&eacute;er une nouvelle communaut&eacute; avec cet esprit.

source: But one of the problems I had to face was the problem of <a href="/philosophy/categories.html#ProprietarySoftware">proprietary software</a>. For example one thing that happened at the lab, after the hackers left, was that the machines and the software that we had developed could no longer be maintained. The software of course worked, and it continued to work if nobody changed it, but the machines did not. The machines would break and there would be no-one who could fix them and eventually they would be thrown out. In the old days, yes we had service contracts for the machines, but it was essentially a joke. That was a way of getting parts after the expert hackers from the AI lab fixed the problem. Because if you let the field-service person fix it it would take them days, and you didn't want to do that, you wanted it to work. So, the people who knew how to do those things would just go and fix it quickly, and since they were ten times as competent as any field service person, they could do a much better job. And then they would have the ruined boards, they would just leave them there and tell the field service person &ldquo;take these back and bring us some new ones&rdquo;.
fr: Mais un des probl&egrave;mes auxquels j'ai d&ucirc; faire face fut celui des logiciels <a href="/philosophy/categories.fr.html#ProprietarySoftware">propri&eacute;taires</a>. Par exemple, ce qu'il s'est pass&eacute; au laboratoire une fois les hackers partis, c'est que les machines et les logiciels que nous avions d&eacute;velopp&eacute;s ne pouvaient plus &ecirc;tre maintenus. Les logiciels marchaient &eacute;videmment et continuaient de marcher si personne ne les changeait, mais pas les machines. Les machines allaient casser et personne n'allait pouvoir les r&eacute;parer et par la suite on allait les jeter. Dans les vieux jours, oui, il y avait des contrats d'entretien pour les machines mais c'&eacute;tait une plaisanterie pour l'essentiel. C'&eacute;tait une mani&egrave;re de participer apr&egrave;s que les experts du labo d'IA aient arrang&eacute; le probl&egrave;me. Parce que si vous aviez laiss&eacute; les personnes de service le faire, &ccedil;a leur aurait pris des jours. Et vous ne vouliez pas que &ccedil;a arrive. Vous vouliez que &ccedil;a marche. Aussi, les personnes qui savaient faire ce genre de choses allaient r&eacute;parer &ccedil;a tr&egrave;s vite, puisqu'elles &eacute;taient dix fois plus comp&eacute;tentes que n'importe quelle personne du service. Ils pouvaient faire un bien meilleur travail. Et donc si les cartes &eacute;taient ab&icirc;m&eacute;es, ils avaient juste &agrave; les laisser l&agrave; et appeler les personnes de service &laquo;&nbsp;Reprenez-les et ramenez-nous en de nouvelles&nbsp;&raquo;.

source: In the real old days our hackers used to modify the machines that came from Digital also. For example, they built paging-boxes to put on the PDP-10's. Nowadays I think there are some people here [in Stockholm] who do such things too, but it was a pretty unusual thing in those days. And the really old days, the beginning of the 1960's people used to modify computers adding all sorts of new instructions and new fancy timesharing features, so that the PDP-1 at MIT by the time it was retired in the mid-seventies had something like twice as many instructions as it had when it was delivered by Digital in the early sixties, and it had special hardware scheduler assisting features and strange memory-mapping features making it possible to assign individual hardware devices to particular timesharing jobs and lots of things that I hardly really know about. I think they also built in some kind of extended addressing modes they added index registers and indirect addressing, and they turned it essentially from a weak machine into a semi-reasonable one.
fr: &Agrave; la belle &eacute;poque, nos hackers avaient &eacute;galement l'habitude de modifier les machines qui venaient de Digital. Par exemple, ils construisaient des bo&icirc;tes de pagination &agrave; poser sur le PDP-10's. De nos jours, je pense qu'il y en a certains ici [&agrave; Stockholm] qui le font aussi. Mais ce n'&eacute;tait pas courant en ces temps-l&agrave;. Et aux temps tr&egrave;s anciens, au d&eacute;but des ann&eacute;es 60, les gens modifiaient les ordinateurs en ajoutant toutes sortes de nouvelles instructions et de nouveaux syst&egrave;mes fantaisistes de temps partag&eacute;. De sorte que le PDP-1 du M.I.T., avant qu'il ne parte &agrave; la retraite dans les ann&eacute;es 70, avait quelque chose comme deux fois plus d'instructions qu'il n'en avait lors de sa livraison par Digital dans les ann&eacute;es 60. Et il avait un planificateur mat&eacute;riel sp&eacute;cial pour aider les unit&eacute;s logiques et d'&eacute;tranges dispositifs de m&eacute;moire-tra&ccedil;ante qui rendait possible le fait de relier individuellement les p&eacute;riph&eacute;riques mat&eacute;riels &agrave; des syst&egrave;mes de r&eacute;partition du temps et des tas d'autres choses comme &ccedil;a que je connais &agrave; peine. Je pense qu'ils ont &eacute;galement construit, dans un certain type de mode d'adressage &eacute;tendu qu'ils ont rajout&eacute;, l'index des registres et l'adressage indirect et ont transform&eacute; pour l'essentiel une toute petite machine en une autre &agrave; peu pr&egrave;s correcte.

source: I guess it is one of the disadvantages of VLSI that it's no longer so feasible to add instructions to your machines.
fr: Je devine que l'un des inconv&eacute;nients de la VLSI (Very Large Scale Integration (int&eacute;gration &agrave; tr&egrave;s grande &eacute;chelle)) est qu'il n'est plus vraiment pratique d'ajouter des instructions sur vos machines.
