Repository: gitGNU/gnu_www-fr
Catalog: philosophy/stallman-kth.*.po
Languages: fr

source: If you want to increment the stack pointer a certain amount. But in addition you can also tell it to start at a particular line in the program, you can set the program counter to a particular source line. But what if you find that you called a function by mistake and you didn't really want to call that function at all? Say, that function is so screwed up that what you really want to do is get back out of it and do by hand what that function should have done. For that you can use the &ldquo;RETURN&rdquo; command. You select a stack frame and you say &ldquo;RETURN&rdquo;, and it causes that stack-frame, and all the ones within it, to be discarded as if that function were returning right now, and you can also specify the value it should return. This does not continue execution; it pretends that return happened and then stops the program again, so you can continue changing other things.
fr: Ceci si vous voulez incr&eacute;menter l'indicateur de pile d'une certaine quantit&eacute;. Mais en outre, vous pouvez &eacute;galement le dire pour d&eacute;marrer sur une ligne particuli&egrave;re du programme&nbsp;; vous pouvez placer le compteur &agrave; une ligne particuli&egrave;re du code source. Mais que se passe-t'il si vous constatez que vous avez appel&eacute; une fonction par erreur et que vous ne vouliez pas appeler cette fonction du tout&nbsp;? Vous vous dites que cette fonction est trop merdique, que vous voulez vraiment en sortir et vous faites &agrave; la main ce que cette fonction devait faire. Pour cela, vous pouvez utiliser la commande &laquo;&nbsp;RETURN&nbsp;&raquo;. Vous s&eacute;lectionnez une trame de la pile et vous dites &laquo;&nbsp;RETURN&nbsp;&raquo;. Et &ccedil;a va faire que la trame de la pile comme toutes celles qui vont avec, seront abandonn&eacute;es comme si cette fonction revenait instantan&eacute;ment en arri&egrave;re. Vous pouvez aussi sp&eacute;cifier la valeur &agrave; laquelle vous voulez qu'elle revienne. &Ccedil;a ne prolonge pas l'ex&eacute;cution&nbsp;; &ccedil;a simule le retour et stoppe &agrave; nouveau le programme&nbsp;; vous pouvez ainsi continuer de modifier autre chose.

source: And with all these things put together you thus have pretty good control over what's going on in a program.
fr: Avec toutes ces choses r&eacute;unies, vous avez donc un excellent contr&ocirc;le sur ce qu'il se passe dans un programme.

source: In addition one slightly amusing thing: C has string constants, what happens if you use a string constant in an expression that you're computing in the debugger? It has to create a string in the program you were debugging. Well it does. It sets up a call to MALLOC in that debugged program, lets MALLOC run, and then gets control back. Thus it invisibly finds a place to put the string constant.
fr: En outre, une chose assez amusante&nbsp;: C a des constantes de cha&icirc;ne. Que se passe t-il si vous utilisez une constante de cha&icirc;ne dans une expression que vous calculez dans le d&eacute;bogueur&nbsp;? Il doit cr&eacute;er une cha&icirc;ne dans le programme que vous d&eacute;boguez. Alors il le fait. Il cr&eacute;e un appel &agrave; MALLOC dans le programme d&eacute;bogu&eacute;, laisse MALLOC fonctionner et r&eacute;cup&egrave;re le contr&ocirc;le. Ainsi il trouve de fa&ccedil;on invisible un endroit pour placer la constante de cha&icirc;ne.

source: Eventually when this debugger is running on the real GNU system, I intend to put in facilities in the debugger to examine all of the internal status of the process that is running underneath it. For example to examine the status of the memory map, which pages exist, which are readable, which are writable, and to examine the inferior program's terminal status. There already is a bit of a command; this debugger, unlike the debuggers on Unix, keeps the terminal status completely separate for the debugger and the program you're debugging, so that it works with programs that run in raw mode, it works with programs that do interrupt driven input, and there's also a command that enables you to find out something about the terminal settings at the program you're debugging is actually using. I believe that in general a debugger should allow you to find out everything that's going on in the inferior process.
fr: Quand le d&eacute;bogueur a finalement fonctionn&eacute; sur le vrai syst&egrave;me GNU, j'avais l'intention d'y installer des am&eacute;nagements pour examiner l'ensemble des &eacute;tats internes du processus tournant en dessous de lui. Par exemple pour examiner l'&eacute;tat de la carte m&eacute;moire, pour savoir quelles pages existent, si elles sont lisibles, inscriptibles et pour examiner l'&eacute;tat inf&eacute;rieur du terminal du programme. Il y a d&eacute;j&agrave; l'&eacute;bauche d'une commande&nbsp;; ce d&eacute;bogueur, &agrave; la diff&eacute;rence des d&eacute;bogueurs sous Unix, maintient l'&eacute;tat du terminal du d&eacute;bogueur et celui du programme que vous d&eacute;boguez compl&egrave;tement s&eacute;par&eacute;s. De sorte que &ccedil;a marche avec des programmes qui tournent en mode brut, avec ceux qui font des interruptions d'entr&eacute;es dynamiques&nbsp;; et il y a &eacute;galement une commande qui vous permet d'apprendre quelque chose sur les positionnements des terminaux que le programme que vous d&eacute;boguez utilise r&eacute;ellement. Je crois qu'en g&eacute;n&eacute;ral un d&eacute;bogueur devrait vous permettre de d&eacute;couvrir tout qu'il se passe dans le processus inf&eacute;rieur.

source: There are two other main parts of the GNU system that already exist. One is the new C compiler, and one is the TRIX kernel.
fr: Deux autres parties centrales du syst&egrave;me GNU existent d&eacute;j&agrave;. L'un est le nouveau compilateur C et l'autre le noyau TRIX.

source: This would be a representation inside their compiler for instruction to take the contents of register two, add four and store it in register three. In this fashion you can represent any possible instruction for any machine. So they actually did represent all the instructions this way and then when it came time to try to combine them, they would do this by substituting one expression into another, making a more complicated algebraic expression for the combined instruction.
fr: C'&eacute;tait une repr&eacute;sentation interne &agrave; leur compilateur de l'instruction de&nbsp;: prendre le contenu du registre n&deg;2, d'y ajouter 4 et de le stocker dans le registre n&deg;3. De cette fa&ccedil;on vous pouviez repr&eacute;senter n'importe quelle instruction pour n'importe quelle machine. Ils repr&eacute;sentaient r&eacute;ellement toutes les instructions comme &ccedil;a et quand est venu le temps d'essayer de les combiner, ils l'ont fait en substituant une expression dans une autre, donnant une expression alg&eacute;brique plus compliqu&eacute;e &agrave; l'instruction combin&eacute;e.

source: Sometimes depending on whether the result of the first instruction had any further use, it might be necessary to make a combined instruction with two assignment operators. One for this value [pointing at ???]and another one with this value [pointing at ???] substituted in it with what came from the second instruction. But if this value was only used that once, you could eliminate it after substituting for it; there'd be no need to compute it any more. So it's actually somewhat complicated doing the substitution correctly checking that the intervening instructions don't change any of these values and other such things. When you support such things as auto-increment and auto-decrement addressing, which I do now, you also have to do various checks for those to check for situations where what you're doing is not value preserving.
fr: Cela d&eacute;pendait parfois si le r&eacute;sultat de la premi&egrave;re instruction avait une utilit&eacute; quelconque ou pas mais il pouvait &ecirc;tre n&eacute;cessaire de faire une instruction combin&eacute;e avec deux op&eacute;rateurs d'assignement. Un pour la valeur [pointer sur ???] et un autre pour cette valeur [pointer sur ???] &agrave; l'int&eacute;rieur de laquelle &eacute;tait substitu&eacute; ce qui provenait de la deuxi&egrave;me instruction. Si cette valeur n'&eacute;tait utilis&eacute;e qu'une fois, vous pouviez l'&eacute;liminer apr&egrave;s l'avoir substitu&eacute;e&nbsp;; il n'&eacute;tait plus n&eacute;cessaire de calculer. Donc c'est r&eacute;ellement assez difficile de faire ces substitutions correctement, en v&eacute;rifiant bien que les instructions qui interviennent ne vont changer aucune de ces valeurs ni rien d'autre du m&ecirc;me genre. Quand vous devez permettre des choses comme l'utilisation de l'auto-incr&eacute;mentation et l'adressage de l'auto-d&eacute;cr&eacute;mentation, ce que je fais maintenant, vous avez diverses v&eacute;rifications &agrave; faire &agrave; leur sujet dans les situations o&ugrave; votre objectif n'est pas de conserver de valeur.

source: But after checking all those things, then you take the substituted combined expression and put it through a pattern matcher, which recognizes all the valid instructions of your chosen target machine. And if it's recognized, then you replace those two instructions with the combined one, otherwise you leave them alone. And their technique is to combine two or three instructions related by data flow in this way.
fr: Mais apr&egrave;s avoir v&eacute;rifi&eacute; tout &ccedil;a, vous prenez l'expression combin&eacute;e substitu&eacute;e et vous la placez &agrave; travers un correspondeur de combinaison, qui reconna&icirc;t toutes les instructions valides de la machine cible que vous avez choisie. Quand c'est identifi&eacute;, vous remplacez les deux instructions par leur instruction combin&eacute;e, sinon vous les laissez seules. Leur technique est de combiner deux ou trois instructions li&eacute;es en flux de donn&eacute;es dans ce but.

source: In the Arizona compiler, they actually represent things as text strings like this, and their compiler is horribly slow. First I had some idea of just using their compiler and making changes in it, but it was clear to me I had to rewrite it entirely to get the speed I wanted, so I have rewritten it to use list structure representations for all these expressions. Things like this:
fr: Dans le compilateur d'Arizona, ils repr&eacute;sentent vraiment les choses avec des cha&icirc;nes de texte comme celles-l&agrave;, et leur compilateur est terriblement lent. Au d&eacute;but j'avais l'id&eacute;e d'utiliser leur compilateur et d'y apporter des modifications, mais j'ai compris que je devais le r&eacute;&eacute;crire enti&egrave;rement pour obtenir la rapidit&eacute; que je voulais, aussi je l'ai fait pour pouvoir utiliser des repr&eacute;sentations de structure de liste pour toutes ces expressions. Des choses comme ceci&nbsp;:

source: This looks like Lisp, but the semantics of these are not quite LISP, because each symbol here is one recognized specially. There's a particular fixed set of these symbols that is defined, all the ones you need. And each one has a particular pattern of types of arguments, for example: &ldquo;reg&rdquo; always has an integer, because registers are numbered, but &ldquo;+&rdquo; takes two subexpressions, and so on. And with each of these expressions is also a data type which says essentially whether it's fixed or floating and how many bytes long it is. It could be extended to handle other things too if you needed to.
fr: &Ccedil;a ressemble un peu au LISP mais la s&eacute;mantique n'est pas tout &agrave; fait la m&ecirc;me, parce que chaque symbole est ici identifi&eacute; individuellement. Un ensemble fixe, particulier de ces symboles est d&eacute;fini. De tous ceux dont vous avez besoin. Chacun ayant une combinaison particuli&egrave;re de types d'arguments, par exemple&nbsp;: &laquo;&nbsp;reg&nbsp;&raquo; a toujours un nombre entier parce que les registres sont num&eacute;rot&eacute;s, mais &laquo;&nbsp;+&nbsp;&raquo; prend deux sous-expressions, et ainsi de suite. Et &agrave; chacune de ces expressions va &eacute;galement un type de donn&eacute;es qui pour l'essentiel indique s'il est fixe ou flottant et sa longueur en octets. &Ccedil;a peut &ecirc;tre &eacute;largi pour manipuler d'autres choses si vous en avez besoin.

source: And finally it then has to correct the code for various problems, such as happen when there were pseudo registers that don't fit in the real registers, that had to be put into stack slots instead. When that happens on certain machines, some of the instructions may become invalid. For example on the 68000 you can add a register into memory and you can add memory into register, but you can't add one memory location into another. So if you have an ADD instruction, and you're headed for a 68000 and both of the things end up in memory, it's not valid. So this final pass goes through and copies things into registers and out of registers as needed to correct those problems.
fr: Et &agrave; la fin, il doit corriger le code pour les diff&eacute;rents probl&egrave;mes; comme celui des pseudo-registres qui ne s'adaptaient pas aux vrais registres et qui devaient &ecirc;tre mis &agrave; la place dans des slots de pile. Quand &ccedil;a arrive sur certaines machines, des instructions peuvent devenir invalides. Par exemple sur la 68000, on peut ajouter un registre dans la m&eacute;moire et ajouter de la m&eacute;moire dans un registre mais pas ajouter une adresse m&eacute;moire dans une autre. Aussi, si lors d'une instruction ADD vous allez vers des 68000 et que les deux &eacute;l&eacute;ments arrivent ensemble dans la m&eacute;moire, ce n'est pas valide. Donc ce passage final intervient et des &eacute;l&eacute;ments sont copi&eacute;s dans et en dehors des registres, comme c'est n&eacute;cessaire pour corriger ce genre de probl&egrave;me.

source: Problems can also arise with index registers. If you're trying to index by something, then most of the time that code will become invalid if the index quantity is in memory, except in a few cases on some machines where you can it with indirect addressing. In the cases when you're doing auto-increment on an index register you may have to copy the value into a register, do the instruction, and then copy the incremented value back to the memory slot where it really lives.
fr: Les probl&egrave;mes peuvent &eacute;galement surgir avec les registres d'index. Si vous essayez d'indexer par quelque chose, la plupart du temps le code deviendra invalide si la quantit&eacute; d'index est dans la m&eacute;moire. Except&eacute; dans quelques cas sur quelques machines o&ugrave; vous pouvez le faire avec un adressage indirect. Lorsque vous proc&eacute;dez &agrave; une auto-incr&eacute;mentation sur un registre d'index, vous pouvez avoir &agrave; copier la valeur dans un registre, op&eacute;rer l'instruction et de l&agrave; copier la valeur incr&eacute;ment&eacute;e en amont du slot de m&eacute;moire o&ugrave; elle vit vraiment.

source: There's got room for a lot of hair, and I've not finished implementing all the hair needed to make really fully efficient.
fr: Il y a de la place pour beaucoup d'optimisation et je n'ai pas fini de mettre en &oelig;uvre tout ce qui est n&eacute;cessaire pour le rendre vraiment pleinement efficace.

source: This compiler currently works by having a parser which turns C code into effectively a syntax tree annotated with C datatype information. Then another pass which looks at that tree and generates code like this [LISP like code]. Then several optimization passes. One to handle things like jumps across jumps, jumps to jumps, jumps to .+1, all of which can be immediately simplified. Then a common subexpression recognizer, then finding basic blocks, and performing dataflow-analysis, so that it can tell for each instruction which values are used in that instruction and never used afterward. And also linking each instruction to the places where the values it uses were generated, so if I have one instruction which generates pseudo register R[28], and then another instruction later which uses R[28] and it's the first place to use R[28], I make the second one point back to the first one, and this pointer is used to control the attempts to combine the instructions. You don't combine adjacent instructions, you combine an instruction that uses a value with the instruction that produced that value. Even if there are other instructions in between, they don't matter for this, you just have to check them to make sure they don't do anything to interfere. Then after the combiner comes the dynamic register allocator, and finally something to convert it into assembly code.
fr: Ce compilateur fonctionne actuellement avec un analyseur syntaxique qui transforme en r&eacute;alit&eacute; le code C en arbre syntaxique, annot&eacute; d'informations en types de donn&eacute;es C. Alors un autre passage examine cet arbre et produit du code comme celui-l&agrave; [comme du LISP]. Ensuite viennent plusieurs passages d'optimisation&nbsp;: un pour traiter par exemple des sauts &agrave; travers des sauts, des sauts de sauts, des sauts de +1 et tout ce qui peut &ecirc;tre imm&eacute;diatement simplifi&eacute;. Puis un syst&egrave;me de reconnaissance des sous-expressions courantes trouve alors les blocs de base et effectue l'analyse du flux des donn&eacute;es afin de pouvoir indiquer pour chaque instruction quelles valeurs sont utilis&eacute;es dans l'instruction et nulle part ailleurs. Et qui lie aussi chaque instruction aux endroits o&ugrave; les valeurs utilis&eacute;es ont &eacute;t&eacute; cr&eacute;&eacute;es. Donc si j'ai une instruction qui cr&eacute;e un pseudo-registre R[28] et une autre instruction plus tard qui utilise R[28], sachant que c'est le premier lieu pour utiliser R[28], je fais pointer la seconde en arri&egrave;re sur la premi&egrave;re et ce pointeur est celui qui servira pour contr&ocirc;ler les essais de combinaison des instructions. Vous ne combinez pas des instructions adjacentes, vous combinez une instruction qui utilise une valeur avec l'instruction qui a produit cette valeur. M&ecirc;me s'il y a d'autres instructions au milieu, elles ne sont pas concern&eacute;es; vous avez juste &agrave; vous assurer qu'elles n'interviennent pas. Et apr&egrave;s le combinateur, vient l'attributeur dynamique de registre et enfin quelque chose pour le convertir en code assembleur.

source: In the Arizona compiler the instruction recognizer was generated with LEX. Your machine description was simply a LEX program that LEX would turn into a C function to recognize valid instructions as strings. What I have is instead a special purpose decision tree that's generated from a machine description written in this syntax as if it were LISP. And this recognizer is used as a subroutine for many different parts of the compiler.
fr: Dans le compilateur d'Arizona, le syst&egrave;me de reconnaissance d'instruction a &eacute;t&eacute; cr&eacute;&eacute; avec LEX. La description de votre machine &eacute;tait simplement un programme LEX, que LEX transformait en fonction de C pour identifier les instructions valides comme les cha&icirc;nes. &Agrave; la place, j'ai un arbre de d&eacute;cision &agrave; usage sp&eacute;cial, cr&eacute;&eacute; &agrave; partir d'une description de machine &eacute;crite dans cette syntaxe comme si c'&eacute;tait du LISP. Et ce syst&egrave;me de reconnaissance est utilis&eacute; comme sous-programme dans plusieurs parties diff&eacute;rentes du compilateur.

source: Currently this compiler runs about as fast as PCC. It runs noticeably faster if you tell it not to do the hairy register allocation, in which case it allocates registers the same way as PCC does. In its super hairy mode it does a much better job of allocating registers than PCC, and I observe that for the VAX it generates the best code I've seen from any C compiler on the VAX.
fr: Actuellement ce compilateur fonctionne &agrave; peu pr&egrave;s aussi rapidement que le PCC. Il fonctionne sensiblement plus rapidement si vous lui dites de ne pas faire une attribution de registre limite. Dans ce cas elle assigne des registres de la m&ecirc;me mani&egrave;re que le PCC. Dans son mode super-limite, il fait un travail d'allocation de registres bien meilleur que le PCC et j'observe que pour VAX, il produit le meilleur code que j'ai vu de tous les compilateurs C sur VAX.

source: For the 68000 the code is still not ideal. I can see places where early stages do things that are not the best, because it can't fully look ahead. It has a choice in an early stage, and it does the thing that it thinks is going to be best, but really if it did the other one, a later stage is actually smart enough to do something even better. But the early stage doesn't know what the later stage is going to do, so I have more work to do on some of these things.
fr: Pour les 68000 le code n'est pas toujours id&eacute;al. Je peux voir par endroits, aux &eacute;tapes ant&eacute;rieures, se passer des choses qui ne sont pas forc&eacute;ment les meilleures parce qu'il ne peut pas anticiper vraiment. Il a un choix &agrave; faire &agrave; une &eacute;tape ant&eacute;rieure et il fait ce qu'il pense &ecirc;tre le mieux. Or s'il avait fait l'autre choix, une &eacute;tape ult&eacute;rieure aurait &eacute;t&eacute; assez intelligente pour faire encore mieux. Mais l'&eacute;tape ant&eacute;rieure ne sait pas ce que l'&eacute;tape ult&eacute;rieure va faire, donc je dois travailler davantage sur ce genre de choses.

source: Sometimes this causes it to free up registers unnecessarily. Because when things wind up in memory and it needs to copy them into registers, it needs to get registers to copy them into. This means taking registers that it has already allocated to, and kicking those temporary quantities out to stack slots. Of course this may invalidate more instructions now that those things are in memory, not registers, so it has to check again and again. Sometimes it thinks it has to copy things to registers and really it isn't going to have to, so it may free up too many things and thus not use all the registers that it could.
fr: Parfois &ccedil;a provoque le fait de lib&eacute;rer des registres inutilement. &Eacute;tant donn&eacute; que quand les choses finissent dans la m&eacute;moire, il a besoin de les copier dans des registres. Et il lui faut des registres pour &ccedil;a. C'est-&agrave;-dire prendre des registres d&eacute;j&agrave; assign&eacute;s et virer les quantit&eacute;s provisoires des slots de pile. &Eacute;videmment, maintenant que ces choses sont dans la m&eacute;moire, &ccedil;a peut invalider davantage d'instructions. Pas les registres. Donc il lui faut tout le temps v&eacute;rifier. Parfois il pense &agrave; tort qu'il devrait copier les choses dans les registres, alors il peut en lib&eacute;rer trop et ne pas utiliser tous les registres qu'il pourrait.
