Repository: gitGNU/gnu_www-fr
Catalog: philosophy/stallman-kth.*.po
Languages: fr

source: (Question: Do you have a code generator for 32000?) Not yet, but again, it's not a code generator it's just a machine description that you need. A list of all the machine instructions described in this [LISP like] form. So in fact aside from the work of implementing the idea of constraints on which arguments can be in registers and which kind of registers, which is something which was needed for the 68000 and was not needed for the VAX, the work of porting this compiler from the VAX to the 68000 just took a few days. So it's very easy to port.
fr: (Question&nbsp;: Avez-vous un g&eacute;n&eacute;rateur de code pour les 32000&nbsp;?) Pas encore, mais &agrave; nouveau ce n'est pas un g&eacute;n&eacute;rateur de code dont vous avez besoin, juste d'une description de machine. Une liste de toutes les instructions de la machine d&eacute;crites sous cette forme [comme du LISP]. En fait, hormis le travail de mettre en &oelig;uvre l'id&eacute;e de contraintes sur les arguments &mdash;&nbsp;lesquels pourront &ecirc;tre dans des registres et dans quel genre de registres&nbsp;&mdash; n&eacute;cessaires pour les 68000 mais pas pour le VAX, le travail de portage de ce compilateur de VAX aux 68000 a juste pris quelques jours. Donc il est tr&egrave;s facile &agrave; transf&eacute;rer.

source: The compiler currently generates assembler code and it can generate debugging information either in the format that DBX wants, or in the special internal format of GDB. I'd say the only work needed on this compiler is in three areas. One: I have to add a &ldquo;profiling&rdquo; feature, like the one that the Unix compilers have. Two: I have to make these register allocation things smarter, so that I can stop seeing stupid things appearing in the output. And three: There are various bugs, things that doesn't handle correctly yet, although it has compiled itself correctly. I expect this will just take a few months, and then I will release the compiler.
fr: Le compilateur produit actuellement du code assembleur. Et il peut produire de l'information de d&eacute;bogage soit dans le format que DBX veut, soit dans le format interne sp&eacute;cial &agrave; GDB. Je dirais que le seul travail &agrave; faire sur ce compilateur se situe &agrave; trois niveaux. Un&nbsp;: Je dois ajouter un dispositif de &laquo;&nbsp;profilage&nbsp;&raquo; comme celui des compilateurs d'Unix. Deux&nbsp;: Je dois rendre les allocations de registre plus intelligentes pour ne plus voir de choses stupides appara&icirc;tre en sortie. Trois&nbsp;: Il y a divers bogues. Des choses qu'il ne traite pas encore correctement bien qu'il se soit compil&eacute; correctement. Je pense que &ccedil;a ne prendra que quelques mois, ensuite je le diffuserai.

source: The other sizable part of the system that exist, is the kernel. (Question: A pause?) Ah, yeah I guess we've forgotten about breaks. Why don't I finish talking about the kernel, which should only take about five minutes, and then we can take a break.
fr: L'autre partie assez importante du syst&egrave;me, c'est le noyau.(Question&nbsp;: Une pause&nbsp;?) Ah, ouais je devine que nous avons oubli&eacute; les coupures. Pourquoi je ne finirai pas de parler du noyau&nbsp;? Ce qui devrait prendre environ cinq minutes seulement, et ensuite nous pourrons faire une coupure.

source: Now, for the kernel I am planning to use a system called TRIX (it doesn't stand for anything that I know of) which was developed as a research project at MIT. This system is based on Remote Procedure Call. Thus programs are called domains. Each domain is a address space and various capabilities, and a capability is none other than the ability to call a domain. Any domain can create &ldquo;capability ports&rdquo; to call it, and then it can pass these ports to other domains, and there is no difference between calling the system and calling another user domain. In fact you can't tell which you have. Thus it is very easy to have devices implemented by other user programs. A file system could be implemented by a user program, transparently. It's also transparent to communicate across networks. You think that you're directly calling another domain, but really you're calling the network server domain. It takes the information that you gave in the call, and passes this over the network to another server program which then calls the domain that you're trying to talk to. But you and that other domain see this as happening invisibly.
fr: Maintenant pour le noyau, je projette d'utiliser un syst&egrave;me appel&eacute; TRIX (il ne ressemble &agrave; rien de ce que je connais) qui a &eacute;t&eacute; d&eacute;velopp&eacute; comme projet de recherche au M.I.T. Ce syst&egrave;me est bas&eacute; sur le Remote Procedure Call &mdash;&nbsp;Appel de Proc&eacute;dure &agrave; Distance. Les programmes sont appel&eacute;s domaines. Chaque domaine est un espace d'adressage et a diverses capacit&eacute;s; une capacit&eacute; n'&eacute;tant rien d'autre que l'aptitude &agrave; appeler un domaine. Tout domaine peut cr&eacute;er des &laquo;&nbsp;ports de capacit&eacute;s&nbsp;&raquo; pour l'appeler et peut passer ces ports aux autres domaines. Et il n'y a aucune diff&eacute;rence entre appeler le syst&egrave;me et appeler un autre domaine d'utilisateur. En fait vous ne pouvez pas dire lequel vous avez. Ainsi il est tr&egrave;s facile d'avoir des dispositifs mis en &oelig;uvre par d'autres programmes utilisateur. Un syst&egrave;me de fichiers pourrait l'&ecirc;tre de fa&ccedil;on transparente. Il est &eacute;galement transparent de communiquer &agrave; travers des r&eacute;seaux. Vous pensez que vous appelez directement un autre domaine mais en r&eacute;alit&eacute; vous appelez le domaine du serveur de r&eacute;seau. Il prend l'information que vous avez donn&eacute;e dans l'appel et la passe au-dessus du r&eacute;seau &agrave; un autre programme du serveur qui appelle alors le domaine auquel vous essayez de parler. Mais pour vous et cet autre domaine, cela se passe de mani&egrave;re invisible.

source: The TRIX kernel runs, and it has a certain limited amount of Unix compatibility, but it needs a lot more. Currently it has a file system that uses the same structure on disk as the ancient Unix file system does. This made it easier to debug the thing, because they could set up the files with Unix, and then they could run TRIX, but that file system doesn't have any of the features that I believe are necessary.
fr: Le noyau TRIX fonctionne et il a une certaine quantit&eacute; limit&eacute;e de compatibilit&eacute;s Unix, mais il lui en faut beaucoup plus. Actuellement son syst&egrave;me de fichiers utilise la m&ecirc;me structure sur disque que l'antique syst&egrave;me de fichiers d'Unix. &Ccedil;a rendait plus facile le d&eacute;bogage parce qu'ils pouvaient installer les fichiers avec Unix et donc faire fonctionner TRIX, mais ce syst&egrave;me de fichiers n'a aucune des fonctionalit&eacute;s n&eacute;cessaires d'apr&egrave;s moi.

source: Features that I believe must be added include: Version numbers, undeletion, information on when and how and where the file was backed up on tape, atomic superseding of files. I believe that it is good that in Unix when a file is being written, you can already look at what's going there, so for example, you can use &ldquo;tail&rdquo; to see how far the thing got, that's very nice. And if the program dies, having partly written the file, you can see what it produced. These things are all good, but, that partly written output should not ever be taken for the complete output that you expected to have eventually. The previous version of that should continue to be visible and used by everyone who tries to use it, until the new version is completely and correctly made. This means that the new version should be visible in the file system but not under the name it is supposed to have. It should get renamed when it's finished. Which is by the way what happens in ITS, although there each user program has to do this explicitly. For Unix compatibility with the user programs, it has to happen invisibly.
fr: Les fonctionalit&eacute;s qui devraient &ecirc;tre rajout&eacute;es d'apr&egrave;s moi incluent&nbsp;: les num&eacute;ros de version, la restauration, les informations sur quand, comment et o&ugrave; le dossier a &eacute;t&eacute; sauvegard&eacute; sur bande, le remplacement nucl&eacute;aire des fichiers. Je crois qu'il est bon dans Unix, lorsqu'un fichier est &eacute;crit, que vous puissiez d&eacute;j&agrave; regarder ce qu'il se passe. Ainsi par exemple, vous pouvez utiliser &laquo;&nbsp;tail&nbsp;&raquo; pour voir o&ugrave; &ccedil;a en est, c'est vraiment bien. Et si le programme &eacute;choue apr&egrave;s avoir &eacute;crit le fichier partiellement, vous pouvez voir ce qu'il a fait. Toutes ces choses sont bonnes, mais le r&eacute;sultat partiellement &eacute;crit ne devrait jamais &ecirc;tre consid&eacute;r&eacute; comme le r&eacute;sultat final escompt&eacute;. La version pr&eacute;c&eacute;dente devrait continuer d'&ecirc;tre visible et utilis&eacute;e par tous ceux qui tentent de l'utiliser jusqu'&agrave; ce qu'une nouvelle version soit enti&egrave;rement et correctement r&eacute;alis&eacute;e. Cela signifie que la nouvelle version devra &ecirc;tre visible dans le syst&egrave;me de fichiers mais pas sous le nom qu'elle est cens&eacute;e avoir. Elle devrait &ecirc;tre renomm&eacute;e quand c'est fini. C'est d'ailleurs ce qui se passe dans ITS, bien que chaque programme utilisateur doive le faire de fa&ccedil;on explicite. Pour la compatibilit&eacute; d'Unix avec les programmes utilisateurs, &ccedil;a doit se passer de fa&ccedil;on invisible.

source: I have a weird hairy scheme to try to make version numbers fit with the existing Unix user programs. And this is the idea that you specify a file name leaving the version number implicit, if you just specify the name in the ordinary way. But if you wish to specify a name exactly, either because you want to state explicitly what version to use, or because you don't want versions at all, you put a point at the end of it. Thus if you give the filename &ldquo;FOO&rdquo; it means &ldquo;Search the versions that exists for FOO and take the latest one&rdquo;. But if you say &ldquo;FOO.&rdquo; it means &ldquo;use exactly the name FOO and none other&rdquo;. If you say &ldquo;FOO.3.&rdquo; it says &ldquo;use exactly the name FOO.3 &rdquo; which of course is version three of FOO and none other. On output, if you just say &ldquo;FOO&rdquo;, it will eventually create a new version of &ldquo;FOO&rdquo;, but if you say &ldquo;FOO.&rdquo; it will write a file named exactly &ldquo;FOO&rdquo;.
fr: C'est un arrangement bizarrement effrayant d'essayer de faire co&iuml;ncider les num&eacute;ros de versions avec les programmes utilisateur pr&eacute;sents sous Unix. Il s'agit de l'id&eacute;e de sp&eacute;cifier le nom de fichier, en laissant implicite le num&eacute;ro de version si vous le sp&eacute;cifiez normalement. Et si vous souhaitez le faire de fa&ccedil;on explicite &mdash;&nbsp;soit parce que vous voulez d&eacute;clarer explicitement quelle version utiliser, soit parce que vous ne voulez pas de version du tout&nbsp;&mdash; vous mettez un point &agrave; son extr&eacute;mit&eacute;. Ainsi si vous donnez le nom de fichier &laquo;&nbsp;FOO&nbsp;&raquo; cela signifie &laquo;&nbsp;cherchez les versions qui existent pour &lt;FOO&gt; et prenez la derni&egrave;re&nbsp;&raquo;. Mais si vous dites &laquo;&nbsp;FOO.&nbsp;&raquo; cela signifie &laquo;&nbsp;utilisez exactement le nom &lt;FOO&gt; et aucun autre&nbsp;&raquo;. Si vous dites &laquo;&nbsp;FOO.3.&nbsp;&raquo; cela veut dire &laquo;&nbsp;utilisez exactement le nom FOO.3&nbsp;&raquo; qui naturellement est la version trois de &laquo;&nbsp;FOO&nbsp;&raquo; et aucune autre. En sortie, si vous dites juste &laquo;&nbsp;FOO&nbsp;&raquo;, &ccedil;a va cr&eacute;er par la suite une nouvelle version de &laquo;&nbsp;FOO&nbsp;&raquo;, mais si vous dites &laquo;&nbsp;FOO.&nbsp;&raquo;, &ccedil;a va &eacute;crire un fichier nomm&eacute; exactement &laquo;&nbsp;FOO&nbsp;&raquo;.

source: Now there's some challenges involved in working out all the details in this, and seeing whether there are any lingering problems, whether some Unix software actually breaks despite feeding them names with points in them and so on, to try to make it get the same behavior.
fr: Maintenant c'est un d&eacute;fi compliqu&eacute; de mettre au point tous ces d&eacute;tails et de voir s'il y a des probl&egrave;mes persistants, si vraiment certains logiciels Unix &eacute;chouent malgr&eacute; le fait d'avoir fourni des noms avec des points et ainsi de suite, pour tenter de lui faire avoir le m&ecirc;me comportement.

source: I would expect that when you open a file for output whose name ends in a point, you should actually open that name right away, so you get the so you get the same Unix behavior, the partially written output is immediately visible, whereas when you output a name that doesn't end in a point, the new version should appear when you close it, and only if you close it explicitly. If it gets closed because the job dies, or because the system crashes or anything like that, it should be under a different name.
fr: Je m'attends &agrave; ce que lorsque vous sortez un fichier dont le nom finit par un point, vous l'ouvrez en fait avec ce nom tout de suite et vous obtenez le m&ecirc;me comportement qu'Unix&nbsp;: le r&eacute;sultat partiellement &eacute;crit est imm&eacute;diatement visible. Tandis que quand vous le sortez avec un nom qui ne finit pas par un point, la nouvelle version ne devrait appara&icirc;tre que quand vous le fermez et seulement si vous le fermez explicitement. S'il a &eacute;t&eacute; ferm&eacute; parce que le travail a &eacute;chou&eacute; ou &agrave; cause du plantage du syst&egrave;me ou de n'importe quoi du genre, il devrait &ecirc;tre sous un nom diff&eacute;rent.

source: And this idea can be connected up to &ldquo;star matching&rdquo;, by saying that a name that doesn't end in a point is matched against all the names without their version numbers, so if a certain directory has files like this:
fr: Et cette id&eacute;e peut &ecirc;tre associ&eacute;e au &laquo;&nbsp;star matching&nbsp;&raquo; &mdash;&nbsp;correspondance par &eacute;toile (*)&nbsp;&mdash; o&ugrave; un nom qui ne finit pas par un point &eacute;quivaut &agrave; tous les noms sans num&eacute;ro de version. Ainsi, si un certain r&eacute;pertoire a des fichiers comme ceci&nbsp;:

source: If I say &ldquo;*&rdquo;, that's equivalent to
fr: Si je dis &laquo;&nbsp;*&nbsp;&raquo;, &ccedil;a &eacute;quivaut &agrave;

source: because it takes all the names and gets rid of their versions, and takes all the distinct ones. But if I say &ldquo;*.&rdquo; then it takes all the exact names, puts a point after each one, and matches against them. So this gives me all the names for all the individual versions that exist. And similar, you can see the difference between &ldquo;*.c&rdquo; and &ldquo;*.c.&rdquo; this [the first] would give you essentially versionless references to all the &ldquo;.c&rdquo; files, whereas this [the second] will give you all the versions &hellip; well this actually wouldn't, you'd have to say &ldquo;*.c.*.&rdquo;. I haven't worked out the details here.
fr: parce que &ccedil;a prend tous les noms, les d&eacute;barasse de leurs versions et conserve tous ceux qui sont distincts. Mais si je dis &laquo;&nbsp;*.&nbsp;&raquo;, alors &ccedil;a prend tous les noms exacts, met un point apr&egrave;s chaque nom et cherche les &eacute;quivalences. &Ccedil;a me donne tous les noms avec toutes les diff&eacute;rentes versions qui existent. Et pareil, vous pouvez voir la diff&eacute;rence entre le &laquo;&nbsp;*.c&nbsp;&raquo; et le &laquo;&nbsp;*.c.&nbsp;&raquo;. Ceci [le premier] vous donnera essentiellement les r&eacute;f&eacute;rences sans version de tous les fichiers &laquo;&nbsp;.c&nbsp;&raquo;, tandis que cela [le second] vous donnera toutes les versions&hellip; bon, pas vraiment, vous devriez dire &laquo;&nbsp;*.c.*.&nbsp;&raquo; mais je n'ai pas rendu compte des d&eacute;tails ici.

source: Another thing, that isn't a user visible feature and is certainly compatible to put in, is failsafeness in the file system. Namely, by writing all the information on disk in the proper order, arranging that you can press &ldquo;halt&rdquo; at any time without ever corrupting thereby the file system on disk. It is so well known how to do this, I can't imagine why anyone would neglect it. Another idea is further redundant information. I'm not sure whether I'll do this or not, but I have ideas for how to store in each file all of its names, and thus make it possible if any directory on disk is lost, to reconstruct it from the rest of the contents of the disk.
fr: Autre chose qui n'est pas une fonction visible par l'utilisateur et certainement compatible &agrave; installer, c'est la protection du syst&egrave;me de fichiers. &Agrave; savoir, &eacute;crire toutes les informations sur le disque dans l'ordre appropri&eacute;, en s'arrangeant pour pouvoir presser le bouton &laquo;&nbsp;Arr&ecirc;t&nbsp;&raquo; &agrave; tout moment sans endommager le syst&egrave;me de fichiers du disque. C'est tellement connu que je ne peux pas imaginer qu'on puisse le n&eacute;gliger. Une autre id&eacute;e, c'est l'information redondante. Je ne sais pas si je le ferai, mais j'ai des id&eacute;es sur la fa&ccedil;on de stocker dans chaque fichier tous ses noms et par l&agrave; rendre possible si l'un des r&eacute;pertoires du disque est perdu de le reconstruire &agrave; partir du reste du contenu du disque.

source: Also I think I know how to make it possible to atomically update any portion of a file. Thus if you want to replace a certain subrange of a file with new data in such a fashion that any attempt to read the file will either see only the old data, or only the new data. I believe I can do that, without any locking even.
fr: En outre, je pense savoir comment rendre possible la mise &agrave; jour nucl&eacute;aire de n'importe quelle partie de fichier. Ceci si vous voulez remplacer un sous-bloc particulier d'un fichier par de nouvelles donn&eacute;es de mani&egrave;re &agrave; ce qu'&agrave; toute tentative de lecture du fichier cela ne permette de voir que celles-ci ou seulement les anciennes.

source: For network support, I intend eventually to implement TCP/IP for this system. I also think it's possible to use KERMIT to get something effectively equivalent to UUCP.
fr: Pour le support de r&eacute;seau, j'ai l'intention par la suite de mettre en &oelig;uvre TCP/IP pour ce syst&egrave;me. Je pense &eacute;galement qu'il est possible d'utiliser KERMIT pour obtenir quelque chose d'&eacute;quivalent au UUCP de mani&egrave;re efficace.

source: People always ask me &ldquo;When is it going to be finished?&rdquo; Of course I can't know when it's going to be finished, but that's the wrong question to ask me. If you were planning to pay for it, it would make sense for you to want to know exactly what are you going to get and when. But since you're not going to pay for it, the right question for you to ask is &ldquo;how can you help make it get finished sooner?&rdquo; I have a list of projects, it is on a file at MIT, and people who are interested in helping could send me mail at this Internet address, and I will send back a list of projects. (I wonder if this is will work (looking at the chalk)). Is this readable? This is &ldquo;RMS@GNU.ORG&rdquo; (just follow the bouncing ball.) And now let's take a break, and after the break, I will say some really controversial things. So don't leave now. If you leave now, you're going to miss the real experience.
fr: Les gens me demandent toujours &laquo;&nbsp;Quand est-ce que &ccedil;a sera fini&nbsp;?&nbsp;&raquo;. Naturellement je ne peux pas savoir, mais c'est une mauvaise question. Si vous avez pay&eacute; pour &ccedil;a, je comprendrais que vous vouliez savoir exactement ce que vous allez obtenir et quand. Mais puisque vous n'allez pas payer, la bonne question &agrave; vous poser est &laquo;&nbsp;Comment pouvez-vous aider pour que cela finisse plus t&ocirc;t&nbsp;?&nbsp;&raquo;. J'ai une liste de projets, elle est dans un dossier au M.I.T.. Les gens qui sont int&eacute;ress&eacute;s pour aider peuvent m'envoyer un courrier &agrave; cette adresse internet et je leur enverrai en retour une liste de projets (Je me demande si &ccedil;a va marcher [en regardant la craie]). Est-ce que c'est lisible&nbsp;? C'est &laquo;&nbsp;RMS@GNU.ORG&nbsp;&raquo; (suivez juste la &laquo;&nbsp;bouncing ball&nbsp;&raquo; (la balle magique)). Et maintenant prenons une pause, et apr&egrave;s la pause, je vais dire des choses vraiment controvers&eacute;es. Alors ne partez pas maintenant. Si vous partez maintenant vous allez rater la v&eacute;ritable exp&eacute;rience.

source: <strong> [Here we had a 15 min. break] </strong>
fr: <strong>[Ici, nous avons eu 15 minutes de pause]</strong>

source: I've been asked to announce how you can get copies of GNU software. Well, one way of course is if you know a friend who has a copy, you can copy it, but if you don't know a friend who has a copy, and you're not on the Internet, you can't FTP it, then you can always order a distribution tape, and send some money to the Free Software Foundation. Of course free programs is not the same thing as free distribution. I'll explain this in detail later.
fr: On m'a demand&eacute; de faire conna&icirc;tre le moyen d'obtenir des copies du logiciel GNU. Bien, un moyen naturellement est de conna&icirc;tre un ami qui en a une copie. Mais si ce n'est pas le cas et que vous n'&ecirc;tes pas sur l'Internet pour le t&eacute;l&eacute;charger, alors vous pouvez toujours commander une distribution et envoyer une certaine somme d'argent &agrave; la Free Software Foundation (Fondation pour le Logiciel Libre). Naturellement les logiciels libres ce n'est pas la m&ecirc;me chose que la distribution libre. Je l'expliquerai en d&eacute;tail plus tard.

source: Here I have an EMACS manual, of the nicely printed variety. It has been phototypeset and then offset printed. Although you can also print it yourself from the sources that come in the EMACS distribution, you can get these copies from the Free Software Foundation. You can come afterwards and look at this and also this contains an order for you might copy some information from, and this [front] picture has also sometimes been enjoyed. This [pointing at a figure being chased by RMS riding a gnu] is a scared software hoarder, I'll be talking about him in a moment.
fr: J'ai un manuel d'EMACS, de la s&eacute;rie bien imprim&eacute;e. &Ccedil;a a &eacute;t&eacute; phototyp&eacute; puis imprim&eacute; en offset. Bien que vous puissiez &eacute;galement l'imprimer vous-m&ecirc;me &agrave; partir des sources de la distribution d'EMACS, vous pouvez obtenir ces copies de la Free Software Foundation. Vous pouvez venir apr&egrave;s et regarder. &Ccedil;a contient &eacute;galement une commande pour que vous puissiez copier l'information, de m&ecirc;me que cette page [de garde] qui a &eacute;t&eacute; aussi appr&eacute;ci&eacute;e&nbsp;: [montrant du doigt un personnage chass&eacute; par RMS &agrave; cheval sur un gnu] c'est un accapareur de logiciel effray&eacute;, je parlerai de lui dans un moment.
