Repository: gitGNU/gnu_www-fr
Catalog: philosophy/stallman-kth.*.po
Languages: fr

source: Really all they're doing is interfering with everybody else doing what needs to be done, but they're pretending as much to them selves as to the rest of us, that they are providing a useful function. Well, what I hope is that when that software Mafia guy comes up and says, &ldquo;You want those programs to disappear on your computer?&rdquo;, the user can say &ldquo;I'm not afraid of you any more. I have this free GNU software, and there's nothing you can do to me now.&rdquo;
fr: Vraiment, tout ce qu'ils font c'est interf&eacute;rer avec tous ceux qui font ce qui doit &ecirc;tre fait, mais ils pr&eacute;tendent fournir, davantage pour eux-m&ecirc;mes que pour le reste du monde, une fonction utile. Bon. Ce que j'esp&egrave;re, c'est que quand ce type de Mafia du logiciel entre et dit&nbsp;: &laquo;&nbsp;Vous voulez que ces programmes disparaissent de votre ordinateur&nbsp;?&nbsp;&raquo;, l'utilisateur puisse r&eacute;pondre&nbsp;: &laquo;&nbsp;Je n'ai plus peur de vous. J'ai le logiciel libre GNU et il n'y a rien que vous puissiez me faire d&eacute;sormais&nbsp;&raquo;.

source: Now, one of the justifications people sometimes offer for owning software, is the idea of giving people an incentive to produce things. I support the idea of private enterprise in general, and the idea of hope to make money by producing things that other people like to use, but it's going haywire in the field of software now. Producing a proprietary program is not the same contribution to society as producing the same program and letting it be free. Because writing the program is just a potential contribution to society. The real contribution to the wealth of society happens only when the program is used. And if you prevent the program from being used, the contribution doesn't actually happen. So, the contribution that society needs is not these proprietary programs that everyone has such an incentive to make, the contribution we really want is free software, so our society is going haywire because it gives people an incentive to do what is not very useful, and no incentive to do what is useful. Thus the basic idea of private enterprise is not being followed, and you could even say that the society is neurotic. After all when an individual encourages in others behavior that is not good for that individual we call this a neurosis. Here society is behaving in that fashion, encouraging programmers to do things that is not good for society.
fr: Maintenant, un des moyens de justifier parfois le fait de poss&eacute;der le logiciel est l'id&eacute;e de donner l'envie aux gens de produire des choses. Je soutiens l'id&eacute;e de l'entreprise priv&eacute;e en g&eacute;n&eacute;ral et l'id&eacute;e de vouloir gagner de l'argent en produisant des choses que d'autres aiment &agrave; utiliser, mais &ccedil;a se d&eacute;traque dans le domaine du logiciel maintenant. Produire un programme propri&eacute;taire, ce n'est pas la m&ecirc;me contribution &agrave; la soci&eacute;t&eacute; que produire ce programme et le laisser libre. Parce que l'&eacute;criture du programme est juste une contribution potentielle &agrave; la soci&eacute;t&eacute;. La vraie contribution &agrave; la richesse de la soci&eacute;t&eacute; vient seulement quand le programme est utilis&eacute;. Et si vous emp&ecirc;chez l'utilisation du programme, la contribution ne se produit pas vraiment. Aussi, la contribution dont la soci&eacute;t&eacute; a besoin ne r&eacute;side pas dans ces programmes propri&eacute;taires que tout le monde a tellement envie de faire. La contribution que nous voulons vraiment est celle du logiciel libre. Aussi notre soci&eacute;t&eacute; se d&eacute;traque parce qu'elle donne aux gens l'envie de faire ce qui n'est pas utile et aucune envie de faire ce qu'est utile. Ainsi l'id&eacute;e fondamentale de l'entreprise priv&eacute;e n'est pas comprise et vous pourriez m&ecirc;me dire que la soci&eacute;t&eacute; est n&eacute;vrotique. Car apr&egrave;s tout, quand un individu encourage dans le comportement des autres ce qui n'est pas bon pour lui, vous appelez &ccedil;a une n&eacute;vrose. Ici la soci&eacute;t&eacute; se comporte comme &ccedil;a, en encourageant les programmeurs &agrave; faire des choses qui ne sont pas bonnes pour la soci&eacute;t&eacute;.

source: I'm unusual. I'd rather believe that I'm a good member of society and that I'm contributing something, than feel that I'm ripping society off successfully, and that's why I've decided to do what I have done. But every one is at least a little bit bothered by the feeling that they are getting paid to do what's not really useful. So let's stop defending this idea of incentives to do the wrong thing and let's at least try to come up with arrangements to encourage people to do the right thing, which is to make free software.
fr: Je ne suis pas commun. Je pr&eacute;f&egrave;re croire que je suis un bon membre de la soci&eacute;t&eacute; et que je contribue &agrave; quelque chose plut&ocirc;t que de sentir que je l'arnaque avec succ&egrave;s et c'est pourquoi j'ai d&eacute;cid&eacute; de faire ce que j'ai fait. Mais tout le monde est plus ou moins tracass&eacute; par le sentiment d'&ecirc;tre pay&eacute; pour faire ce qui n'est pas vraiment utile. Aussi cessons de d&eacute;fendre l'id&eacute;e d'encourager &agrave; faire la mauvaise chose et essayons au moins de proposer des arrangements pour encourager les gens &agrave; faire la bonne, qui est de faire du logiciel libre.

source: Thank you.
fr: Merci.

source: <strong>[After this RMS answered questions for about an hour. I have only included a very few of the questions and answers in this version. The tape was bad, and I didn't have the time to do a proper job on all of it] </strong>
fr: <strong>[Apr&egrave;s &ccedil;a, RMS a r&eacute;pondu &agrave; des questions pendant environ une heure. J'ai seulement inclus tr&egrave;s peu de ces questions et r&eacute;ponses dans cette version. La bande &eacute;tait mauvaise, et je n'ai pas eu le temps de faire un travail appropri&eacute; sur la totalit&eacute;]</strong>

source: <b>Q</b>: Has anyone tried to make problems for you?
fr: <b>Question&nbsp;:</b> Est-ce que quelqu'un a tent&eacute; de vous causer des ennuis&nbsp;?

source: <b>A:</b> The only time anyone has tried to make a problem for me was those owners, so called, self-styled owners of Gosling Emacs. Aside from that they have no grounds to do so, so there is not much they can do. By the way, I'd like to call everyone's attention to the way in which people use language to try to encourage people to think certain thoughts and not think of others. Much of the terminology current in the field was chosen by the self-styled software owners to try to encourage you to try to make you see software as similar to material objects that are property, and overlook the differences. The most flagrant example of this is the term &ldquo;pirate&rdquo;. Please refuse to use to use the term &ldquo;pirate&rdquo; to describe somebody who wishes to share software with his neighbor like a good citizen.
fr: <b>R&eacute;ponse&nbsp;:</b> La seule fois qu'on a tent&eacute; de me causer des ennuis c'&eacute;tait avec ces propri&eacute;taires pr&eacute;tendus, soi-disant propri&eacute;taires de Gosling Emacs. Hormis le fait qu'ils n'en avaient aucune raison, ils ne peuvent rien faire de plus. D'ailleurs, je voudrais attirer l'attention de tout le monde sur la fa&ccedil;on dont les gens se servent d'un langage pour essayer d'encourager les gens &agrave; penser certaines choses et &agrave; ne pas penser &agrave; d'autres. Une grande part de la terminologie actuelle dans le domaine a &eacute;t&eacute; choisie par les soi-disant propri&eacute;taires de logiciel pour tenter de vous encourager &agrave; voir le logiciel assimil&eacute; &agrave; des objets mat&eacute;riels comme une propri&eacute;t&eacute; et oublier les diff&eacute;rences. L'exemple le plus flagrant en est le terme &laquo;&nbsp;pirate&nbsp;&raquo;. Refusez s'il vous pla&icirc;t d'utiliser le terme &laquo;&nbsp;pirate&nbsp;&raquo; pour d&eacute;crire quelqu'un qui souhaite partager le logiciel avec son voisin comme un bon citoyen.

source: I forgot to tell you this: The idea of copyright was invented after the printing press. In ancient times authors copied from each other freely, and this was not considered wrong, and it was even very useful: The only way certain authors works have survived, even in fragments, is because some of them were quoted at length in other works which have survived.
fr: J'ai oubli&eacute; de vous dire ceci&nbsp;: L'id&eacute;e de droit d'auteur a &eacute;t&eacute; invent&eacute; apr&egrave;s la presse imprim&eacute;e. Dans l'ancien temps, les auteurs se copiaient les uns les autres librement et ceci n'&eacute;tait pas mal consid&eacute;r&eacute;. Et c'&eacute;tait m&ecirc;me tr&egrave;s utile&nbsp;: certains travaux d'auteurs ont seulement pu survivre, m&ecirc;me en fragments, parce qu'ils ont &eacute;t&eacute; cit&eacute;s longuement dans d'autres travaux qui, eux ont surv&eacute;cu.

source: This was because books were copied one copy at the time. It was ten times as hard to make ten copies as it was to make one copy. Then the printing press was invented, and this didn't prevent people from copying books by hand, but by comparison with printing them, copying by hand was so unpleasant that it might as well have been impossible.
fr: C'&eacute;tait parce que des livres &eacute;taient copi&eacute;s une fois &agrave; ce moment-l&agrave;. Il &eacute;tait dix fois plus dur d'en tirer dix copies qu'une seule. Alors la presse a &eacute;t&eacute; invent&eacute;e. Et ceci n'a pas emp&ecirc;ch&eacute; les gens de copier les livres &agrave; la main. Mais par comparaison avec le fait de les imprimer, les copier &agrave; la main &eacute;tait si d&eacute;sagr&eacute;able que cela pouvait rendre la t&acirc;che tout &agrave; fait impossible.

source: When books could only be made by mass production, copyright then started to make sense and it also did not take away the freedom of the reading public. As a member of the public who didn't own a printing press, you couldn't copy a book anyway. So you weren't losing any freedom just because there were copyrights. Thus copyright was invented, and made sense morally because of a technological change. Now the reverse change is happening. Individual copying of information is becoming better and better, and we can see that the ultimate progress of technology is to make it possible to copy any kind of information. [break due to turning of tape]
fr: Quand les livres ont pu &ecirc;tre produits en masse, le droit d'auteur commen&ccedil;ait &agrave; avoir un sens. De plus, celui-ci n'a pas confisqu&eacute; la libert&eacute; de lecture publique, puisqu'en tant que membre du public qui n'avait pas de presse vous ne pouviez pas copier de livre de toute fa&ccedil;on. Aussi vous ne perdiez aucune libert&eacute; &agrave; cause du droit d'auteur. Il a &eacute;t&eacute; invent&eacute; et se comprenait par un changement technologique. Or aujourd'hui le changement inverse se produit. La copie individuelle d'information se fait de mieux en mieux et nous pouvons voir que la finalit&eacute; du progr&egrave;s technologique est de permettre de copier n'importe quel genre d'information&hellip; [coupure due &agrave; la rotation de la bande].

source: Thus we are back in the same situation as in the ancient world where copyright did not make sense.
fr: Ainsi nous retournons dans la m&ecirc;me situation que dans le monde antique o&ugrave; le droit d'auteur n'avait pas de sens.

source: If we consider our idea of property, they come from material objects. Material objects satisfy a conservation law, pretty much. Yes it's true I can break a chalk in half, that's not it, and it gets worn down, it gets consumed. But basically this is one chair [pointing at a chair]. I can't just sort of snap my finger and have two chairs. The only way to get another one is to build it just the way the first one was build. It takes more raw materials, it takes more work of production, and our ideas of property were evolved to make moral sense to fit these facts.
fr: Si nous consid&eacute;rons notre concept de propri&eacute;t&eacute;, &ccedil;a vient des objets mat&eacute;riels. Les objets mat&eacute;riels satisfont une loi &eacute;conomique, plut&ocirc;t pas mal. Oui c'est vrai, je peux casser une craie en deux mais ce n'est pas &ccedil;a, et elle va s'user, se consommer. Mais fondamentalement ceci est une chaise [pointant une chaise du doigt]. Je ne peux pas simplement claquer des doigts et en avoir deux. La seule mani&egrave;re d'en avoir une deuxi&egrave;me, c'est de la construire comme l'a &eacute;t&eacute; la premi&egrave;re. &Ccedil;a prend plus de mati&egrave;res premi&egrave;res, plus de travail de production et nos id&eacute;es de propri&eacute;t&eacute; ont &eacute;t&eacute; d&eacute;velopp&eacute;es pour qu'il y ait un sens moral &agrave; ce que ces faits concordent.

source: Essentially they are trying to preserve the &ldquo;material object age&rdquo;, but it's gone, and we should get our ideas of right and wrong in sync with the actual facts of the world we live in.
fr: Pour l'essentiel, ils tentent de conserver &laquo;&nbsp;l'&acirc;ge de l'objet mat&eacute;riel&nbsp;&raquo; mais celui-ci est fini et notre conception du vrai et du faux devrait &ecirc;tre synchrone avec les faits r&eacute;els du monde dans lequel nous vivons.

source: <b>A:</b> With information that's not generally useful, or is of a personal nature, I would say it's OK. In other words not information about how to do things, but information about what you intend to do. Information whose only value to others is speculative, that is they can take some money away from you, but they can't actually create anything with it. It's perfectly reasonable I'd say to keep that sort of thing secret and controlled.
fr: <b>R&eacute;ponse&nbsp;:</b> Pour une information qui n'est pas utile au public ou &agrave; caract&egrave;re personnel, je dirais OUI. En d'autres termes, pas l'information sur la mani&egrave;re de faire les choses mais sur ce que vous avez l'intention de faire. L'information dont la seule valeur pour les autres est sp&eacute;culative. Celle qui leur permet de vous faire perdre de l'argent mais avec laquelle ils ne peuvent r&eacute;ellement rien cr&eacute;er. Je dirais qu'il est parfaitement raisonnable de garder ce genre de chose secret et sous contr&ocirc;le.

source: But in terms of creative information, information that people can use or enjoy, and that will be used and enjoyed more the more people who have it, always we should encourage the copying.
fr: Mais en termes d'information cr&eacute;atrice, celle que les gens peuvent utiliser ou dont ils peuvent profiter et qui le sera d'autant plus que plus de gens l'auront, nous devrions toujours en encourager la copie.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Permission is granted to make and distribute verbatim copies of this transcript as long as the copyright and this permission notice appear.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Miluz.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
