Repository: gitGNU/gnu_www-fr
Catalog: philosophy/stallman-kth.*.po
Languages: fr

source: It was clear to me from what I saw happening to these proprietary systems that the only way we could have the spirit of the old AI lab was to have a free operating system. To have a system made up of free software which could be shared with anyone. So that we could invite everyone to join in improving it. And that's what led up to the GNU project. So I guess we've arrived at the second part of the talk.
fr: Il m'appar&ucirc;t clair, d'apr&egrave;s ce que j'avais vu advenir de ces syst&egrave;mes propri&eacute;taires que la seule fa&ccedil;on de conserver l'esprit du vieux labo d'I.A. &eacute;tait d'avoir un logiciel d'exploitation libre. D'avoir un syst&egrave;me form&eacute; par du logiciel libre pouvant &ecirc;tre partag&eacute; avec n'importe qui. De fa&ccedil;on &agrave; pouvoir inviter tout le monde &agrave; s'associer pour l'am&eacute;liorer. Et c'est ce qui a conduit au projet GNU. Ainsi j'estime que nous sommes arriv&eacute;s &agrave; la deuxi&egrave;me partie de l'entretien.

source: About three and a half year ago it was clear to me that I should start developing a <a href="/philosophy/free-sw.html">free software</a> system. I could see two possible kinds of systems to develop: One: A LISP-machine-like system, essentially a system just like the MIT LISP machine system that had just been developed, except free, and running on general purpose hardware, not on special LISP machines. And the other possibility was a more conventional operating system, and it was clear to me that if I made a conventional operating system, I should make it compatible with Unix, because that would make it easy for people all around to switch to it. After a little while, I concluded I should do the latter and the reason was, that I saw that you can't have something really like the LISP machine system on general purpose hardware. The LISP machine system uses special hardware plus special writable microcode to gain both good execution speed and robust detection of errors at runtime, specially data-type errors. In order to make a LISP system run fast enough on ordinary hardware, you have to start making assumptions. Assuming that a certain argument is the right type, and then if it isn't the system just crashes.
fr: Environ trois ans et demi auparavant, il &eacute;tait devenu clair pour moi que je devais commencer &agrave; d&eacute;velopper un syst&egrave;me de logiciel libre. Je pouvais voir deux genres de syst&egrave;mes se d&eacute;velopper&nbsp;: le premier, un syst&egrave;me qui ressemblait &agrave; celui des machines LISP, un syst&egrave;me essentiellement comme celui qui venait d'&ecirc;tre d&eacute;velopp&eacute; sur les machines LISP du M.I.T. mais libre et fonctionnant sur tout type de mat&eacute;riel, pas seulement sur les machines LISP sp&eacute;cialis&eacute;es. Et l'autre syst&egrave;me possible &eacute;tait un logiciel d'exploitation plus conventionnel. Et il &eacute;tait clair pour moi que si je faisais un logiciel d'exploitation conventionnel, je devais le rendre compatible avec Unix parce que &ccedil;a rendait la migration plus facile aux gens alentours. Peu de temps plus tard, j'en ai conclu que c'&eacute;tait ce qu'il fallait faire. Et la raison, c'&eacute;tait qu'il n'&eacute;tait pas vraiment possible d'obtenir quelque chose d'identique au syst&egrave;me des machines LISP sur tout type de mat&eacute;riel. Le syst&egrave;me des machines LISP utilise du mat&eacute;riel sp&eacute;cial, plus un microcode &agrave; affichage sp&eacute;cial pour gagner une bonne vitesse d'ex&eacute;cution et une d&eacute;tection solide des erreurs pendant le temps d'ex&eacute;cution, en particulier les erreurs sur le type des donn&eacute;es. Pour qu'un syst&egrave;me LISP puisse fonctionner assez rapidement sur du mat&eacute;riel ordinaire, vous devez commencer par faire des suppositions. En supposant que tel argument est le bon. Et si ce n'est pas le cas, vous obtenez le plantage du syst&egrave;me.

source: Of course you can put in explicit checks, you can write a robust program if you want, but the fact is that you are going to get things like memory addressing errors when you feed a function an argument of the wrong type if you did NOT put in things to check for it.
fr: Naturellement vous pouvez y placer des contr&ocirc;les explicites, vous pouvez &eacute;crire un programme solide si vous voulez, mais le fait est que vous allez obtenir des choses comme des erreurs d'adressage de m&eacute;moire lorsque vous alimentez une fonction, un argument de type inappropri&eacute; si vous n'aviez pas pr&eacute;vu d'y placer des &eacute;l&eacute;ments &agrave; contr&ocirc;ler pour &ccedil;a.

source: So the result is then that you need something running underneath the LISP system to you catch these errors, and give the user the ability to keep on running, and debug what happened to him. Finally I concluded that if I was going to have to have a operating system at a lower level, I might as well make a good operating-system&mdash;that it was a choice between an operating system and the lisp, or just an operating system; therefore I should do the operating system first, and I should make it compatible with Unix. Finally when I realized that I could use the most amusing word in the English language as a name for this system, it was clear which choice I had to make. And that word is of course GNU, which stands for &ldquo;Gnu's Not Unix&rdquo;. The recursive acronym is a very old tradition among the hacker community around MIT. It started, I believe, with an editor called TINT, which means: &ldquo;Tint Is Not Teco&rdquo;, and later on it went through names such as &ldquo;SINE&rdquo; for &ldquo;SINE Is Not Emacs&rdquo;, and FINE for &ldquo;Fine Is Not Emacs&rdquo;, and EINE for &ldquo;Eine Is Not Emacs&rdquo;, and ZWEI for &ldquo;Zwei Was Eine Initially&rdquo;, and ultimately now arrives at GNU.
fr: Le r&eacute;sultat, c'est qu'il fallait que quelque chose fonctionne en dessous du syst&egrave;me LISP pour percevoir ces erreurs, donner &agrave; l'utilisateur la possibilit&eacute; de maintenir le fonctionnement et de d&eacute;boguer les probl&egrave;mes qui &eacute;taient survenus. Enfin j'en ai conclu que si je devais avoir &agrave; plus bas niveau un logiciel d'exploitation, je pouvais tout aussi bien faire un bon syst&egrave;me d'exploitation &mdash;&nbsp;c'&eacute;tait un choix entre un syst&egrave;me d'exploitation et le LISP ou juste un syst&egrave;me d'exploitation&nbsp;; donc je devais faire le logiciel d'exploitation d'abord et le rendre compatible avec Unix. Enfin quand j'ai r&eacute;alis&eacute; que je pouvais utiliser le plus dr&ocirc;le des mots anglais pour nommer ce syst&egrave;me, le choix que je devais faire &eacute;tait clair. Et ce mot est bien-s&ucirc;r GNU, qui signifie &laquo;&nbsp;GNU is Not Unix&nbsp;&raquo;. L'acronyme r&eacute;cursif est une tr&egrave;s vieille tradition dans la communaut&eacute; des hackers aux environs du M.I.T. Il a commenc&eacute; je crois, avec un &eacute;diteur appel&eacute; TINT, ce qui signifie&nbsp;: &laquo;&nbsp;Tint Is Not Teco&nbsp;&raquo; et plus tard c'est pass&eacute; par des noms comme &laquo;&nbsp;SINE&nbsp;&raquo; pour &laquo;&nbsp;Sine Is Not Emacs&nbsp;&raquo;, et FINE pour &laquo;&nbsp;Fine Is Not Emacs&nbsp;&raquo;, et EINE pour &laquo;&nbsp;Eine Is Not Emacs&nbsp;&raquo;, et ZWEI pour &laquo;&nbsp;Zwei Was Eine Initially&nbsp;&raquo;, et finalement c'&eacute;tait arriv&eacute; &agrave; GNU.

source: I would say that since the time about two and a half years ago when I actually started working on GNU, I've done more than half of the work. When I was getting ready to start working on the project, I first started looking around for what I could find already available free. I found out about an interesting portable compiler system which was called &ldquo;the free university compiler kit&rdquo;, and I thought, with a name like that, perhaps I could have it. So, I sent a message to the person who had developed it asking if he would give it to the GNU project, and he said &ldquo;No, the university might be free, but the software they develop isn't&rdquo;, but he then said that he wanted to have a Unix compatible system too, and he wanted to write a sort of kernel for it, so why didn't I then write the utilities, and they could both be distributed with his proprietary compiler, to encourage people to buy that compiler. And I thought that this was despicable and so I told him that my first project would be a compiler.
fr: Je dirais qu'environ deux ans et demi avant de commencer r&eacute;ellement &agrave; travailler sur GNU, j'avais d&eacute;j&agrave; fait plus de la moiti&eacute; du travail. Au moment o&ugrave; j'&eacute;tais pr&ecirc;t &agrave; d&eacute;marrer le projet, j'ai d'abord regard&eacute; autour de moi ce qu'il y avait de libre d&eacute;j&agrave; disponible. J'ai d&eacute;couvert un syst&egrave;me portatif int&eacute;ressant de compilateur appel&eacute; &laquo;&nbsp;le kit compilateur libre universitaire&nbsp;&raquo; et j'ai pens&eacute; qu'avec un nom comme &ccedil;a, je pouvais peut-&ecirc;tre l'avoir. Ainsi, j'ai envoy&eacute; un message &agrave; la personne qui l'avait d&eacute;velopp&eacute; en lui demandant s'il acceptait de le donner au projet GNU. Et il a dit&nbsp;: &laquo;&nbsp;Non, l'universit&eacute; est peut-&ecirc;tre libre, mais le logiciel qu'ils d&eacute;veloppent ne l'est pas&nbsp;&raquo;, mais aussi qu'il voulait avoir un syst&egrave;me compatible avec Unix et qu'il a voulu &eacute;crire une sorte de noyau pour lui, alors pourquoi je n'&eacute;crirais pas les utilitaires, comme &ccedil;a les deux pourraient &ecirc;tre distribu&eacute;s avec son compilateur propri&eacute;taire et &ccedil;a encouragerait les gens &agrave; l'acheter. J'ai pens&eacute; que c'&eacute;tait ignoble alors je lui ai dit que mon premier projet sera de faire un compilateur.

source: I didn't really know much about optimizing compilers at the time, because I'd never worked on one. But I got my hands on a compiler, that I was told at the time was free. It was a compiler called PASTEL, which the authors say means &ldquo;off-color PASCAL&rdquo;.
fr: Je ne savais pas vraiment grand-chose au sujet des compilateurs de lin&eacute;arisation parce que je n'avais jamais travaill&eacute; dessus. Mais j'ai mis les mains dedans. Et celui dont on m'avait parl&eacute; &eacute;tait libre. C'&eacute;tait un compilateur appel&eacute; PASTEL dont les auteurs disaient que c'&eacute;tait du &laquo;&nbsp;PASCAL mal fichu&nbsp;&raquo;.

source: Pastel was a very complicated language including features such as parametrized types and explicit type parameters and many complicated things. The compiler was of course written in this language, and had many complicated features to optimize the use of these things. For example: the type &ldquo;string&rdquo; in that language was a parameterized type; you could say &ldquo;string(n)&rdquo; if you wanted a string of a particular length; you could also just say &ldquo;string&rdquo;, and the parameter would be determined from the context. Now, strings are very important, and it is necessary for a lot of constructs that use them to run fast, and this means that they had to have a lot of features to detect such things as: when the declared length of a string is an argument that is known to be constant throughout the function, to save to save the value and optimize the code they're going to produce, many complicated things. But I did get to see in this compiler how to do automatic register allocation, and some ideas about how to handle different sorts of machines.
fr: Le Pastel &eacute;tait un langage tr&egrave;s compliqu&eacute; comprenant des dispositifs comme des caract&egrave;res param&eacute;tris&eacute;s et des caract&egrave;res param&egrave;tres explicites et beaucoup de choses compliqu&eacute;es. Le compilateur naturellement a &eacute;t&eacute; &eacute;crit dans ce langage et comportait nombre de dispositifs compliqu&eacute;s pour optimiser l'utilisation de ces &eacute;l&eacute;ments. Par exemple&nbsp;: le caract&egrave;re &laquo;&nbsp;string&nbsp;&raquo; dans ce langage &eacute;tait un caract&egrave;re param&eacute;tris&eacute;; vous pouviez dire le &laquo;&nbsp;string(n)&nbsp;&raquo; si vous vouliez une cha&icirc;ne d'une longueur particuli&egrave;re; vous pouviez &eacute;galement juste dire &laquo;&nbsp;string&nbsp;&raquo;, et le param&egrave;tre &eacute;tait d&eacute;termin&eacute; &agrave; partir du contexte. Maintenant, les cha&icirc;nes sont tr&egrave;s importantes et n&eacute;cessaires &agrave; beaucoup de constructions qui les utilisent pour fonctionner rapidement. Et &ccedil;a veut dire qu'elles devaient avoir beaucoup de fonctions pour d&eacute;tecter des choses comme quand la longueur d&eacute;clar&eacute;e d'une cha&icirc;ne est un argument connu pour &ecirc;tre constant dans toute la fonction, quand il s'agit de sauvegarder la valeur et d'optimiser le code qu'elles vont produire&hellip; beaucoup de choses compliqu&eacute;es. Mais j'ai pu voir dans ce compilateur comment proc&eacute;der &agrave; l'allocation automatique de registre et quelques id&eacute;es sur la fa&ccedil;on de manipuler diff&eacute;rents types de machines.

source: Well, since this compiler already compiled PASTEL, what i needed to do was add a front-end for C, which I did, and add a back-end for the 68000 which I expected to be my first target machine. But I ran into a serious problem. Because the PASTEL language was defined not to require you to declare something before you used it, the declarations and uses could be in any order, in other words: Pascal's &ldquo;forward&rdquo; declaration was obsolete, because of this it was necessary to read in an entire program, and keep it in core, and then process it all at once. The result was that the intermediate storage used in the compiler, the size of the memory needed, was proportional to the size of your file. And this also included stack-space, you needed gigantic amounts of stack space, and what I found as a result was: that the 68000 system available to me could not run the compiler. Because it was a horrible version of Unix that gave you a limit of something like 16K words of stack, this despite the existence of six megabytes in the machine, you could only have 16Kw of stack or something like that. And of course to generate its conflict matrix to see which temporary values conflicted, or was alive at the same time as which others, it needed a quadratic matrix of bits, and that for large functions that would get it to hundreds of thousands of bytes. So i managed to debug the first pass of the ten or so passes of the compiler, cross compiled on to that machine, and then found that the second one could never run.
fr: Bon, ce compilateur ayant d&eacute;j&agrave; compil&eacute; PASTEL, j'avais &agrave; rajouter une entr&eacute;e pour le C&nbsp;; ce que je fis. Puis d'ajouter un arri&egrave;re-plan pour la 68000 qui devait &ecirc;tre ma premi&egrave;re machine cible. Mais j'allais vers un s&eacute;rieux probl&egrave;me. Puisque le langage PASTEL &eacute;tait con&ccedil;u de mani&egrave;re &agrave; ne pas avoir besoin de d&eacute;clarer quoi que ce soit avant de l'utiliser. Les d&eacute;clarations et utilitaires pouvaient &ecirc;tre dans n'importe quel ordre&nbsp;; en d'autres termes&nbsp;: la d&eacute;claration &laquo;&nbsp;forward&nbsp;&raquo; du Pascal &eacute;tait obsol&egrave;te. Pour cette raison il &eacute;tait n&eacute;cessaire d'emmagaziner le programme dans son entier, de le garder dans le noyau et de l'appliquer d'un trait. Le r&eacute;sultat, c'&eacute;tait que le stockage interm&eacute;diaire utilis&eacute; dans le compilateur, la taille de la m&eacute;moire requise, &eacute;taient proportionnels &agrave; la taille de votre fichier. Et cela incluait aussi l'espace de pile&nbsp;; vous aviez besoin d'une quantit&eacute; gigantesque d'espace de pile, et j'en ai conclu que le syst&egrave;me 68000 dont je disposais ne pouvait pas faire fonctionner le compilateur. Car c'&eacute;tait une horrible version d'Unix qui vous limitait &agrave; quelque chose comme 16K de mots de pile, ceci en d&eacute;pit de l'existence de six m&eacute;ga-octets dans la machine. Et naturellement pour g&eacute;n&eacute;rer la matrice des conflits pour voir quelles valeurs temporaires &eacute;taient en conflit ou actives en m&ecirc;me temps que les autres, il &eacute;tait n&eacute;cessaire d'avoir une matrice quadratique de bits. Et pour les grandes fonctions cela pouvait prendre des centaines de milliers d'octets. Aussi je suis parvenu &agrave; corriger la premi&egrave;re des quelque dix passes du compilateur en compilation crois&eacute;e sur cette machine et j'ai constat&eacute; alors que la seconde ne pourrait jamais fonctionner.

source: While I was thinking about what to do about these problems and wondering whether I should try to fix them or write entirely new compiler, in a roundabout fashion I began working on GNU Emacs. GNU Emacs is the main distributed portion of the GNU system. It's an extensible text editor a lot like the original emacs which I developed ten years ago, except that this one uses actual LISP as its extension language. The editor itself is implemented in C, as is the LISP interpreter, so the LISP interpreter is completely portable, and you don't need a LISP system external to the editor. The editor contains its own LISP system, and all of the editing commands are written in LISP so that they can provide you with examples to look at for how to write your own editing commands, and things to start with, so you can change them into the editing commands that you really want.
fr: Pendant que je r&eacute;fl&eacute;chissais &agrave; ces probl&egrave;mes en me demandant si je devais essayer de les corriger ou bien d'&eacute;crire enti&egrave;rement un nouveau compilateur, j'ai commenc&eacute; de mani&egrave;re indirecte &agrave; travailler sur GNU Emacs. Gnu Emacs est la partie principale de la distribution du syst&egrave;me GNU. C'est un &eacute;diteur de texte extensible qui ressemble de pr&egrave;s &agrave; l'Emacs original que j'ai d&eacute;velopp&eacute; il y a dix ans, sauf que celui-ci emploie le v&eacute;ritable LISP pour son extension de langage. Le r&eacute;dacteur lui-m&ecirc;me est impl&eacute;ment&eacute; en C de m&ecirc;me que l'interpr&eacute;teur LISP. Ainsi l'interpr&eacute;teur LISP est enti&egrave;rement portatif et vous n'avez pas besoin de syst&egrave;me LISP externe au r&eacute;dacteur. Le r&eacute;dacteur contient son propre syst&egrave;me LISP et toutes les commandes d'&eacute;dition sont &eacute;crites en LISP de mani&egrave;re &agrave; pouvoir vous donner des exemples sur la fa&ccedil;on d'&eacute;crire vos propres commandes d'&eacute;dition et des &eacute;l&eacute;ments pour d&eacute;buter avec. Ainsi vous pouvez les changer pour les commandes d'&eacute;dition que vous voulez vraiment.

source: In the summer of that year, about two years ago now, a friend of mine told me that because of his work in early development of Gosling Emacs, he had permission from Gosling in a message he had been sent to distribute his version of that. Gosling originally had set up his Emacs and distributed it free and gotten many people to help develop it, under the expectation based on Gosling's own words in his own manual that he was going to follow the same spirit that I started with the original Emacs. Then he stabbed everyone in the back by putting copyrights on it, making people promise not to redistribute it and then selling it to a software-house. My later dealings with him personally showed that he was every bit as cowardly and despicable as you would expect from that history.
fr: L'&eacute;t&eacute; de cette ann&eacute;e-l&agrave;, il y a environ deux ans maintenant, un ami m'a dit qu'en raison de son travail au tout d&eacute;but du d&eacute;veloppement de Gosling Emacs, il a eu la permission &eacute;crite de Gosling de distribuer sa propre version. Gosling, &agrave; l'origine, avait cr&eacute;&eacute; son Emacs. Il l'avait distribu&eacute; librement et beaucoup de gens aid&egrave;rent &agrave; son d&eacute;veloppement, avec l'espoir &mdash;&nbsp; selon les propres mots de Gosling dans son manuel&nbsp;&mdash; qu'il avait suivi le m&ecirc;me &eacute;tat d'esprit que celui que j'avais donn&eacute; &agrave; l'Emacs original. Ensuite il a poignard&eacute; tout le monde dans le dos en posant un copyright dessus, en faisant promettre aux gens de ne pas le redistribuer puis en le vendant &agrave; une maison d'&eacute;dition de logiciels. Les rapports d'affaires que j'ai eu avec lui par la suite m'ont personnellement prouv&eacute; qu'il &eacute;tait aussi l&acirc;che et ignoble que vous pouvez le voir dans cette histoire.

source: But in any case, my friend gave me this program, and my intention was to change the editing commands at the top level to make them compatible with the original Emacs that I was used to. And to make them handle all the combinations of numerical arguments and so on that one might expect that they would handle and have all the features that I wanted. But after a little bit of this, I discovered that the extension language of that editor, which is called MOCKLISP, was not sufficient for the task. I found that that I had to replace it immediately in order to do what I was planning to do. Before I had had the idea of someday perhaps replacing MOCKLISP with real LISP, but what I found out was that it had do be done first. Now, the reason that MOCKLISP is called MOCK, is that it has no kind of structure datatype: it does not have LISP lists; it does not have any kind of array. It also does not have LISP symbols, which are objects with names: for any particular name, there is only one object, so that you can type in the name and you always get the same object back. And this tremendously hampers the writing of many kinds of programs, you have to do things by complicated string-manipulation that don't really go that way.
fr: Mais de toute fa&ccedil;on, mon ami m'avait donn&eacute; le programme. Et j'avais l'intention de modifier les commandes d'&eacute;dition &agrave; un niveau sup&eacute;rieur pour les rendre compatibles avec l'Emacs original dont j'avais l'habitude. Ceci pour qu'elles puissent manipuler toutes les combinaisons d'arguments num&eacute;riques et tout ce que l'on pouvait s'attendre &agrave; ce qu'elles manipulent, en &eacute;tant pourvues de tous les dispositifs que je voulais. Mais peu apr&egrave;s, j'ai d&eacute;couvert que le langage d'extension de ce r&eacute;dacteur, appel&eacute; MOCKLISP, ne suffisait pas &agrave; la t&acirc;che. J'ai compris que je devais le remplacer imm&eacute;diatement pour pouvoir r&eacute;aliser mon projet. J'avais d&eacute;j&agrave; pens&eacute; auparavant &agrave; remplacer &eacute;ventuellement MOCKLISP par le vrai LISP, mais ce que j'ai d&eacute;couvert c'est qu'il fallait le faire d'abord. Maintenant, la raison pour laquelle MOCKLISP s'appelle MOCK (FAUX), c'est qu'il n'y a aucun type de structure des donn&eacute;es&nbsp;: il n'y a pas de listes LISP&nbsp;; il n'y a aucun type de tableau. Il n'y a &eacute;galement pas de symboles LISP, qui sont des objets nomm&eacute;s&nbsp;: &agrave; chaque nom particulier est attribu&eacute; un seul objet de mani&egrave;re &agrave; ce que la saisie du nom se rapporte toujours au m&ecirc;me objet. Sinon, &ccedil;a entrave consid&eacute;rablement l'&eacute;criture de pas mal de types de programmes, en vous obligeant &agrave; passer par des manipulations alphanum&eacute;riques compliqu&eacute;es qui ne vont pas vraiment dans ce sens.
