Repository: gitGNU/gnu_www-fr
Catalog: philosophy/stallman-kth.*.po
Languages: fr

source: So, that was the AI lab. But what was the culture of hackers like aside from their anarchism? In the days of the PDP-1 only one person could use the machine, at the beginning at least. Several years later they wrote a timesharing system, and they added lots of hardware for it. But in the beginning you just had to sign up for some time. Now of course the professors and the students working on official projects would always come in during the day. So, the people who wanted to get lots of time would sign up for time at night when there were less competition, and this created the custom of hackers working at night. Even when there was timesharing it would still be easier to get time, you could get more cycles at night, because there were fewer users. So people who wanted to get lots of work done, would still come in at night. But by then it began to be something else because you weren't alone, there were a few other hackers there too, and so it became a social phenomenon. During the daytime if you came in, you could expect to find professors and students who didn't really love the machine, whereas if during the night you came in you would find hackers. Therefore hackers came in at night to be with their culture. And they developed other traditions such as getting Chinese food at three in the morning. And I remember many sunrises seen from a car coming back from Chinatown. It was actually a very beautiful thing to see a sunrise, cause' that's such a calm time of day. It's a wonderful time of day to get ready to go to bed. It's so nice to walk home with the light just brightening and the birds starting to chirp, you can get a real feeling of gentle satisfaction, of tranquility about the work that you have done that night.
fr: C'&eacute;tait le laboratoire d'I.A. Mais c'&eacute;tait quoi la culture des hackers hormis leur anarchisme&nbsp;? Dans les temps du PDP-1 une seule personne pouvait utiliser la machine, du moins au d&eacute;but. Plusieurs ann&eacute;es apr&egrave;s ils ont &eacute;crit un syst&egrave;me de r&eacute;partition du temps et ils ont rajout&eacute; pas mal de mat&eacute;riel pour &ccedil;a. Mais au d&eacute;but, vous pouviez seulement vous enregistrer pour une p&eacute;riode donn&eacute;e. Naturellement les professeurs et les &eacute;tudiants qui travaillaient sur des projets officiels venaient toujours pendant la journ&eacute;e. Ainsi, les gens qui voulaient avoir plus de temps s'enregistraient la nuit quand il y avait moins d'affluence et ce fut la coutume des hackers de travailler la nuit. M&ecirc;me lorsqu'il y avait le r&eacute;partiteur de temps, il &eacute;tait toujours plus facile d'en avoir, vous pouviez obtenir plus de cycles la nuit parce qu'il y avait peu d'utilisateurs. Aussi ceux qui d&eacute;siraient effectuer un volume de travail plus important devaient venir la nuit. Mais &ccedil;a a commenc&eacute; &agrave; changer parce que vous n'&eacute;tiez pas seul, il y avait quelques autres hackers ici et l&agrave; et c'est devenu un ph&eacute;nom&egrave;ne social. Si vous entriez pendant la journ&eacute;e, vous pouviez vous attendre &agrave; trouver des professeurs et des &eacute;tudiants qui n'&eacute;taient pas des fans de la machine, alors que si vous veniez la nuit vous trouviez des hackers. Par cons&eacute;quent, les hackers sont venus la nuit pour partager leur culture. Et ils ont d&eacute;velopp&eacute; d'autres traditions, comme celle d'aller chercher de la nourriture chinoise &agrave; trois heure du matin. Et j'ai beaucoup de souvenirs de levers de soleil depuis la voiture en revenant de Chinatown. C'&eacute;tait tellement beau de voir le lever du soleil, c'est une heure tellement calme du jour. C'est une heure merveilleuse pour aller au lit. Il est si doux de marcher vers sa maison dans une lumi&egrave;re qui commence juste &agrave; poindre et les oiseaux qui commencent &agrave; gazouiller. Vous aviez une sensation de douce satisfaction, de tranquillit&eacute; pour le travail que vous avez fait la nuit.

source: Another tradition that we began was that of having places to sleep at the lab. Ever since I first was there, there was always at least one bed at the lab. And I may have done a little bit more living at the lab than most people because every year of two for some reason or other I'd have no apartment and I would spend a few months living at the lab. And I've always found it very comfortable, as well as nice and cool in the summer. But it was not at all uncommon to find people falling asleep at the lab, again because of their enthusiasm; you stay up as long as you possibly can hacking, because you just don't want to stop. And then when you're completely exhausted, you climb over to the nearest soft horizontal surface. A very informal atmosphere.
fr: Une autre tradition que nous avons commenc&eacute;e &eacute;tait celle d'avoir des endroits o&ugrave; dormir au laboratoire. Depuis que j'y &eacute;tais venu la premi&egrave;re fois, il y avait toujours au moins un lit. Et j'y passais un peu plus de temps que la plupart des autres parce que chaque ann&eacute;e, pour une raison ou une autre, je n'avais pas d'appartement et j'y vivais quelques mois. Et je l'ai toujours trouv&eacute; tr&egrave;s confortable et sympa et frais en &eacute;t&eacute;. Mais il n'&eacute;tait pas du tout rare de tomber sur des personnes endormies au laboratoire, toujours &agrave; cause de leur enthousiasme&nbsp;: vous restez le plus longtemps possible &agrave; hacker parce que vous ne vouliez pas vous arr&ecirc;ter, et une fois que vous &ecirc;tiez compl&egrave;tement &eacute;puis&eacute;, vous escaladiez la surface horizontale souple la plus proche. Une ambiance vraiment sans c&eacute;r&eacute;monie.

source: But when the hackers all left the lab this caused a demographic change, because the professors and the students who didn't really love the machine were just as numerous as before, so they were now the dominant party, and they were very scared. Without hackers to maintain the system, they said, &ldquo;we're going to have a disaster, we must have commercial software&rdquo;, and they said &ldquo;we can expect the company to maintain it&rdquo;. It proved that they were utterly wrong, but that's what they did.
fr: Mais quand les hackers sont partis du laboratoire, &ccedil;a a caus&eacute; un changement d&eacute;mographique parce que les professeurs et les &eacute;tudiants qui n'&eacute;taient pas vraiment des fans de la machine &eacute;taient aussi nombreux qu'avant&nbsp;; ils repr&eacute;sentaient la majorit&eacute;. Et ils ont vraiment eu peur. Sans hacker pour maintenir le syst&egrave;me, ils se sont dit&nbsp;: &laquo;&nbsp;&Ccedil;a va &ecirc;tre un d&eacute;sastre, il nous faut un logiciel commercial&nbsp;&raquo;, et ils se sont dit &laquo;&nbsp;Comme &ccedil;a, nous pourrons compter sur la maintenance de l'entreprise&nbsp;&raquo;. Il fut prouv&eacute; qu'ils avaient absolument tort, mais c'est ce qu'ils ont fait.

source: One thing was that that software was much more poorly written, and harder to understand; therefore making it harder for people to make the changes that were in fact needed. Another was, that that software came with security, which had the inevitable effect of causing people to cooperate with each other less. In the old days on ITS it was considered desirable that everyone could look at any file, change any file, because we had reasons to. I remember one interesting scandal where somebody sent a request for help in using Macsyma. Macsyma is a symbolic algebra program that was developed at MIT. He sent to one of the people working on it a request for some help, and he got an answer a few hours later from somebody else. He was horrified, he sent a message &ldquo;so-and-so must be reading your mail, can it be that mail files aren't properly protected on your system?&rdquo; &ldquo;Of course, no file is protected on our system. What's the problem? You got your answer sooner; why are you unhappy? Of course we read each other's mail so we can find people like you and help them&rdquo;. Some people just don't know when they're well off.
fr: La premi&egrave;re chose fut que ce logiciel &eacute;tait tr&egrave;s mal &eacute;crit et dur &agrave; comprendre&nbsp;; rendant donc plus durs les changements n&eacute;cessaires. Une autre fut que le logiciel &eacute;tait s&eacute;curis&eacute;, ce qui a eu pour effet in&eacute;vitable de diminuer la collaboration entre les uns et les autres. Dans le pass&eacute;, sur <abbr title="Icompatible Timesharing System">ITS</abbr>, on trouvait b&eacute;n&eacute;fique le fait d'avoir acc&egrave;s &agrave; tous les fichiers et de pouvoir changer n'importe lequel, parce que nous avions des raisons pour cela. Je me rappelle un scandale int&eacute;ressant o&ugrave; quelqu'un a envoy&eacute; une demande d'aide en utilisant Macsyma. Macsyma est un programme symbolique d'alg&egrave;bre qui a &eacute;t&eacute; d&eacute;velopp&eacute; au M.I.T. Il a envoy&eacute; une demande d'aide &agrave; l'une des personnes qui travaillait dessus et a obtenu une r&eacute;ponse quelques heures plus tard de la part de quelqu'un d'autre. Il a &eacute;t&eacute; horrifi&eacute;. Il a envoy&eacute; le message&nbsp;: &laquo;&nbsp;Untel ou untel doit lire votre courrier, les fichiers de courrier ne sont peut-&ecirc;tre pas correctement prot&eacute;g&eacute;s sur votre syst&egrave;me&nbsp;?&nbsp;&raquo;. &laquo;&nbsp;Naturellement, aucun dossier n'est prot&eacute;g&eacute; sur notre syst&egrave;me. Quel est le probl&egrave;me&nbsp;? Vous avez obtenu votre r&eacute;ponse plus t&ocirc;t, pourquoi en &ecirc;tes-vous chagrin&eacute;&nbsp;? &Eacute;videmment nous lisons le courrier de tout le monde, comme &ccedil;a nous pouvons tomber sur des personnes comme vous et les aider&nbsp;&raquo;. Certaines personnes ne savent pas qu'elles sont riches.

source: But gradually things got worse and worse, it's just the nature of the way the system had been constructed forced people to demand more and more security. Until eventually I was forced to stop using the machine, because I refused to have a password that was secret. Ever since passwords first appeared at the MIT-AI lab I had come to the conclusion that to stand up for my belief, to follow my belief that there should be no passwords, I should always make sure to have a password that is as obvious as possible and I should tell everyone what it is. Because I don't believe that it's really desirable to have security on a computer, I shouldn't be willing to help uphold the security regime. On the systems that permit it I use the &ldquo;empty password&rdquo;, and on systems where that isn't allowed, or where that means you can't log in at all from other places, things like that, I use my login name as my password. It's about as obvious as you can get. And when people point out that this way people might be able to log in as me, i say &ldquo;yes that's the idea, somebody might have a need to get some data from this machine. I want to make sure that they aren't screwed by security&rdquo;.
fr: Mais graduellement les choses ont empir&eacute;, &agrave; cause de la fa&ccedil;on dont le syst&egrave;me avait &eacute;t&eacute; construit qui forcait les gens &agrave; demander de plus en plus de s&eacute;curit&eacute;. Jusqu'&agrave; ce que finalement, je sois oblig&eacute; d'arr&ecirc;ter d'utiliser la machine parce que je refusais d'avoir un mot de passe secret. Depuis que les mots de passe &eacute;taient apparus pour la premi&egrave;re fois au laboratoire d'I.A. du M.I.T., j'en &eacute;tais venu &agrave; la conclusion que pour respecter ma croyance, pour suivre ma croyance, il ne devait y avoir aucun mot de passe. Je devais toujours veiller &agrave; avoir un mot de passe aussi &eacute;vident que possible et le dire &agrave; tout le monde. Parce que je ne crois pas qu'il soit vraiment souhaitable d'avoir une s&eacute;curit&eacute; sur un ordinateur, je ne devrais pas aider au maintien du r&eacute;gime de s&eacute;curit&eacute;. Sur les syst&egrave;mes qui me permettent d'utiliser un &laquo;&nbsp;mot de passe vide&nbsp;&raquo; et sur des syst&egrave;mes o&ugrave; cela n'est pas permis &mdash;&nbsp;o&ugrave; cela signifie que vous ne pouvez pas ouvrir de session ailleurs, des choses comme &ccedil;a, j'utilise mon login en tant que mot de passe. Il est &eacute;vident que vous pouvez l'obtenir. Et quand les gens pr&eacute;cisent que de cette mani&egrave;re on peut ouvrir une session en mon nom, je r&eacute;ponds &laquo;&nbsp;Oui, c'est une id&eacute;e, quelqu'un pourrait avoir besoin de quelques donn&eacute;es sur cette machine. Je veux m'assurer qu'elles ne sont pas verrouill&eacute;es par la s&eacute;curit&eacute;&nbsp;&raquo;.

source: And an other thing that I always do is I always turn of all protection on my directory and files, because from time to time I have useful programs stored there and if there's a bug I want people to be able to fix it.
fr: Et une autre chose que je fais toujours, c'est d&eacute;sactiver la protection sur mon r&eacute;pertoire et mes dossiers. Parce que de temps en temps j'y stocke des programmes utiles et s'il y a un bogue je veux que les gens puissent le corriger.

source: But that machine wasn't designed also to support the phenomenon called &ldquo;tourism&rdquo;. Now &ldquo;tourism&rdquo; is a very old tradition at the AI lab, that went along with our other forms of anarchy, and that was that we'd let outsiders come and use the machine. Now in the days where anybody could walk up to the machine and log in as anything he pleased this was automatic: if you came and visited, you could log in and you could work. Later on we formalized this a little bit, as an accepted tradition specially when the Arpanet began and people started connecting to our machines from all over the country. Now what we'd hope for was that these people would actually learn to program and they would start changing the operating system. If you say this to the system manager anywhere else he'd be horrified. If you'd suggest that any outsider might use the machine, he'll say &ldquo;But what if he starts changing our system programs?&rdquo; But for us, when an outsider started to change the system programs, that meant he was showing a real interest in becoming a contributing member of the community. We would always encourage them to do this. Starting, of course, by writing new system utilities, small ones, and we would look over what they had done and correct it, but then they would move on to adding features to existing, large utilities. And these are programs that have existed for ten years or perhaps fifteen years, growing piece by piece as one craftsman after an other added new features.
fr: Mais cette machine n'a pas non plus &eacute;t&eacute; con&ccedil;ue pour d&eacute;fendre leph&eacute;nom&egrave;ne appel&eacute; &laquo;&nbsp;tourisme&nbsp;&raquo;. Le&laquo;&nbsp;tourisme&nbsp;&raquo; est une tr&egrave;s vieilletradition du laboratoire d'I.A. qui allait dans le sens de nos autresconceptions de l'anarchie et qui &eacute;tait que nous devions laisser lesgens de l'ext&eacute;rieur utiliser la machine. &Agrave; l'&eacute;poque o&ugrave; quiconquepouvait marcher jusqu'&agrave; elle et se connecter &agrave; ce qui lui plaisait,c'&eacute;tait automatique&nbsp;: si vous veniez pour visiter, vous pouviez ouvrir une session et travailler. Plus tard nous avons plus ou moins formalis&eacute; &ccedil;a comme une tradition admise, particuli&egrave;rement quand l'Arpanet a commenc&eacute; et que les gens ont commenc&eacute; &agrave; se relier &agrave; nos machines &agrave; partir de n'importe quel coin du pays. Maintenant ce que nous esp&eacute;rions, c'&eacute;tait que ces personnes apprendraient r&eacute;ellement &agrave; programmer et qu'elles commenceraient &agrave; modifier le logiciel d'exploitation. Quand vous dites &ccedil;a &agrave; un directeur syst&egrave;me n'importe o&ugrave; ailleurs, il en serait horrifi&eacute;. Si vous lui proposez l'id&eacute;e que n'importe quel &eacute;tranger puisse utiliser la machine, il dirait &laquo;&nbsp;Mais s'il commence &agrave; modifier nos programmes&nbsp;?&nbsp;&raquo;. Mais pour nous, si un &eacute;tranger commence &agrave; modifier les programmes, cela signifie qu'il montre un vrai int&eacute;r&ecirc;t en devenant un membre contributif de la communaut&eacute;. Nous encouragions toujours les gens &agrave; le faire. &Agrave; commencer naturellement par &eacute;crire de nouveaux utilitaires, des petits, et nous jetions un &oelig;il sur ce qu'ils avaient fait et nous les corrigions. Ils en arrivaient alors &agrave; ajouter des dispositifs &agrave; de grands utilitaires existants. Et ce sont des programmes qui ont exist&eacute; pendant une dizaine ou peut-&ecirc;tre une quinzaine d'ann&eacute;es, grandissant petit &agrave; petit, un artisan apr&egrave;s l'autre, auquels s'ajoutaient de nouveaux dispositifs suppl&eacute;mentaires.

source: Sort of like cities in France you might say, where you can see the extremely old buildings with additions made a few hundred years later all the way up to the present. Where in the field of computing, a program that was started in 1965 is essentially that. So we would always hope for tourists to become system maintainers, and perhaps then they would get hired, after they had already begun working on system programs and shown us that they were capable of doing good work.
fr: Comme dans certaines villes de France on pourrait dire, o&ugrave; vous pouvez voir des b&acirc;timents extr&ecirc;mement vieux avec des rajouts, faits des centaines d'ann&eacute;es apr&egrave;s, dans tous les styles jusqu'&agrave; aujourd'hui. Dans le domaine de l'informatique, un programme qui a &eacute;t&eacute; commenc&eacute; en 1965 c'est exactement &ccedil;a. Ainsi nous esp&eacute;rions toujours que des touristes entretiennent le syst&egrave;me et peut-&ecirc;tre allaient-ils &ecirc;tre embauch&eacute;s apr&egrave;s avoir d&eacute;j&agrave; commenc&eacute; &agrave; travailler sur les programmes et nous avoir montr&eacute; qu'ils &eacute;taient capables de faire du bon travail.

source: But the ITS machines had certain other features that helped prevent this from getting out of hand, one of these was the &ldquo;spy&rdquo; feature, where anybody could watch what anyone else was doing. And of course tourists loved to spy, they think it's such a neat thing, it's a little bit naughty you see, but the result is that if any tourist starts doing anything that causes trouble there's always somebody else watching him. So pretty soon his friends would get very mad because they would know that the continued existence of tourism depended on tourists being responsible. So usually there would be somebody who would know who the guy was, and we'd be able to let him leave us alone. And if we couldn't, then what we would do was we would turn off access from certain places completely, for a while, and when we turned it back on, he would have gone away and forgotten about us. And so it went on for years and years and years.
fr: Mais il y avait sur les machines ITS certains dispositifs qui aidaient &agrave; &eacute;viter que &ccedil;a nous &eacute;chappe. L'un d'entre eux &eacute;tait un dispositif &laquo;&nbsp;espion&nbsp;&raquo; o&ugrave; tout le monde pouvait observer ce que tout le monde faisait. Et naturellement les touristes ont aim&eacute; espionner. Ils pensaient que c'&eacute;tait une chose ing&eacute;nieuse. C'est un peu m&eacute;chant vous voyez mais le r&eacute;sultat est que si un touriste commence &agrave; faire n'importe quoi qui cause probl&egrave;me, il y a toujours quelqu'un pour le voir. Assez vite ses amis allaient en &ecirc;tre furieux parce qu'ils savaient que le tourisme continue &agrave; exister,il fallait des touristes responsables. Aussi il y avait forc&eacute;ment quelqu'un qui savait qui c'&eacute;tait et nous &eacute;tions en mesure de lui dire de nous laisser tranquilles. Et si nous ne pouvions pas, alors ce que nous avions &agrave; faire &eacute;tait de fermer enti&egrave;rement l'acc&egrave;s &agrave; certains endroits pendant un moment, et quand nous le r&eacute;ouvriions, il &eacute;tait parti et nous avait oubli&eacute;s. Et cela a continu&eacute; comme &ccedil;a pendant des ann&eacute;es, des ann&eacute;es&hellip; et des ann&eacute;es.

source: But the Twenex system wasn't designed for this sort of thing, and eventually they wouldn't tolerate me with my password that everybody knew, tourists always logging in as me two or three at a time, so they started flushing my account. And by that time I was mostly working on other machines anyway, so eventually I gave up and stopped ever turning it on again. And that was that. I haven't logged in on that machine as myself &hellip; [At this point RMS is interrupted by tremendous applause] &hellip; for.
fr: Mais le syst&egrave;me de Twenex n'avait pas &eacute;t&eacute; con&ccedil;u pour ce genre de chose et par la suite ils ne m'ont plus tol&eacute;r&eacute;, moi et mon mot de passe que tout le monde connaissait. Les touristes ouvraient toujours les sessions en mon nom, &agrave; deux ou trois &agrave; la fois, et ont commenc&eacute; &agrave; vider mon compte. &Agrave; ce moment-l&agrave; de toute fa&ccedil;on, je travaillais le plus souvent sur d'autres machines; tellement que finalement j'ai abandonn&eacute; et cess&eacute; &agrave; tout jamais de le r&eacute;activer. C'&eacute;tait comme &ccedil;a. Je ne m'&eacute;tais pas connect&eacute; sur cette machine en tant que moi&hellip; [ &agrave; ce moment-l&agrave;, RMS est interrompu par des applaudissements &eacute;normes ]&hellip; pour &ccedil;a.

source: And the final reason why this is so, is that Twenex can't be shared. Twenex is a proprietary program and you're only allowed to have the sources if you keep them secret in certain nasty ways, and this gives them a bad flavor. Unless a person is oblivious (which some people in computers are, there's some people who'll do anything if it's fun for them, and won't think for a minute whether they're cooperating with anyone else, but you'd have to be pretty oblivious to not to notice what a sad thing it is to work on a program like that, and that is a further discouragement). And if that isn't enough there is the fact that every year or so they're going to give you a new release full of 50 000 additional lines of code all written by monkeys. Because they generally follow the &ldquo;million monkeys typing, and eventually they'll come up with something useful&rdquo; school of system development.
fr: Et la raison, c'est que Twenex ne pouvait pas &ecirc;tre partag&eacute;. Twenex est un programme propri&eacute;taire&nbsp;: vous n'avez le droit d'avoir les sources que si vous les gardez secr&egrave;tes de fa&ccedil;on assez agressive et &ccedil;a leur donne mauvais go&ucirc;t. &Agrave; moins que la personne soit inconsciente. Comme le sont certains en informatique&nbsp;; il y en a qui feraient n'importe quoi si c'est dr&ocirc;le pour eux et ne penseront pas une minute &agrave; coop&eacute;rer avec qui que ce soit. Mais il faut &ecirc;tre franchement ailleurs pour ne pas remarquer &agrave; quel point c'est triste de travailler comme &ccedil;a sur un programme, c'est une autre fa&ccedil;on de d&eacute;courager. Et comme si ce n'&eacute;tait pas suffisant, chaque ann&eacute;e ils vous donnent une nouvelle version remplie d'une cinquantaine de milliers de lignes de code suppl&eacute;mentaires toutes &eacute;crites par des singes. Parce qu'ils suivent g&eacute;n&eacute;ralement le syst&egrave;me de programmation scolaire du genre &laquo;&nbsp;million de singes dactylographiant qui finiront bien par apporter quelque chose d'utile&nbsp;&raquo;.
