Repository: gitGNU/gnu_www-fr
Catalog: philosophy/stallman-kth.*.po
Languages: fr

source: So I wrote a LISP interpreter and put it in in place of MOCKLISP and in the process I found that I had to rewrite many of the editor's internal data structures because I wanted them to be LISP objects. I wanted the interface between the LISP and the editor to be clean, which means that objects such as editor buffers, sub-processes, windows and buffer-positions, all have to be LISP objects, so that the editor primitives that work on them are actually callable as LISP functions with LISP data. This meant that I had to redesign the data formats of all those objects and rewrite all the functions that worked on them, and the result was that after about six months I had rewritten just about everything in the editor.
fr: Alors j'ai &eacute;crit un interpr&eacute;teur de LISP pour le mettre &agrave; la place de MOCKLISP. Et pendant le processus, j'ai constat&eacute; que je devais r&eacute;&eacute;crire un certain nombre de structures de donn&eacute;es internes &agrave; l'&eacute;diteur parce que je voulais qu'il s'agisse d'objets LISP. J'ai voulu que l'interface entre le LISP et l'&eacute;diteur soit propre. C'est &agrave; dire que les objets comme les tampons, les sous-programmes, les fen&ecirc;tres et les zones tampon de l'&eacute;diteur soient tous des objets LISP. Pour que les instructions de l'&eacute;diteur qui leur &eacute;taient affect&eacute;es soient r&eacute;ellement attribuables en tant que fonctions LISP avec des donn&eacute;es LISP. Cela voulait dire qu'il fallait reconcevoir les formats de donn&eacute;es de tous les objets et r&eacute;&eacute;crire toutes lesfonctions qui leur &eacute;taient affect&eacute;es. Et cela a eu pour r&eacute;sultat, pendant environ six mois, de me faire r&eacute;&eacute;crire &agrave; peu pr&egrave;s tout ce qu'il y avait dans l'&eacute;diteur.

source: In addition, because it is so hard to write things in MOCKLISP, all the things that had been written in MOCKLISP were very unclean and by rewriting them to take advantage of the power of real LISP, I could make them much more powerful and much simpler and much faster. So I did that, and the result was that when I started distributing this program only a small fraction remained from what I had received.
fr: En outre, parce qu'il est vraiment difficile d'&eacute;crire dans MOCKLISP, tout ce qui avait &eacute;t&eacute; &eacute;crit &eacute;tait tr&egrave;s imparfait. Et en le r&eacute;&eacute;crivant, je pouvais tirer profit de la puissance du vrai LISP&nbsp;; je pouvais rendre tout &ccedil;a beaucoup plus puissant, beaucoup plus simple et rapide. Alors je l'ai fait. Et quand j'ai commenc&eacute; &agrave; distribuer le programme, il ne restait qu'une petite partie de ce que j'avais re&ccedil;u.

source: At this point, the company that Gosling thinks he sold the program to challenged my friend's right to distribute it, and the message was on backup tapes, so he couldn't find it. And Gosling denied having given him permission. And then a strange thing happened. He was negotiating with this company, and it seemed that the company mainly was concerned with not having anything distributed that resembled what they were distributing. See, he was still distributing, and the company where he worked, which is Megatest, was still distributing the same thing he had given me, which really was an old version of Gosling Emacs with his changes, and so he was going to make an agreement with them where he would stop distributing that, and would switch to using GNU Emacs, and they would then acknowledge that he really had the permission after all, and then supposedly everyone would be happy. And this company was talking to me about wanting to distribute GNU Emacs, free of course, but also sell various sorts of supporting assistance, and they wanted to hire me to help do the work. So it's sort of strange that they then changed their mind and refused to sign that agreement, and put up a message on the network saying that I wasn't allowed to distribute the program. They didn't actually say that they would do anything, they just said that it wasn't clear whether they might ever someday do something. And this was enough to scare people so that no one would use it any more, which is a sad thing.
fr: &Agrave; ce moment-l&agrave;, l'entreprise &agrave; qui Gosling pensait avoir vendu le programme a contest&eacute; &agrave; mon ami le droit de le distribuer. Le message &eacute;tait alors enregistr&eacute; sur des bandes qu'il ne pouvait pas trouver. Malgr&eacute; tout, Gosling a ni&eacute; lui avoir donn&eacute; la permission. Une chose &eacute;trange s'est alors produite. Il &eacute;tait en pourparlers avec cette compagnie qui semblait principalement concern&eacute;e par le fait qu'il avait distribu&eacute; quelque chose de similaire &agrave; ce qu'elle distribuait. En gros, Gosling distribuait ce que la compagnie, Megatest, o&ugrave; il avait travaill&eacute;, distribuait aussi. C'est-&agrave;-dire ce qu'il m'avait donn&eacute;; en r&eacute;alit&eacute; une de ses anciennes versions d'Emacs modifi&eacute;e. Il allait donc passer un accord avec eux dans lequel il cessait de le distribuer. Ils voulaient ensuite passer &agrave; GNU Emacs, en reconnaissant &agrave; Gosling la permission de le faire apr&egrave;s tout et donc th&eacute;oriquement tout le monde &eacute;tait content. Alors cette entreprise m'a entretenu au sujet de leur d&eacute;sir de distribuer GNU Emacs, librement bien-s&ucirc;r, mais aussi de vendre divers types de supports d'aide. Et ils ont voulu louer mes comp&eacute;tences pour aider &agrave; faire ce travail. Aussi, il est un peu &eacute;trange qu'ils aient soudain chang&eacute; d'avis et refus&eacute; de signer cet accord, en mettant un message d'annonce sur le r&eacute;seau comme quoi on ne m'avait pas donn&eacute; le droit de distribuer le programme. Ils n'ont pas r&eacute;ellement dit qu'ils feraient quelque chose. Ils ont juste dit qu'il n'&eacute;tait pas improbable qu'ils fassent quelque chose un jour. Cela faisait suffisamment peur aux gens pour que plus personne ne l'utilise. C'est triste.

source: (Sometimes I think that perhaps one of the best things I could do with my life is: find a gigantic pile of proprietary software that was a trade secret, and start handing out copies on a street corner so it wouldn't be a trade secret any more, and perhaps that would be a much more efficient way for me to give people new free software than actually writing it myself; but everyone is too cowardly to even take it.)
fr: (Parfois je me dis que peut-&ecirc;tre une des meilleures choses que je pourrais faire dans la vie serait de trouver une pile colossale de logiciels propri&eacute;taires encore sous secret commercial et de commencer &agrave; en distribuer des copies &agrave; tous les coins de rue en les faisant sortir du secret commercial. &Ccedil;a serait peut-&ecirc;tre une mani&egrave;re beaucoup plus efficace pour moi de fournir aux gens du nouveau logiciel libre plut&ocirc;t qu'en l'&eacute;crivant r&eacute;ellement moi-m&ecirc;me&nbsp;; mais tout le monde serait trop l&acirc;che pour le prendre quand m&ecirc;me).

source: So I was forced to rewrite all the rest that remained, and I did that, it took me about a week and a half. So they won a tremendous victory. And I certainly wouldn't ever cooperate with them in any fashion after that.
fr: &Ccedil;a m'a oblig&eacute; &agrave; r&eacute;&eacute;crire tout ce qui restait qui n'&eacute;tait pas de moi, et je l'ai fait. Il m'a fallu environ une semaine et demie. Ainsi ils ont gagn&eacute; une grande victoire! Il &eacute;tait certain que je ne coop&eacute;rerais jamais plus avec eux en aucune mani&egrave;re apr&egrave;s &ccedil;a.

source: Then after GNU Emacs was reasonably stable, which took all in all about a year and a half, I started getting back to other parts of the system. I developed a debugger which I called GDB which is a symbolic debugger for C code, which recently entered distribution. Now this debugger is to a large extent in the spirit of DBX, which is a debugger that comes with Berkeley Unix. Commands consist of a word that says what you want to do, followed by arguments. In this debugger, commands can all be abbreviated, and the common commands have single character abbreviations, but any unique abbreviation is always allowed. There are extensible HELP facilities, you can type HELP followed by any command or even subcommands, and get a lengthy description of how to use that command. Of course you can type any expression in C, and it will print the value.
fr: Apr&egrave;s que GNU Emacs soit devenu raisonnablement stable &mdash;&nbsp;ce qui m'a pris environ un an et demi &agrave; tout prendre - j'ai commenc&eacute; &agrave; revenir sur d'autres parties du syst&egrave;me. J'ai d&eacute;velopp&eacute; un programme de d&eacute;bogage que j'ai appel&eacute; GDB&nbsp; un d&eacute;bogueur en code C symbolique r&eacute;cemment entr&eacute; dans la distribution. R&eacute;alis&eacute; en grande partie dans l'esprit de DBX qui est le d&eacute;bogueur de l'Unix de Berkeley. Les commandes se composent d'un mot indiquant ce que vous voulez faire, suivi des arguments. Dans ce programme, toutes les commandes peuvent &ecirc;tre abr&eacute;g&eacute;es. Et les commandes communes sont des abr&eacute;viations &agrave; caract&egrave;re unique, sachant que toute abr&eacute;viation &agrave; caract&egrave;re unique est permise. Il y a aussi des am&eacute;nagements consid&eacute;rables pour HELP. Vous pouvez taper HELP suivi de toutes les commandes ou m&ecirc;me des commandes secondaires et vous obtenez une description compl&egrave;te de la fa&ccedil;on de l'utiliser. Naturellement vous pouvez taper n'importe quelle expression en C et il en imprimera la valeur.

source: You can also do some things that are not usual in symbolic C debuggers, for example: You can refer to any C datatype at any memory address, either to examine the value, or to assign the value. So for example if you want to store a floating point value in a word at a certain address, you just say: &ldquo;Give me the object of type FLOAT or DOUBLE at this address&rdquo; and then assign that. Another thing you can do is to examine all the values that have been examined in the past. Every value examined gets put on the &ldquo;value history&rdquo;. You can refer to any element in the history by its numerical position, or you can easily refer to the last element with just dollar-sign. And this makes it much easier to trace list structure. If you have any kind of C structure that contains a pointer to another one, you can do something like &ldquo;PRINT *$.next&rdquo;, which says: &ldquo;Get the next field out of the last thing you showed me, and then display the structure that points at&rdquo;. And you can repeat that command, and each time you'll see then next structure in the list. Whereas in every other C debugger that I've seen the only way to do that is to type a longer command each time. And when this is combined with the feature that just typing carriage-return repeats the last command you issued, it becomes very convenient. Just type carriage-return for each element in the list you want to see.
fr: Vous pouvez &eacute;galement faire des choses inhabituelles pour un d&eacute;bogueur C symbolique, par exemple&nbsp;: vous pouvez faire r&eacute;f&eacute;rer n'importe quel type de donn&eacute;e de C &agrave; n'importe quelle adresse de m&eacute;moire pour en &eacute;tudier la valeur ou pour l'attribuer. Par exemple si vous voulez stocker une valeur de virgule flottante dans un mot &agrave; une certaine adresse, vous devez juste dire&nbsp;: &laquo;&nbsp;Donnez-moi l'objet du type FLOAT ou DOUBLE &agrave; cette adresse et attribuez-le&nbsp;&raquo;. Une autre chose que vous pouvez faire est d'&eacute;tudier toutes les valeurs qui ont &eacute;t&eacute; &eacute;tudi&eacute;es auparavant. Chaque valeur &eacute;tudi&eacute;e est plac&eacute;e au dessus de l'&laquo;&nbsp;historique des valeurs&nbsp;&raquo;. Vous pouvez vous r&eacute;f&eacute;rer &agrave; n'importe quel &eacute;l&eacute;ment par sa position dans l'historique. Ou vous pouvez facilement vous r&eacute;f&eacute;rer au dernier &eacute;l&eacute;ment juste avec le signe dollar. Et &ccedil;a facilite le suivi de la structure des listes. Pour n'importe quel genre de structure de C qui contient un pointeur vers une autre structure, vous pouvez faire quelque chose comme &laquo;&nbsp;PRINT*$.next&nbsp;&raquo; qui dit&nbsp;: &laquo;&nbsp;Sortez le prochain champ de la derni&egrave;re chose que vous m'avez montr&eacute; et ensuite affichez la structure sur laquelle il pointe&nbsp;&raquo;. En r&eacute;p&eacute;tant cette commande, vous voyez chaque fois la prochaine structure de la liste, sachant que dans chacun des d&eacute;bogueurs C que j'ai vus, la seule mani&egrave;re de le faire est de taper une commande chaque fois plus longue. Et quand c'est combin&eacute; &agrave; un retour-chariot tap&eacute; juste apr&egrave;s la derni&egrave;re commande donn&eacute;e, &ccedil;a devient tr&egrave;s pratique. Vous avez juste &agrave; taper retour-chariot pour chaque &eacute;l&eacute;ment de la liste que vous voulez voir.

source: There are also explicitly settable variables in the debugger, any number of them. You say dollar-sign followed by a name, and that is a variable. You can assign these variables values of any C datatype and then you can examine them later. Among the things that these are useful for are: If there's a particular value that you're going to examine, and you know you are going to refer to it a lot, then rather than remember its number in the history you might give it a name. You might also find use for them when you set conditional breakpoints. Conditional breakpoints are a feature in many symbolic debuggers, you say &ldquo;stop when you get to this point in the program, but only if a certain expression is true&rdquo;. The variables in the debugger allow you to compare a variable in the program with a previous value of that variable that you saved in a debugger variable. Another thing that they can be used for is for counting, because after all, assignments are expressions in C, therefore you can do &ldquo;$foo+=5&rdquo; to increment the value of &ldquo;$foo&rdquo; by five, or just &ldquo;$foo++&rdquo; you can do. You can even do this in a conditional breakpoint, so that's a cheap way of having it break the tenth time the breakpoint is hit, you can do &ldquo;$foo--==0&rdquo;. Does everyone follow that? Decrement foo and if it's zero now, break. And then you set $foo to the number of times you want it to skip, and you let it go. You can also use that to examine elements of an array. Suppose you have an array of pointers, you can then do:
fr: Vous pouvez aussi poser des variables de fa&ccedil;on explicite dans le d&eacute;bogueur, en n'importe quel nombre. Vous posez le signe dollar suivi d'un nom et c'est une variable. Vous pouvez attribuer les valeurs de ces variables &agrave; n'importe quel type de donn&eacute;es de C et vous pourrez les &eacute;tudier plus tard. Parmi les choses pour lesquelles c'est utile, s'il y a une valeur particuli&egrave;re que vous voulez &eacute;tudier, sachant que vous allez vous y r&eacute;f&eacute;rer souvent, plut&ocirc;t que de vous souvenir de son num&eacute;ro dans l'historique, vous pouvez lui donner un nom. Vous pouvez aussi les utiliser quand vous placez des paliers conditionnels. Les paliers conditionnels sont un dispositif qui existe dans beaucoup de d&eacute;bogueurs symboliques. Vous dites&nbsp;: &laquo;&nbsp;Arr&ecirc;tez-vous quand vous serez arriv&eacute;s &agrave; ce point du programme, mais seulement si une certaine expression est vraie&nbsp;&raquo;. Les variables dans le d&eacute;bogueur vous permettent de comparer une variable du programme &agrave; sa pr&eacute;c&eacute;dente valeur sauvegard&eacute;e dans la variable du d&eacute;bogueur. Une autre chose &agrave; laquelle elles peuvent servir, c'est de compter. Parce qu'apr&egrave;s tout, les allocations sont des expressions en C, donc on peut faire&nbsp;: &laquo;&nbsp;$foo+=5&nbsp;&raquo; pour incr&eacute;menter la valeur &laquo;&nbsp;$foo&nbsp;&raquo; de cinq ou juste &laquo;&nbsp;$foo++&nbsp;&raquo;. Vous pouvez &eacute;galement le faire lors d'un palier conditionnel. Une mani&egrave;re &eacute;conome de le voir s'arr&ecirc;ter la dixi&egrave;me fois que le palier est atteint, serait de faire &laquo;&nbsp;$foo--==0&nbsp;&raquo;. Est-ce que tout le monde suit&nbsp;? Faire d&eacute;cro&icirc;tre Foo et une fois qu'il est &agrave; z&eacute;ro, arr&ecirc;t. Vous faites d&eacute;marrer $foo au nombre de fois que vous voulez qu'il saute et vous le l&acirc;chez. Vous pouvez aussi utiliser &ccedil;a pour examiner les &eacute;l&eacute;ments d'un tableau. Supposez que vous avez un tableau de pointeurs, vous pouvez faire&nbsp;:

source: But first you do
fr: mais d'abord vous faites

source: Okay, when you do that [points at the &ldquo;Print&rdquo; expression], you get the zeroth element of X, and then you do it again and it gets the first element, and suppose these are pointers to structures, then you probably put an asterisk there [before the X in the PRINT expression] and each time it prints the next structure pointed to by the element of the array. And of course you can repeat this command by typing carriage-return. If a single thing to repeat is not enough, you can create a user-defined-command. You can say &ldquo;Define Mumble&rdquo;, and then you give some lines of commands and then you say &ldquo;end&rdquo;. And now there is defined a &ldquo;Mumble&rdquo; command which will execute those lines. And it's very useful to put these definitions in a command file. You can have a command file in each directory, that will be loaded automatically when you start the debugger with that as your working directory. So for each program you can define a set of user defined commands to access the data structures of that program in a useful way. You can even provide documentation for your user-defined commands, so that they get handled by the &ldquo;help&rdquo; features just like the built-in commands.
fr: Ok, quand vous faites &ccedil;a [des points &agrave; l'expression &laquo;&nbsp;Print&nbsp;&raquo;], vous obtenez l'&eacute;l&eacute;ment z&eacute;ro de X et quand vous le faites &agrave; nouveau, il atteint le premier &eacute;l&eacute;ment. Supposez que ce soient des pointeurs vers des structures, alors vous mettez probablement une ast&eacute;risque l&agrave; [avant le X dans l'expression &laquo;&nbsp;Print&nbsp;&raquo;] et chaque fois qu'elle affiche la prochaine structure point&eacute;e par l'&eacute;l&eacute;ment du tableau. Et bien-s&ucirc;r vous pouvez r&eacute;p&eacute;ter cette commande en tapant retour-chariot. Si une chose simple &agrave; r&eacute;p&eacute;ter ne suffit pas, vous pouvez cr&eacute;er une commande d&eacute;finie par l'utilisateur. Vous pouvez dire &laquo;&nbsp;D&eacute;finissez Mumble&nbsp;&raquo;, vous donnez quelques lignes de commandes et vous dites &laquo;&nbsp;end&nbsp;&raquo;. Il y a maintenant une commande &laquo;&nbsp;Mumble&nbsp;&raquo; d&eacute;finie qui ex&eacute;cutera ces lignes. Et il est tr&egrave;s utile de mettre ces d&eacute;finitions dans un fichier de commande. Vous pouvez avoir un fichier de commande dans chaque r&eacute;pertoire qui sera charg&eacute; automatiquement lorsque vous mettez en marche le d&eacute;bogueur avec &ccedil;a en tant que r&eacute;pertoire actif. Ainsi pour chaque programme, vous pouvez d&eacute;finir un ensemble de commandes sur mesure pour acc&eacute;der aux structures de donn&eacute;es de fa&ccedil;on utile. Vous pouvez m&ecirc;me fournir de la documentation pour vos commandes, de fa&ccedil;on &agrave; ce qu'elles soient trait&eacute;es dans les am&eacute;nagements de &laquo;&nbsp;help&nbsp;&raquo; comme des commandes int&eacute;gr&eacute;es.

source: One other unusual thing in this debugger, is the ability to discard frames from the stack. Because I believe it's important not just to be able to examine what's happening in the program you're debugging, but also to change it in any way conceivable. So that after you've found one problem and you know what's wrong, you can fix things up as if that code were correct and find the next bug without having to recompile your program first. This means not only being able to change the data areas in you program flexibly, but also being able to change the flow of control. In this debugger you can change the flow of control very directly by saying:
fr: Une autre chose peu habituelle dans ce d&eacute;bogueur, c'est la capacit&eacute; d'&eacute;carter les trames de la pile. Parce que je crois que c'est non seulement important pour pouvoir examiner ce qui se produit dans le programme que vous d&eacute;boguez, mais aussi pour le modifier de toutes les fa&ccedil;ons possibles. De sorte qu'apr&egrave;s avoir trouv&eacute; un probl&egrave;me et avoir su ce qui n'allait pas, vous pouvez arranger les choses comme si le code &eacute;tait correct et trouver le prochain bogue sans avoir d'abord &agrave; recompiler le programme. Cela signifie non seulement pouvoir changer en souplesse les secteurs de donn&eacute;es de votre programme, mais &eacute;galement changer le flux de contr&ocirc;le. Dans ce d&eacute;bogueur, vous pouvez changer le flux de contr&ocirc;le tr&egrave;s directement en disant&nbsp;:

source: SET $PC=&lt;some number&gt;
fr: SET $PC=&lt;un certain nombre&gt;

source: So you can set the program counter. You can also set the stack pointer, or you can say
fr: Et vous pouvez placer le compteur. Vous pouvez &eacute;galement placer l'indicateur de pile, ou vous pouvez dire&nbsp;:

source: SET $SP+=&lt;something&gt;
fr: SET $SP+=&lt;quelque chose&gt;
