Repository: gitGNU/gnu_www-fr
Catalog: philosophy/stallman-kth.*.po
Languages: fr

source: Thus, the people in the programming field have evolved a way of wasting a lot of their time and thus making apparently a need for more programmers than we really need. Why is there a programmer shortage? Because with intellectual property programmers have arranged to waste half the work they do, so we seem to need twice as many programmers. And so, when people point to the system of intellectual property and say &ldquo;look at the large employment statistics, look at how big this industry is&rdquo; what that really proves is that people are wasting a lot of money and time. If they talk about looking for ways to improve programmer productivity, they're happy to do this if it involves superior tools, but to improve programmer productivity by getting rid of the explicit things that is done to reduce programmer productivity, that they're against. Because that would reduce the number of programmers employed. There's something a little bit schizophrenic there.
fr: Donc, les personnes dans le domaine de la programmation ont &eacute;volu&eacute; de mani&egrave;re &agrave; perdre une bonne partie de leur temps en cr&eacute;ant de ce fait un apparent besoin en programmeurs. Plus important qu'en r&eacute;alit&eacute;. Pourquoi y a-t-il un manque de programmeurs&nbsp;? Puisqu'avec la propri&eacute;t&eacute; intellectuelle ceux-ci se sont organis&eacute;s pour gaspiller la moiti&eacute; de leur travail, il semble que nous en ayons besoin de deux fois plus. Quand les gens se tournent vers le syst&egrave;me de la propri&eacute;t&eacute; intellectuelle en disant &laquo;&nbsp;Regardez les belles statistiques d'emploi, regardez l'ampleur de cette industrie&nbsp;&raquo;", cela ne prouve r&eacute;ellement que du gaspillage de temps et d'argent. Quand ils parlent de chercher des moyens d'am&eacute;liorer la productivit&eacute; du programmeur, ils sont ravis de le faire si cela implique des outils plus &eacute;volu&eacute;s, mais si cela implique de se d&eacute;barrasser de choses pr&eacute;cises qui pourraient la r&eacute;duire, ils sont contre. Puisque cela r&eacute;duirait le nombre de programmeurs utilis&eacute;s. Il y a quelque chose d'un peu schizophr&egrave;ne l&agrave;-dedans.

source: And the spiritual harm that corresponds to this level of material harm is to the spirit of scientific cooperation, which used to be so strong that scientists even in countries that were at war would continue cooperating, because they knew that what they were doing had nothing to do with the war, it was just for the long term benefit of humanity. Nowadays, people don't care about the long term benefit of humanity any more.
fr: Et la nocivit&eacute; spirituelle qui correspond &agrave; ce niveau de nocivit&eacute; mat&eacute;rielle se trouve dans l'esprit de coop&eacute;ration scientifique, qui &eacute;tait si fort, que m&ecirc;me les scientifiques dans les pays en guerre continuaient de coop&eacute;rer. Parce qu'ils savaient que ce qu'ils faisaient n'avait rien &agrave; voir avec la guerre. C'&eacute;tait uniquement pour le b&eacute;n&eacute;fice &agrave; long terme de l'humanit&eacute;. De nos jours, les gens ne s'en inqui&egrave;tent plus.

source: To get an idea of what it's like to obstruct the use of a program, let's imagine that we had a sandwich, that you could eat, and it wouldn't be consumed. You could eat it, and another person could eat it, the same sandwich, any number of times, and it would always remain just as nourishing as originally.
fr: Pour avoir une id&eacute;e de ce qui peut emp&ecirc;cher l'utilisation d'un programme, imaginez un sandwich que vous pouvez manger mais qui ne serait pas consomm&eacute;. Vous pourriez le manger, une autre personne pourrait le manger, le m&ecirc;me sandwich, n'importe quel nombre de fois et il en resterait toujours comme s'il nourrissait autant qu'&agrave; l'origine.

source: The best thing to do, the thing that we ought to do with this sandwich is carry it around to the places where there are hungry people; bringing it to as many mouths as possible, so that it feeds as many people as possible. By all means, we should not have a price to eat from this sandwich, because then people would not afford to eat it, and it would be wasted.
fr: La meilleure chose &agrave; faire, ce que nous devons faire avec ce sandwich, est de l'amener partout o&ugrave; les gens sont affam&eacute;s; l'amenant &agrave; autant de bouches que possible, de sorte qu'il alimente autant de personnes que possible. Il est certain que nous ne devrions pas mettre de prix sur ce sandwich, parce que sinon les gens ne se permettraient pas de le manger et il serait gaspill&eacute;.

source: The program is like this sandwich, but even more so because it can be in many different places at once being eaten, used by different people one after the other. It is as if this sandwich was enough to feed everyone, everywhere, forever, and that were not allowed to happen, because someone believed he should own it.
fr: Un programme est comme ce sandwich, mais encore plus, parce qu'il peut &ecirc;tre mang&eacute; en m&ecirc;me temps dans de nombreux endroits diff&eacute;rents, utilis&eacute; par des personnes diff&eacute;rentes les unes apr&egrave;s les autres. C'est comme si ce sandwich suffisait pour alimenter tout le monde, partout, pour toujours, et cela n'a pas pu se produire parce que quelqu'un a cru qu'il pouvait le poss&eacute;der.

source: Now, the people who believe that they can own programs, generally put forward two lines of argument for this. The first one is &ldquo;I wrote it, it is a child of my spirit, my heart, my soul is in this. How can anyone take it away from me? Wherever it goes it's mine, mine, MINE!!&rdquo;. Well, it's sort of strange that most of them signs agreements saying it belongs to the company they work for.
fr: Maintenant, les gens qui croient qu'ils peuvent poss&eacute;der les programmes proposent g&eacute;n&eacute;ralement deux types d'arguments. Le premier c'est&nbsp;: &laquo;&nbsp;Je l'ai &eacute;crit, c'est l'enfant de mon esprit, mon cœur, mon &acirc;me y est. Qui peut me l'enlever&nbsp;? O&ugrave; qu'il aille, il est &agrave; moi, &agrave; moi, À MOI&nbsp;!!&nbsp;&raquo;. Bien, il est curieux tout de m&ecirc;me que la plupart d'entre eux signent des accords stipulant qu'il appartient &agrave; l'entreprise pour laquelle ils travaillent.

source: So I believe this is one of the things you can easily talk yourself into believing is important, but you can just as easily convince yourself it doesn't matter at all.
fr: Aussi je crois que c'est l'une des choses que vous pouvez facilement vous dire en croyant que c'est important, mais vous pouvez aussi ais&eacute;ment vous convaincre que cela n'a pas d'importance du tout.

source: Usually, these people use this argument to demand the right to control even how people can change a program. They say: &ldquo;Nobody should be able to mess up my work of art&rdquo;. Well, imagine that the person who invented a dish that you plan to cook had the right to control how you can cook it, because it's his work of art. You want to leave out the salt, but he says &ldquo;Oh, no. I designed this dish, and it has to have this much salt!&rdquo; &ldquo;But my doctor says it's not safe for me to eat salt. What can I do?&rdquo;.
fr: Habituellement, ces personnes usent de cet argument pour exiger le droit de contr&ocirc;ler m&ecirc;me la fa&ccedil;on dont les gens peuvent modifier le programme. Ils disent&nbsp;: &laquo;&nbsp;Personne ne devrait pouvoir g&acirc;cher mon &oelig;uvre d'art&nbsp;&raquo;. Bien, imaginez que la personne qui a invent&eacute; le plat que vous projetez de cuisiner a eu le droit de contr&ocirc;ler la fa&ccedil;on dont vous pouvez le faire cuire parce que c'est son &oelig;uvre d'art. Vous voulez y enlever le sel, mais il dit &laquo;&nbsp;Oh, non! J'ai con&ccedil;u ce plat et il doit y avoir beaucoup de sel&nbsp;!&nbsp;&raquo;, &laquo;&nbsp;Mais mon m&eacute;decin m'a dit qu'il n'&eacute;tait pas bon pour moi de manger sal&eacute;. Que dois-je faire&nbsp;?&nbsp;&raquo;.

source: Clearly, the person who is using the program is much closer to the event. The use of the program affects him very directly, whereas it only has a sort of abstract relation to the person who wrote the program. And therefore, for the sake of giving people as much control as possible over their own lives, it has to be the user who decides those things.
fr: Clairement, la personne qui utilise le programme est bien plus pr&egrave;s de l'&eacute;v&eacute;nement. L'utilisation du programme l'affecte directement tandis qu'il y a juste une sorte de relation abstraite avec la personne qui l'a &eacute;crit. Et donc, pour donner aux gens autant de contr&ocirc;le que possible sur leurs propres vies, c'est l'utilisateur qui doit d&eacute;cider.

source: The second line of argument they make is the economic one. &ldquo;How will people get payed to program?&rdquo; they say, and there's a little bit of real issue in this. But a lot of what they say is confusion. And the confusion is, it's not at all the same to say &ldquo;if we want to have a lot of people programming we must arrange for them not to need to make a living in any other fashion&rdquo; on the one hand, and to say &ldquo;We need to have the current system, you need to get rich by programming&rdquo; on the other hand. There's a big difference between just making a living wage and making the kind of money programmers, at least in the US make nowadays. They always say: &ldquo;How will I eat?&rdquo;, but the problem is not really how &ldquo;Will he eat?&rdquo;, but &ldquo;How will he eat sushi?&rdquo;. &ldquo;How will I have a roof over my head?&rdquo;, but the real problem is &ldquo;How can he afford a condo?&rdquo;.
fr: Le deuxi&egrave;me argument est &eacute;conomique. &laquo;&nbsp;Comment les gens seront pay&eacute;s pour programmer&nbsp;?&nbsp;&raquo; disent-ils, et il y a un peu de vrai l&agrave;-dedans. Mais une bonne part de ce qu'ils disent est confus. Et la confusion vient de ce qu'il n'est pas du tout pareil de dire&nbsp;: &laquo;&nbsp;Si nous voulons avoir beaucoup de gens pour programmer, nous devons nous assurer qu'ils n'auront pas besoin de gagner leur vie d'une autre mani&egrave;re&nbsp;&raquo; d'une part, et d'autre part de dire &laquo;&nbsp;Nous devons conserver le syst&egrave;me actuel, nous devons devenir riches en programmant&nbsp;&raquo;. Il y a une grande diff&eacute;rence entre juste percevoir un salaire pour vivre et se faire du fric comme le font les programmeurs de nos jours, au moins aux &Eacute;tats-Unis. Ils disent toujours&nbsp;: &laquo;&nbsp;Comment vais-je manger&nbsp;?&nbsp;&raquo;, mais le probl&egrave;me n'est pas vraiment de savoir &laquo;&nbsp;comment il va manger&nbsp;&raquo; mais &laquo;&nbsp;comment il va manger des sushis&nbsp;&raquo;. De m&ecirc;me &laquo;&nbsp;Comment aurai-je un toit au-dessus de ma t&ecirc;te&nbsp;?&nbsp;&raquo; mais &nbsp;comment pourra-t'il se payer un appartement dans une copropri&eacute;t&eacute;&nbsp;?&nbsp;&raquo;.

source: When you have something like a program, like an infinite sandwich, like a road, which has to be built once, but once it is built it pretty much doesn't matter how much you use it, there's no cost in using it, generally it's better if we don't put any price on using it. And there are plenty of those things that we develop now, and pay people to build. For example, all the streets out there. It's very easy to find people who will program without being paid; it really is impossible to find people who will build streets without being paid. Building streets is not creative and fun like programming. But we have plenty of streets out there, we do come up with the money to pay them, and it's much better the way we do it than if if we said: &ldquo;Let's have companies go and build streets and put toll booths up, and then every time you turn another street corner, you pay another toll. And then the companies that picked the good places to put their streets, they will be profitable, and the others will go bankrupt.&rdquo;
fr: Lorsque vous avez quelque chose comme un programme, comme un sandwich infini ou comme une route qui ne doit &ecirc;tre construite qu'une fois, sachant qu'une fois construite il importe peu de savoir combien de fois vous l'utilisez, sachant que cela ne co&ucirc;te rien de l'utiliser, il est g&eacute;n&eacute;ralement bien mieux de ne pas mettre de co&ucirc;t sur cette utilisation. Et il y a des tas de choses comme &ccedil;a que nous d&eacute;veloppons aujourd'hui, apr&egrave;s avoir pay&eacute; des gens pour le faire. Par exemple, toutes les rues l&agrave;-dehors. Autant il est tr&egrave;s facile de trouver des gens qui programmeront sans &ecirc;tre pay&eacute;s, autant il est vraiment impossible d'en trouver qui construiront des routes sans &ecirc;tre pay&eacute;s. La construction des routes n'est pas cr&eacute;atrive ni amusante comme la programmation mais nous avons des tas de rues l&agrave;-dehors. Nous apportons l'argent pour payer ces gens et c'est bien mieux comme &ccedil;a que d'avoir dit&nbsp;: &laquo;&nbsp;Laissons les entreprises faire et construire des routes et des cabines de p&eacute;age, et chaque fois que vous tournez &agrave; un coin de rue vous paierez un autre p&eacute;age. De l&agrave;, les entreprises qui auront s&eacute;lectionn&eacute; les bons endroits pour mettre leurs routes feront des profits et les autres feront faillite&nbsp;&raquo;.

source: There's a funny thing that happens whenever someone comes up with a way of making lots of money by hoarding something. Until that time you've probably had lots and lots of people who were really enthusiastic and eager to work in that field, the only sort of question is how can they get any sort of livelihood at all. If we think of mathematicians for example, there are a lot more people who want to be pure mathematicians than there is funding for anybody to be pure mathematicians. And even when you do get funding, you don't get very much, they don't live well. And for musicians it's even worse. I saw a statistics for how much the average musician, the average person devoting most of his time trying to be a musician, in Massachusetts made; it was something like half the median income or less. It is barely enough to live on, it's difficult. But there are lots of them trying to do that. And then, somehow when it gets generally possible to get very well paid to do something, all those people disappear, and people start saying &ldquo;nobody will do it unless they get paid that well&rdquo;.
fr: Il y a une chose dr&ocirc;le qui se produit chaque fois que quelqu'un propose une mani&egrave;re de faire de l'argent en accaparant quelque chose. Jusque l&agrave;, vous aviez probablement un bon nombre de gens vraiment enthousiastes et d&eacute;sireux de travailler dans ce domaine. Et le seul genre de question qui se posait &eacute;tait&nbsp;: &laquo;&nbsp;Comment peuvent-ils trouver un moyen d'existence&nbsp;?&nbsp;&raquo; Si nous pensons aux math&eacute;maticiens par exemple, il y a beaucoup plus de gens qui veulent &ecirc;tre des math&eacute;maticiens purs que de fonds pour que tout le monde le devienne. Et m&ecirc;me lorsque vous obtenez des fonds, vous n'en obtenez pas beaucoup. Et ces gens ne vivent pas bien. Pour des musiciens c'est encore pire. J'ai vu des statistiques sur combien le musicien moyen, le p&eacute;quin moyen qui consacre la majeure partie de son temps &agrave; tenter de devenir musicien, se fait dans le Massachusetts&nbsp;; c'&eacute;tait quelque chose comme la moiti&eacute; du revenu moyen ou moins. C'est &agrave; peine assez pour vivre, c'est dur. Mais il y en a un bon nombre qui essaient. Et puis, d'une fa&ccedil;on ou d'une autre, quand il devient possible d'&ecirc;tre tr&egrave;s bien pay&eacute; pour faire quelque chose, g&eacute;n&eacute;ralement tous ces gens disparaissent. Et on commence &agrave; dire &laquo;&nbsp;personne ne le fera &agrave; moins d'&ecirc;tre pay&eacute; aussi bien&nbsp;&raquo;.

source: And I saw this happen in the field of programming. The very same people who used to work at the AI lab and get payed very little and love it, now wouldn't dream of working for less than fifty thousand dollars a year. What happened? When you dangle before people the possibility of making lots of money, when they see that other people doing similar work are getting paid that much money, they feel that they should get the same, and thus no-one is willing to continue the old way. And it's easy after this has happened to think that paying people a lot of money is the only way it could be, but that's not so. If the possibility of making a lots of money did not exist, you would have people who would accept doing it for a little money, specially when it's something that is creative and fun.
fr: Et j'ai vu cela se produire dans le domaine de la programmation. Les m&ecirc;mes qui travaillaient au laboratoire d'I.A. en &eacute;tant tr&egrave;s peu pay&eacute;s et qui aimaient &ccedil;a, aujourd'hui ne r&ecirc;veraient pas d'un travail pour moins de cinquante mille dollars par an. Que s'est-il pass&eacute;&nbsp;? Quand vous faites miroiter aux gens la possibilit&eacute; de faire de l'argent, quand ils en voient d'autres faire le m&ecirc;me travail en &eacute;tant pay&eacute;s tr&egrave;s cher, ils estiment devoir obtenir la m&ecirc;me chose et personne n'est alors dispos&eacute; &agrave; continuer &agrave; l'ancienne mani&egrave;re. Il est facile une fois que cela s'est produit, de penser que de bien payer les gens est d&eacute;sormais le seul moyen. Mais ce n'est pas vrai. Si la possibilit&eacute; de faire de l'argent n'existait pas vous auriez des gens qui accepteraient de le faire pour pas grand-chose, particuli&egrave;rement quand c'est cr&eacute;atif et amusant.

source: Now I saw the unique world of the AI lab destroyed, and I saw that selling software was an intrinsic part of what had destroyed it, and I saw also, as I explained before, how you need to have free software in order to have a community like that. But then thinking about it more, I realized all these ways in which hoarding software hurts all of society, most specially by pressuring people to sell out their neighbors and causing social decay. The same spirit that leads people to watch while somebody in the street is getting stabbed and not tell anyone. The spirit that we can see so many companies all around us displaying all the time. And it was clear to me I had a choice, I could become part of that world and feel unhappy about what I was doing with my life, or I could decide to fight it. So I decided to fight it. I've dedicated my career to try to rebuild the software sharing community, to trying to put an end to the phenomenon of hoarding generally useful information. And the GNU system is a means to this end. It is a technical means to a social end. With the GNU system, I hope to vaccinate the users against the threat of the software hoarders.
fr: Maintenant que j'ai vu le monde unique du laboratoire d'I.A. d&eacute;truit et la vente du logiciel en &ecirc;tre intrins&egrave;quement responsable, j'ai &eacute;galement vu, comme je l'ai expliqu&eacute; avant, le besoin en logiciel libre pour retrouver une communaut&eacute; comme celle-l&agrave;. Mais en y r&eacute;fl&eacute;chissant davantage, j'ai r&eacute;alis&eacute; l'ampleur de la nocivit&eacute; du logiciel accapar&eacute; sur l'ensemble de la soci&eacute;t&eacute;, plus particuli&egrave;rement la pression mise sur les gens pour qu'ils vendent au d&eacute;triment de leurs voisins et causant l'affaiblissement social. Le m&ecirc;me esprit qui pousse les gens &agrave; observer quelqu'un quise fait poignarder dans la rue sans le dire &agrave; personne. Cet esprit dont nous pouvons voir tant d'entreprises en faire la preuve autour de nous. Il &eacute;tait &eacute;vident que j'avais le choix. Je pouvais faire partie de ce monde et me sentir malheureux de voir ce que je faisais de ma vie ou je pouvais d&eacute;cider de le combattre. Ainsi j'ai d&eacute;cid&eacute; de le combattre. J'ai consacr&eacute; ma carri&egrave;re &agrave; tenter de reconstruire la communaut&eacute; de partage du logiciel, &agrave; tenter de mettre un terme au ph&eacute;nom&egrave;ne d'accaparer l'information utile &agrave; l'ensemble des gens. Et le syst&egrave;me GNU est un moyen &agrave; cet effet. Il est un moyen technique &agrave; des fins sociales. Avec le syst&egrave;me GNU, j'esp&egrave;re vacciner les utilisateurs contre la menace des accapareurs de logiciel.

source: Right now the hoarders essentially claims the power to render a person's computer useless. There used to be people in the US, most commonly about fifty years ago, they were in the Mafia, they would go up to stores and bars, especially bars when bars were illegal of course. They would go up and say: &ldquo;A lot of places around here have been burning down lately. You wouldn't want your place to burn down, would you? Well we can protect you from fires, you just have to pay us a thousand dollars a month, and we'll make sure you don't have a fire here&rdquo;. And this was called &ldquo;the protection racket&rdquo;. Now we have something where a person says &ldquo;You got a nice computer there, and you've got some programs there that you're using. Well, if you don't want those programs to disappear, if you don't want the police to come after you, you better pay me a thousand dollars, and I'll give you a copy of this program with a license&rdquo;, and this is called &ldquo;the software protection racket&rdquo;.
fr: En ce moment, les accapareurs r&eacute;clament essentiellement le pouvoir de rendre inutile l'ordinateur d'une personne. Il y avait des gens aux USA, il y a plus ou moins cinquante ans, de la Mafia qui entraient dans les magasins et les bars, sp&eacute;cialement les bars hors-la-loi &eacute;videmment. Ils pouvaient entrer et dire&nbsp;: &laquo;&nbsp;Pas mal d'endroits par ici ont br&ucirc;l&eacute; derni&egrave;rement. Vous ne voudriez pas que le v&ocirc;tre subisse le m&ecirc;me sort&nbsp;? Aussi, nous pouvons vous prot&eacute;ger contre les incendies, vous avez juste &agrave; nous payer mille dollars par mois et nous nous assurerons qu'il n'y aura pas le feu&nbsp;&raquo;. Et &ccedil;a s'appelait &laquo;&nbsp;le racket de protection&nbsp;&raquo;. Aujourd'hui nous en sommes &agrave; quelque chose pr&egrave;s &agrave; ce qu'une personne nous dise &laquo;&nbsp;Vous avez un joli ordinateur ici et vous utilisez quelques programmes. Bien, si vous ne voulez pas que ces programmes disparaissent, si vous ne voulez pas que la police vous poursuive, vous feriez mieux de payer mille dollars et je vous donnerai une copie de ce programme avec une autorisation&nbsp;&raquo;, et &ccedil;a s'appelle &laquo;&nbsp;le racket de protection de logiciel&nbsp;&raquo;.
