Repository: gitGNU/gnu_www-fr
Catalog: philosophy/stallman-kth.*.po
Languages: fr

source: Software is a relatively new phenomenon. People started distributing software perhaps thirty years ago. It was only about twenty years ago that someone had the idea of making a business about it. It was an area with no tradition about how people did things, or what rights anybody had. And there were several ideas for what other areas of life you might bring traditions from by analogy.
fr: Le logiciel est un ph&eacute;nom&egrave;ne relativement nouveau. Les gens ont commenc&eacute; &agrave; distribuer du logiciel il y a peut-&ecirc;tre trente ans. Il y a seulement environ vingt ans que quelqu'un a eu l'id&eacute;e de faire du business avec &ccedil;a. C'&eacute;tait un secteur sans &agrave;-priori sur la fa&ccedil;on de faire ou sur les droits que l'on pouvait avoir. Et il y avait quelques id&eacute;es sur ce que les autres domaines de la vie pouvaient apporter comme tradition par analogie.

source: One analogy that is liked by a lot of professors in Europe, is that between programs and mathematics. A program is sort of a large formula. Now, traditionally nobody can own a mathematical formula. Anybody can copy them and use them.
fr: Une analogie appr&eacute;ci&eacute;e par un bon nombre de professeurs en Europe est celle faite entre les programmes et les math&eacute;matiques. Un programme est une sorte de grande formule. Par tradition, personne ne peut poss&eacute;der une formule math&eacute;matique. N'importe qui peut la copier et s'en servir.

source: The analogy that's most meaningful to ordinary people is with recipes. If you think about it, the thing that you have in ordinary life that's most like program is a recipe, it's instructions for doing something. The differences come because a recipe is followed by a person, not by a machine automatically. It's true there's no difference between source code and object code for a recipe, but it's still the closest thing. And no-one is allowed to own a recipe.
fr: L'analogie qui a le plus de sens pour les gens ordinaires, c'est celle avec les recettes. Si vous r&eacute;fl&eacute;chissez, ce qui ressemble le plus &agrave; un programme dans la vie ordinaire c'est une recette. Des instructions pour faire quelque chose. La diff&eacute;rence, c'est qu'une recette est suivie par une personne, pas par une machine de fa&ccedil;on automatis&eacute;e. Il est vrai qu'il n'y a pas de diff&eacute;rence entre le code source et le code objet pour la recette, mais c'est toujours ce qu'il y a de plus proche. Et personne n'est autoris&eacute; &agrave; poss&eacute;der une recette.

source: But the analogy that was chosen was the analogy with books, which have copyright. And why was this choice made? Because the people that had the most to gain from making that particular choice were allowed to make the decision. The people who wrote the programs, not the people who used the programs, were allowed to decide, and they decided in a completely selfish fashion, and as a result they've turned the field of programming into an ugly one.
fr: Mais l'analogie qui a &eacute;t&eacute; choisie fut celle avec les livres, sur lesquels s'appliquent le droit d'auteur. Pourquoi ce choix a-t-il &eacute;t&eacute; fait&nbsp;? Parce que les gens qui avaient le plus &agrave; gagner &agrave; faire ce choix particulier ont &eacute;t&eacute; autoris&eacute;s &agrave; prendre la d&eacute;cision. Les gens qui &eacute;crivaient les programmes, pas ceux qui les utilisaient, n'ont pas eu le droit de d&eacute;cider. Cela a &eacute;t&eacute; fait d'une fa&ccedil;on totalement &eacute;go&iuml;ste, en transformant le domaine de la programmation en quelque chose de sinistre.

source: It was only in the late seventies that this began to change. I was extremely impressed by the sharing spirit that we had. We were doing something that we hoped was useful and were happy if people could use it. So when I developed the first EMACS, and people wanted to start use it outside of MIT, I said that it belongs to the EMACS &ldquo;Commune&rdquo;, that in order to use EMACS you had to be a member of the commune, and that meant that you had the responsibility to contribute all the improvements that you made. All the improvements to the original EMACS had to be sent back to me so that I could incorporate them into newer versions of EMACS, so that everyone in the community could benefit from them.
fr: C'est seulement vers la fin des ann&eacute;es 70 que &ccedil;a a commenc&eacute; &agrave; changer. J'ai &eacute;t&eacute; extr&ecirc;mement marqu&eacute; par l'esprit de partage que nous avions alors. Nous esp&eacute;rions faire quelque chose d'utile et nous &eacute;tions heureux si les gens pouvaient l'utiliser. Ainsi, quand j'ai d&eacute;velopp&eacute; le premier EMACS et que les gens ont commenc&eacute; &agrave; vouloir l'utiliser en dehors du M.I.T., j'ai dit qu'il appartenait &agrave; la &laquo;&nbsp;communaut&eacute;&nbsp;&raquo; EMACS. Pour utiliser EMACS vous deviez &ecirc;tre membre de la communaut&eacute; et &ccedil;a voulait dire que vous aviez eu la responsabilit&eacute; de participer &agrave; toutes les am&eacute;liorations que vous aviez faites. Toutes les am&eacute;liorations de l'EMACS original devaient m'&ecirc;tre renvoy&eacute;es pour que je puisse les incorporer &agrave; de nouvelles versions d'EMACS, de mani&egrave;re &agrave; ce que chacun dans la communaut&eacute; puisse en b&eacute;n&eacute;ficier.

source: But this started to be destroyed when SCRIBE was developed at CMU, and then was sold to a company. This was very disturbing to a lot of us at many universities, because we saw that this was a temptation placed in front of everyone, that it was so profitable to be uncooperative and those of us who still believed in cooperation had no weapon to try to compel people to cooperate with us. Clearly, one after another, people would defect and stop cooperating with the rest of society, until only those of us with very strong consciences would still cooperate. And that's what happened.
fr: Mais &ccedil;a a commenc&eacute; &agrave; se d&eacute;grader quand SCRIBE a &eacute;t&eacute; d&eacute;velopp&eacute; &agrave; C.M.U. puis vendu &agrave; une entreprise. &Ccedil;a a &eacute;t&eacute; d&eacute;routant pour beaucoup d'entre nous dans de nombreuses universit&eacute;s, parce que nous avons vu que c'&eacute;tait une tentation offerte &agrave; chacun et qu'il &eacute;tait bien profitable d'&ecirc;tre peu coop&eacute;ratif. Et ceux d'entre nous qui y croyaient toujours n'avaient aucune arme pour tenter de contraindre les gens &agrave; coop&eacute;rer avec nous. Sans aucun doute, les uns apr&egrave;s les autres, les gens allaient d&eacute;serter et cesser de coop&eacute;rer avec le reste de la soci&eacute;t&eacute;, jusqu'&agrave; ce qu'il ne reste plus que ceux qui avaient des consciences tr&egrave;s fortes pour continuer. Et c'est ce qu'il s'est pass&eacute;.

source: The field of programming has now become an ugly one, where everyone cynically thinks about how much money he is going to get by not being nice to the other people in the field, and to the users.
fr: Le domaine de la programmation est maintenant devenu sinistre, o&ugrave; chacun pense de fa&ccedil;on cynique &agrave; combien il va gagner &agrave; ne pas &ecirc;tre sympa avec ses homologues et les utilisateurs.

source: I want to establish that the practice of owning software is both materially wasteful, spiritually harmful to society and evil. All these three things being interrelated. It's spiritually harmful because it involves every member of society who comes in contact with computers in a practice that is obviously materially wasteful to other people. And every time you do something for your own good, which you know is hurting other people more that it helps you, you have to become cynical in order to support such a thing in your mind. And it's evil because it is deliberately wasting the work done in society and causing social decay.
fr: Je veux montrer que le fait de poss&eacute;der un logiciel est &agrave; la fois mat&eacute;riellement inutile, spirituellement nuisible &agrave; la soci&eacute;t&eacute; et malfaisant. Ces trois choses &eacute;tant interd&eacute;pendantes. C'est spirituellement nocif parce que &ccedil;a engage manifestement chaque membre de la soci&eacute;t&eacute; en contact avec des ordinateurs dans une pratique mat&eacute;rielle inutile aux autres. Et chaque fois que vous faites quelque chose pour vous-m&ecirc;me et que vous savez que &ccedil;a blesse plus les autres que &ccedil;a ne vous aide, vous &ecirc;tes oblig&eacute; de devenir cynique pour pouvoir supporter une telle chose dans votre esprit. Et c'est malfaisant parce que &ccedil;a gaspille d&eacute;lib&eacute;r&eacute;ment le travail effectu&eacute; dans la soci&eacute;t&eacute; en provoquant l'affaiblissement social.

source: First I want to explain the kinds of harm that are done by attempts to own software and other information that's generally useful, then I'll go on to rebut the arguments made to support that practice, and then I want to talk about how to fight that phenomenon, and how I'm fighting it.
fr: D'abord je veux expliquer les diff&eacute;rentes nuisances caus&eacute;es par les tentatives de poss&eacute;der un logiciel ou toute autre information utile en g&eacute;n&eacute;ral, puis je m'appliquerai &agrave; r&eacute;futer les arguments qui soutiennent cette pratique, ensuite je veux parler de la fa&ccedil;on de combattre ce ph&eacute;nom&egrave;ne et comment je m'y prends moi-m&ecirc;me.

source: The idea of owning information is harmful in three different levels. Materially harmful on three different levels, and each kind of material harm has a corresponding spiritual harm.
fr: L'id&eacute;e de poss&eacute;der l'information est nocive &agrave; trois niveaux diff&eacute;rents. Mat&eacute;riellement nocif &agrave; trois niveaux diff&eacute;rents. Et &agrave; chaque type de nocivit&eacute; mat&eacute;rielle correspond une nocivit&eacute; spirituelle.

source: Now in fact, you don't have to do anything special to cause a program to get around to all the people who want to use it, because they can copy it themselves perfectly well, and it will get to everyone. All you have to do after you've written the program is to sit back and let people do what they want to do. But that's not what happens; instead somebody deliberately tries to obstruct the sharing of the program, and in fact, he doesn't just try to obstruct it, he tries to pressure other people into helping. Whenever a user signs a nondisclosure agreement he has essentially sold out his fellow users. Instead of following the golden rule and saying, &ldquo;I like this program, my neighbor would like the program, I want us both to have it&rdquo;, instead he said, &ldquo;Yeah, give it to me. To hell with my neighbor! I'll help you keep it away from my neighbor, just give it to me!&rdquo;, and that spirit is what does the spiritual harm. That attitude of saying, &ldquo;To hell with my neighbors, give ME a copy&rdquo;.
fr: En fait, vous n'avez rien de sp&eacute;cial &agrave; faire pour qu'un programme se r&eacute;pande &agrave; tous ceux qui veulent l'utiliser, parce qu'ils peuvent le copier eux-m&ecirc;mes parfaitement bien et qu'il finit par atteindre tout le monde. Tout ce que vous avez &agrave; faire, apr&egrave;s avoir &eacute;crit le programme, c'est de vous reposer et de laissez les gens faire ce qu'ils veulent. Mais ce n'est pas ce qu'il se passe. Au lieu de &ccedil;a, quelqu'un essaye d&eacute;lib&eacute;r&eacute;ment d'entraver le partage du programme. Mais il ne tente pas simplement de l'entraver, il tente de se faire aider en mettant la pression sur les autres. Toutes les fois qu'un utilisateur signe un accord de non-divulgation, il a essentiellement vendu tous ses homologues utilisateurs. Au lieu de suivre la r&egrave;gle d'or et de dire &laquo;&nbsp;J'aime ce programme, mon voisin le voudrait aussi, je veux que nous l'ayons tous les deux&nbsp;&raquo;, il a dit&nbsp;: &laquo;&nbsp;Ouais, donnez-le moi. Au diable mon voisin&nbsp;! Je vous aiderai &agrave; le maintenir hors de sa port&eacute;e. Ne le donnez qu'&agrave; moi&nbsp;!&nbsp;&raquo; et cet esprit est ce qui cause la nuisance spirituelle. Cette attitude de dire &laquo;&nbsp;Au diable mes voisins, donnez-moi &agrave; MOI une copie&nbsp;&raquo;.

source: After I ran into people saying they wouldn't let me have copies of something, because they had signed some secrecy agreement, then when somebody asked me to sign a thing like that I knew it was wrong. I couldn't do to somebody else the thing that had made me so angry when it was done to me.
fr: Apr&egrave;s &ecirc;tre rentr&eacute; dans les gens qui disaient qu'il ne me laisseraient pas avoir de copies parce qu'ils avaient sign&eacute; un accord secret, quand quelqu'un me demandait de signer un truc comme &ccedil;a je savais que c'&eacute;tait mal. Je ne pouvais pas faire &agrave; quelqu'un d'autre ce qui m'avait tant exasp&eacute;r&eacute; quand on me l'avait fait &agrave; moi.

source: But this is just one of the levels of harm. The second level of harm comes when people want to change the program, because no program is really right for all the people who would like to use it. Just as people like to vary recipes, putting in less salt say, or maybe they like to add some green peppers, so people also need to change programs in order to get the effects that they need.
fr: Mais c'est juste un des niveaux de la nocivit&eacute;. Le deuxi&egrave;me niveau arrive quand les gens veulent modifier le programme, parce qu'un programme ne satisfait jamais vraiment tous ceux qui voudraient l'utiliser. Tout comme ils aiment varier les recettes, en mettant moins de sel, ou peut-&ecirc;tre aiment-ils rajouter du poivre vert, les gens doivent &eacute;galement modifier les programmes pour obtenir les effets dont ils ont besoin.

source: Now, the software owners don't really care whether people can change the program or not, but it's useful for their ends to prevent people. Generally when software is proprietary you can't get the sources, you can't change it, and this causes a lot of wasted work by programmers, as well as a lot of frustration by users. For example: I had a friend who told me how she worked for many months at a bank where she was a programmer, writing a new program. Now, there was a commercially available program that was almost right, but it was just not quite the thing they needed, and in fact as it was it was useless for them. The amount of change it would have taken to make it do what they needed was probably small, but because the sources of that program were not available, that was impossible. She had to start over from scratch and waste a lot of work. And we can only speculate about what fraction of all the programmers in the world are wasting their time in this fashion.
fr: Maintenant, les propri&eacute;taires de logiciel ne s'inqui&egrave;tent pas vraiment de savoir si les gens peuvent modifier le programme ou non, mais les en emp&ecirc;cher leur est utile pour parvenir &agrave; leurs fins. G&eacute;n&eacute;ralement quand un logiciel est une propri&eacute;t&eacute; industrielle, vous ne pouvez pas obtenir les sources, vous ne pouvez pas le modifier et c'est un grand gaspillage de travail pour les programmeurs aussi bien qu'une grande frustation pour les utilisateurs. Par exemple&nbsp;: une amie m'a dit qu'elle avait travaill&eacute; pendant de nombreux mois dans une banque o&ugrave; elle &eacute;tait programmeuse, pour &eacute;crire un nouveau programme. Or il y avait un programme disponible dans le commerce qui &eacute;tait presque bon, mais qui n'&eacute;tait pas tout &agrave; fait ce dont ils avaient besoin. Et tel quel, il leur &eacute;tait inutile. La quantit&eacute; de changement que cela demandait &eacute;tait probablement faible, mais comme les sources de ce programme n'&eacute;taient pas disponibles, c'&eacute;tait impossible. Elle a d&ucirc; partir de z&eacute;ro et dilapider beaucoup de temps. Et nous ne pouvons que sp&eacute;culer sur la fraction de l'ensemble des programmeurs du monde qui perdent leur temps de cette fa&ccedil;on.

source: And then there is also the situation where a program is adequate make do, but it's uncomfortable. For example: The first time we had a graphics printer at MIT, we wrote the software ourselves, and we put in lots of nice features, for example it would send you a message when your job had finished printing, and it would send you a message if the printer ran out of paper and you had a job in the queue, and lots of other things that were what we wanted. We then got a much nicer graphic printer, one of the first laser printers, but then the software was supplied by Xerox, and we couldn't change it. They wouldn't put in these features, and we couldn't, so we had to make do with things that &ldquo;half worked&rdquo;. And it was very frustrating to know that we were ready, willing and able to fix it, but weren't permitted. We were sabotaged.
fr: Il y a aussi le cas o&ugrave; un programme est ad&eacute;quat mais inconfortable. Par exemple&nbsp;: la premi&egrave;re fois que nous avons eu une imprimante graphique au M.I.T., nous avons &eacute;crit le logiciel nous-m&ecirc;mes et nous avons install&eacute; un bon nombre d'utilitaires sympathiques. Par exemple, il devait vous envoyer un message quand le travail d'impression &eacute;tait fini et il vous envoyait un message si l'imprimante manquait de papier, si vous aviez un travail en file d'attente et pas mal d'autres choses qui correspondaient &agrave; ce que nous voulions. Nous avons alors re&ccedil;u une imprimante graphique beaucoup plus int&eacute;ressante, une des premi&egrave;res imprimantes laser, mais le logiciel &eacute;tait fourni par Xerox et nous ne pouvions pas le modifier. Ils n'accepteraient pas d'int&eacute;grer les utilitaires et nous ne pouvions pas le faire nous-m&ecirc;me. Aussi nous avons d&ucirc; nous contenter de choses qui ne &laquo;&nbsp;fonctionnaient qu'&agrave; moiti&eacute;&nbsp;&raquo;. Et c'&eacute;tait tr&egrave;s frustrant de savoir que nous &eacute;tions pr&ecirc;ts, d&eacute;sireux et capables d'arranger &ccedil;a mais que nous n'en avions pas le droit. On nous sabotait.

source: And then there are all the people who use computers and say that the computers are a mystery to them, they don't know they work. Well how can they possibly know? They can't read the programs they're using. The only way people learn how programs should be written, or how programs do what they do, is by reading the source code.
fr: Et il y a toutes les personnes qui utilisent des ordinateurs et qui disent que les ordinateurs sont un myst&egrave;re pour eux. Ils ne savent pas comment &ccedil;a fonctionne. Mais comment pourraient-ils le savoir&nbsp;? Ils ne peuvent pas lire les programmes qu'ils utilisent. La seule mani&egrave;re pour les gens d'apprendre comment les programmes devraient &ecirc;tre &eacute;crits ou comment ils font ce qu'ils font, c'est de lire le code source.

source: So I could only wonder whether the idea of the user who just thinks of the computer as a tool is not actually a self-fulfilling prophecy, a result of the practice of keeping source code secret.
fr: Aussi je ne peux que me demander si l'id&eacute;e d'un utilisateur qui voit l'ordinateur uniquement comme un outil tient r&eacute;ellement ou non de la proph&eacute;tie d'auto-&eacute;panouissement&nbsp;; une cons&eacute;quence du fait de maintenir le code source secret.

source: Now the spiritual harm that goes with this kind of material harm, is in the spirit of self-sufficiency. When a person spends a lot of time using a computer system, the configuration of that computer system becomes the city that he lives in. Just as the way our houses and furniture are laid out, determines what it's like for us to live among them, so that the computer system that we use, and if we can't change the computer system that we use to suit us, then our lives are really under the control of others. And a person who sees this becomes in a certain way demoralized: &ldquo;It's no use trying to change those things, they're always going to be bad. No point even hassling it. I'll just put in my time and &hellip; when it's over I'll go away and try not to think about it any more&rdquo;. That kind of spirit, that unenthusiasm is what results from not being permitted to make things better when you have feelings of public spirit.
fr: Maintenant la nocivit&eacute; spirituelle qui correspond &agrave; ce type de nocivit&eacute; mat&eacute;rielle r&eacute;side dans l'esprit d'auto-suffisance. Quand une personne d&eacute;pense une bonne partie de son temps &agrave; utiliser un syst&egrave;me informatique, la configuration de ce syst&egrave;me informatique devient le pays dans lequel elle vit. Tout comme la mani&egrave;re dont nos maisons et nos meubles sont dispos&eacute;s d&eacute;termine comment nous vivons parmi eux. Ainsi va le syst&egrave;me informatique que nous utilisons. Et si nous ne pouvons pas le modifier pour qu'il nous convienne, nos vies sont alors vraiment sous le contr&ocirc;le des autres. Et d'une certaine mani&egrave;re, la personne qui le constate en est d&eacute;moralis&eacute;e&nbsp;: &laquo;&nbsp;&Ccedil;a ne sert &agrave; rien d'essayer de changer &ccedil;a, ce sera toujours mauvais. Je ne vais rien gagner &agrave; tout d&eacute;ranger. Je ne vais qu'y consacrer mon temps et&hellip; quand j'aurai fini, je m'en irai en t&acirc;chant de ne plus y penser&nbsp;&raquo;. Ce genre d'esprit, ce manque d'enthousiasme est ce qui r&eacute;sulte de ne pas &ecirc;tre autoris&eacute; &agrave; am&eacute;liorer les choses quand vous avez l'esprit public.

source: The third level of harm is in the interaction between software developers themselves. Because any field of knowledge advance most when people can build on the work of others, but ownership of information is explicitly designed to prevent anyone else to doing that. If people could build on other people's work, then the ownership would become unclear, so they make sure each new entry to the field has to start from the beginning, and thus they greatly slow down the advance of the field.
fr: Le troisi&egrave;me niveau de nocivit&eacute; se situe dans l'interaction entre les d&eacute;veloppeurs de logiciel eux-m&ecirc;mes. Puisque tout domaine de connaissance avance davantage quand les gens peuvent construire &agrave; partir du travail des autres. Mais l'appropriation de l'information est explicitement con&ccedil;ue pour emp&ecirc;cher tout autre de le faire. Si les gens pouvaient construire &agrave; partir du travail des autres, alors la propri&eacute;t&eacute; deviendrait difficile &agrave; cerner, c'est pourquoi ils s'assurent que chaque nouveau venu dans le domaine commence &agrave; partir du d&eacute;but et en ralentissent ainsi consid&eacute;rablement l'avancement.
