Repository: gitGNU/gnu_www-fr
Catalog: philosophy/stophr3028.*.po
Languages: fr

source: Stop H.R. 3028 - Protect the Net - Stop the Trademark Monopolists
fr: Stoppez H.R. 3028 - Prot&eacute;gez Internet - Stoppez les monopoles des marques d&eacute;pos&eacute;es

source: This is posted on behalf of Marc Rotenberg <a href="mailto:rotenberg@epic.org">&lt;rotenberg@epic.org&gt;</a>. More information is available by following the links at the end of this page.
fr: Ceci est post&eacute; pour le compte de Marc Rotenberg <a href="mailto:rotenberg@epic.org">&lt;rotenberg@epic.org&gt;</a>. Vous trouverez plus d'informations en suivant les liens au bas de cette page.

source: <cite> This bill fits a pattern: every time Congress wants to create a new monopoly covering some activity formerly open to all, or extend and increase an old monopoly, they apply the term &ldquo;piracy&rdquo; to the free activity that the monopoly will stamp out. So whenever you see anything described as &ldquo;piracy&rdquo; aside from the capturing of ships, watch out for your liberties! -- Richard Stallman </cite>
fr: <cite>Cette loi suit un sch&eacute;ma&nbsp;: chaque fois que le Congr&egrave;s veut cr&eacute;er un nouveau monopole couvrant une activit&eacute; auparavant ouverte &agrave; tous, ou &eacute;tendre et accro&icirc;tre un ancien monopole, il applique le terme &laquo;&nbsp;piratage&nbsp;&raquo; &agrave; l'activit&eacute; libre que le monopole s'appropriera. Par cons&eacute;quent, chaque fois que vous verrez quelque chose de d&eacute;crit comme du &laquo;&nbsp;piratage&nbsp;&raquo;, except&eacute; pour l'abordage de bateaux, faites attention &agrave; vos libert&eacute;s&nbsp;! -- Richard Stallman</cite>

source: The House of Representatives is about to vote on legislation that would grant sweeping new powers for trademark holders and undermine the rights of domain name holders, Internet users, and small businesses. H.R. 3028 &ldquo;The Trademark Cyberpiracy Prevention Act of 1999&rdquo; will also establish unprecedented ability for trademark holders to sue Internet users all around the world. And H.R. 32028 will undermine a fair and carefully crafted international consensus on the resolution of Internet name disputes. It's a bad bill and it should be stopped.
fr: La Chambre des Repr&eacute;sentants est sur le point de voter une loi qui accorderait de nouveaux pouvoirs &eacute;tendus aux d&eacute;tenteurs de marques d&eacute;pos&eacute;es et saperait les droits des d&eacute;tenteurs de noms de domaines, des internautes et des petites entreprises. H.R. 3028 &laquo;&nbsp;The Trademark Cyberpiracy Prevention Act of 1999&nbsp;&raquo; (La loi de pr&eacute;vention du cyber-piratage des marques d&eacute;pos&eacute;es de 1999) &eacute;tablirait &eacute;galement la possibilit&eacute; sans pr&eacute;c&eacute;dent pour les d&eacute;tenteurs de marques d&eacute;pos&eacute;es de poursuivre les internautes dans le monde entier. Et H.R. 32028 saperait un consensus international juste et soigneusement cisel&eacute; sur la r&eacute;solution des disputes sur les noms de domaine Internet. C'est une mauvaise loi et elle devrait &ecirc;tre bloqu&eacute;e.

source: The House of Representatives may vote on H.R. 3028 as early as Tuesday, October 26, 1999.
fr: La Chambre des Repr&eacute;sentants peut voter H.R. 3028 d&egrave;s mardi 26 octobre 1999.

source: You Need To Act
fr: Vous devez agir

source: There is a chance to stop HR 3028. It has very few sponsors and has moved quietly through Congress, mostly under the radar of organizations and businesses that have worked to promote the growth of the Internet. Also, Congress will soon break for Thanksgiving.
fr: Il y a une chance de bloquer la loi HR 3028. Elle a tr&egrave;s peu de soutiens et est pass&eacute;e par le Congr&egrave;s discr&egrave;tement, largement à l'insu des organisations et entreprises qui ont &oelig;uvr&eacute; &agrave; promouvoir la croissance d'Internet. De plus, le Congr&egrave;s fera bient&ocirc;t une pause pour Thanksgiving.

source: But you have to act!
fr: Mais vous devez agir&nbsp;!

source: What You Can Do
fr: Ce que vous pouvez faire

source: It is vitally important for you to contact your Representative in Congress and explain politely but firmly that you hope that your Representative will VOTE AGAINST H.R. 3028.
fr: Il est vital pour vous de contacter votre Repr&eacute;sentant au Congr&egrave;s et de lui expliquer poliment mais fermement que vous esp&eacute;rez qu'il VOTERA CONTRE H.R. 3028

source: Here is a quick guide to Calling Your Congressman.
fr: Voici un guide rapide pour appeler votre Repr&eacute;sentant au Congr&egrave;s

source: Call the Capitol Hill Switchboard (202-224-3121) and ask to speak to your Congressman. (Don't know who your Congressman is? Ok, go <a href="http://www.house.gov/writerep/">here</a>)
fr: Appelez le standard de Capitol Hill (202-224-3121) et demandez &agrave; parler &agrave; votre Repr&eacute;sentant. (Vous ne savez pas qui est votre Repr&eacute;sentant&nbsp;? D'accord, rendez-vous <a href="http://www.house.gov/writerep/">ici</a>)

source: When you reach the office say to the person who answers the phone:
fr: Quand vous obtenez le bureau, dites &agrave; la personne qui r&eacute;pond&nbsp;:

source: &ldquo;Hello, I'm a registered voter in the district of Congressman &lt;name&gt;. I'm calling because I hope he/she will vote against H.R. 3028, &lsquo;The Cyberpiracy Act&rsquo;. I don't like cyberpirates, but I believe this bill will hurt ALL domain name holders on the Internet, including small businesses, noncommercial organizations and individuals. Will you please tell the Congressman that I asked him/her to vote against H.R. 3028? Thanks.&rdquo;
fr: &laquo;&nbsp;Bonjour, je suis un &eacute;lecteur inscrit dans la circonscription du Repr&eacute;sentant &lt;name&gt;. J'appelle car j'esp&egrave;re qu'il/elle votera contre H.R. 3028, &laquo;&nbsp;La loi contre le cyber-piratage&nbsp;&raquo;. Je n'aime pas les cyber-pirates, mais je pense que cette loi l&egrave;sera TOUS les d&eacute;tenteurs de noms de domaine Internet, y compris les petites entreprises, les organisations non commerciales et les particuliers. Pouvez-vous s'il vous pla&icirc;t dire au Repr&eacute;sentant que je lui ai demand&eacute; de voter contre H.R. 3028&nbsp;? Merci&nbsp;&raquo;.

source: Here are all the things you just did in 30 seconds:
fr: Voici ce que vous venez de faire en 30 secondes&nbsp;:

source: You made clear that you're a voter in the Congressman's District (they'll listen to you!)
fr: Vous avez clairement dit que vous &ecirc;tes un &eacute;lecteur dans la circonscription du Repr&eacute;sentant (ils vous &eacute;couteront&nbsp;!)

source: You said clearly that you are against a bill and you gave the bill number and the title of the bill (it's important to give both!)
fr: Vous avez dit clairement que vous &eacute;tiez contre une loi et vous avez donn&eacute; le num&eacute;ro de la loi et son libell&eacute; (il est important de donner les deux&nbsp;!)

source: You gave the Congressman a good reason to vote against H.R. 3028 (Members of Congress like good reasons for votes)
fr: Vous avez donn&eacute; au Repr&eacute;sentant une bonne raison de voter contre H.R. 3028 (les membres du Congr&egrave;s aiment les bonnes raisons pour les votes)

source: You asked for a commitment to convey your position to the Congressman (you want to be taken seriously)
fr: Vous avez demand&eacute; un engagement &agrave; faire suivre votre position au Repr&eacute;sentant (vous voulez &ecirc;tre pris au s&eacute;rieux)

source: You were polite (always a plus)
fr: Vous avez &eacute;t&eacute; poli (c'est toujours un plus)

source: If you leave your name and address, that will make your call even more effective (you might even get a letter)
fr: Si vous laissez vos nom et adresse, cela rendra votre appel encore plus efficace (vous pourriez m&ecirc;me recevoir un courrier)

source: If you like, you can also send an email to your Representative with a new service offered at the House web site &mdash; check <a href="http://www.house.gov/writerep/">here</a>.
fr: Si vous le souhaitez, vous pouvez aussi envoyer un courriel &agrave; votre Repr&eacute;sentant gr&acirc;ce au nouveau service offert par le site Web de la Chambre des Repr&eacute;sentants <a href="http://www.house.gov/writerep/">ici</a>.

source: If you're still energized to do something, ask a friend or neighbor who also lives in your district to make the same call. You can also call the office of the Chairman of the Rules Committee Congressman David Dreier and tell his staffperson that you oppose H.R. 3028 and hope that Mr. Dreier will put off a vote on the bill until the problems are fixed.
fr: Si vous &ecirc;tes encore motiv&eacute; pour faire autre chose, demandez &agrave; un ami ou un voisin qui vit aussi dans votre circonscription de faire le m&ecirc;me appel. Vous pouvez aussi appeler le pr&eacute;sident du Comit&eacute; des lois au Congr&egrave;s, David Dreier, et dire &agrave; son &eacute;quipe que vous &ecirc;tes oppos&eacute; &agrave; la loi H.R. 3028 et que vous esp&eacute;rez que M. Dreier repoussera le vote sur la loi jusqu'&agrave; ce que les probl&egrave;mes soient r&eacute;solus.

source: If you want to learn more about the problems with H.R. 3028, look at the excellent letter from computer users and legal experts. Also, visit Thomas and check out the bill and the history.
fr: Si vous voulez en savoir plus sur les probl&egrave;mes avec la loi H.R. 3028, consultez l'excellente lettre des utilisateurs d'ordinateurs et des experts juridiques. Vous pouvez aussi visiter Thomas et consulter la loi et son historique.

source: Relevant Information
fr: Informations pertinentes

source: <a href="http://thomas.loc.gov/cgi-bin/bdquery/z?d106:h.r.03028:"> Information about H.R. 3028, including the Text of the bill</a>
fr: <a href="http://thomas.loc.gov/cgi-bin/bdquery/z?d106:h.r.03028:">Informations sur H.R. 3028, y compris le texte de la loi</a>

source: <a href="http://www.icann.org/udrp/udrp.htm"> Information about the ICANN Uniform Dispute Resolution Policy</a>
fr: <a href="http://www.icann.org/udrp/udrp.htm">Informations sur la politique uniforme de r&eacute;solution de disputes de l'<acronym title="Internet Corporation for Assigned Names and Numbers">ICANN</acronym></a>

source: <a href="http://www.acm.org/usacm/trademark.html"> Letter from ACM, Legal Experts on Problems with H.R. 3028</a>
fr: <a href="http://www.acm.org/usacm/trademark.html">Lettre de l'<acronym title="Association for Computing Machinery">ACM</acronym> des experts juridiques sur les probl&egrave;mes avec H.R. 3028</a>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
