Repository: gitGNU/gnu_www-fr
Catalog: philosophy/third-party-ideas.*.po
Languages: fr

source: Philosophy of the GNU Project - GNU Project - Free Software Foundation (FSF)
fr: Philosophie du Projet GNU - GNU Project - Free Software Foundation (FSF)

source: Third Party Ideas
fr: Id&eacute;es de tierces personnes

source: These articles give other people's philosophical opinions in support of free software, or related issues, and don't speak for the GNU project &mdash; but we more or less agree with them.
fr: Ces articles donnent les opinions philosophiques d'autres personnes en faveur des logiciels libres, ou de sujets connexes, et ne s'expriment pas au nom du projet GNU &mdash;&nbsp;mais nous sommes plus ou moins d'accord avec elles.

source: Many of the <a href="/links/links.html#FreedomOrganizations">Organizations that Work for Freedom in Computer Development and Electronic Communications</a> also have philosophical opinions in support of free software, or related issues.
fr: De nombreuses <a href="/links/links.fr.html#FreedomOrganizations">organisations qui œuvrent pour la libert&eacute; dans le d&eacute;veloppement informatique et les communications &eacute;lectroniques</a> ont aussi des opinions philosophiques en faveur des logiciels libres, ou de sujets li&eacute;s.

source: <a href="http://freedom-to-tinker.com/blog/tblee/trouble-free-riding">The Trouble with &ldquo;Free Riding&rdquo;</a>, by Timothy B. Lee.
fr: <a href="http://freedom-to-tinker.com/blog/tblee/trouble-free-riding">Le problème des «&nbsp;Free Riding&nbsp;»</a>, par Timothy B. Lee.

source: <a href="http://www.cato-unbound.org/2008/06/09/rasmus-fleischer/the-future-of-copyright/">The Future of Copyright</a>, an essay by Rasmus Fleischer.
fr: <a href="http://www.cato-unbound.org/2008/06/09/rasmus-fleischer/the-future-of-copyright/">Le futur du copyright</a>, un essai de Rasmus Fleischer.

source: <a href="http://www.cic.unb.br/docentes/pedro/trabs/stockholm.html">The Digital Stockholm Syndrome</a>: reflections over some psychological responses to market forces, by Pedro Rezende, University of Brasilia.
fr: <a href="http://www.cic.unb.br/docentes/pedro/trabs/stockholm.html">Le syndrome de Stockholm numérique</a>&nbsp;: reflexions sur certaines réponses psychologiques aux forces du marché, par Pedro Rezende, Université de Brasilia.

source: <a href="http://questioncopyright.org">QuestionCopyright.org</a> is a web site about the history and effects of copyright, dedicated to raise awareness of the harmful consequences of today's copyright system.
fr: <a href="http://questioncopyright.org">QuestionCopyright.org</a> est un site Web sur l'histoire et les effets du copyright, destin&eacute; &agrave; faire prendre conscience des cons&eacute;quences dommageables du syst&egrave;me de copyright actuel.

source: <a href="http://www.informationweek.com/story/showArticle.jhtml?articleID=196601781"> How Vista Lets Microsoft Lock Users In</a> by Cory Doctorow. <b>Note:</b> We think it is a mistake to use the enemy's favorable-sounding propaganda terms such as &ldquo;trusted computing&rdquo; to describe a malicious plan.
fr: <a href="http://www.informationweek.com/story/showArticle.jhtml?articleID=196601781">Comment Vista permet &agrave; Microsoft de verrouiller les utilisateurs</a> par Cory Doctorow. <b>Note</b>&nbsp;: Nous pensons que c'est une erreur d'utiliser les termes de propagande de l'ennemi, qui paraissent favorables, tels que &laquo;&nbsp;informatique de confiance&nbsp;&raquo;, pour d&eacute;crire un plan malicieux.

source: <a href="http://www.movingtofreedom.org/">movingtofreedom.org</a>, Scott Carpenter's blog with many freedom-related articles.
fr: <a href="http://www.movingtofreedom.org/">movingtofreedom.org</a>, le blog de Scott Carpenter avec beaucoup d'articles relatifs &agrave; la libert&eacute;.

source: <a href="http://lwn.net/Articles/194701/">A couple of lessons on the hazards of proprietary software</a>.
fr: <a href="http://lwn.net/Articles/194701/">Deux leçons sur les dangers du logiciel propriétaire</a>, décrit les dangers du logiciel propriétaire.

source: <a href="http://southflorida.bizjournals.com/southflorida/stories/2006/07/03/story8.html"> Multiple doctors cut off from records by Dr. Notes </a>, an example of how proprietary software gives the developers unjust power over the users.
fr: <a href="http://southflorida.bizjournals.com/southflorida/stories/2006/07/03/story8.html">Plusieurs morceaux d'enregistrements de docteurs par Dr Notes</a>, un exemple de la fa&ccedil;on dont le logiciel propri&eacute;taire donne aux d&eacute;veloppeurs un pouvoir injuste sur les utilisateurs.

source: Jimmy Wales explains why <a href="http://blog.jimmywales.com/index.php/archives/2004/10/21/free-knowledge-requires-free-software-and-free-file-formats/"> Free Knowledge requires Free Software and Free File Formats</a> in this paper. He also exposes why <a href="http://www.wikipedia.org">Wikipedia</a> needs to be free software.
fr: Jimmy Wales explique pourquoi <a href="http://blog.jimmywales.com/index.php/archives/2004/10/21/free-knowledge-requires-free-software-and-free-file-formats/"> le savoir libre n&eacute;cessite des logiciels libres et des formats de fichiers libres</a> dans ce document. Il explique &eacute;galement pourquoi <a href="http://www.wikipedia.org">Wikipedia</a> a besoin d'&ecirc;tre un logiciel libre.

source: <a href="http://www.juergen-ernst.de/info_swpat_en.html">Software patents under the magnifying glass</a>. In this article the author uses arguments based on lambda calculus to show why software cannot be patented.
fr: <a href="http://www.juergen-ernst.de/info_swpat_en.html">Les brevets logiciels &agrave; la loupe</a>. Dans cet article, l'auteur utilise des arguments bas&eacute;s sur le lambda calcul pour montrer pourquoi les logiciels ne peuvent &ecirc;tre brevet&eacute;s.

source: <a href="http://lwn.net/Articles/204641/">Free gadgets need free software</a>, an editorial reporting a firmware &ldquo;upgrade&rdquo; that removes the ability to record radio broadcasts.
fr: <a href="http://lwn.net/Articles/204641/">Les gadgets libres n&eacute;cessitent des logiciels libres</a>, un &eacute;ditorial qui rapporte comment une &laquo;&nbsp;mise &agrave; jour&nbsp;&raquo; de firmware supprime la possibilit&eacute; d'enregistrer des programmes radiodiffus&eacute;s.

source: <a href="http://www.theinquirer.net/?article=11663">Groklaw sends a Dear Darl letter</a>; a group from the free software and open source community has put together a response to SCO CEO Darl McBride's Open Letter to the Open Source Community.
fr: <a href="http://www.theinquirer.net/?article=11663">Groklaw sends a Dear Darl letter</a>; un groupe de la communaut&eacute; du logiciel libre et open source a fait une r&eacute;ponse conjointe &agrave; la lettre ouverte &agrave; la communaut&eacute; open source du PDG de SCO, Darl McBride.

source: <a href="http://www.hardwarecentral.com/hardwarecentral/editorials/4788/1,">Hardware Central</a>. We disagree with one aspect of this article's conclusion: It's not legitimate for Microsoft to help Disney and the RIAA impose Digital Restrictions Management on you, any more than it is legitimate for Disney and the RIAA to try it. The full power of computing should be available to you, not just to the owners of information.
fr: <a href="http://www.hardwarecentral.com/hardwarecentral/editorials/4788/1,">Hardware Central</a>. Nous ne sommes pas d'accord avec un aspect de la conclusion de cet article&nbsp;: Il n'est pas l&eacute;gitime pour Microsoft d'aider Disney et la RIAA &agrave; de vous imposer la Digital Restrictions Management, pas plus qu'il n'est l&eacute;gitime pour Disney et la RIAA d'essayer de la faire. La puissance de traitement compl&egrave;te doit vous &ecirc;tre accessible, et pas seulement pour ceux qui sont propri&eacute;taires de l'information.

source: <a href="http://portal.softwarelivre.org/news/1185">The Brazilian Federal Goverment sponsored a national Free Software Movement</a> in Brazil. This article is in Brazilian Porteguese.
fr: <a href="http://portal.softwarelivre.org/news/1185">Le gouvernement f&eacute;d&eacute;ral br&eacute;silien a sponsoris&eacute; un mouvement national du logiciel libre</a> au Br&eacute;sil. Cet article est en portugais br&eacute;silien.

source: The SCO Sue Me Petition has overwhelmed its inceptor and the petition is no longer taking votes. The author of the petition, John Everitt, was expecting only several responses but instead he had thousands of participants. <a href="http://www.linuxjournal.com/article.php?sid=6913">In the last available public communication about the petition</a>, he urged people to help <a href="http://www.fsf.org">FSF</a> in any way possible.
fr: La p&eacute;tition &laquo;&nbsp;SCO Sue Me&nbsp;&raquo; a submerg&eacute; son initiateur et la p&eacute;tition ne recueille plus de votes. L'auteur de cette p&eacute;tition, John Everitt, s'attendait seulement &agrave; recevoir quelques r&eacute;ponses, mais au lieu de cela, il a eu des milliers de participants. <a href="http://www.linuxjournal.com/article.php?sid=6913">Dans la derni&egrave;re communication publique disponible de la p&eacute;tition</a>, il pressait les gens &agrave; aider la <a href="http://www.fsf.org">FSF</a> de toutes les fa&ccedil;ons possibles.

source: <a href="http://proposicion.org.ar/doc/gob/Conde-281102/index.html.en">Senator Alberto Conde's answer</a> to CESSI regarding Bill E-135/02-03 which proposes use of Free Software in the public sector for the province of Buenos Aires. <a href="http://proposicion.org.ar/proyecto/leyes/E-135.02-03/">The bill</a> has been submitted by Senator Alberto Conde himself.
fr: <a href="http://proposicion.org.ar/doc/gob/Conde-281102/index.html.en">La r&eacute;ponse du S&eacute;nateur Alberto Conde</a> au CESSI concernant la loi E-135/02-03 qui propose l'utilisation de logiciel libre dans le secteur public pour la province de Buenos Aires. <a href="http://proposicion.org.ar/proyecto/leyes/E-135.02-03/">La loi </a>a &eacute;t&eacute; soumise par le S&eacute;nateur Alberto Conde lui-m&ecirc;me.

source: Some economists argue that copyright and patents <a href="http://www.reason.com/0303/fe.dc.creation.shtml"> fail to promote the progress</a> that they supposedly exist to promote.
fr: Quelques &eacute;conomistes argumentent que les droits d'auteur et les brevets <a href="http://www.reason.com/0303/fe.dc.creation.shtml"> &eacute;chouent &agrave; promouvoir le progr&egrave;s</a>, dont c'&eacute;tait le but de leur cr&eacute;ation.

source: This article takes a narrowly economic view of its subject, measuring social alternatives only by what goods are available for what price, assuming that you the citizen are a mere consumer and place no value on your freedom in itself. It also uses the misleading term <a href="/philosophy/words-to-avoid.html#IntellectualProperty">&ldquo;intellectual property&rdquo;</a>, which is misleading because it lumps copyrights and patents together. The article also lumps them together, which it can get away with because it ignores the (different) social issues that copyrights and patents raise.
fr: Cet article adopte une vision &eacute;conomique &eacute;troite sur le sujet, mesurant les alternatives sociales en crit&egrave;res de&nbsp;: quels biens seront disponibles pour quel prix, supposant que vous, le citoyen, &ecirc;tes un simple consommateur et ne donne aucune valeur &agrave; votre libert&eacute;. Il utilise &eacute;galement le terme pr&ecirc;tant &agrave; confusion <a href="/philosophy/words-to-avoid.fr.html#IntellectualProperty">&laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;</a>, qui est trompeur car il met dans un m&ecirc;me sac droits d'auteur et brevets. Cet article les m&eacute;lange car il ignore les (diff&eacute;rents) probl&egrave;mes que droits d'auteurs et brevets soul&egrave;vent.

source: Despite those flaws, it is significant. If one can judge copyright to be harmful even on narrow economic terms, disregarding the ethical wrong of stopping people from sharing, it can only be more harmful once we consider the ethics as well.
fr: Malgr&eacute; ces d&eacute;fauts, il est important. Si on peut juger que le droit d'auteur est dangereux m&ecirc;me en termes &eacute;conomiques &eacute;troits, en ne consid&eacute;rant pas le tort &eacute;thique d'emp&ecirc;cher les gens de partager, il ne peut &ecirc;tre que plus dangereux encore si l'on consid&egrave;re aussi l'&eacute;thique.

source: Two articles by Duncan Campbell describe how NSA backdoors were hidden in proprietary software programs: <a href="http://www.heise.de/tp/english/inhalt/te/2898/1.html">&ldquo;Only NSA can listen, so that's OK&rdquo;</a> and <a href="http://www.heise.de/tp/english/inhalt/te/5263/1.html">&ldquo;How NSA access was built into Windows&rdquo;</a>. Both are clear demonstrations of how users of proprietary software can often be unaware of what they are actually running.
fr: Deux articles de Duncan Campbell d&eacute;crivent comment des portes d&eacute;rob&eacute;es de la NSA ont &eacute;t&eacute; cach&eacute;es dans des logiciels propri&eacute;taires&nbsp;: <a href="http://www.heise.de/tp/english/inhalt/te/2898/1.html">&laquo;&nbsp;Seule la NSA peut &eacute;couter, alors c'est OK&nbsp;&raquo;</a> et <a href="http://www.heise.de/tp/english/inhalt/te/5263/1.html">&laquo;&nbsp;Comment l'acc&egrave;s pour la NSA a &eacute;t&eacute; construit dans Windows&nbsp;&raquo;</a>. Les deux articles sont des d&eacute;monstrations claires de ce que les utilisateurs de logiciel propri&eacute;taire peuvent souvent ne pas &ecirc;tre conscients de ce qui s'ex&eacute;cute en fait sur leur machine.

source: <a href="http://www.culturaleconomics.atfreeweb.com/cpu.htm">&ldquo;Copyright C.P.U.&rdquo;</a> by Harry Hillman Chartrand is a good summary of the history of copyright.
fr: <a href="http://www.culturaleconomics.atfreeweb.com/cpu.htm">&laquo;&nbsp;Copyright C.P.U.&nbsp;&raquo;</a> par Harry Hillman Chartrand, est un bon r&eacute;sum&eacute; de l'histoire du droit d'auteur.

source: Malla Pollack's <a href="http://eon.law.harvard.edu/openlaw/eldredvashcroft/progress.html">&ldquo;What is Congress Supposed to Promote?&rdquo;</a> explains how the United States' government's recent tendencies to provide maximum control to copyright holders defies the justification for establishment of copyright set out in the constitution.
fr: Malla Pollack <a href="http://eon.law.harvard.edu/openlaw/eldredvashcroft/progress.html">&laquo;&nbsp;Qu'est-ce que le Congr&egrave;s est suppos&eacute; promouvoir&nbsp;?&nbsp;&raquo;</a> explique comment les derni&egrave;res tendances du gouvernement des &Eacute;tats-Unis &agrave; donner le contr&ocirc;le maximal aux d&eacute;tenteurs de droits d'auteur d&eacute;fient la justification pour l'&eacute;tablissement du droit d'auteur d&eacute;finie dans la Constitution.

source: Mikael Pawlo's <a href="http://newsforge.com/newsforge/02/05/08/153204.shtml?tid=19">&ldquo;Software lemon law with bitter taste&rdquo;</a> explains how a &ldquo;lemon law&rdquo; for software could threaten free software development.
fr: <a href="http://newsforge.com/newsforge/02/05/08/153204.shtml?tid=19">&laquo;&nbsp;Software lemon law with bitter taste&nbsp;&raquo;</a> de Mikael Pawlo explique comment une &laquo;&nbsp;loi citron&nbsp;&raquo; pour le logiciel pourrait menacer le d&eacute;veloppement de logiciel libre.

source: <a href="http://www.baen.com/library/palaver4.htm">British historian Thomas Macaulay</a> had ideas about copyright in 1841 which still hold true today.
fr: <a href="http://www.baen.com/library/palaver4.htm">L'historien anglais Thomas Macaulay</a> avait des id&eacute;es sur le copyright en 1841 qui s'av&egrave;rent toujours vraies aujourd'hui.

source: <a href="http://www.openrevolt.org/">openrevolt.org</a> is a site devoted to providing information about the European Copyright Directive and similar legislation. It concentrates on the two principal problems of the EUCD, which make it easier for copyright holders to censor webpages on ISPs and give legal protection to copy-protection measures.
fr: <a href="http://www.openrevolt.org/">openrevolt.org</a> est un site destin&eacute; &agrave; fournir de l'information &agrave; propos de la Directive europ&eacute;enne sur le droit d'auteur et des lois similaires. Elle se concentre sur les deux principaux probl&egrave;mes de l'EUCD, qui rendent plus facile la censure des pages web chez les FAI pour les d&eacute;tenteurs de copyright et donnent une protection juridique aux mesures de protection contre la copie.

source: <a href="http://www.chillingeffects.org">Chilling Effects</a> is a collection point for cease and desist notices concerning online activity &mdash; we invite visitors to enter C&amp;Ds they have received or sent. The website collects the C&amp;Ds in a searchable database and hyperlinks them to explanations of the legal issues.
fr: <a href="http://www.chillingeffects.org">Chilling Effects</a> est un lieu de collection pour les ordonnances de cessation et d'abstention concernant l'activit&eacute; en ligne &mdash;&nbsp;nous invitons les visiteurs &agrave; y mettre les ordonnances de cessation et d'abstention qu'ils ont re&ccedil;ues ou envoy&eacute;es. Le site web rassemble les ordonnances de cessation et d'abstention dans une base de donn&eacute;es et les relie par des hyperliens aux explications sur les probl&egrave;mes juridiques qu'elles soul&egrave;vent.

source: <a href="http://web.archive.org/web/20020222080928/www.byte.com/documents/s=2302/byt1011380870846/"> Coding is a Crime</a>, by Shannon Cochran, is a commentary on the indictment of Jon Johansen on felony charges for helping write DeCSS.
fr: <a href="http://web.archive.org/web/20020222080928/www.byte.com/documents/s=2302/byt1011380870846/">Coder est une délit</a>, par Shannon Cochran, est un commentaire sur l'inculpation criminelle de Jon Johansen pour avoir aid&eacute; &agrave; &eacute;crire DeCSS.

source: <a href="http://james-boyle.com/papers.pdf">The Second Enclosure Movement and the Construction of the Public Domain.</a>, by James Boyle.
fr: <a href="http://james-boyle.com/papers.pdf">The Second Enclosure Movement and the Construction of the Public Domain.</a>, par James Boyle.

source: <a href="http://www.gseis.ucla.edu/~howard/Papers/pw-public-spaces.html">Intellectual Property: The Attack on Public Space in Cyberspace</a>, by Howard Besser, describes how various industries are using their leverage with copyright to make fewer locations on the Internet less and less public.
fr: <a href="http://www.gseis.ucla.edu/~howard/Papers/pw-public-spaces.html">Propriété intellectuelle&nbsp;: L'attaque de l'espace public dans le cyberspace</a>, par Howard Besser, d&eacute;crit comment diff&eacute;rentes industries utilisent leur influence par le biais du copyright pour rendre des portions plus &eacute;troites de l'Internet de moins en moins publiques.

source: <a href="http://papers.ssrn.com/sol3/papers.cfm?abstract_id=267848#PaperDownload">&ldquo;Locating Copyright Within the First Amendment Skein,&rdquo;</a>, by Neil W. Netanel, argues that the United States court system has been wrong in its dated assumption that fair use eliminates the conflict between copyright law and the First Amendment.
fr: <a href="http://papers.ssrn.com/sol3/papers.cfm?abstract_id=267848#PaperDownload">&laquo;&nbsp;Rechercher le copyright dans le Premier amendement Skein&nbsp;&raquo;</a>, par Neil W. Netanel, dit que le syst&egrave;me l&eacute;gal des &Eacute;tats-Unis a fait une erreur dans son hypoth&egrave;se vieillote que &laquo;&nbsp;l'usage raisonnable&nbsp;&raquo; &eacute;limine le conflit entre la loi sur le droit d'auteur et le Premier amendement.

source: Richard Stallman co-signed <a href="http://www.perens.com/Articles/StandTogether.html">a joint statement responding to comments by Craig Mundie of Microsoft</a>.
fr: Richard Stallman a co-sign&eacute; <a href="http://www.perens.com/Articles/StandTogether.html">une d&eacute;claration conjointe en r&eacute;ponse aux commentaires de Craig Mundie de Microsoft</a>.

source: In <cite><a href="/philosophy/dmarti-patent.html">Patent Reform Now!</a></cite>, Don Marti calls for free software supporters to nominate Richard M. Stallman to US Patent and Trademark Office's Patent Public Advisory Committee.
fr: Dans <cite><a href="/philosophy/dmarti-patent.fr.html">Réformer les brevets logiciels maintenant&nbsp;!</a></cite>, Don Marti appelle les partisans du logiciel libre &agrave; nommer Richard M. Stallman au Patent Public Advisory Committee de l'Office am&eacute;ricain des brevets et des marques (USPTO).

source: <a href="/philosophy/stophr3028.html">Stop H.R. 3028</a>, &ldquo;The Trademark Cyberpiracy Prevention Act of 1999&rdquo;.
fr: <a href="/philosophy/stophr3028.fr.html">Stoppez H.R. 3028</a>, «&nbsp;La loi sur la prévention du cyberpiratage des marques déposées de 1999&nbsp;».

source: <a href="http://www.brunching.com/features/feature-copyfire.html">Copyrighting fire</a>
fr: <a href="http://www.brunching.com/features/feature-copyfire.html">Mettre le feu sous Copyright</a>

source: <a href="http://simson.net/clips/98.Globe.05-07.Read_them_and_weep.htm">Read Them And Weep</a>, by Simson Garfinkel, talks about the pending bills that would give information owners sweeping new powers, and restrict the activities of users.
fr: <a href="http://simson.net/clips/98.Globe.05-07.Read_them_and_weep.htm">Lisez-les et pleurez</a>, par Simson Garfinkel, discussions &agrave; propos de projets de loi qui donneraient aux propri&eacute;taires de l'information de nouveaux pouvoirs extraordinaires, et restreindraient les activit&eacute;s des utilisateurs.

source: <a href="/philosophy/nonsoftware-copyleft.html">Applying Copyleft To Non-Software Information</a>, by Michael Stutz.
fr: <a href="/philosophy/nonsoftware-copyleft.fr.html">Appliquer le Copyleft &agrave; de l'information de type non logiciel</a>, par Michael Stutz.

source: <a href="free-world.html">Only the Free World Can Stand Up to Microsoft</a>, by Tom Hull.
fr: <a href="philosophy/free-world.fr.html">Seul le monde libre peut r&eacute;sister &agrave; Microsoft</a>, par Tom Hull.

source: <a href="http://www.ram.org/ramblings/philosophy/fmp.html">The Free Music Philosophy</a>, by Ram Samudrala.
fr: <a href="http://www.ram.org/ramblings/philosophy/fmp.html">La philosophie de la musique libre</a>, par Ram Samudrala.

source: Record companies argue for more copyright power by saying they are the support of the musicians. <a href="http://www.negativland.com/albini.html">This article</a> shows how record companies really treat musicians.
fr: L'industrie du disque demande plus de pouvoir de copyright arguant du fait qu'elle est le soutien des musiciens. <a href="http://www.negativland.com/albini.html">Cet article</a> montre comment les maisons de disque traitent les musiciens en r&eacute;alit&eacute;.

source: <a href="http://www.ram.org/ramblings/philosophy/fmp/copying_primer.html">A primer on the ethics of &ldquo;Intellectual property&rdquo;</a>, by Ram Samudrala.
fr: <a href="http://www.ram.org/ramblings/philosophy/fmp/copying_primer.html">Une introduction &agrave; l'&eacute;thique de la &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;</a>, par Ram Samudrala.

source: <a href="/philosophy/self-interest.html">Is Self-Interest Sufficient to Organize an Free Economy?</a> by Loyd Fueston.
fr: <a href="/philosophy/self-interest.fr.html">L'int&eacute;r&ecirc;t personnel est-il suffisant pour organiser une &eacute;conomie libre&nbsp;?</a> par Loyd Fueston.

source: <a href="/philosophy/kragen-software.html">People, places, things and ideas</a> by Kragen Sitaker
fr: <a href="/philosophy/kragen-software.fr.html">Gens, endroits, choses et id&eacute;es</a> par Kragen Sitaker
