Repository: gitGNU/gnu_www-fr
Catalog: philosophy/third-party-ideas.*.po
Languages: fr

source: <a href="http://gsyc.escet.urjc.es/sobre/">Articles in Spanish about free software issues</a>
fr: <a href="http://gsyc.escet.urjc.es/sobre/">Articles en espagnol &agrave; propos des probl&egrave;mes du logiciel libre</a>

source: <a href="http://old.law.columbia.edu/my_pubs/anarchism.html">Anarchism Triumphant: Free Software and the Death of Copyright</a>
fr: <a href="http://old.law.columbia.edu/my_pubs/anarchism.html">L'anarchisme triomphant&nbsp;: Le logiciel libre et la mort du copyright</a>

source: <a href="http://people.coe.ilstu.edu/rpriegle/wwwdocs/plagiari.htm">The Death and Rebirth of Plagiarism</a> by Rodney Riegle. (We don't entirely agree with this article&mdash;we think there is no harm in asking people to make some extra effort to write &ldquo;footnotes&rdquo; to give credit.)
fr: <a href="http://www.coe.ilstu.edu/rpriegle/wwwdocs/plagiari.htm">La mort et la renaissance du plagiat</a> par Rodney Riegle. (Nous ne sommes pas compl&egrave;tement d'accord avec cet article &mdash;&nbsp;nous pensons qu'il n'y a pas de mal &agrave; demander aux gens de faire un effort suppl&eacute;mentaire pour &eacute;crire les &laquo;&nbsp;notes de bas de page&nbsp;&raquo; pour remercier).

source: <a href="/philosophy/economics_frank/frank.html">Does Studying Economics Inhibit Cooperation?</a> by Frank, Gilovich, and Regan.
fr: <a href="/philosophy/economics_frank/frank.html">Le fait d'&eacute;tudier l'&eacute;conomie inhibe-t-il la coop&eacute;ration ?</a> par Frank, Gilovich, et Regan.

source: <a href="http://danny.oz.au/freedom/ip/aidfs.html">Development, Ethical Trading, and Free Software</a> by Danny Yee.
fr: <a href="http://danny.oz.au/freedom/ip/aidfs.html">D&eacute;veloppement, commerce &eacute;thique, et Logiciel Libre</a> par Danny Yee.

source: <a href="/philosophy/bdk.html">THE BALLAD OF DENNIS KARJALA</a>: A political comment in the form of a broadside ballad by Timothy R. Phillips.
fr: <a href="/philosophy/bdk.fr.html">LA BALLADE DE DENNIS KARJALA</a>&nbsp;: Un commentaire politique sous la forme d'une ballade virulente par Timothy R. Phillips.

source: <a href="/philosophy/ICT-for-prosperity.html">Shaping Collaborative ICT Development and Initiatives for Global Prosperity</a> by Robert J. Chassell
fr: <a href="/philosophy/ICT-for-prosperity.fr.html">Modeler le d&eacute;veloppement collaboratif des TIC et des initiatives pour une prosp&eacute;rit&eacute; globale</a> par Robert J. Chassell

source: <a href="http://www.ic.unicamp.br/~oliva/papers/free-software/selection-html/"> Competitive Advantages of Free Software</a> by Alexandre Oliva.
fr: <a href="http://www.ic.unicamp.br/~oliva/papers/free-software/selection-html/">L'avantage comp&eacute;titif des logiciels libres</a> par Alexandre Oliva.

source: <a href="http://www.advogato.org/article/89.html" id="PatentgrantundertheGPL">Patent grant under the GPL</a>.
fr: <a href="http://www.advogato.org/article/89.html" id="PatentgrantundertheGPL">D&eacute;livrance de brevet sous la GPL</a>.

source: <a href="http://www.nytimes.com/library/tech/00/05/biztech/articles/10digital.html" id="ConceptofCopyrightFightsMarkoff">The Concept of Copyright Fights for Internet Survival</a> by John Markoff.
fr: <a href="http://www.nytimes.com/library/tech/00/05/biztech/articles/10digital.html" id="ConceptofCopyrightFightsMarkoff">Le concept de combats contre le copyright pour la survie de l'Internet</a> par John Markoff.

source: <a id="TheRealPurposeOfCopyrightBerry" href="http://www.libraryjournal.com/article/CA158872.html">The Real Purpose of Copyright</a> by John N. Berry III.
fr: <a id="TheRealPurposeOfCopyrightBerry" href="http://www.libraryjournal.com/article/CA158872.html">L'objectif r&eacute;el du copyright</a> par John N. Berry III.

source: <a id="Copyrightfire" href="/philosophy/fire.html">Copyrighting Fire! (Humor)</a> by Ian Clarke.
fr: <a id="Copyrightfire" href="/philosophy/fire.fr.html">Mettre le feu sous Copyright! (Humour)</a> par Ian Clarke.

source: <a href="http://www.praxagora.com/andyo/professional/infirmation_technology.html" id="INFOTECH">The Future Brings &ldquo;Infirmation Technology&rdquo;</a> by Andy Oram.
fr: <a href="http://www.praxagora.com/andyo/professional/infirmation_technology.html" id="INFOTECH">Le futur apporte la &laquo;&nbsp;Technologie de l'Infirmation&nbsp;&raquo;</a> par Andy Oram (le titre est un jeu de mot sur &laquo;&nbsp;infirme&nbsp;&raquo; et &laquo;&nbsp;information&nbsp;&raquo;).

source: <a href="http://www.freeprotocols.org/">The Free Protocols Foundation</a> is an independent public forum, dedicated to the support of patent-free protocols.
fr: <a href="http://www.freeprotocols.org/">La Fondation des protocoles libres</a> est un forum public ind&eacute;pendant, d&eacute;di&eacute; au soutien aux protocoles libres de tout brevet.

source: <a href="/philosophy/software-libre-commercial-viability.html">Software Libre and Commercial Viability</a> by Alessandro Rubini
fr: <a href="/philosophy/software-libre-commercial-viability.fr.html">Logiciel libre et viabilité commerciale</a> par Alessandro Rubini

source: <a href="http://www.uow.edu.au/arts/sts/bmartin/pubs/98il/"> Information liberation</a> by Brian Martin. We urge people to avoid using the term <a href="/philosophy/words-to-avoid.html">intellectual property</a> and to instead speak about copyrights, patents, and/or trademarks.
fr: <a href="http://www.uow.edu.au/arts/sts/bmartin/pubs/98il/">Information liberation</a> par Brian Martin. Nous insistons pour qu'on &eacute;vite d'utiliser le terme <a href="/philosophy/words-to-avoid.fr.html">propri&eacute;t&eacute; intellectuelle</a> et invitons &agrave; parler &agrave; la place de copyrights, brevets, et/ou de marques.

source: <a href="http://wearcam.org/seatsale/index.htm">Seat Sale</a>, a satire about copyright.
fr: <a href="http://wearcam.org/seatsale/index.htm">Seat Sale</a>, une satire &agrave; propos du copyright.

source: A <a href="http://www.cs.cmu.edu/~dst/DeCSS/Gallery/">gallery</a> of examples demonstrating how outrageous and absurd the Digital Millenium Copyright Act is.
fr: Une <a href="http://www.cs.cmu.edu/~dst/DeCSS/Gallery/">galerie</a> d'exemples d&eacute;montrant combien le Digital Millenium Copyright Act (Loi sur le droit d'auteur du millénaire numérique) est scandaleux et absurde.

source: A book review of <a href="http://slashdot.org/article.pl?sid=01/03/28/0121209&amp;mode=nocomment"> <cite>Digital Copyright</cite></a>.
fr: Une critique du livre <a href="http://slashdot.org/article.pl?sid=01/03/28/0121209&amp;mode=nocomment"><cite>Digital Copyright</cite></a>.

source: <a href="http://www.itworld.com/AppDev/350/LWD010523vcontrol4/">Live and let license</a> by Joe Barr.
fr: <a href="http://www.itworld.com/AppDev/350/LWD010523vcontrol4/">Live and let license</a> par Joe Barr.

source: <a href="http://www.piecepack.org">Piecepack</a> is a set of boardgame pieces which everyone is free to use in creating or playing various types of games.
fr: <a href="http://www.piecepack.org">Piecepack</a> est un jeu de pi&egrave;ces de jeu de plateau que chacun est libre d'utiliser pour cr&eacute;er ou jouer &agrave; diff&eacute;rents types de jeux.

source: Eastern Gianozia has put together a <a href="http://www.gianoziaorientale.org/info/foreign_politics.html">tongue-in-cheek look at Software Patents and DRM</a>.
fr: La Gianozia orientale a port&eacute; <a href="http://www.gianoziaorientale.org/info/foreign_politics.html">un regard ironique sur les brevets logiciels et &agrave; la gestion des droits num&eacute;riques(DRM)</a>.

source: <a href="http://revistes.upc.es/~topopardo/weblog/archives/000036.html">Here</a> is an interesting allegory (in Spanish) comparing Free Software to a dining experience.
fr: <a href="http://revistes.upc.es/~topopardo/weblog/archives/000036.html">Une int&eacute;ressante all&eacute;gorie</a> (en espagnol) comparant le logiciel libre &agrave; un d&icirc;ner.

source: <a href="http://www.linuxjournal.com/article/7813">Free Software and Scouting</a>
fr: <a href="http://www.linuxjournal.com/article/7813">Logiciels libres et scoutisme</a>

source: <a href="http://fare.tunes.org/articles/patents.html">Patents Are An Economic Absurdity</a>: This article adopts as a premise the popular view that free trade is desirable. We don't always agree - beyond a certain point, free trade gives businesses too much power, allowing them to intimidate democracy. But that is a different matter.
fr: <a href="http://fare.tunes.org/articles/patents.html">Patents Are An Economic Absurdity (Les brevets sont une absurdit&eacute; &eacute;conomique)</a>&nbsp;: Cet article adopte comme pr&eacute;misse la conception populaire que le libre &eacute;change est souhaitable. Nous ne sommes pas toujours d'accord - au-del&agrave; d'un certain point, le libre &eacute;change donne aux entreprises beaucoup trop de pouvoir, leur permettant d'intimider la d&eacute;mocratie. Mais ceci est une autre histoire.

source: <a href="http://www.lewrockwell.com/orig/kinsella2.html">In Defense of Napster and Against the Second Homesteading Rule</a>
fr: <a href="http://www.lewrockwell.com/orig/kinsella2.html">Pour la d&eacute;fense de Napster et contre la Second Homesteading Rule (la deuxi&egrave;me Loi sur la concession statutaire).</a>

source: <a href="http://www.mises.org/journals/jls/15_2/15_2_1.pdf">Against Intellectual Property</a>, Spring 2001, Journal of Libertarian Studies (PDF)
fr: <a href="http://www.mises.org/journals/jls/15_2/15_2_1.pdf">Against Intellectual Property (Contre la propri&eacute;t&eacute; intellectuelle)</a>, printemps 2001, Journal of Libertarian Studies (PDF

source: <a href="http://www.sci.brooklyn.cuny.edu/~sdexter/copyleft_ethics.html">A Comparative Ethical Assessment of Free Software Licensing Schemes</a> by Samir Chopra and Scott Dexter
fr: <a href="http://www.sci.brooklyn.cuny.edu/~sdexter/copyleft_ethics.html">A Comparative Ethical Assessment of Free Software Licensing Schemes</a> (Une &eacute;valuation &eacute;thique comparative des combinaisons de licences de logiciels libres) par S.Chopra et S. Dexter.

source: The <a href="http://www.simplemachines.it/simone.html">SIM.ONE hardware project</a> has created free (as in freedom) computer design specifications.
fr: Le <a href="http://www.simplemachines.it/simone.html">projet de mat&eacute;riel SIM.ONE</a> a cr&eacute;&eacute; des sp&eacute;cifications de conception d'ordinateur libres (libre comme dans libert&eacute;).

source: Not available online, but as early as 1960 Bernard Galler wrote a letter to the editor of the Communications of the ACM (vol.3, no.4, pp.A12-A13), saying in part (mentioning price, but clearly implying freedom):
fr: Non disponible en ligne, mais en 1960, Bernard Galler a &eacute;crit une lettre &agrave; l'&eacute;diteur de Communications de l'ACM (vol.3, no.4, pp.A12-A13), disant en partie (en mentionnant le prix, mais impliquant clairement la libert&eacute;)&nbsp;:

source: &hellip; it is clear that what is being charged for is the development of the program, and while I am particularly unhappy that it comes from a university, I believe it is damaging to the whole profession. There isn't a 704 installation that hasn't directly benefited from the free exchange of programs made possible by the distribution facilities of SHARE. If we start to sell our programs, this will set very undesirable precedents.
fr: &hellip; il est clair que ce qui est factur&eacute; pour le d&eacute;veloppement du programme, et alors que je suis particuli&egrave;rement m&eacute;content que cela provienne d'une universit&eacute;, je pense que c'est dommageable pour l'ensemble de la profession. Il n'y a pas une installation 704 qui n'ait pas directement b&eacute;n&eacute;fici&eacute; du libre &eacute;change des programmes rendu possible par les commodit&eacute;s de distribution de SHARE. Si nous commen&ccedil;ons &agrave; vendre nos programmes, cela cr&eacute;era des pr&eacute;c&eacute;dents tr&egrave;s f&acirc;cheux.

source: (Thanks to Nelson Beebe for the reference.)
fr: (Merci &agrave; Nelson Beebe pour la r&eacute;f&eacute;rence).

source: Links to more philosophy articles
fr: Liens vers d'autres articles

source: <a href="essays-and-articles.html">Essays and Articles</a>
fr: <a href="essays-and-articles.fr.html">Essais et articles</a>

source: <a href="speeches-and-interview.html">Speeches and interviews</a>
fr: <a href="speeches-and-interview.fr.html">Discours et entretiens</a>

source: <a href="/philosophy/">The main philosophy page</a>
fr: <a href="/philosophy/philosophy.fr.html">Page principale de la philosophie GNU</a>

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
