Repository: gitGNU/gnu_www-fr
Catalog: philosophy/trivial-patent.*.po
Languages: fr

source: The Anatomy of a Trivial Patent - GNU project - Free Software Foundation (FSF)
fr: L'anatomie d'un brevet banal - projet GNU - Free Software Foundation (FSF)

source: The Anatomy of a Trivial Patent
fr: L'anatomie d'un brevet banal

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: Programmers are well aware that many of the existing software patents cover laughably obvious ideas. Yet the patent system's defenders often argue that these ideas are nontrivial, obvious only in hindsight. And it is surprisingly difficult to defeat them in debate. Why is that?
fr: Les programmeurs sont bien conscients du fait que de nombreux brevets existants sont des idées ridiculement évidentes. Pourtant les défenseurs du système de brevet prétendent souvent que ces idées ne sont pas banales, mais évidentes seulement a posteriori. Et il est étonnamment difficile de démontrer la fausseté de ce propos dans un débat. Pourquoi cela&nbsp;?

source: One reason is that any idea can be made to look complex when analyzed to death. Another reason is that these trivial ideas often look quite complex as described in the patents themselves. The patent system's defenders can point to the complex description and say, &ldquo;How can anything this complex be obvious?&rdquo;
fr: Tout d'abord, n'importe quelle idée, analysée à l'extrême, peut paraître complexe. Mais ces idées qui relèvent du simple bon-sens, paraissent souvent complexes de par leur description dans les brevets eux-mêmes. Les défenseurs du système de brevet peuvent ainsi décrire la description comme étant complexe et demander «&nbsp;Mais comment quelque chose d'aussi complexe peut-il être évident&nbsp;?&nbsp;»

source: I will use an example to show you how. Here's claim number one from US patent number 5,963,916, applied for in October 1996:
fr: Je vais utiliser un exemple pour vous en montrer la méthode. Voici l'énoncé de l'objectif numéro un du brevet américain numéro 5.963.916 déposé en octobre 1996&nbsp;:

source: 1. A method for enabling a remote user to preview a portion of a pre-recorded music product from a network web site containing pre-selected portions of different pre-recorded music products, using a computer, a computer display and a telecommunications link between the remote user's computer and the network web site, the method comprising the steps of:
fr: 1. Une méthode pour permettre à un utilisateur distant d'écouter une partie d'un produit musical pré-enregistré, depuis un site Web sur un réseau contenant des parties pré-sélectionnées de différents produits musicaux pré-enregistrés, en utilisant un ordinateur, un périphérique d'affichage d'ordinateur, un lien de télécommunication entre l'ordinateur de l'utilisateur distant et un site Web en réseau, la méthode comprenant les étapes suivantes&nbsp;:

source: using the remote user's computer to establish a telecommunications link to the network web site wherein the network web site comprises (i) a central host server coupled to a communications network for retrieving and transmitting the pre-selected portion of the pre-recorded music product upon request by a remote user and (ii) a central storage device for storing pre-selected portions of a plurality of different pre-recorded music products;
fr: utiliser l'ordinateur de l'utilisateur distant pour établir un lien de télécommunications vers le site Web du réseau qui comprend (i) un serveur hôte central couplé à un réseau de communication pour rechercher et transmettre la partie pré-sélectionnée du produit musical pré-enregistré sur demande par un utilisateur à distance et (ii) un périphérique de stockage central pour stocker les parties pré-sélectionnées d'un ensemble de différents produits de musique pré-enregistrés&nbsp;;

source: transmitting user identification data from the remote user's computer to the central host server thereby allowing the central host server to identify and track the user's progress through the network web site;
fr: transmettre les données d'identification de l'utilisateur depuis l'ordinateur distant de l'utilisateur vers le serveur hôte central, et ce pour autoriser le serveur hôte central à identifier et à suivre le cheminement de l'utilisateur à travers le site Web du réseau&nbsp;;

source: choosing at least one pre-selected portion of the pre-recorded music products from the central host server;
fr: choisir au moins une partie pré-sélectionnée du produit musical pré-enregistré depuis le serveur hôte central.

source: receiving the chosen pre-selected portion of the pre-recorded products; and
fr: recevoir la partie pré-sélectionnée choisie du produit pré-enregistré&nbsp;; et

source: interactively previewing the received chosen pre-selected portion of the pre-recorded music product.
fr: prévisualiser interactivement la partie pré-sélectionnée choisie et reçue du produit musical pré-sélectionné.

source: That sure looks like a complex system, right? Surely it took a real clever guy to think of this? No, but it took cleverness to make it seem so complex. Let's analyze where the complexity comes from:
fr: Voilà bien un système qui semble complexe, pas vrai&nbsp;? Il a sûrement fallu un gars vraiment malin pour penser à cela&nbsp;,non? Mais il a fallu de l'habileté pour le faire paraître complexe. Analysons d'où vient cette complexité&nbsp;:

source: <i>1. A method for enabling a remote user to preview a portion of a pre-recorded music product from a network web site containing pre-selected portions</i>
fr: <i>1. Une méthode pour permettre à un utilisateur distant d'écouter une partie d'un produit musical pré-enregistré depuis un site Web réseau contenant des extraits pré-sélectionnées</i>

source: That states the principal part of their idea. They put selections from certain pieces of music on a server so a user can listen to them.
fr: Voilà énoncée la plus grande partie de leur idée. Des extraits de certains morceaux de musique sur un serveur, peuvent être écoutés par un utilisateur.

source: <i>of different pre-recorded music products,</i>
fr: <i>de produits musicaux pré-enregistrés variés,</i>

source: This emphasizes their server stores selections from more than one piece of music.
fr: Ceci souligne que leur serveur stocke des sélections de plus d'un morceau de musique.

source: It is a basic principle of computer science is that if a computer can do a thing once, it can do that thing many times, on different data each time. Many patents pretend that applying this principle to a specific case makes an &ldquo;invention&rdquo;.
fr: Un principe basique de l'informatique est que, si un ordinateur peut faire quelque chose une fois, il peut faire cette chose de nombreuses fois, chaque fois sur des données différentes. Beaucoup de brevets prétendent qu'appliquer ce principe à un cas spécifique en fait une «&nbsp;invention&nbsp;».

source: <i>using a computer, a computer display and a telecommunications link between the remote user's computer and the network web site,</i>
fr: <i>en utilisant un périphérique d'affichage d'ordinateur et un lien de télécommunication entre l'ordinateur de l'utilisateur distant et un site Web en réseau,</i>

source: This says they are using a server on a network.
fr: Ceci indique qu'ils utilisent un serveur sur un réseau.

source: <i>the method comprising the steps of: using the remote user's computer to establish a telecommunications link to the network web site</i>
fr: <i>la méthode comprenant les étapes suivantes&nbsp;: utiliser l'ordinateur de l'utilisateur distant pour établir un lien de télécommunication vers le réseau du site Web</i>

source: This says that the user connects to the server over the network. (That's the way one uses a server.)
fr: Il est dit que l'utilisateur se connecte au serveur à travers le réseau (c'est comme ça qu'on utilise un serveur).

source: <i>wherein the network web site comprises (i) a central host server coupled to a communications network</i>
fr: <i>où le réseau du site Web comprend (i) un serveur hôte central couplé à un réseau de communication</i>

source: This informs us that the server is on the net. (That is typical of servers.)
fr: Ceci nous informe qu'un serveur est sur le Net. (C'est l'utilité d'un serveur).

source: <i>for retrieving and transmitting the pre-selected portion of the pre-recorded music product upon request by a remote user</i>
fr: <i>pour rechercher et transmettre, sur demande d'un utilisateur distant, la partie pré-sélectionnée du produit musical pré-enregistré </i>

source: This repeats the general idea stated in the first two lines.
fr: Ceci reprend l'idée générale indiquée dans les deux premières lignes.

source: <i>and (ii) a central storage device for storing pre-selected portions of a plurality of different pre-recorded music products;</i>
fr: <i>et (ii) un périphérique de stockage central pour stocker des parties pré-sélectionnées d'un ensemble de différents produits de musique pré-enregistrés&nbsp;;</i>

source: They have decided to put a hard disk (or equivalent) in their computer and store the music samples on that. Ever since around 1980, this has been the normal way to store anything on a computer for rapid access.
fr: Ils ont décidé de mettre un disque dur (ou un équivalent) dans leur ordinateur et d'y stocker les extraits. Depuis ... disons 1980, c'est la manière courante de stocker des données sur un ordinateur pour y avoir accès rapidement.

source: Note how they emphasize once again the fact that they can store more than one selection on this disk. Of course, every file system will let you store more than one file.
fr: Notez comme ils soulignent à nouveau le fait qu'ils peuvent stocker plus d'une sélection sur ce disque. Naturellement, tout système de fichiers vous permettra de stocker plus d'un fichier.

source: <i>transmitting user identification data from the remote user's computer to the central host server thereby allowing the central host server to identify and track the user's progress through the network web site;</i>
fr: <i>transmettre les données d'identification de l'utilisateur depuis l'ordinateur distant de l'utilisateur vers l'application centrale permettant ainsi d'identifier et de tracer la progression de l'utilisateur sur le site Web&nbsp;;</i>

source: This says that they keep track of who you are and what you access&mdash;a common (though nasty) thing for web servers to do. I believe it was common already in 1996.
fr: Ceci explique juste qu'ils gardent une trace de votre identité et de ce à quoi vous accèdez, une tâche banale (bien que mauvaise) pour les serveurs Web. Je crois que c'était déjà d'usage courant en 1996.

source: <i>choosing at least one pre-selected portion of the pre-recorded music products from the central host server;</i>
fr: <i>choisir au moins une partie pré-sélectionnée du produit musical pré-enregistré depuis le serveur hôte central.</i>

source: In other words, the user clicks to say which link to follow. That is typical for web servers; if they had found another way to do it, that might have been an invention.
fr: En d'autres termes, l'utilisateur clique pour suivre un lien. C'est typique de l'usage d'un serveur Web&nbsp; s'ils avaient trouvé un autre moyen de le faire, ça pourrait être une invention.

source: <i>receiving the chosen pre-selected portion of the pre-recorded products; and</i>
fr: <i>recevoir la partie pré-sélectionnée choisie du produit pré-enregistré&nbsp;; et</i>

source: When you follow a link, your browser reads the contents. This is typical behavior for a web browser.
fr: Quand vous suivez un lien, votre navigateur lit le contenu. C'est un comportement typique pour un navigateur Web.

source: <i>interactively previewing the received chosen pre-selected portion of the pre-recorded music product.</i>
fr: <i>prévisualiser interactivement la partie pré-sélectionnée choisie et reçue du produit musical pré-enregistré</i>

source: This says that your browser plays the music for you. (That is what many browsers do, when you follow a link to an audio file.)
fr: Ceci dit que votre navigateur joue l'extrait pour vous. (C'est ce que beaucoup de navigateurs font, lorsque vous suivez un lien vers un fichier audio).

source: Now you see how they padded this claim to make it into a complex idea: they combined their own idea (stated in two lines of text) with important aspects of what computers, networks, web servers, and web browsers do. This adds up to the so-called invention for which they received the patent.
fr: Maintenant vous pouvez voir comment ils ont enrobé cette demande pour en faire une idée complexe&nbsp;: ils ont inclus dans leur propre idée, expliquée en deux lignes, des aspects importants de ce que les ordinateurs, les réseaux, les serveurs Web et les navigateurs Web font. Cette complexité, plutôt que les deux lignes qui décrivent leur propre idée, étend la prétendue «&nbsp;invention&nbsp;» pour laquelle ils ont reçu un brevet.

source: This example is typical of software patents. Even the occasional patent whose idea is nontrivial has the same sort of added complication.
fr: Cet exemple est typique des brevets logiciels. Même les quelques brevets dont l'idée n'est pas banale utilisent le même genre de complications ajoutées.

source: Now look at a subsequent claim:
fr: Regardez maintenant la revendication suivante&nbsp;:

source: <i>3. The method of [149]claim 1 wherein the central memory device comprises a plurality of compact disc-read only memory (CD-ROMs).</i>
fr: <i>3. La méthode de la revendication [149] 1 dans laquelle le périphérique central de mémoire comporte une pluralité de <acronym title="Compact Disc - Read Only Memory">CD-ROM</acronym>.</i>

source: What they are saying here is, &ldquo;Even if you don't think that claim 1 is really an invention, using CD-ROMs to store the data makes it an invention for sure. An average system designer would never have thought of storing data on a CD.&rdquo;
fr: Ce qui est dit là est que, «&nbsp;même si vous ne pensez pas que la revendication 1 est une invention, utiliser des CD-ROM pour stocker des données en fait une invention de façon incontestable. Un concepteur de système moyen n'aurait jamais pensé à cela.&nbsp;»

source: Now look at the next claim:
fr: Maintenant regardez la revendication suivante&nbsp;:

source: <i>4. The method of [150]claim 1 wherein the central memory device comprises a RAID array drive.</i>
fr: <i>4. La méthode de la revendication [150] 1 dans laquelle le périphérique central de stockage de mémoire comprend une matrice de disque <acronym title="Redundant Array of Inexpensive Disks">RAID</acronym>.</i>

source: A RAID array is a group of disks set up to work like one big disk, with the special feature that, even if one of the disks in the array has a failure and stops working, all the data are still available on the other disks in the group. Such arrays have been commercially available since long before 1996, and are a standard way of storing data for high availability. But these brilliant inventors have patented the use of a RAID array for this particular purpose.
fr: Une matrice <acronym title="Redundant Array of Inexpensive Disks">RAID</acronym> est un groupe de disques durs configurés pour fonctionner comme un seul gros disque, avec la fonctionnalité spéciale suivante&nbsp;: même lorsque l'un des disques de cette matrice contient une erreur et arrête de fonctionner, toutes les données sont toujours accessibles sur les autres disques du groupe. De telles matrices on été disponibles dans le commerce depuis bien avant 1996, et sont un moyen standard de stocker des données pour une haute disponibilité. Mais ces brillants inventeurs ont breveté l'utilisation d'une matrice RAID pour cet usage particulier.

source: Trivial as it is, this patent would not necessarily be found legally invalid if there is a lawsuit about it. Not only the US Patent Office but the courts as well tend to apply a very low standard when judging whether a patent is &ldquo;unobvious&rdquo;. This patent might pass muster, according to them.
fr: Banal comme il est, ce brevet ne serait pas nécessairement considéré comme légalement invalide s'il y avait une poursuite judiciaire à son propos. Non seulement le bureau des brevets américain, mais également les cours de justice, tendent à appliquer une norme très basse lorsque l'on juge si un brevet est «&nbsp;non-évident&nbsp;». Ce brevet pourrait être validé par l'inspection (ndt&nbsp;: traduit de «&nbsp;This patent might <a href="http://en.wikipedia.org/wiki/Muster">pass muster&nbsp;»</a> qui est une <a href="http://fr.wikipedia.org/wiki/Idiotisme">stupidité</a>),selon eux.

source: What's more, the courts are reluctant to overrule the Patent Office, so there is a better chance of getting a patent overturned if you can show a court prior art that the Patent Office did not consider. If the courts are willing to entertain a higher standard in judging unobviousness, it helps to save the prior art for them. Thus, the proposals to &ldquo;make the system work better&rdquo; by providing the Patent Office with a better database of prior art could instead make things worse.
fr: Qui plus est, les cours sont peu disposées à aller à l'encontre d'une décision du bureau des brevets, il y a donc d'avantage de chance d'obtenir une annulation de brevet en exposant la jurisprudence d'un cas de brevet de même type jugé invalide par le bureau des brevets. Si les cours sont disposées à évoluer à un niveau plus élevé en rendant des jugements de non-évidence, il devient utile et nécessaire de les aider en archivant cette jurisprudence à leur usage. En conséquences, les propositions pour «&nbsp;mieux faire fonctionner le système&nbsp;» en fournissant au bureau des brevets une meilleure base de données de jurisprudence pourraient, en fait, rendre les choses encore plus mauvaises.

source: It is very hard to make a patent system behave reasonably; it is a complex bureaucracy and tends to follow its structural imperatives regardless of what it is &ldquo;supposed&rdquo; to do. The only practical way to get rid of the many obvious patents on software features and business practices is to get rid of all patents in those fields. Fortunately, that would be no loss: the unobvious patents in the software field do no good either. What software patents do is put software developers and users under threat.
fr: Il est vraiment difficile de rendre raisonnable le comportement d'un système de brevet &nbsp;; c'est une bureaucratie complexe qui tend à suivre ses impératifs structurels indépendamment de ce qu'elle est «&nbsp;supposée&nbsp;» faire. La seule manière pratique de se débarrasser des nombreux brevets évidents sur des fonctionnalitées logicielles et des procédures de gestion est l'annulation de tous les brevets dans ces domaines. Par chance, ce serait sans perte&nbsp;: car les brevets non-évidents dans le domaine du logiciel ne font aucun bien non plus. Les brevets logiciels mettent en danger les développeurs et utilisateurs de logiciels.

source: The patent system is supposed, intended, to promote progress, and those who benefit from software patents ask us to believe without question that they do have that effect. But programmers' experience shows otherwise. New theoretical analysis shows that this is no paradox. (See <a href="http://www.researchoninnovation.org/patent.pdf"> http://www.researchoninnovation.org/patent.pdf</a>.) There is no reason why society should expose software developers and users to the danger of software patents.
fr: Le système de brevet est supposé conçu pour favoriser le progrès, et ceux qui tirent bénéfice des brevets logiciels nous demandent de croire, sans nous poser de question, qu'il a vraiment cet effet. Mais l'expérience des programmeurs est toute autre. Une nouvelle analyse théorique prouve que ce n'est aucunement paradoxal. (Voir <a href="http://www.researchoninnovation.org/patent.pdf">http://www.researchoninnovation.org/patent.pdf</a>[en]). Il n'y a aucune raison pour que la société expose les développeurs et utilisateurs de logiciels aux dangers des brevets sur ces derniers.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: Merci d'envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Signalez les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.<br />Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour avoir des informations sur la coordination et la soumission des traductions de cet article.

source: Copyright &copy; 2006 Richard Stallman<br /> Verbatim copying and distribution of this entire article are permitted in any medium provided this notice is preserved.
fr: Copyright &copy; 2006 Richard Stallman<br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Mathieu Stumpf.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
