Repository: gitGNU/gnu_www-fr
Catalog: philosophy/ucita.*.po
Languages: fr

source: Why We Must Fight UCITA - GNU Project - Free Software Foundation (FSF)
fr: Pourquoi nous devons contrer l'UCITA - GNU Project - Free Software Foundation (FSF)

source: Why We Must Fight UCITA
fr: Pourquoi nous devons contrer l'UCITA

source: UCITA is a proposed law, designed by the proprietary software developers, who are now asking all 50 states of the US to adopt it. If UCITA is adopted, it will threaten the free software community <a href="#Note1">(1)</a> with disaster. To understand why, please read on.
fr: L'<acronym title="Uniform Computer Information Transactions Act">UCITA</acronym> est une loi propos&eacute;e et con&ccedil;ue par les d&eacute;veloppeurs de logiciel propri&eacute;taire qui demandent maintenant aux 50 &eacute;tats des &Eacute;tats-Unis de l'adopter. Si elle l'&eacute;tait, cela serait une menace d&eacute;sastreuse &agrave; l'encontre de la communaut&eacute; du logiciel libre <a href="#Note1">(1)</a>. Pour comprendre pourquoi, veuillez lire ce qui suit.

source: We generally believe that big companies ought to be held to a strict standard of liability to their customers, because they can afford it and because it will keep them honest. On the other hand, individuals, amateurs, and good samaritans should be treated more favorably.
fr: On peut penser en g&eacute;n&eacute;ral que les grosses soci&eacute;t&eacute;s sont li&eacute;es par une formule stricte d'engagement envers leurs clients, parce qu'elles en ont la capacit&eacute; et qu'elles en seraient d'autant plus honn&ecirc;tes. Et d'autre part que les particuliers, les amateurs et les bons samaritains seraient trait&eacute;s avec plus deconsid&eacute;ration.

source: UCITA does exactly the opposite. It makes individuals, amateurs, and good samaritans liable, but not big companies.
fr: L'UCITA va exactement &agrave; l'encontre. Il suppose un engagement de la part des particuliers, des amateurs et des bons samaritains, mais pas de ces grosses soci&eacute;t&eacute;s.

source: You see, UCITA says that by default a software developer or distributor is completely liable for flaws in a program; but it also allows a shrink-wrap license to override the default. Sophisticated software companies that make proprietary software will use shrink-wrap licenses to avoid liability entirely. But amateurs, and self-employed contractors who develop software for others, will be often be shafted because they didn't know about this problem. And we free software developers won't have any reliable way to avoid the problem.
fr: Par exemple, l'UCITA indique qu'un d&eacute;veloppeur ou qu'un distributeur est par d&eacute;faut compl&egrave;tement responsable pour les d&eacute;fauts d'un programme&nbsp;; mais elle l&eacute;galise l'usage controvers&eacute; jusqu'ici d'une licence imprim&eacute;e sur l'enveloppe du logiciel qui est consid&eacute;r&eacute; accept&eacute;e &agrave; l'ouverture du paquet&nbsp;; cette licence, plus g&eacute;n&eacute;rale, pr&eacute;vaudrait sur la licence originale. Les &eacute;diteurs de logiciel propri&eacute;taire vont employer ces licences afin d'&eacute;viter tout engagement. Mais les amateurs et les contractants autonomes (ind&eacute;pendants) qui d&eacute;veloppent des logiciels pour d'autres seront souvent l&eacute;s&eacute;s par l'ignorance de ce probl&egrave;me. Et nous, d&eacute;veloppeurs de logiciel libre, n'auront non plus aucun moyen fiable pour l'&eacute;viter.

source: What could we do about this? We could try to change our licenses to avoid it. But since we don't use shrink-wrap licenses, we cannot override the UCITA default. Perhaps we can prohibit distribution in the states that adopt UCITA. That might solve the problem&mdash;for the software we release in the future. But we can't do this retroactively for software we have already released. Those versions are already available, people are already licensed to distribute them in these states&mdash;and when they do so, under UCITA, they would make us liable. We are powerless to change this situation by changing our licenses now; we will have to make complex legal arguments that may or may not work.
fr: Qu'est-ce que nous pouvons faire&nbsp;? Nous pourrions essayer d'adapter nos licences, mais puisque nous n'employons pas de licence d'enveloppe, nous ne pourrions contourner l'UCITA. Peut-&ecirc;tre pourrions-nous interdire la distribution de nos logiciels dans les &eacute;tats qui adoptent l'UCITA. Cela pourrait r&eacute;soudre le probl&egrave;me (pour les logiciels que nous publierons dans le futur). Mais nous ne pouvons faire &ccedil;a avec ceux que nous avons d&eacute;j&agrave; publi&eacute;s. Ces versions sont d&eacute;j&agrave; disponibles, les gens ont d&eacute;j&agrave; re&ccedil;u la permission de les distribuer dans ces &eacute;tats (et quand ils le font, sous l'UCITA, ils nous mettent sous engagement). Nous serions impuissants devant cette situation en changeant nos licences maintenant&nbsp;; nous aurons &agrave; d&eacute;fendre des arguments l&eacute;gaux complexes qui peuvent marcher ou bien &eacute;chouer.

source: UCITA has another indirect consequence that would hamstring free software development in the long term&mdash;it gives proprietary software developers the power to prohibit reverse engineering. This would make it easy for them to establish secret file formats and protocols, which there would be no lawful way for us to figure out.
fr: L'UCITA pr&eacute;sente un autre inconv&eacute;nient indirect contre le d&eacute;veloppement de logiciel libre &agrave; long terme (elle donne aux d&eacute;veloppeurs de logiciel propri&eacute;taire la possibilit&eacute; d'interdire l'analyse des algorithmes et des formats de donn&eacute;es). Cela leur faciliterait la cr&eacute;ation de protocoles et de formats de fichier secrets que nous ne pourrions reconstituer de mani&egrave;re l&eacute;gale.

source: That could be a disastrous obstacle for development of free software that can serve users' practical needs, because communicating with users of non-free software is one of those needs. Many users today feel that they must run Windows, simply so they can read and write files in Word format. Microsoft's &ldquo;Halloween documents&rdquo; announced a plan to use secret formats and protocols as a weapon to obstruct the development of the GNU/Linux system <a href="#Note2">(2)</a>.
fr: Cela serait un obstable d&eacute;sastreux pour le d&eacute;veloppement de liberticiels qui peuvent combler les besoins pratiques des utilisateurs, car la possibilit&eacute; d'&eacute;changer des informations fait partie de ces besoins. Beaucoup d'usagers aujourd'hui pensent qu'ils doivent employer Windows, simplement pour pouvoir lire et &eacute;crire des documents en format Word. Le &laquo;Document de l'Halloween&raquo; de Microsoft annon&ccedil;ait un plan d'utilisation de formats et de protocoles secrets comme une arme pour obstruer le d&eacute;veloppement de GNU/Linux <a href="#Note2">(2)</a>.

source: Precisely this kind of restriction is now being used in Norway to prosecute 16-year-old Jon Johansen, who figured out the format of DVDs to make it possible to write free software to play them on free operating systems. (The Electronic Frontier Foundation is helping with his defense; see <a href="http://www.eff.org/">http://www.eff.org</a> for further information.)
fr: C'est pr&eacute;cis&eacute;ment ce type de restriction qui est employ&eacute;e en ce moment en Norv&egrave;ge pour pers&eacute;cuter Jon Johansen, &acirc;g&eacute; de 16 ans, qui a pu d&eacute;terminer le format des DVDs dans le but d'&eacute;crire des logiciels libres pour les visionner sur les syst&egrave;mes d'exploitation libres. (L'Electronic Frontier Foundation prend en charge sa d&eacute;fense&nbsp;; cf <a href="http://www.eff.org/">http://www.eff.org</a> pour plus d'information).

source: Some friends of free software have argued that UCITA would benefit our community, by making non-free software intolerably restrictive, and thus driving users to us. Realistically speaking, this is unlikely, because it assumes that proprietary software developers will act against their own interests. They may be greedy and ruthless, but they are not stupid.
fr: Certains amis du logiciel libre ont pr&eacute;tendu que notre communaut&eacute; pourrait b&eacute;n&eacute;ficier de l'UCITA en rendant insoutenables les restrictions impos&eacute;es par les logiciels propri&eacute;taires, dirigeant leurs utilisateurs vers nous. D'un point de vue r&eacute;aliste, c'est peu probable, car cela pr&eacute;supposerait que les d&eacute;veloppeurs de logiciel propri&eacute;taire agiraient contre leurs propres int&eacute;r&ecirc;ts. Ils peuvent &ecirc;tre goinfres et sans piti&eacute; mais ils ne sont pas idiots pour autant.

source: Proprietary software developers intend to use the additional power UCITA would give them to increase their profits. Rather than using this power at full throttle all the time, they will make an effort to find the most profitable way to use it. Those applications of UCITA power that make users stop buying will be abandoned; those that most users tolerate will become the norm. UCITA will not help us.
fr: Les d&eacute;veloppeurs de logiciel propri&eacute;taire ont l'intention d'utiliser le pouvoir suppl&eacute;mentaire que l'UCITA leur procure afin d'augmenter leurs profits. Plut&ocirc;t que d'en faire un usage intense et constant, ils s'arrangeront pour trouver le moyen le plus profitable de l'utiliser. Les applications de l'UCITA qui r&eacute;duiront le potentiel d'achat des utilisateurs seront abandonn&eacute;es&nbsp;; celles que les utilisateurs tol&eacute;reront deviendront la norme. L'UCITA ne nous aidera pas.

source: UCITA does not apply only to software. It applies to any sort of computer-readable information. Even if you use only free software, you are likely to read articles on your computer, and access data bases. UCITA will allow the publishers to impose the most outrageous restrictions on you. They could change the license retroactively at any time, and force you to delete the material if you don't accept the change. They could even prohibit you from describing what you see as flaws in the material.
fr: L'UCITA ne s'applique pas seulement au logiciel. Elle s'applique &agrave; n'importe quel type d'information susceptible d'&ecirc;tre lue par un ordinateur. M&ecirc;me si vous n'employez que du liberticiel, vous allez probablement lire des articles sur votre ordinateur et acc&eacute;der &agrave; des bases de donn&eacute;es. L'UCITA permettra au publicateur de vous imposer les plus outrageuses des restrictions. Ils pourraient changer la licence r&eacute;troactivement &agrave; n'importe quel moment et vous forcer d'effacer l'information si vous ne vous soumettez pas au changement. De m&ecirc;me, ils pourraient vous interdire de d&eacute;noncer les &eacute;ventuelles erreurs que vous constateriez dans l'information que vous d&eacute;tenez.

source: This is too outrageous an injustice to wish on anyone, even if it would indirectly benefit a good cause. As ethical beings, we must not favor the infliction of hardship and injustice on others on the grounds that it will drive them to join our cause. We must not be Machiavellian. The point of free software is concern for each other.
fr: C'est une injustice trop outrageuse qu'on ne peut souhaiter &agrave; personne, m&ecirc;me si une bonne cause en b&eacute;n&eacute;ficiait. En tant que personnes d'&eacute;thique, nous ne pouvons favoriser la tendance de s&eacute;v&eacute;rit&eacute; et d'injustice &agrave; d'autres dans le but qu'ils rejoignent notre cause. Nous ne pouvons &ecirc;tre machiav&eacute;liques. Le but du logiciel libre est le souci de tous.

source: Our only smart plan, our only ethical plan, is&hellip;to defeat UCITA!
fr: Notre seul plan intelligent et &eacute;thique est&hellip; de mettre l'UCITA en d&eacute;faite&nbsp;!

source: If you want to help the fight against UCITA, by meeting with state legislators in your state, send mail to Skip Lockwood <a href="mailto:dfc@dfc.org">&lt;dfc@dfc.org&gt;</a>. He can tell you how to contribute effectively.
fr: Si vous d&eacute;sirez aider &agrave; la bataille contre l'UCITA, en rencontrant des l&eacute;gislateurs dans votre &Eacute;tat, envoyez un courriel &agrave; Skip Lockwood <a href="mailto:dfc&#64;dfc.org">&lt;dfc&#64;dfc.org&gt;</a>. Il pourra vous indiquer le moyen de contribuer efficacement.

source: Volunteers are needed most urgently in Virginia and Maryland <a href="#Note3">(3)</a>, but California and Oklahoma are coming soon. There will probably be a battle in every state sooner or later.
fr: Le besoin se fait sentir le plus urgemment en Virginie et dans le Maryland <a href="#Note3">(3)</a>, mais il atteindra bient&ocirc;t la Californie et l'Oklahoma. Il y aura probablement une bataille dans chaque &Eacute;tat t&ocirc;t ou tard.

source: For more information about UCITA, see <a href="http://www.badsoftware.com">http://www.badsoftware.com</a>. InfoWorld magazine is also helping to fight against UCITA; see <a href="http://archive.infoworld.com/cgi-bin/displayStory.pl?/features/990531ucita_home.htm"> http://archive.infoworld.com/cgi-bin/displayStory.pl?/features/990531ucita_home.htm</a>
fr: Pour plus d'informations sur l'UCITA, consultez <a href="http://www.badsoftware.com">http://www.badsoftware.com</a>. Le magazine InfoWorld participe &agrave; la bataille contre l'UCITA&nbsp;; consultez <a href="http://archive.infoworld.com/cgi-bin/displayStory.pl?/features/990531ucita_home.htm">http://archive.infoworld.com/cgi-bin/displayStory.pl?/features/990531ucita_home.htm</a>

source: Other people have been using the term &ldquo;open source&rdquo; to describe a similar category of software. I use the term &ldquo;free software&rdquo; to show that the Free Software Movement still exists&mdash;that the Open Source Movement has not replaced or absorbed us.
fr: D'autres personnes utilisent l'expression &laquo;&nbsp;open source&nbsp;&raquo; pour d&eacute;crire une cat&eacute;gorie similaire de logiciels. J'emploie personnellement l'expression &laquo;&nbsp;Free Software&nbsp;&raquo; afin de montrer que le mouvement du logiciel libre existe encore (que le mouvement du code source ouvert ne nous a ni remplac&eacute;s ni absorb&eacute;s).

source: If you value your freedom as well as your convenience, I suggest you use the term &ldquo;free software&rdquo;, not &ldquo;open source&rdquo;, to describe your own work, so as to stand up clearly for your values.
fr: Si vous appr&eacute;ciez votre libert&eacute; autant que votre confort, je vous sugg&egrave;re d'employer la tournure &laquo;&nbsp;logiciel libre&nbsp;&raquo; et non &laquo;&nbsp;code source ouvert&nbsp;&raquo; pour d&eacute;crire votre œuvre. Ceci, afin de marquer clairement votre &eacute;chelle de valeur.

source: If you value accuracy, please use the term &ldquo;free software&rdquo;, not &ldquo;open source&rdquo;, to describe the work of the Free Software Movement. The GNU operating system, its GNU/Linux variant, the many GNU software packages, and the GNU GPL, are all primarily the work of the Free Software Movement. The supporters of the Open Source Movement have the right to promote their views, but they should not do so on the basis of our achievements.
fr: De m&ecirc;me, si l'exactitude vous importe, utilisez la tournure &laquo;&nbsp;logiciel libre&nbsp;&raquo; si vous faites r&eacute;f&eacute;rence au mouvement pour le logiciel libre. Le syst&egrave;me d'exploitation GNU, son d&eacute;riv&eacute; GNU/Linux, les nombreux logiciels GNU, ainsi que la GNU GPL, sont tous issus du labeur du Mouvement pour le logiciel libre. Les aficionados du mouvement open source ont le droit de revendiquer leur point de vue, mais ils ne devraient pas le faire sur le compte de notre r&eacute;ussite.

source: See <a href="/philosophy/open-source-misses-the-point.html"> http://www.gnu.org/philosophy/open-source-misses-the-point.html</a> for more explanation.
fr: Consulter <a href="/philosophy/open-source-misses-the-point.fr.html">http://www.gnu.org/philosophy/open-source-misses-the-point.fr.html</a> pour plus d'explications&nbsp;<sup><a href="#TransNote1">1</a></sup>.

source: The system is often called &ldquo;Linux&rdquo;, but properly speaking Linux is actually the kernel, one major component of the system (see <a href="/gnu/linux-and-gnu.html">http://www.gnu.org/gnu/linux-and-gnu.html</a>).
fr: Le syst&egrave;me est souvent appel&eacute; &laquo;&nbsp;Linux&nbsp;&raquo;, mais &agrave; proprement parler, Linux n'est que le noyau, un composant majeur du syst&egrave;me (voir <a href="/gnu/linux-and-gnu.fr.html">http://www.gnu.org/gnu/linux-and-gnu.fr.html</a>.

source: The Maryland lower house has approved UCITA; there is a push to get the state senate to approve it before the end of the legislative session, on April 10.
fr: La Chambre basse du Maryland a approuv&eacute; l'UCITA&nbsp;; il y a pression pour le faire approuver par le S&eacute;nat de l'&Eacute;tat avant la fin de la session l&eacute;gislative, le 10 avril.

source: To rush the consideration of this bill is even more obviously foolish than the bill itself. So if you live in Maryland, please phone or write to your state senator, saying the senate should at least defer UCITA for summer study, if it is not rejected outright.
fr: Pr&eacute;cipiter la prise en compte de cette loi est m&ecirc;me encore plus &eacute;videmment stupide que la loi elle-m&ecirc;me. Aussi, si vous habitez dans le Maryland, veuillez t&eacute;l&eacute;phoner ou &eacute;crire &agrave; votre S&eacute;nateur d'&Eacute;tat, en disant que le S&eacute;nat devrait au moins repousser l'UCITA pour une &eacute;tude pendant l'&eacute;t&eacute;, si ce n'est le rejeter imm&eacute;diatement.

source: If you know anyone in Maryland who works with computers, please forward this message to that person and ask for per support.
fr: Si vous connaissez quelqu'un dans le Maryland qui travaille dans l'informatique, veuillez lui faire suivre ce message et lui demander son soutien.

source: If you support the anti UCITA campaign, <em>please make prominent links to this page, <a href="http://www.4cite.org">http://www.4cite.org</a> and to <a href="http://archive.infoworld.com/cgi-bin/displayStory.pl?/features/990531ucita_home.htm"> http://archive.infoworld.com/cgi-bin/displayStory.pl?/features/990531ucita_home.htm</a>! </em>
fr: Si vous soutenez la campagne contre l'UCITA, <em>veuillez s'il vous pla&icirc;t cr&eacute;er des liens clairement affich&eacute;s vers cette page, <a href="http://www.4cite.org">http://www.4cite.org</a>, et vers celle-ci, <a href="http://archive.infoworld.com/cgi-bin/displayStory.pl?/features/990531ucita_home.htm">http://archive.infoworld.com/cgi-bin/displayStory.pl?/features/990531ucita_home.htm</a>&nbsp;!</em>

source: Links to other articles
fr: Liens vers d'autres articles

source: <a href="http://www.ieeeusa.org/policy/POSITIONS/ucita.html">IEEE supports the movement to oppose UCITA</a>
fr: <a href="http://www.ieeeusa.org/policy/POSITIONS/ucita.fr.html">L'IEEE soutient le mouvement contre l'UCITA</a>

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: <b>Notes du traducteur</b>&nbsp;: <ol><li id="TransNote1">&laquo;&nbsp;open source&nbsp;&raquo; signifie &laquo;&nbsp;code source ouvert&nbsp;&raquo; et met l'accent sur la disponibilit&eacute; du code source aux utilisateurs. &Agrave; contrario, &laquo;&nbsp;free software&nbsp;&raquo; pouvant se traduire par &laquo;&nbsp;logiciel libre&nbsp;&raquo; ou &laquo;&nbsp;liberticiel&nbsp;&raquo;, met l'emphase sur l'aspect libre de ce type de logiciels.</li></ol>

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Wolgang Sourdeau<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
