Repository: gitGNU/gnu_www-fr
Catalog: philosophy/why-copyleft.*.po
Languages: fr

source: Why Copyleft? - GNU Project - Free Software Foundation (FSF)
fr: Pourquoi le Copyleft&nbsp;? - GNU Project - Free Software Foundation (FSF)

source: Why Copyleft?
fr: Pourquoi le Copyleft&nbsp;?

source: <cite>&ldquo;When it comes to defending the freedom of others, to lie down and do nothing is an act of weakness, not humility.&rdquo;</cite>
fr: <cite>&laquo;&nbsp;Quand il est temps de d&eacute;fendre la libert&eacute; d'autrui, ne pas r&eacute;sister et laisser faire est un acte de faiblesse, non d'humilit&eacute;&nbsp;&raquo;</cite>.

source: In the GNU Project we usually recommend people use <a href="/copyleft/copyleft.html">copyleft</a> licenses like GNU GPL, rather than permissive non-copyleft free software licenses. We don't argue harshly against the non-copyleft licenses&mdash;in fact, we occasionally recommend them in special circumstances&mdash;but the advocates of those licenses show a pattern of arguing harshly against the <acronym title="General Public License">GPL</acronym>.
fr: Au sein du projet GNU, nous recommandons g&eacute;n&eacute;ralement l'utilisation de licences de type <a href="/copyleft/copyleft.fr.html">&laquo;&nbsp;copyleft&nbsp;&raquo;</a> comme la GNU GPL plut&ocirc;t que des licences de logiciels libres plus permissives. Nous ne pol&eacute;miquons pas contre les licences &laquo;&nbsp;non-copyleft&nbsp;&raquo; (en fait, nous les recommandons ponctuellement dans certaines circonstances) mais les partisans de ces licences montrent, eux, une tendance marqu&eacute;e &agrave; la pol&eacute;mique contre la licence GPL.

source: In one such argument, a person stated that his use of one of the BSD licenses was an &ldquo;act of humility&rdquo;: &ldquo;I ask nothing of those who use my code, except to credit me.&rdquo; It is rather a stretch to describe a legal demand for credit as &ldquo;humility&rdquo;, but there is a deeper point to be considered here.
fr: D'une certaine mani&egrave;re, quelqu'un a d&eacute;cid&eacute; que l'utilisation d'une des licences BSD &eacute;tait un &laquo;&nbsp;acte d'humilit&eacute;&nbsp;&raquo;&nbsp;: &laquo;&nbsp;je ne demande rien &agrave; la personne qui utilise mon code, &agrave; l'exception de la reconnaissance de mon travail&nbsp;&raquo;. C'est quelque part une exag&eacute;ration de consid&eacute;rer une demande l&eacute;gitime de reconnaissance comme de &laquo;&nbsp;l'humilit&eacute;&nbsp;&raquo;, mais il y a ici quelque chose de plus fondamental &agrave; examiner.

source: Humility is abnegating your own self interest, but you and the one who uses your code are not the only ones affected by your choice of which free software license to use for your code. Someone who uses your code in a non-free program is trying to deny freedom to others, and if you let him do it, you're failing to defend their freedom. When it comes to defending the freedom of others, to lie down and do nothing is an act of weakness, not humility.
fr: L'humilit&eacute; consiste &agrave; faire abstraction de votre propre int&eacute;r&ecirc;t, mais vous et celui qui utilise votre code n'&circ;tes pas les seuls &agrave; &ecirc;tre affect&eacute;s par le choix de la licence de logiciel libre pour votre code. Quiconque utilise votre code dans un programme non libre essaie d'interdire cette possibilit&eacute; aux autres, et si vous laissez faire, vous manquez &agrave; votre devoir de d&eacute;fendre cette libert&eacute; pour les autres. Quand vient le moment de d&eacute;fendre la libert&eacute; d'autrui, ne pas r&eacute;sister et laisser faire est un acte de faiblesse et non d'humilit&eacute;.

source: Releasing your code under one of the BSD licenses, or some other permissive non-copyleft license, is not doing wrong; the program is still free software, and still a contribution to our community. But it is weak, and in most cases it is not the best way to promote users' freedom to share and change software.
fr: Diffuser votre code sous une des licences BSD ou une des licences &laquo;&nbsp;non-copyleft&nbsp;&raquo; permissives n'est pas mal faire; le programme reste un logiciel libre et une contribution pour notre communaut&eacute;. Mais il est n&eacute;anmoins faiblement prot&eacute;g&eacute; et ce n'est pas, dans la plupart des cas, la meilleure mani&agrave;re de promouvoir la libert&eacute; des utilisateurs de modifier les logiciels et de les partager.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Laurent Bertaud.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
