Repository: gitGNU/gnu_www-fr
Catalog: philosophy/why-free.*.po
Languages: fr

source: Why Software Should Not Have Owners - GNU Project - Free Software Foundation (FSF)
fr: Pourquoi les logiciels ne doivent pas avoir de propri&eacute;taire - GNU Project - Free Software Foundation (FSF)

source: GNU, GNU Project, FSF, Free Software, Free Software Foundation, Why Software Should Not Have Owners
fr: GNU, Projet GNU, FSF, logiciel libre, Free Software Foundation, Pourquoi les logiciels ne doivent pas avoir de propri&eacute;taire

source: Why Software Should Not Have Owners
fr: Pourquoi les logiciels ne doivent pas avoir de propri&eacute;taire

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: Digital information technology contributes to the world by making it easier to copy and modify information. Computers promise to make this easier for all of us.
fr: Les techniques num&eacute;riques de l'information contribuent &agrave; l'int&eacute;r&ecirc;t g&eacute;n&eacute;ral en rendant plus commodes la copie et la modification de l'information. Les ordinateurs apportent la promesse de faciliter ces op&eacute;rations pour tous.

source: Not everyone wants it to be easier. The system of copyright gives software programs &ldquo;owners&rdquo;, most of whom aim to withhold software's potential benefit from the rest of the public. They would like to be the only ones who can copy and modify the software that we use.
fr: Tout le monde ne veut pas de cette simplification. Le syst&egrave;me du droit de copie attribue aux programmes informatiques des &laquo;&nbsp;propri&eacute;taires&nbsp;&raquo;, qui pour la plupart souhaitent en garder pour eux les b&eacute;n&eacute;fices potentiels et non les ouvrir au public. Ils veulent &ecirc;tre seuls &agrave; pouvoir copier et modifier les logiciels que nous utilisons.

source: The copyright system grew up with printing&mdash;a technology for mass-production copying. Copyright fit in well with this technology because it restricted only the mass producers of copies. It did not take freedom away from readers of books. An ordinary reader, who did not own a printing press, could copy books only with pen and ink, and few readers were sued for that.
fr: Le syst&egrave;me du droit d'auteur s'est d&eacute;velopp&eacute; en m&ecirc;me temps que l'imprimerie, une technique de copie &agrave; grande &eacute;chelle. Le droit d'auteur &eacute;tait adapt&eacute; &agrave; cette technologie parce qu'il ne limitait que la copie &agrave; grande &eacute;chelle. Il ne privait pas les lecteurs de livres de leurs libert&eacute;s : le lecteur moyen ne poss&eacute;dait pas de presse &agrave; imprimer, et il pouvait recopier des livres avec sa plume et son encrier, et peu de lecteurs furent prousuivis pour cela.

source: Digital technology is more flexible than the printing press: when information has digital form, you can easily copy it to share it with others. This very flexibility makes a bad fit with a system like copyright. That's the reason for the increasingly nasty and draconian measures now used to enforce software copyright. Consider these four practices of the Software Publishers Association (SPA):
fr: Les techniques num&eacute;riques sont plus souples que la presse d'imprimerie. Une fois sous forme num&eacute;rique, il devient facile de recopier l'information pour en faire profiter d'autres personnes. Cette souplesse place le support num&eacute;rique en porte-&agrave;-faux dans un syst&egrave;me comme le droit de copie. C'est pour cette raison que de plus en plus souvent des mesures s&eacute;v&egrave;res et d&eacute;sagr&eacute;ables sont prises afin de renforcer le droit de copie pour les logiciels. Par exemple les quatre pratiques suivantes de l'Association des &Eacute;diteurs de Logiciels (Software Publishers Association, SPA)&nbsp;:

source: Massive propaganda saying it is wrong to disobey the owners to help your friend.
fr: Une propagande massive clamant qu'il est mal de d&eacute;sob&eacute;ir aux propri&eacute;taires afin d'aider ses amis.

source: Solicitation for stool pigeons to inform on their coworkers and colleagues.
fr: Une incitation &agrave; la d&eacute;nonciation de ses camarades ou de ses coll&egrave;gues.

source: Raids (with police help) on offices and schools, in which people are told they must prove they are innocent of illegal copying.
fr: Des visites surprises, avec l'aide de la police, dans les bureaux et dans les &eacute;coles, au cours desquelles on exige des personnes la preuve qu'elles sont innocentes du d&eacute;lit de copie ill&eacute;gale.

source: Owners make several kinds of arguments for giving them the power to control how we use information:
fr: Les propri&eacute;taires ont invent&eacute; divers arguments pour justifier leur prise de contr&ocirc;le de la mani&egrave;re dont nous utilisons l'information&nbsp;:

source: Name calling.
fr: Les insultes.

source: Owners use smear words such as &ldquo;piracy&rdquo; and &ldquo;theft&rdquo;, as well as expert terminology such as &ldquo;intellectual property&rdquo; and &ldquo;damage&rdquo;, to suggest a certain line of thinking to the public&mdash;a simplistic analogy between programs and physical objects.
fr: Les propri&eacute;taires emploient des expressions p&eacute;joratives comme &laquo;&nbsp;pirate&nbsp;&raquo; ou &laquo;&nbsp;vol&nbsp;&raquo; en les associant &agrave; une terminologie plus technique comme &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo; ou &laquo;&nbsp;pr&eacute;judice&nbsp;&raquo;. Ils conduisent ainsi le public &agrave; penser comme ils le veulent, par une analogie simpliste entre les programmes d'ordinateurs et les objets du monde physique.

source: Our ideas and intuitions about property for material objects are about whether it is right to <em>take an object away</em> from someone else. They don't directly apply to <em>making a copy</em> of something. But the owners ask us to apply them anyway.
fr: Nos id&eacute;es et nos intuitions sur la propri&eacute;t&eacute; des objets mat&eacute;riels se rapportent &agrave; la question de savoir s'il est juste d'<em>emporter un objet</em> qui appartient &agrave; quelqu'un d'autre. Elles ne s'appliquent pas directement &agrave; la <em>recopie</em> de quelque chose. Mais les propri&eacute;taires nous demandent de les appliquer quand m&ecirc;me.

source: Exaggeration.
fr: L'exag&eacute;ration.

source: Owners say that they suffer &ldquo;harm&rdquo; or &ldquo;economic loss&rdquo; when users copy programs themselves. But the copying has no direct effect on the owner, and it harms no one. The owner can lose only if the person who made the copy would otherwise have paid for one from the owner.
fr: Les propri&eacute;taires disent subir des &laquo;&nbsp;dommages&nbsp;&raquo; ou des &laquo;&nbsp;pertes &eacute;conomiques&nbsp;&raquo; du fait que les utilisateurs recopient eux-m&ecirc;mes les programmes. Pourtant le fait de la copie n'a aucun effet direct pour le propri&eacute;taire et ne fait de mal &agrave; personne. Le propri&eacute;taire ne subit une perte que dans la mesure o&ugrave; la personne qui fait cette copie aurait &eacute;t&eacute; pr&ecirc;te &agrave; payer au propri&eacute;taire le prix d'un autre exemplaire.

source: A little thought shows that most such people would not have bought copies. Yet the owners compute their &ldquo;losses&rdquo; as if each and every one would have bought a copy. That is exaggeration&mdash;to put it kindly.
fr: Or en y r&eacute;fl&eacute;chissant un petit peu, on conclut vite que la plupart de ces personnes n'auraient pas achet&eacute; le logiciel. Ce qui n'emp&ecirc;che nullement les propri&eacute;taires de calculer leurs &laquo;&nbsp;pertes&nbsp;&raquo; comme si toutes ces personnes avaient &eacute;t&eacute; des acheteurs potentiels. Le moins qu'on puisse dire c'est qu'ils exag&egrave;rent.

source: The law.
fr: Le droit.

source: Owners often describe the current state of the law, and the harsh penalties they can threaten us with. Implicit in this approach is the suggestion that today's law reflects an unquestionable view of morality&mdash;yet at the same time, we are urged to regard these penalties as facts of nature that can't be blamed on anyone.
fr: Les propri&eacute;taires parlent souvent des dispositions l&eacute;gales et des p&eacute;nalit&eacute;s dont ils peuvent nous menacer. Implicitement, ils veulent nous dire l&agrave; que les lois d'aujourd'hui refl&egrave;tent un point de vue moral incontestable, et en m&ecirc;me temps nous invitent &agrave; consid&eacute;rer les p&eacute;nalit&eacute;s encourues comme des faits de nature, dont personne ne porte la responsabilit&eacute;.

source: This line of persuasion isn't designed to stand up to critical thinking; it's intended to reinforce a habitual mental pathway.
fr: Ce type d'argumentation n'a pas &eacute;t&eacute; taill&eacute; pour r&eacute;sister au raisonnement critique mais pour venir renforcer une pens&eacute;e routini&egrave;re.

source: It's elementary that laws don't decide right and wrong. Every American should know that, in the 1950s, it was against the law in many states for a black person to sit in the front of a bus; but only racists would say sitting there was wrong.
fr: En aucune fa&ccedil;on les lois ne sont des arbitres du bien et du mal. Tout Am&eacute;ricain devrait savoir que dans les années 1950, dans de nombreux &Eacute;tats, il &eacute;tait ill&eacute;gal pour un Noir de s'asseoir &agrave; l'avant d'un autobus. Cependant seuls les racistes diront que c'&eacute;tait mal de le faire.

source: Natural rights.
fr: Les droits naturels.

source: Authors often claim a special connection with programs they have written, and go on to assert that, as a result, their desires and interests concerning the program simply outweigh those of anyone else&mdash;or even those of the whole rest of the world. (Typically companies, not authors, hold the copyrights on software, but we are expected to ignore this discrepancy.)
fr: Souvent les auteurs revendiquent leur attachement affectif aux programmes qu'ils ont &eacute;crits et nous en font d&eacute;duire que leurs d&eacute;sirs et leurs int&eacute;r&ecirc;ts au sujet de ces programmes sont plus importants que ceux de toutes les autres personnes, plus importants m&ecirc;me que ceux du monde entier. Il faut ici remarquer que la plupart du temps ce sont les soci&eacute;t&eacute;s et non les auteurs qui d&eacute;tiennent les droits de copie sur les logiciels, mais nous sommes cens&eacute;s n&eacute;gliger cette incoh&eacute;rence.

source: To those who propose this as an ethical axiom&mdash;the author is more important than you&mdash;I can only say that I, a notable software author myself, call it bunk.
fr: &Agrave; ceux qui &eacute;noncent comme un axiome moral l'id&eacute;e que l'auteur est plus important que le public, je peux seulement r&eacute;pondre que pour ma part, bien qu'auteur de logiciels tr&egrave;s connu, je dis que c'est du chiqu&eacute;.

source: But people in general are only likely to feel any sympathy with the natural rights claims for two reasons.
fr: Si les gens ont tellement tendance &agrave; sympathiser avec les arguments du type &laquo;&nbsp;droits naturels&nbsp;&raquo;, c'est g&eacute;n&eacute;ralement pour l'une des deux raisons suivantes.

source: One reason is an overstretched analogy with material objects. When I cook spaghetti, I do object if someone else eats it, because then I cannot eat it. His action hurts me exactly as much as it benefits him; only one of us can eat the spaghetti, so the question is, which one? The smallest distinction between us is enough to tip the ethical balance.
fr: La premi&egrave;re de ces raisons repose sur une analogie abusive avec les objets mat&eacute;riels. Si je pr&eacute;pare un plat de spaghetti, cela ne me va pas me convenir que quelqu'un d'autre que moi les mange, parce qu'alors je ne pourrai plus les manger moi-m&ecirc;me. En mangeant mes spaghetti, l'autre personne me cause un dommage dans l'exacte mesure de son b&eacute;n&eacute;fice &agrave; elle. D'elle ou de moi, une seule personne peut avoir les spaghetti, la question est de savoir qui. La plus petite distinction entre nous deux suffit &agrave; faire pencher la balance morale.

source: But whether you run or change a program I wrote affects you directly and me only indirectly. Whether you give a copy to your friend affects you and your friend much more than it affects me. I shouldn't have the power to tell you not to do these things. No one should.
fr: Mais le cas d'un programme que j'ai &eacute;crit est tr&egrave;s diff&eacute;rent. Si vous le faites fonctionner ou si vous le modifiez, cela vous profite directement mais ne m'affecte que d'une mani&egrave;re indirecte. Le fait que vous en donniez ou non une copie &agrave; un ami vous profite beaucoup plus, &agrave; vous et &agrave; votre ami, qu'il ne me d&eacute;range, moi. Il ne faut pas que j'aie le pouvoir de vous en emp&ecirc;cher. Personne ne doit avoir ce pouvoir.

source: The second reason is that people have been told that natural rights for authors is the accepted and unquestioned tradition of our society.
fr: Deuxi&egrave;mement, les gens ont entendu dire que les droits naturels des auteurs constituaient une tradition universellement accept&eacute;e et jamais remise en question par notre soci&eacute;t&eacute;.

source: As a matter of history, the opposite is true. The idea of natural rights of authors was proposed and decisively rejected when the US Constitution was drawn up. That's why the Constitution only <em>permits</em> a system of copyright and does not <em>require</em> one; that's why it says that copyright must be temporary. It also states that the purpose of copyright is to promote progress&mdash;not to reward authors. Copyright does reward authors somewhat, and publishers more, but that is intended as a means of modifying their behavior.
fr: Pourtant historiquement c'est l'inverse qui est vrai. Au moment de la r&eacute;daction de la Constitution des &Eacute;tats-Unis, l'id&eacute;e de droits naturels pour les auteurs fut propos&eacute;e mais finalement rejet&eacute;e. C'est pourquoi la Constitution se borne &agrave; <em>autoriser</em> les syst&egrave;mes de droit de copie, sans toutefois les rendre <em>obligatoires</em>. La Constitution &eacute;nonce aussi que de tels syt&egrave;mes doivent &ecirc;tre temporaires, que leur but est de favoriser le progr&egrave;s et non pas de r&eacute;compenser les auteurs. Le droit de copie r&eacute;compense certes les auteurs, et les &eacute;diteurs encore plus, mais toujours en tant que moyen d'infl&eacute;chir leur comportement.

source: The real established tradition of our society is that copyright cuts into the natural rights of the public&mdash;and that this can only be justified for the public's sake.
fr: La v&eacute;ritable tradition de notre soci&eacute;t&eacute;, c'est que le droit d'auteur empi&egrave;te sur les droits naturels du public et ne peut se justifier que dans l'int&eacute;r&ecirc;t de ce m&ecirc;me public.

source: Economics.
fr: L'&Eacute;conomie.

source: The final argument made for having owners of software is that this leads to production of more software.
fr: Finalement, on nous dit qu'il faut aux logiciels des propri&eacute;taires parce que cela encourage leur production.

source: Unlike the others, this argument at least takes a legitimate approach to the subject. It is based on a valid goal&mdash;satisfying the users of software. And it is empirically clear that people will produce more of something if they are well paid for doing so.
fr: Contrairement aux autres arguments, celui-ci repose du moins sur une approche l&eacute;gitime du sujet. Le but est valable en effet: satisfaire les utilisateurs de logiciels. L'exp&eacute;rience montre que les gens produiront plus de logiciels s'ils sont mieux pay&eacute;s pour le faire.

source: People readily accept this assumption because it accords with our experiences with material objects. Consider a sandwich, for instance. You might well be able to get an equivalent sandwich either gratis or for a price. If so, the amount you pay is the only difference. Whether or not you have to buy it, the sandwich has the same taste, the same nutritional value, and in either case you can only eat it once. Whether you get the sandwich from an owner or not cannot directly affect anything but the amount of money you have afterwards.
fr: Le public accepte facilement cette hypoth&egrave;se parce qu'elle correspond &agrave; son exp&eacute;rience des objets mat&eacute;riels. Si nous prenons l'exemple du sandwich, on peut sans doute r&eacute;ussir &agrave; en trouver deux qui soient identiques, l'un gratuit, l'autre payant. Si c'est le cas la somme pay&eacute;e ou non est la seule diff&eacute;rence entre les deux. Que vous deviez ou non le payer, le sandwich aura le m&ecirc;me go&ucirc;t, la m&ecirc;me valeur nutritive et en tous cas vous ne pourrez le manger qu'une seule fois. Le fait le sandwich vous ait &eacute;t&eacute; fourni, ou non, par un propri&eacute;taire n'a d'influence directe que sur la somme d'argent dont vous disposez par la suite.

source: This is true for any kind of material object&mdash;whether or not it has an owner does not directly affect what it <em>is</em>, or what you can do with it if you acquire it.
fr: Ceci est vrai pour tout type d'objet mat&eacute;riel. Le fait qu'ils aient ou non un propri&eacute;taire ne change pas leur <em>nature</em>, ni leur utilit&eacute; au cas o&ugrave; vous en faites l'acquisition.

source: But if a program has an owner, this very much affects what it is, and what you can do with a copy if you buy one. The difference is not just a matter of money. The system of owners of software encourages software owners to produce something&mdash;but not what society really needs. And it causes intangible ethical pollution that affects us all.
fr: Pour un programme c'est diff&eacute;rent. Le fait qu'il ait un propri&eacute;taire modifie nettement sa nature et ce que vous pouvez en faire si vous en achetez un exemplaire. Et pas seulement pour une question d'argent, car le syst&egrave;me de propri&eacute;taires de logiciels encourage ces derniers &agrave; produire un bien qui n'est pas celui dont la soci&eacute;t&eacute; a besoin. Il est la cause d'une pollution morale imperceptible qui nous affecte tous.

source: What does society need? It needs information that is truly available to its citizens&mdash;for example, programs that people can read, fix, adapt, and improve, not just operate. But what software owners typically deliver is a black box that we can't study or change.
fr: En effet, de quoi la soci&eacute;t&eacute; a-t-elle besoin&nbsp;? D'une information vraiment disponible pour ses citoyens. Par exemple, des programmes que les gens peuvent r&eacute;parer, modifier, adapter, am&eacute;liorer, et pas seulement faire marcher. Or ce que les propri&eacute;taires de logiciels livrent g&eacute;n&eacute;ralement est une bo&icirc;te noire que personne ne peut &eacute;tudier ni modifier.

source: Society also needs freedom. When a program has an owner, the users lose freedom to control part of their own lives.
fr: La soci&eacute;t&eacute; a aussi besoin de libert&eacute;. Quand un programme a un propri&eacute;taire, ses utilisateurs perdent la libert&eacute; de contr&ocirc;ler un des aspects de leur vie.

source: And, above all, society needs to encourage the spirit of voluntary cooperation in its citizens. When software owners tell us that helping our neighbors in a natural way is &ldquo;piracy&rdquo;, they pollute our society's civic spirit.
fr: Surtout, la soci&eacute;t&eacute; a besoin d'encourager l'esprit de coop&eacute;ration volontaire de ses citoyens. Quand les propri&eacute;taires de logiciels qualifient de &laquo;&nbsp;pillage&nbsp;&raquo; le fait d'aider notre voisin d'une fa&ccedil;on simple et naturelle, ils polluent l'esprit civique de notre soci&eacute;t&eacute;.

source: This is why we say that <a href="/philosophy/free-sw.html">free software</a> is a matter of freedom, not price.
fr: C'est pourquoi nous disons que le <a href="/philosophy/free-sw.fr.html">logiciel libre</a> est une question de libert&eacute;, pas de prix.

source: The economic argument for owners is erroneous, but the economic issue is real. Some people write useful software for the pleasure of writing it or for admiration and love; but if we want more software than those people write, we need to raise funds.
fr: L'argument &eacute;conomique des propri&eacute;taires est un faux argument, mais le probl&egrave;me &eacute;conomique est un vrai probl&egrave;me. Certaines personnes &eacute;crivent des logiciels utiles pour le plaisir ou pour conqu&eacute;rir l'admiration et la reconnaissance, mais si nous voulons plus de logiciels que ceux que ces personnes &eacute;crivent il nous faut r&eacute;colter des fonds.

source: Since the 1980s, free software developers have tried various methods of finding funds, with some success. There's no need to make anyone rich; a typical income is plenty of incentive to do many jobs that are less satisfying than programming.
fr: Depuis les années 1980, les d&eacute;veloppeurs de logiciels libres essaient, avec un certain succ&egrave;s, diverses m&eacute;thodes pour trouver des financements. Il n'est pas indispensable pour cela d'enrichir quelqu'un&nbsp;; un revenu moyen a fait la preuve de sa capacit&eacute; suffisante comme stimulant pour beaucoup de m&eacute;tiers moins satisfaisants que la programmation.

source: For years, until a fellowship made it unnecessary, I made a living from custom enhancements of the free software I had written. Each enhancement was added to the standard released version and thus eventually became available to the general public. Clients paid me so that I would work on the enhancements they wanted, rather than on the features I would otherwise have considered highest priority.
fr: Pendant des ann&eacute;es, jusqu'&agrave; ce que la cr&eacute;ation d'une association le rende superflu, j'ai gagn&eacute; ma vie avec les am&eacute;liorations que je faisais ponctuellement aux logiciels que j'avais &eacute;crits. Chacune de ces am&eacute;liorations &eacute;tait ajout&eacute;e &agrave; la version livr&eacute;e en standard, devenant ipso facto disponible au public. Les clients me payaient pour travailler aux am&eacute;liorations dont ils avaient besoin et qui ne co&iuml;ncidaient pas forc&eacute;ment avec les fonctionnalit&eacute;s que j'aurais autrement consid&eacute;r&eacute;es comme prioritaires.

source: The free software movement is still small, but the example of listener-supported radio in the US shows it's possible to support a large activity without forcing each user to pay.
fr: Le mouvement du logiciel libre est encore petit et encore jeune. Mais l'exemple de la radio financ&eacute;e par les auditeurs aux &Eacute;tats-Unis montre qu'il est possible de soutenir une activit&eacute; importante sans forcer chaque utilisateur &agrave; payer.
