Repository: gitGNU/gnu_www-fr
Catalog: philosophy/why-free.*.po
Languages: fr

source: As a computer user today, you may find yourself using a <a href="/philosophy/categories.html#ProprietarySoftware">proprietary</a> program. If your friend asks to make a copy, it would be wrong to refuse. Cooperation is more important than copyright. But underground, closet cooperation does not make for a good society. A person should aspire to live an upright life openly with pride, and this means saying no to proprietary software.
fr: En tant qu'utilisateur d'ordinateur aujourd'hui, vous utilisez peut-&ecirc;tre un <a href="/philosophy/categories.fr.html#ProprietarySoftware">programme propri&eacute;taire</a>. Si votre ami vous en demande une copie, ce serait mal de refuser. La coop&eacute;ration est plus importante que le droit de copie. Cependant, dans le fond, la coop&eacute;ration en circuit ferm&eacute; ne permettra pas de b&acirc;tir une bonne soci&eacute;t&eacute;. Chacun devrait aspirer &agrave; une vie honn&ecirc;te men&eacute;e ouvertement et avec fiert&eacute;, et pour cela il faut dire &laquo;&nbsp;non&nbsp;!&nbsp;&raquo; au logiciel propri&eacute;taire.

source: You deserve to be able to cooperate openly and freely with other people who use software. You deserve to be able to learn how the software works, and to teach your students with it. You deserve to be able to hire your favorite programmer to fix it when it breaks.
fr: Vous m&eacute;ritez de pouvoir coop&eacute;rer ouvertement et librement avec les autres personnes qui utilisent les logiciels. Vous m&eacute;ritez de pouvoir apprendre comment marche un logiciel et de l'enseigner &agrave; vos &eacute;l&egrave;ves. Vous m&eacute;ritez de pouvoir engager votre programmeur favori pour r&eacute;parer le logiciel quand il est cass&eacute;.

source: You deserve free software.
fr: Vous m&eacute;ritez le logiciel libre.

source: This essay is published in <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>.
fr: Cet essai est publi&eacute; dans le livre <a href="http://shop.fsf.org/product/free-software-free-society/"><i>Free Software, Free Society: The Selected Essays of Richard M. Stallman</i></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 1994, 2009 Richard Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 1994, 2009 Richard Stallman <br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Michel Rodriguez.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
