Repository: gitGNU/gnu_www-fr
Catalog: philosophy/wsis.*.po
Languages: fr

source: World Summit on the Information Society
fr: Sommet mondial sur la soci&eacute;t&eacute; de l'information

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
fr: par <a href="http://www.stallman.org"><strong>Richard Stallman</strong></a>

source: <em>(Originally published on Newsforge.)</em>
fr: <em>(Publié initialement sur Newsforge).</em>

source: At <abbr title="World Summit on the Information Society">WSIS</abbr>, in a climate of suppression of dissent, the score is 0-0<br /> <span style="margin-left: 30%">-- Richard Stallman</span>
fr: Au <abbr title="Sommet mondial sur la soci&eacute;t&eacute; de l'information">SMSI</abbr>, dans un climat de r&eacute;pression de la diff&eacute;rence d'opinion, le score est z&eacute;ro partout<br /><span style="margin-left: 30%;">-- Richard Stallman</span>

source: The World Summit on the Information Society is supposed to formulate plans to end the &ldquo;digital divide&rdquo; and make the internet accessible to everyone on Earth. The negotiations were completed in November, so the big official meeting in Geneva last week was more of a trade show and conference than a real summit meeting.
fr: Le Sommet mondial sur la soci&eacute;t&eacute; de l'information est suppos&eacute; &eacute;laborer des dispositifs pour r&eacute;sorber la &laquo;&nbsp;fracture num&eacute;rique&nbsp;&raquo; et rendre Internet accessible &agrave; tout le monde sur Terre. Les n&eacute;gociations se sont termin&eacute;es en novembre, aussi, la grande r&eacute;union officielle &agrave; Gen&egrave;ve la semaine derni&egrave;re relevait plus de la repr&eacute;sentation commerciale que d'une r&eacute;elle rencontre au sommet.

source: The summit procedures were designed so that non-governmental organizations (mainly those that promote human rights and equality, and work to reduce poverty) could attend, see the discussions, and comment. However, the actual declaration paid little attention to the comments and recommendations that these organizations made. In effect, civil society was offered the chance to speak to a dead mike.
fr: Les proc&eacute;dures du sommet ont &eacute;t&eacute; con&ccedil;ues de sorte que les organisations non gouvernementales (principalement celles qui promeuvent les Droits de l'homme et l'&eacute;galit&eacute;, et travaillent pour r&eacute;duire la pauvret&eacute;) puissent y assister, voir les discussions, et les commenter. Cependant, la d&eacute;claration effective fait peu de cas des commentaires et des recommandations que ces organisations ont faits. En effet, on a offert &agrave; la soci&eacute;t&eacute; civile la chance de parler dans un micro muet.

source: The summit's declaration includes little that is bold or new. When it comes to the question of what people will be free to <em>do</em> with the internet, it responds to demands made by various governments to impose restrictions on citizens of cyberspace.
fr: La d&eacute;claration du sommet ne comporte rien de bien nouveau ou audacieux. Quand on en vient &agrave; la question de savoir ce que les gens seront libres de <em>faire</em> avec Internet, elle r&eacute;pond aux demandes faites par divers gouvernements pour imposer des restrictions sur les citoyens du cyber-espace.

source: Part of the digital divide comes from artificial obstacles to the sharing of information. This includes the licenses of non-free software, and harmfully restrictive copyright laws. The Brazilian declaration sought measures to promote free software, but the US delegation was firmly against it (remember that the Bush campaign got money from Microsoft). The outcome was a sort of draw, with the final declaration presenting free software, open source, and proprietary software as equally legitimate. The US also insisted on praising so-called &ldquo;intellectual property rights&rdquo;. (That biased term <a href="/philosophy/words-to-avoid.html#IntellectualProperty"> promotes simplistic over-generalization</a>; for the sake of clear thinking about the issues of copyright law, and about the very different issues of patent law, that term should always be avoided.)
fr: Une partie de la fracture num&eacute;rique provient d'obstacles artificiels au partage de l'information. Ceci comprend les licences de logiciels non libres, et les lois restrictives n&eacute;fastes sur les droits d'auteur. La d&eacute;claration br&eacute;silienne recherchait des mesures pour promouvoir le logiciel libre, mais la d&eacute;l&eacute;gation am&eacute;ricaine y &eacute;tait fermement oppos&eacute;e (rappelez-vous que la campagne de Bush a obtenu de l'argent de Microsoft). Le r&eacute;sultat fut une sorte de match nul, avec la d&eacute;claration finale pr&eacute;sentant le logiciel libre, le logiciel open source, et le logiciel propri&eacute;taire comme &eacute;galement l&eacute;gitimes. Les &Eacute;tats-Unis ont &eacute;galement insist&eacute; sur l'&eacute;loge des soi-disants &laquo;&nbsp;droits de propri&eacute;t&eacute; intellectuelle&nbsp;&raquo (Ce terme tendancieux <a href="/philosophy/words-to-avoid.fr.html#IntellectualProperty">promeut une g&eacute;n&eacute;ralisation simpliste</a>; dans l'int&eacute;r&ecirc;t d'une r&eacute;flexion claire sur les cons&eacute;quences de la loi sur le droit d'auteur, et sur les cons&eacute;quences tr&egrave;s diff&eacute;rentes de la loi sur les brevets, ce terme devrait &ecirc;tre toujours &eacute;vit&eacute;).

source: The declaration calls on governments to ensure unhindered access to the public domain, but says nothing about whether any additional works should ever enter the public domain.
fr: La d&eacute;claration demande instamment aux gouvernements d'assurer un acc&egrave;s sans entrave au domaine public, mais ne dit rien au sujet de nouvelles œuvres qui pourraient entrer dans le domaine public.

source: Human rights were given lip service, but the proposal for a &ldquo;right to communicate&rdquo; (not merely to access information) using the internet was shot down by many of the countries. The summit has been criticized for situating its 2005 meeting in Tunisia, which is a prime example of what the information society must not do. People have been <a href="http://news.bbc.co.uk/1/hi/world/africa/2777389.stm"> imprisoned in Tunisia for using the internet to criticize the government</a>.
fr: Les droits de l'homme ont &eacute;t&eacute; reconnus pour la forme, mais la proposition pour un &laquo;&nbsp;droit de communiquer&nbsp;&raquo; (pas simplement d'acc&eacute;der &agrave; l'information) en utilisant Internet a &eacute;t&eacute; descendue par beaucoup pays. Le sommet a &eacute;t&eacute; critiqu&eacute; pour localiser sa r&eacute;union de 2005 en Tunisie, qui est un excellent exemple de ce que la soci&eacute;t&eacute; de l'information ne doit pas faire. Des gens ont &eacute;t&eacute; <a href="http://news.bbc.co.uk/1/hi/world/africa/2777389.stm">emprisonn&eacute;s en Tunisie pour avoir utilis&eacute; Internet pour critiquer le gouvernement</a>.

source: Suppression of criticism has been evident here at the summit too. A counter-summit, actually a series of talks and discussions, was planned for last Tuesday, but it was shut down by the Geneva police who clearly were searching for an excuse to do so. First they claimed that the landlord did not approve use of the space, but the tenant who has a long-term lease for the space then arrived and said he had authorized the event. So the police cited a fire code violation which I'm told is applicable to most buildings in Geneva&mdash;in effect, an all-purpose excuse to shut down anything. Press coverage of this maneuver eventually forced the city to allow the counter-summit to proceed on Wednesday in a different location.
fr: La r&eacute;pression de la critique a &eacute;t&eacute; &eacute;vidente ici aussi au sommet. Un contre-sommet, en fait une s&eacute;rie d'entretiens et de discussions, a &eacute;t&eacute; organis&eacute; pour mardi dernier, mais il a &eacute;t&eacute; arr&ecirc;t&eacute; d&eacute;finitivement par la police de Gen&egrave;ve qui cherchait clairement une excuse pour le faire. D'abord ils pr&eacute;tendirent que le propri&eacute;taire n'avait pas autoris&eacute; l'utilisation des lieux, mais le locataire qui a un bail &agrave; long terme pour les lieux arriva alors et dit qu'il avait autoris&eacute; l'&eacute;v&eacute;nement. Alors la police cita une violation du code contre l'incendie dont on m'a dit qu'il s'appliquait &agrave; la plupart des immeubles de Gen&egrave;ve &mdash; en fait, une excuse fourre-tout pour emp&ecirc;cher n'importe quoi. La couverture m&eacute;diatique de cette manœuvre for&ccedil;a finalement la ville &agrave; autoriser le contre-sommet &agrave; se poursuivre le mercredi dans un endroit diff&eacute;rent.

source: In a more minor act of suppression, the moderator of the official round table in which I spoke told me &ldquo;your time is up&rdquo; well before the three minutes each participant was supposed to have. She later did the same thing to the EPIC representative. I later learned that she works for the International Chamber of Commerce&mdash;no wonder she silenced us. And how telling that the summit would put a representative of the ICC at the throttle when we spoke.
fr: Dans un registre plus mineur de r&eacute;pression, la mod&eacute;ratrice de la table ronde officielle &agrave; laquelle je parlais me dit &laquo;&nbsp;c'est l'heure&nbsp;&raquo; bien avant les trois minutes que chaque participant &eacute;tait suppos&eacute; avoir. Elle fit plus tard la m&ecirc;me chose &agrave; un repr&eacute;sentant de EPIC. J'appris plus tard qu'elle travaillait pour la Chambre de commerce internationale &mdash; pas &eacute;tonnant qu'elle nous f&icirc;t taire. Et qu'il est r&eacute;v&eacute;lateur que le sommet mette unerepr&eacute;sentante de la Chambre de commerce internationale sur l'acc&eacute;l&eacute;rateur quand nous parlons.

source: Suppression was also visible in the exclusion of certain NGOs from the summit because their focus on human rights might embarrass the governments that trample them. For instance, the summit <a href="http://iso.hrichina.org/public/contents/13710"> refused to accredit Human Rights In China</a>, a group that criticizes the Chinese government for (among other things) censorship of the internet.
fr: La r&eacute;pression &eacute;tait &eacute;galement visible dans l'exclusion de certaines ONG du sommet car leur attention particuli&egrave;re sur les droits de l'homme pourrait embarrasser les gouvernements qui les pi&eacute;tinent. Par exemple, le sommet <a href="http://iso.hrichina.org/iso/news_item.adp?news_id=1527">a refus&eacute; d'accr&eacute;diter Human Rights In China</a>, un groupe qui critique le gouvernement chinois pour (entre autres choses) la censure de l'Internet.

source: <a href="http://www.rsf.org/article.php3?id_article=8774">Reporters Without Borders was also excluded</a> from the summit. To raise awareness of their exclusion, and of the censorship of the internet in various countries, they set up an unauthorized radio station in nearby France and handed out mini-radios, so that summit attendees could hear what the organization had been blocked from saying at the summit itself.
fr: <a href="http://www.rsf.org/article.php3?id_article=8774">Reporters sans fronti&egrave;res &eacute;tait &eacute;galement exclu</a> du sommet. Pour faire prendre conscience de leur exclusion, et de la censure d'Internet dans divers pays, ils ont install&eacute; une station de radio sans autorisation tout pr&egrave;s de la France et ont distribu&eacute; des mini-radios, de sorte que les participants du sommet puissent entendre ce que l'on avait emp&ecirc;ch&eacute; &agrave; l'organisation de dire au sommet lui-m&ecirc;me.

source: The summit may have a few useful side effects. For instance, several people came together to plan an organization to help organizations in Africa switch to GNU/Linux. But the summit did nothing to support this activity beyond providing an occasion for us to meet. Nor, I believe, was it intended to support any such thing. The overall attitude of the summit can be seen in its having invited Microsoft to speak alongside, and before, most of the various participating governments&mdash;as if to accord that criminal corporation the standing of a state.
fr: Le sommet peut avoir quelques effets de bord utiles. Par exemple, plusieurs personnes sont venues pour mettre en place une organisation pour aider les organisations en Afrique &agrave; basculer vers GNU/Linux. Mais le sommet n'a rien fait pour soutenir cette initiative en dehors de fournir une occasion pour nous rencontrer. Pas plus, je crois, qu'il n'&eacute;tait pr&eacute;vu qu'il soutienne d'autres initiatives de ce type. On peut se faire une id&eacute;e de l'attitude d'ensemble du sommet dans le fait qu'il a invit&eacute; Microsoft &agrave; parler au c&ocirc;t&eacute; de, et avant, la plupart des divers gouvernements participants &mdash; comme pour accorder &agrave; cette soci&eacute;t&eacute; criminelle le rang d'un &eacute;tat.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2003 Richard M. Stallman<br /> Verbatim copying and distribution of this entire article are permitted without royalty in any medium provided this notice is preserved.
fr: Copyright &copy; 2003 Richard M. Stallman<br />La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
