Repository: gitGNU/gnu_www-fr
Catalog: philosophy/x.*.po
Languages: fr

source: The X Window System Trap - GNU Project - Free Software Foundation (FSF)
fr: Le piège X Window System - GNU Project - Free Software Foundation (FSF)

source: GNU, FSF, Free Software Foundation, freedom, Richard Stallman, rms, free software movement
fr: GNU, FSF, Free Software Foundation, liberté, Richard Stallman, rms, mouvement du logiciel librE

source: Richard Stallman discusses the history of the movement to develop a free operating system.
fr: Richard Stallman discute de l'histoire du mouvement pour développer un système d'exploitation libre.

source: The X Window System Trap
fr: Le piège X Window System

source: by <strong>Richard M. Stallman</strong>
fr: par <strong>Richard M. Stallman</strong>

source: For many years, the X Consortium was the chief opponent of copyleft. It exerted both moral suasion and pressure to discourage free software developers from copylefting their programs. It used moral suasion by suggesting that it is not nice to say no. It used pressure through its rule that copylefted software could not be in the X Distribution.
fr: Depuis plusieurs années, le Consortium X est le chef de l'opposition au copyleft. Il a employé à la fois la persuasion et la pression morale pour décourager les développeurs de logiciel libre de mettre leur programme sous copyleft. Il a utilisé la persuasion morale en suggérant qu'il n'est pas bien de dire non. Il a utilisé la pression à travers sa règle qui veut qu'un logiciel sous copyleft ne peut pas figurer dans une distribution X.

source: Computer companies normally distribute proprietary software. They wanted free software developers to donate their work for such use. If they had asked for this directly, people would have laughed. But the X Consortium, fronting for them, could present this request as an unselfish one. &ldquo;Join us in donating our work to proprietary software developers,&rdquo; they said, suggesting that this is a noble form of self-sacrifice. &ldquo;Join us in achieving popularity,&rdquo; they said, suggesting that it was not even a sacrifice.
fr: Les sociétés informatiques distribuent normalement des logiciels propriétaires. Elles voulaient que les développeurs de logiciel libre donnent leur travail pour cette utilisation. Si elles le leur avaient demandé directement, les gens auraient rigolé. Mais le Consortium X, en les affrontant pour elles, pouvait présenter cette requête comme un acte désintéressé. Ils ont dit «&nbsp;Rejoignez-nous en donnant votre travail aux développeurs de logiciel propriétaire&nbsp;», en suggérant que c'est une forme noble de sacrifice de soi. «&nbsp;Rejoignez-nous en atteignant la popularité&nbsp;», suggérant en cela que ce n'était même pas un sacrifice.

source: There is an irony here. If you said yes when the X Consortium asked you not to use copyleft, you put the X Consortium in a position to license and restrict its version of your program, along with the code for the core of X.
fr: C'est plutôt ironique. Si vous aviez dit oui quand le Consortium X vous demandait de ne pas utiliser le copyleft, vous aviez mis le Consortium X en position de mettre sous licence et de restreindre sa version de votre programme, en plus du code du noyau de X.

source: The X Consortium and Open Group can no longer exert moral suasion by saying that it is wrong to say no. This will make it easier to decide to copyleft your X-related software.
fr: Le Consortium X et l'Open Group ne peuvent plus à présent exercer de pressions en disant qu'il n'est pas bien de dire non. Cela facilitera votre décision pour mettre sous copyleft votre programme relatif à X.

source: The issue is different for programs outside the core of X: applications, window managers, and additional libraries and widgets. There is no reason not to copyleft them, and we should copyleft them.
fr: Le problème est différent pour les programmes extérieurs au noyau de X: les applications, les gestionnaires de fenêtres, et les bibliothèques additionnelles et les widgets. Il n'y a pas de raison de ne pas les mettre sous copyleft, et nous devrions le faire.

source: At the same time, it is better if we do not feel too much need for popularity. When a businessman tempts you with &ldquo;more popularity,&rdquo; he may try to convince you that his use of your program is crucial to its success. Don't believe it! If your program is good, it will find many users anyway; you don't need to feel desperate for any particular users, and you will be stronger if you do not. You can get an indescribable sense of joy and freedom by responding, &ldquo;Take it or leave it&mdash;that's no skin off my back.&rdquo; Often the businessman will turn around and accept the program with copyleft, once you call the bluff.
fr: En même temps, il est préférable de ne pas ressentir un trop grand besoin de popularité. Quand un homme d'affaire vous tente avec «&nbsp;plus de popularité&nbsp;», il peut essayer de vous convaincre que son utilisation de votre programme est essentiel pour le succès de votre programme. Ne le croyez pas&nbsp;! Si votre programme est bon, il trouvera beaucoup d'utilisateurs de toutes façons&nbsp;; vous n'avez pas besoin de vous sentir désespéré pour certains utilisateurs en particulier, et vous serez plus fort si vous ne le faites pas. Vous pouvez avoir un sentiment indescriptible de joie et de liberté en répondant, «&nbsp;C'est à prendre ou à laisser &mdash;&nbsp;c'est sans conséquence pour moi&nbsp;». Souvent l'homme d'affaire fera demi-tour et acceptera le programme avec copyleft, une fois que vous l'aurez mis au défi.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Il existe aussi <a href="/contact/contact.fr.html">d'autres moyens de contacter</a> la FSF.

source: Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer (en anglais) les liens morts ou d'autres suggestions sur cette page web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
fr: Cette page peut-être utilisée suivant les conditions de la licence <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:
