Repository: gitGNU/gnu_www-fr
Catalog: philosophy/your-freedom-needs-free-software.*.po
Languages: fr

source: Your Freedom Needs Free Software
fr: Votre Libert&eacute; a besoin du logiciel libre

source: Many of us know that governments can threaten the human rights of software users through censorship and surveillance of the Internet. Many do not realize that the software they run on their home or work computers can be an even worse threat. Thinking of software as &lsquo;just a tool&rsquo;, they suppose that it obeys them, when in fact it often obeys others instead.
fr: Beaucoup d'entre nous savent que les gouvernements peuvent menacer les droits humains des utilisateurs de logiciel en censurant et surveillant Internet. Beaucoup n'ont pas conscience que le logiciel qu'ils utilisent sur leur ordinateur personnel ou sur leur lieu de travail, peut &ecirc;tre une menace encore pire. Consid&eacute;rant leur logiciel comme un simple outil, ils supposent qu'il leur ob&eacute;it, alors qu'en fait il ob&eacute;it souvent &agrave; d'autres.

source: The software running in most computers is <a href="/philosophy/categories.html#ProprietarySoftware">non-free, proprietary software</a>: controlled by software companies, not by its users. Users can't check what these programs do, nor prevent them from doing what they don't want. Most people accept this because they have seen no other way, but it is simply wrong to give developers power over the users' computer.
fr: Les logiciels utilis&eacute;s sur la plupart des ordinateurs sont <a href="/philosophy/categories.fr.html#ProprietarySoftware"> des logiciels propri&eacute;taires, non libres</a>&nbsp;: control&eacute;s par les entreprises qui les produisent, pas par leurs utilisateurs. Les utilisateurs ne peuvent pas savoir ce que font ces programmes, ni les emp&ecirc;cher de faire ce qu'ils ne souhaiteraient pas qu'ils fassent. La plupart des gens acceptent cet &eacute;tat de fait parce qu'ils ne voient pas comment il pourrait en &ecirc;tre autrement, mais c'est pourtant une erreur que de laisser aux d&eacute;veloppeurs un pouvoir sur les ordinateurs que l'on utilise.

source: This unjust power, as usual, tempts its wielders to further misdeeds. If a computer talks to a network, and you don't control the software in it, it can easily spy on you. Microsoft Windows spies on users; for instance, it reports what words a user searches for in her own files, and what other programs are installed. RealPlayer spies too; it reports what the user plays. Cell phones are full of non-free software, which spies. Cell phones send out localizing signals even when &lsquo;off&rsquo;, many can send out your precise GPS location whether you wish or not, and some models can be switched on remotely as listening devices. Users can't fix these malicious features because they don't have control.
fr: Ce pouvoir, injuste comme d'habitude, incite ses d&eacute;tenteurs &agrave; commettre d'autres m&eacute;faits. Si un ordinateur est reli&eacute; &agrave; un r&eacute;seau, et que vous n'avez pas de contr&ocirc;le sur les logiciels utilis&eacute;s, vous pouvez facilement &ecirc;tre espionn&eacute;. Microsoft Windows espionne les utilisateurs&nbsp;; par exemple il enregistre dans ses propres fichiers les mots dont ils se servent lors de leurs recherches et la liste des programmes install&eacute;s. RealPlayer espionne aussi en indiquant ce que lisent les utilisateurs. Les t&eacute;l&eacute;phones cellulaires sont truff&eacute;s de logiciels non libres, qui espionnent. Ils envoient des signaux de localisation m&ecirc;me lorsqu'ils sont &eacute;teints. Beaucoup peuvent envoyer votre localisation GPS pr&eacute;cise, que vous le souhaitiez ou non, et certains mod&egrave;les peuvent &ecirc;tre rallum&eacute;s &agrave; distance comme des appareils d'&eacute;coute clandestine. L'utilisateur ne peut pas corriger ces fonctions ind&eacute;sirables, car ce n'est pas lui qui contr&ocirc;le.

source: Microsoft has installed back doors for the US government's use in the past (<a href="http://www.heise.de/tp/r4/artikel/5/5263/1.html">reported on heise.de</a>). We cannot check whether they have successors today. Other proprietary programs may or may not have back doors, but since we cannot check them, we cannot trust them.
fr: Dans le pass&eacute;, Microsoft a install&eacute; des chevaux de Troie au service du gouvernement am&eacute;ricain (<a href="http://www.heise.de/tp/r4/artikel/5/5263/1.html">rapport&eacute; sur heise.de</a>). Nous ne pouvons pas v&eacute;rifier s'ils ont des successeurs aujourd'hui. Les autres programmes propri&eacute;taires peuvent contenir des chevaux de Troie, ou ne pas en contenir, mais puisque nous ne pouvons pas les v&eacute;rifier, nous ne pouvons pas leur faire confiance.

source: The only way to assure that your software is working for you is to insist on Free/Libre software. This means users get the source code, are free to study and change it, and are free to redistribute it with or without changes. The <a href="/gnu/linux-and-gnu.html">GNU/Linux system</a>, developed <a href="/gnu/">specifically for users' freedom</a>, includes office applications, multimedia, games, and everything you really need to run a computer. See <a href="http://www.gnewsense.org/">gNewSense.org</a> for a <a href="/distros">totally Free/Libre version of GNU/Linux</a>.
fr: La seule fa&ccedil;on de s'assurer que votre logiciel travaille pour vous est d'insister sur son caract&egrave;re libre. Cela signifie que les utilisateurs poss&egrave;dent le code source, sont libres de l'utiliser et de le changer, et sont libres de le redistribuer avec ou sans changement. Le <a href="/gnu/linux-and-gnu.fr.html">syst&egrave;me GNU/Linux</a>, d&eacute;velopp&eacute; <a href="/gnu/">sp&eacute;cialement en vue de la libert&eacute; de l'utilisateur</a>, inclut des applications bureautiques et multim&eacute;dias, des jeux et tout ce dont on a r&eacute;ellement besoin sur un ordinateur. Voir <a href="http://www.gnewsense.org/">gNewSense</a> pour une <a href="/distros">version totalement libre de GNU/Linux</a>.

source: A special problem occurs when activists for social change use proprietary software, because its developers, who control it, may be companies they wish to protest&mdash;or that work hand in glove with the states whose policies they oppose. Control of our software by a proprietary software company, whether it be Microsoft, Apple, Adobe or Skype, means control of what we can say, and to whom. This threatens our freedom in all areas of life.
fr: Un probl&egrave;me particulier advient lorsque des militants pour les droits sociaux utilisent des logiciels propri&eacute;taires, parce que leurs d&eacute;veloppeurs, qui les contr&ocirc;lent, peuvent &ecirc;tre les firmes contre lesquelles ils protestent ou qui travaillent main dans la main avec les &eacute;tats dont ils combattent la politique. Le contr&ocirc;le de nos logiciels par des entreprises de logiciels propri&eacute;taires, que ce soit Microsoft, Adobe, Apple ou Skype, signifie le contr&ocirc;le de ce que nous pouvons dire et de nos relations.

source: There is also danger in using a company's server to do your word processing or email&mdash;and not just if you are in China, as US lawyer Michael Springmann discovered. In 2003, AOL not only handed over to the police his confidential discussions with clients, it also made his email and his address list disappear, and didn't admit this was intentional until one of its staff made a slip. Springmann gave up on getting his data back.
fr: Il est &eacute;galement dangereux d'utiliser un serveur d'entreprise pour faire votre traitement de texte ou &eacute;crire vos mails, et pas seulement si vous &ecirc;tes en Chine comme l'a d&eacute;couvert l'avocat am&eacute;ricain Michael Springmann. En 2003, AOL a non seulement transmis ses discussions priv&eacute;es avec ses clients, mais a aussi fait disparaitre ses courriels et sa liste d'adresses, AOL refusant d'admettre que cela &eacute;tait intentionnel, jusqu'&agrave; ce qu'un de ses dirigeants vende la m&egrave;che. Springmann dut renoncer &agrave; r&eacute;cup&eacute;rer ses donn&eacute;es.

source: The US is not the only state that doesn't respect human rights, so keep your data on your own computer, and your backups under your own custody&mdash;and run your computer with Free/Libre software.
fr: Les &Eacute;tats-Unis ne sont pas le seul pays qui ne respecte pas les droits de l'homme&nbsp;; gardez donc vos donn&eacute;es sur votre propre ordinateur et vos sauvegardes en lieu s&ucirc;r, et faites tourner votre ordinateur avec des logiciels libres.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice, and the copyright notice, are preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Bertrand Potier.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
