Repository: gitGNU/gnu_www-fr
Catalog: education/education.*.po
Languages: fr

source: Free Software in Education - GNU Operating System
fr: Les logiciels libres dans l'éducation - GNU Operating System

source: Free Software Universities
fr: Les logiciels libres et les universités

source: More and more students are considering whether a university teaches computer science and software development using Free Software when deciding where they will study. Free Software means that students are free to study how the programs they use work and to learn how to adapt them for their own needs. Learning about Free Software can also help in studying software development ethics and professional practice. If you know of a Free-Software-oriented university then email <a href="mailto:webmasters@gnu.org">webmasters@gnu.org</a> to tell us about it so we can list it here.
fr: De plus en plus d'étudiants se posent la question de savoir si une université enseigne l'informatique et le développement en utilisant des logiciels libres quand vient le moment de choisir leur université. Des logiciels libres signifient que les étudiants sont libres d'étudier la façon dont fonctionnent les logiciels qu'ils utilisent et d'apprendre à les adpater à leurs propres besoins. Apprendre sur les logiciels libres peut aussi aider dans l'apprentissage de l'éthique de développement et des pratiques professionnelles. Si vous connaissez une université qui s'oriente vers les logiciels libres, veuillez envoyer un courriel à <a href="mailto:webmasters@gnu.org">webmasters@gnu.org</a> pour nous le signaler afin que nous la citions ici.

source: Is Your School Committed To Free Software?
fr: Votre école s'implique-t-elle dans les logiciels libres ?

source: If your school is committed to Free Software then we want to hear from you so that we can list it here. Has your school migrated to GNU/Linux, or has your school adopted the firm policy of rejecting proprietary software? If so, contact <a href="mailto:education@gnu.org">&lt;education@gnu.org&gt;</a> to let us know.
fr: Si votre école s'implique dans les logiciels libres, alors nous aimerions le savoir pour la lister ici. Votre école a-t-elle migré vers GNU/Linux, ou a-t-elle adopté une politique ferme de rejet des logiciels propriétaires&nbsp;? Si c'est la cas, contactez <a href="mailto:education@gnu.org">&lt;education@gnu.org&gt;</a> pour nous le faire savoir.

source: Free Software in Education
fr: Les logiciels libres dans l'éducation

source: <a href="/philosophy/free-sw.html">Free Software</a> can be a valuable resource in education. Not only can it be technically or pedagogically superior to proprietary alternatives, but it can also promote the values of the GNU project in the schools:
fr: <a href="/philosophy/free-sw.fr.html">Le logiciel libre</a> peut constituer une ressource précieuse dans l'enseignement. En effet, il peut être non seulement supérieur aux alternatives propriétaires d'un point de vue technique ou pédagogique, mais il peut aussi faire passer les valeurs du projet GNU au sein des établissements scolaires&nbsp;:

source: Freedom
fr: Liberté

source: Cooperation
fr: Coopération

source: Today, many students and schools don't even know about Free Software or the great advantages it brings. At the same time, software knowledgeability is required for more and more tasks, and Free Software has a distinct advantage in this field. If you are one of those kept in the dark until now, please read some of the informational material we've put together here.
fr: Aujourd'hui, beaucoup d'étudiants et d'établissements scolaires ne connaissent même pas les logiciels libres ou les grands avantages qu'ils apportent. En même temps, des compétences en informatique sont requises pour de plus en plus de tâches, et les logiciels libres ont un avantage sérieux sans ce domaine. Si vous faites partie de ceux qui sont restés dans le noir jusqu'à présent, veuillez lire les quelques informations que nous avons rassemblées ici.

source: Here is some information we have collected about the relationship between the GNU project and education (you can see more relationships by reading the <a href="/gnu/thegnuproject.html">history of the GNU project</a>). Please send your comments and suggestions about this information to GNU &amp; Education mailing list <a href="mailto:education@gnu.org">&lt;education@gnu.org&gt;</a>.
fr: Voici des informations que nous avons réunies sur les relations entre le projet GNU et l'enseignement (vous pourrez en apprendre plus en lisant <a href="/gnu/thegnuproject.fr.html">l'histoire du projet GNU</a>). Merci de faire part de vos commentaires et de vos suggestions à <a href="mailto:education@gnu.org"><em>education@gnu.org</em></a>.

source: Why?
fr: Pourquoi&nbsp;?

source: We're working closely with a new group, Free Software in Education, to produce these introductions. If you are not completely familiar with free software, learn why it's right for you!
fr: Nous travaillons en proche collaboration avec un nouveau groupe, les logiciels libres dans l'enseignement, pour produire ces introductions. Si vous n'êtes pas totalement familier avec les logiciels libres, découvrez pourquoi ils sont bons pour vous&nbsp;!

source: Each distributable, easily chewable material, such as the Students bulletin posting, leads to an online portal, tailored to the particular group, at which the interested can find out more about what free software means, learn how to use it, and of course get it.
fr: Chaque élément distribuable, facilement assimilable, comme les billets du journal des étudiants, mène à un portail en ligne, taillé sur mesure pour le groupe particulier, sur lequel l'intéressé peut en apprendre plus sur ce que signifie les logiciels libres, apprendre à les utiliser et bien sûr les télécharger.

source: A GNU idea, the Free Universal Encyclopedia and Learning Resource, became <a href="http://www.wikipedia.org">Wikipedia</a>. Learn about <a href="/encyclopedia/free-encyclopedia.html">why we need such a resource, and why you should care about it</a>.
fr: Une idée de GNU, l'Encyclopédie libre universelle et des ressources d'apprentissage, est devenue <a href="http://www.wikipedia.org">Wikipédia</a>. Découvrez <a href="/encyclopedia/free-encyclopedia.html">pourquoi nous avons besoin d'une telle ressource et pourquoi nous devons y faire attention</a>.

source: Articles:
fr: Articles&nbsp;:

source: <a href="/philosophy/schools.html">Why schools should exclusively use free software</a>, by Richard Stallman.
fr: <a href="/philosophy/schools.fr.html">Pourquoi les écoles devraient utiliser exclusivement des logiciels libres</a>, par Richard Stallman.

source: <a href="http://fsfeurope.org/projects/education/argumentation.en.html">Why give precedence to free software at school?</a>, by Jean Peyratout.
fr: <a href="http://fsfeurope.org/projects/education/argumentation.fr.html">Pourquoi préférer l'utilisation de logiciels libres dans l'Éducation&nbsp;?</a>, par Jean Peyratout.

source: How?
fr: Comment&nbsp;?

source: Our advice is to simply install a free operating system, or find an existing installation, and learn how to use it simply by using it.
fr: Notre conseil est juste d'installer un système d'exploitation libre ou de trouver une installation existante, et d'apprendre à s'en servir, simplement en l'utilisant. Cependant, ces ressources peuvent vous aider à faciliter la transition.

source: Mario Fux <a href="mailto:foxman@lugo.ch">&lt;foxman@lugo.ch></a> writes <a href="http://fsfeurope.org/projects/education/tgs/tgs.en.html"> &ldquo;TUX&amp;GNU@school&rdquo;</a> for <a href="http://fsfeurope.org/projects/education/education.en.html">FSF Europe's education project</a>. It reviews a piece of free education software in every issue.
fr: Mario Fux <a href="mailto:foxman@lugo.ch">&lt;foxman@lugo.ch></a> écrit <a href="http://fsfeurope.org/projects/education/tgs/tgs.fr.html">TUX&amp;GNU@school</a> pour le <a href="http://fsfeurope.org/projects/education/education.fr.html">projet éducation de la FSF Europe</a>. Il passe en revue des logiciels éducatifs libres pour chaque usage.

source: Events
fr: Événements

source: Some projects which promotes only free software and education are listed below. Please let us know of other educational events that follow the <a href="/philosophy/">GNU Philosophy</a>, by writing to GNU &amp; Education list at <a href="mailto:education@gnu.org">&lt;education@gnu.org&gt;</a>.
fr: Certains projets qui ne font la promotion que de logiciels libres dans l'éducation sont listés ci-dessous. Veuillez nous signaler tout autre événement concernant l'éducation qui suit la <a href="/philosophy/philosophy.fr.html">Philosophie GNU</a>, en écrivant à la liste de diffusion GNU &amp; Education à <a href="mailto:education@gnu.org"><em>education@gnu.org</em></a>.

source: Who's using it?
fr: Qui les utilisent&nbsp;?

source: There are some groups that maintain statistics of schools that use free software in several regions of the world:
fr: Certains groupes maintiennent des statistiques sur les écoles qui utilisent des logiciels libres dans plusieurs régions du monde&nbsp;:

source: We want to present some stories of classrooms and courses where free software is being used. Whether your usage is creative or not, please share your story. If you do, please send it to <a href="mailto:education@gnu.org">&lt;education@gnu.org&gt;</a>.
fr: Nous voulons présenter des expériences de classes ou de cours où les logiciels libres sont utilisés. Que votre utilisation soit créative ou pas, veuillez partager votre histoire. Si vous le faites, veuillez écrire à <a href="mailto:education@gnu.org">&lt;education@gnu.org&gt;</a>.

source: Advocacy
fr: Plaidoyer

source: Before we can advocate free software on a local level, as the Free Software in Education project would like to do, we need to figure out <em>how</em> to do that. We are looking for articles in our area. If you know a good link about free software and education, please contact us.
fr: Avant de plaider pour les logiciels libres à un échelon local, comme le projet Logiciels libres dans l'éducation voudrait le faire, nous devons trouver <em>comment</em> faire cela. Nous recherchons des articles concernant votre région. Si vous connaissez un bon lien sur les logiciels libres et l'éducation, veuillez nous contacter.

source: Free Education Software
fr: Logiciels libres dans l'éducation

source: We maintain a <a href="/education/software.html">list of free software and free software projects for education</a>.
fr: Nous maintenons une <a href="/education/software.html">de logiciels libres et de projets de logiciels libres pour l'éducation</a>.

source: Other Groups and Projects
fr: Autres groupes et projets

source: There are several groups and projects that are working with Free Software and Education. A few of them are listed below. If your project supports only free software and it is not listed here, please send an email to <a href="mailto:education@gnu.org">&lt;education@gnu.org&gt;</a>.
fr: Il existe plusieurs groupes et projets qui travaillent dans les logiciels libres et l'éducation. Certains d'entre-eux sont listés ci-dessous. Si votre projet ne soutient que les logiciels libres et qu'il n'est pas listé ici, veuillez envoyer un courriel à <a href="mailto:education@gnu.org">&lt;education@gnu.org&gt;</a>.

source: <a href="/education/freelearning.html">Free Learning Resources</a> is about bringing the principles of free software to educational materials and otherwise general knowledge.
fr: <a href="/education/freelearning.html">Free Learning Resources</a>, dont le but est d'apporter les principes du logiciel libre sur les supports dédiés à l'éducation ou à la connaissance en général.

source: <a href="http://www.gleducar.org.ar">Gleducar</a>, a GNU at education Argentinian project.
fr: <a href="http://www.gleducar.org.ar">Gleducar</a>, un projet argentin GNU dans l'éducation.

source: <a href="http://www.ofset.org">OFSET</a>, The Organization for Free Software in Education and Teaching, promotes the use of free software in education. <a href="http://www.ofset.org/freeduc-cd">Take a look at Freeduc-cd</a>, a live-cd for education setup by Ofset.
fr: <a href="http://www.ofset.org">OFSET</a>, The Organization for Free Software in Education and Teaching (Organisation pour les logiciels libres dans l'éducation et l'enseignement), qui soutient l'utilisation des logiciels libres dans l'éducation. <a href="http://www.ofset.org/freeduc-cd">Jetez un &oelig;il à Freeduc-cd</a>, un live-cd pour l'éducation créé par Ofset.

source: <a href="http://www.sugarlabs.org">Sugar Labs</a>, which provides the Sugar Learning Environment, promoting sharing, collaborative learning, and reflection.
fr: <a href="http://www.sugarlabs.org">Sugar Labs</a>, qui fournit le Sugar Learning Environment, soutien le partage et l'apprentissage collaboratif, et la réflexion.

source: You can help us
fr: Vous pouvez nous aider

source: If you know any educational project based on Free Software, please submit the project page and a brief description to <a href="mailto:education@gnu.org">&lt;education@gnu.org&gt;</a>.
fr: Si vous connaissez un projet éducatif basé sur les logiciels libres, veuillez nous soumettre la page du projet et une brève description à <a href="mailto:education@gnu.org">education@gnu.org</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traduction de cette page
