Repository: gitGNU/gnu_www-fr
Catalog: education/freelearning.*.po
Languages: fr

source: Free Learning Resources - GNU Project - Free Software Foundation (FSF)
fr: Ressources d'apprentissage libres - GNU Project - Free Software Foundation (FSF)

source: Free Learning Resources
fr: Ressources d'apprentissage libres

source: Often, Free software advocates find that they can logically translate their beliefs to other naturally abundant resources traditionally restricted by copyright. One of the most important of these is educational materials.
fr: Souvent, les avocats du logiciel libre trouvent qu'ils peuvent traduire logiquement leurs croyances pour d'autres ressources naturellement abondantes, traditionnellement restreintes par le droit d'auteur. L'une des plus importantes d'entre-elles sont les supports pour l'enseignement.

source: Free information is more widely distributed, thanks to its liberal licensing, and can therefore reach more of its knowledge-hungry audience.
fr: Les informations libres sont distribuées plus largement, grâce à leur mode de licence plus libérale, et peuvent par conséquent toucher une part plus importante de leur public assoiffé de connaissances.

source: The Free information meta-project is not nearly as far along as Free software, though. Thus, much of the focus right now is on creating Free information. Fortunately, while you need a great deal of software to operate a Free system, you don't need much Free information to learn something without losing your rights.
fr: Le méta-projet sur les informations libres n'est pas aussi avancé que celui sur les logiciels libres. Par conséquent, l'essentiel de l'attention se porte maintenant sur la création d'informations libres. Heureusement, alors que vous avez besoin d'un grand nombre de logiciels pour faire fonctionner un système d'exploitation libre, vous n'avez pas besoin de beaucoup d'informations pour apprendre quelque chose sans perdre vos droits.

source: Free Learning Projects
fr: Projets d'apprentissage libres

source: While we'd be pleased to collect as much as contributors submit to us, any Free contributions to any group would be welcome. Some other such groups, that support only Free materials, are listed below.
fr: Bien que nous serions heureux de collecter autant de contributions que possible, toute contribution libre à un quelconque groupe serait la bienvenue. D'autres groupe de ce type, qui ne soutiennent que les supports libres, sont listés ci-dessous&nbsp:

source: <a href="http://www.wikipedia.org/">Wikipedia</a> is the eclectic Free encyclopedia project, fulfilling the <a href="/encyclopedia/free-encyclopedia.html">Free Universal Encyclopedia and Learning Resource</a> concept proposed on gnu.org.
fr: <a href="http://www.wikipedia.org/">Wikipédia</a> est le projet d'encyclopédie éclectique libre, adressant le concept d'<a href="/encyclopedia/free-encyclopedia.html">encyclopédie universelle libre et de ressources d'apprentissage</a> proposé sur gnu.org.

source: <a href="http://promo.net/pg/">Project Gutenberg</a> publishes plain text versions of public-domain works. If you are looking for a copy of a classic book, your search should start on their FTP servers.
fr: Le <a href="http://promo.net/pg/">Projet Gutenberg</a> publie des versions en texte brut d'œuvres du domaine public. Si vous recherchez une copie d'un livre classique, vous devriez commencer vos recherches sur leurs serveurs FTP.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:education@gnu.org"><em>education@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
