Repository: gitGNU/gnu_www-fr
Catalog: gnu/byte-interview.*.po
Languages: fr

source: BYTE Interview with Richard Stallman - GNU Project - Free Software Foundation (FSF)
fr: Entretien de BYTE avec Richard Stallman - GNU Project - Free Software Foundation (FSF)

source: BYTE Interview with Richard Stallman
fr: Entretien de BYTE avec Richard Stallman

source: Conducted by David Betz and Jon Edwards
fr: Entretien dirig&eacute; par David Betz and Jon Edwards

source: Richard Stallman discusses his public-domain Unix-compatible software system with BYTE editors (July 1986)
fr: Richard Stallman s'entretient avec les R&eacute;dacteurs en chef de BYTE de son syst&egrave;me compatible Unix qui est dans le domaine public. (juillet 1986)

source: Richard Stallman has undertaken probably the most ambitious free software development project to date, the GNU system. In his GNU Manifesto, published in the March 1985 issue of Dr. Dobb's Journal, Stallman described GNU as a &ldquo;complete Unix-compatible software system which I am writing so that I can give it away free to everyone who can use it&hellip; Once GNU is written, everyone will be able to obtain good system software free, just like air.&rdquo; (GNU is an acronym for GNU's Not Unix; the &ldquo;G&rdquo; is pronounced.)
fr: Richard Stallman a entrepris ce qui est probablement le projet de d&eacute;veloppement de logiciel libre le plus ambitieux &agrave; ce jour, le syst&egrave;me GNU. Dans son Manifeste GNU, publi&eacute; en mars 1985 dans le Dr. Dobb's Journal, Stallman d&eacute;crivait GNU comme &laquo;&nbsp;un syst&egrave;me d'exploitation compl&egrave;tement compatible Unix, que je suis en train d'&eacute;crire dans le but de le distribuer librement &agrave; qui veut l'utiliser&hellip; Une fois GNU r&eacute;dig&eacute;, tout un chacun pourra obtenir un bon syst&egrave;me libre, tout comme l'air qu'on respire.&nbsp;&raquo; (GNU est un acronyme de GNU's Not Unix ; le &laquo;&nbsp;G&nbsp;&raquo; se prononce).

source: Stallman is widely known as the author of EMACS, a powerful text editor that he developed at the <abbr title="Massachusetts Institute of Technology">MIT</abbr> Artificial Intelligence Laboratory. It is no coincidence that the first piece of software produced as part of the GNU project was a new implementation of EMACS. GNU EMACS has already achieved a reputation as one of the best implementations of EMACS currently available at any price.
fr: Stallman est largement connu comme l'auteur d'EMACS, un &eacute;diteur de texte puissant qu'il a d&eacute;velopp&eacute; au Laboratoire d'intelligence artificielle du MIT. Ce n'est pas une co&iuml;ncidence si la premi&egrave;re pi&egrave;ce logicielle &agrave; faire partie du Projet GNU soit une nouvelle mise en &oelig;uvre d'EMACS. GNU EMACS s'est d&eacute;j&agrave; fait la r&eacute;putation d'une des meilleures mises en &oelig;uvre d'EMACS actuellement disponible quel que soit le prix.

source: <strong>BYTE</strong>: We read your GNU Manifesto in the March 1985 issue of Dr. Dobb's. What has happened since? Was that really the beginning, and how have you progressed since then?
fr: <strong>BYTE</strong>&nbsp;: Nous avons lu le Manifeste GNU en mars 1985, dans une &eacute;dition du Dr. Dobb's. Que s'est-il pass&eacute; depuis&nbsp;? Est-ce que c'&eacute;tait vraiment le tout d&eacute;but et comment avez-vous progress&eacute; depuis&nbsp;?

source: <strong>Stallman</strong>: The publication in Dr. Dobb's wasn't the beginning of the project. I wrote the GNU Manifesto when I was getting ready to start the project, as a proposal to ask computer manufacturers for funding. They didn't want to get involved, and I decided that rather than spend my time trying to pursue funds, I ought to spend it writing code. The manifesto was published about a year and a half after I had written it, when I had barely begun distributing the GNU EMACS. Since that time, in addition to making GNU EMACS more complete and making it run on many more computers, I have nearly finished the optimizing C compiler and all the other software that is needed for running C programs. This includes a source-level debugger that has many features that the other source-level debuggers on Unix don't have. For example, it has convenience variables within the debugger so you can save values, and it also has a history of all the values that you have printed out, making it tremendously easier to chase around list structures.
fr: <strong>Stallman</strong>&nbsp;: La publication dans Dr Dobb's n'a pas &eacute;t&eacute; le d&eacute;but du projet. J'ai &eacute;crit le Manifeste GNU quand j'ai &eacute;t&eacute; pr&ecirc;t &agrave; d&eacute;marrer le projet en tant que proposition de demande de fonds &agrave; des fabricants d'ordinateurs. Ils n'ont pas voulu s'impliquer, alors j'ai d&eacute;cid&eacute; qu'au lieu de perdre mon temps &agrave; chercher des fonds, je ferais mieux de le d&eacute;penser &agrave; &eacute;crire du code. Le Manifeste a &eacute;t&eacute; publi&eacute; &agrave; peu pr&egrave;s un an et demi apr&egrave;s que je l'ai &eacute;crit, au moment o&ugrave; je commen&ccedil;ais &agrave; peine &agrave; distribuer GNU EMACS. Depuis, en plus de rendre GNU EMACS plus complet et capable de fonctionner sur plus d'ordinateurs, j'ai presque termin&eacute; l'optimisation du compilateur C et de tous les logiciels n&eacute;cessaires aux programmes utilisant le C. Cela inclut un d&eacute;bogueur au niveau source qui a de nombreuses caract&eacute;ristiques que les autres d&eacute;bogueurs au niveau source sous Unix n'ont pas. Pour vous donner un exemple, il poss&egrave;de des variables pr&ecirc;tes &agrave; l'emploi qui permettent de sauvegarder des valeurs et il int&egrave;gre aussi un historique de toutes les variables que vous avez list&eacute;es, ce qui rend terriblement plus facile le d&eacute;pistage des structures de listes.

source: <strong>BYTE</strong>: You have finished an editor that is now widely distributed and you are about to finish the compiler.
fr: <strong>BYTE</strong>&nbsp;: Vous avez fini un &eacute;diteur qui est maintenant largement distribu&eacute; et vous &ecirc;tes sur le point de terminer le compilateur.

source: <strong>Stallman</strong>: I expect that it will be finished this October.
fr: <strong>Stallman</strong>&nbsp;:j'esp&egrave;re le finir pour octobre.

source: <strong>BYTE</strong>: What about the kernel?
fr: <strong>BYTE</strong>&nbsp;: Qu'en est-il du noyau&nbsp;?

source: <strong>Stallman</strong>: I'm currently planning to start with the kernel that was written at <abbr>MIT</abbr> and was released to the public recently with the idea that I would use it. This kernel is called TRIX; it's based on remote procedure call. I still need to add compatibility for a lot of the features of Unix which it doesn't have currently. I haven't started to work on that yet. I'm finishing the compiler before I go to work on the kernel. I am also going to have to rewrite the file system. I intend to make it failsafe just by having it write blocks in the proper order so that the disk structure is always consistent. Then I want to add version numbers. I have a complicated scheme to reconcile version numbers with the way people usually use Unix. You have to be able to specify filenames without version numbers, but you also have to be able to specify them with explicit version numbers, and these both need to work with ordinary Unix programs that have not been modified in any way to deal with the existence of this feature. I think I have a scheme for doing this, and only trying it will show me whether it really does the job.
fr: <strong>Stallman</strong>&nbsp;: Actuellement, je projette de commencer avec le noyau &eacute;crit au MIT et qui a &eacute;t&eacute; r&eacute;cemment rendu public que je pense utiliser. Ce noyau s'appelle TRIX ; il est bas&eacute; sur l'appel de proc&eacute;dure distant. Il faut que je lui ajoute les compatibilit&eacute;s avec de nombreuses caract&eacute;ristiques d'Unix qui lui manquent actuellement. Je n'ai pas encore commenc&eacute; &agrave; travailler dessus. Je termine le compilateur, avant de travailler sur le noyau. Il faudra aussi que je r&eacute;&eacute;crive le syst&egrave;me de fichiers. J'ai l'intention de le rendre fiable simplement en lui faisant &eacute;crire les blocs dans le bon ordre, de fa&ccedil;on &agrave; ce que la structure du disque soit toujours homog&egrave;ne. Ensuite, je veux ajouter des num&eacute;ros de version. J'ai un sch&eacute;ma compliqu&eacute; pour les concilier avec la fa&ccedil;on dont on utilise habituellement Unix. Il faut &agrave; la fois la possibilit&eacute; de sp&eacute;cifier des noms de fichiers sans num&eacute;ro de version ainsi que celle de les sp&eacute;cifier avec un num&eacute;ro de version explicite, sachant que tout cela doit fonctionner dans un programme Unix ordinaire qui n'a &eacute;t&eacute; aucunement modifi&eacute; pour tourner avec cette caract&eacute;ristique. J'ai une id&eacute;e directrice pour le faire, la tester sera le moyen pour moi de voir si &ccedil;a marche correctement.

source: <strong>BYTE</strong>: Do you have a brief description you can give us as to how GNU as a system will be superior to other systems? We know that one of your goals is to produce something that is compatible with Unix. But at least in the area of file systems you have already said that you are going to go beyond Unix and produce something that is better.
fr: <strong>BYTE</strong>&nbsp;: Pourriez-vous, en quelques mots, nous dire en quoi GNU, comme syst&egrave;me, sera sup&eacute;rieur aux autres syst&egrave;mes&nbsp;? Nous savons que votre but est de produire quelque chose qui soit compatible avec Unix. Quelques mots au moins en ce qui concerne les syst&egrave;mes de fichiers, dont vous avez dit que vous d&eacute;passerez Unix et que vous produirez quelque chose de mieux.

source: <strong>Stallman</strong>: The C compiler will produce better code and run faster. The debugger is better. With each piece I may or may not find a way to improve it. But there is no one answer to this question. To some extent I am getting the benefit of reimplementation, which makes many systems much better. To some extent it's because I have been in the field a long time and worked on many other systems. I therefore have many ideas to bring to bear. One way in which it will be better is that practically everything in the system will work on files of any size, on lines of any size, with any characters appearing in them. The Unix system is very bad in that regard. It's not anything new as a principle of software engineering that you shouldn't have arbitrary limits. But it just was the standard practice in writing Unix to put those in all the time, possibly just because they were writing it for a very small computer. The only limit in the GNU system is when your program runs out of memory because it tried to work on too much data and there is no place to keep it all.
fr: <strong>Stallman</strong>&nbsp;: Le compilateur C produira un meilleur code et tournera plus vite. Le d&eacute;bogueur est meilleur. Je peux, ou non, trouver un moyen d'am&eacute;liorer chaque &eacute;l&eacute;ment. Mais il n'y a pas qu'une r&eacute;ponse &agrave; cette question. Dans une certaine mesure, je tire b&eacute;n&eacute;fice de la remise &agrave; plat, qui am&eacute;liore grandement beaucoup de syst&egrave;mes. Dans une autre mesure, c'est parce que je suis dans le milieu depuis longtemps et que j'ai travaill&eacute; sur de nombreux autres syst&egrave;mes que j'ai beaucoup d'id&eacute;es &agrave; mettre sur le tapis. Une des raisons pour lesquelles il sera meilleur est que pratiquement tout dans le syst&egrave;me s'accommodera de fichiers de n'importe quelle taille, quels que soient le nombres de lignes, quels que soient les caract&egrave;res qu'ils contiennent. Le syst&egrave;me Unix est tr&egrave;s mauvais sur ce plan. Ce n'est pas un principe nouveau dans l'ing&eacute;nierie logicielle qu'il ne doit pas y avoir de limites arbitraires. C'&eacute;tait simplement une pratique standard en &eacute;crivant Unix de les placer tout le temps, peut-&ecirc;tre bien tout simplement parce qu'ils l'&eacute;crivaient pour des ordinateurs tr&egrave;s modestes. La seule limite, dans le syst&egrave;me GNU, est que votre programme soit &agrave; cours de m&eacute;moire parce qu'il essaye de travailler avec trop de donn&eacute;es et qu'il ne peut les garder toutes.

source: <strong>BYTE</strong>: And that isn't likely to be hit if you've got virtual memory. You may just take forever to come up with the solution.
fr: <strong>BYTE</strong>&nbsp;: Et il y a peu de chance que cela arrive si vous avez de la m&eacute;moire virtuelle. Il suffit juste de patienter pour obtenir la solution.

source: <strong>Stallman</strong>: Actually these limits tend to hit in a time long before you take forever to come up with the solution.
fr: <strong>Stallman</strong>&nbsp;: En fait, ces limites tendent &agrave; &ecirc;tre atteintes bien avant que vous ayez trouv&eacute; la solution.

source: <strong>BYTE</strong>: Can you say something about what types of machines and environments GNU EMACS in particular has been made to run under? It's now running on VAXes; has it migrated in any form to personal computers?
fr: <strong>BYTE</strong>&nbsp;: Avez-vous des pr&eacute;cisions sur les types de machines et environnements pour lesquels GNU EMACS en particulier a &eacute;t&eacute; con&ccedil;u&nbsp;? Il fonctionne maintenant sur des VAX ; est-ce qu'il a &eacute;t&eacute; adapt&eacute; et de quelle fa&ccedil;on, vers des ordinateurs personnels&nbsp;?

source: <strong>Stallman</strong>: I'm not sure what you mean by personal computers. For example, is a Sun a personal computer? GNU EMACS requires at least a megabyte of available memory and preferably more. It is normally used on machines that have virtual memory. Except for various technical problems in a few C compilers, almost any machine with virtual memory and running a fairly recent version of Unix will run GNU EMACS, and most of them currently do.
fr: <strong>Stallman</strong>&nbsp;: Je ne suis pas certain de savoir ce que vous entendez par ordinateurs personnels. Par exemple, est-ce qu'un Sun est un ordinateur personnel&nbsp;? GNU EMACS demande au moins un mega-octet de m&eacute;moire disponible, plus ce serait mieux. On l'utilise normalement sur des machines qui ont de la m&eacute;moire virtuelle. Mis &agrave; part divers probl&egrave;mes techniques pour quelques compilateurs C, pratiquement n'importe quelle machine avec de la m&eacute;moire virtuelle et tournant sous une version relativement r&eacute;cente d'Unix, pourra faire fonctionner GNU EMACS, ce qui est le cas de la plupart d'entre elles.

source: <strong>BYTE</strong>: Has anyone tried to port it to Ataris or Macintoshes?
fr: <strong>BYTE</strong>&nbsp;: Personne n'a jamais tent&eacute; de le porter sur Atari ou Macintosh&nbsp;?

source: <strong>Stallman</strong>: The Atari 1040ST still doesn't have quite enough memory. The next Atari machine, I expect, will run it. I also think that future Ataris will have some forms of memory mapping. Of course, I am not designing the software to run on the kinds of computers that are prevalent today. I knew when I started this project it was going to take a few years. I therefore decided that I didn't want to make a worse system by taking on the additional challenge of making it run in the currently constrained environment. So instead I decided I'm going to write it in the way that seems the most natural and best. I am confident that in a couple of years machines of sufficient size will be prevalent. In fact, increases in memory size are happening so fast it surprises me how slow most of the people are to put in virtual memory; I think it is totally essential.
fr: <strong>Stallman</strong>&nbsp;: L'Atari 1040ST n'a toujours pas assez de m&eacute;moire. J'esp&egrave;re que le prochain Atari pourra le faire tourner. Je pense aussi que les prochaines machines Atari auront une mani&egrave;re ou une autre de mapper la m&eacute;moire. Bien entendu, je ne cr&eacute;e pas le logiciel pour qu'il fonctionne sur les types d'ordinateurs qui pr&eacute;dominent aujourd'hui. Quand j'ai commenc&eacute; ce projet, je savais que cela allait prendre quelques ann&eacute;es. C'est pour cela que j'ai d&eacute;cid&eacute; que je ne voulais pas d'un syst&egrave;me qui serait pire si, d&eacute;fi suppl&eacute;mentaire, je voulais le faire fonctionner dans les contraintes des environnements actuels. J'ai plut&ocirc;t d&eacute;cid&eacute; de l'&eacute;crire dans le sens qui semblait le plus naturel et le meilleur. Je suis convaincu que dans quelques temps, des machines de taille suffisante pr&eacute;domineront. En fait, l'accroissement de la taille m&eacute;moire va &agrave; une telle vitesse que la lenteur avec laquelle la plupart des gens se penche sur l'utilisation de la m&eacute;moire virtuelle me surprend ; je pense que c'est vraiment essentiel.

source: <strong>BYTE</strong>: I think people don't really view it as being necessary for single-user machines.
fr: <strong>BYTE</strong>&nbsp;: Je pense que les gens ne consid&egrave;rent pas vraiment cela n&eacute;cessaire pour une machine mono-utilisateur.

source: <strong>Stallman</strong>: They don't understand that single user doesn't mean single program. Certainly for any Unix-like system it's important to be able to run lots of different processes at the same time even if there is only one of you. You could run GNU EMACS on a nonvirtual-memory machine with enough memory, but you couldn't run the rest of the GNU system very well or a Unix system very well.
fr: <strong>Stallman</strong>&nbsp;: Ce qu'ils ne comprennent pas, c'est que mono-utilisateur ne veut pas dire un seul programme. Il est certain que pour tout syst&egrave;me ressemblant &agrave; un syst&egrave;me Unix, il est important de pouvoir faire fonctionner beaucoup de diff&eacute;rents processus au m&ecirc;me moment, m&ecirc;me s'il n'y en a qu'un qui vous concerne. Vous pourriez lancer GNU EMACS sur une machine n'ayant pas de m&eacute;moire virtuelle, mais avec assez de m&eacute;moire, mais vous ne pourriez pas lancer correctement le reste du syst&egrave;me GNU ou un syst&egrave;me Unix.

source: <strong>BYTE</strong>: How much of LISP is present in GNU EMACS? It occurred to me that it may be useful to use that as a tool for learning LISP.
fr: <strong>BYTE</strong>&nbsp;: Quelle est la part de LISP dans GNU EMACS ? Il me semble que ce serait utile de l'utiliser comme outil d'apprentissage du LISP.

source: <strong>Stallman</strong>: You can certainly do that. GNU EMACS contains a complete, although not very powerful, LISP system. It's powerful enough for writing editor commands. It's not comparable with, say, a Common LISP System, something you could really use for system programming, but it has all the things that LISP needs to have.
fr: <strong>Stallman</strong>&nbsp;: Vous pouvez parfaitement le faire. GNU EMACS poss&egrave;de un syst&egrave;me LISP complet, bien que pas tr&egrave;s puissant. Assez puissant tout de m&ecirc;me pour &eacute;crire des commandes d'&eacute;diteur. Il faut bien avouer qu'il n'est pas comparable au Common LISP System, quelque chose qu'on pourrait utiliser pour programmer un syst&egrave;me, mais il a tout ce dont LISP a besoin.

source: <strong>BYTE</strong>: Do you have any predictions about when you would be likely to distribute a workable environment in which, if we put it on our machines or workstations, we could actually get reasonable work done without using anything other than code that you distribute?
fr: <strong>BYTE</strong>&nbsp;: Pourriez-vous pr&eacute;dire quand, vraisemblablement, vous seriez &agrave; m&ecirc;me de distribuer un environnement fonctionnel qui, si nous l'installions dans nos ordinateurs ou stations de travail, effectuerait vraiment un travail correct, et cela sans utiliser autre chose que le code que vous distribuez&nbsp;?

source: <strong>Stallman</strong>: It's really hard to say. That could happen in a year, but of course it could take longer. It could also conceivably take less, but that's not too likely anymore. I think I'll have the compiler finished in a month or two. The only other large piece of work I really have to do is in the kernel. I first predicted GNU would take something like two years, but it has now been two and a half years and I'm still not finished. Part of the reason for the delay is that I spent a lot of time working on one compiler that turned out to be a dead end. I had to rewrite it completely. Another reason is that I spent so much time on GNU EMACS. I originally thought I wouldn't have to do that at all.
fr: <strong>Stallman</strong>&nbsp;: C'est vraiment difficile &agrave; dire. Cela pourrait arriver dans un an, mais bien entendu, cela pourrait prendre plus de temps. Ou moins, mais ce n'est pas probable non plus. Je pense finir le compilateur dans un mois ou deux. La seule grosse t&acirc;che &agrave; laquelle il faut que je m'attelle est le noyau. J'avais pr&eacute;dit dans un premier temps que GNU prendrait quelque chose comme deux ans, mais cela fait maintenant deux ans et demi et je n'ai toujours pas termin&eacute;. Une des raisons qui explique ce d&eacute;lai est que j'ai d&eacute;pens&eacute; beaucoup de temps &agrave; travailler sur un compilateur qui a fini par tomber dans une impasse. J'ai d&ucirc; le r&eacute;&eacute;crire compl&egrave;tement. Une autre raison est que j'ai pass&eacute; beaucoup, beaucoup de temps sur GNU EMACS. Au d&eacute;but, je ne pensais pas du tout avoir &agrave; le faire.

source: <strong>BYTE</strong>: Tell us about your distribution scheme.
fr: <strong>BYTE</strong>&nbsp;: Parlez-nous de votre sch&eacute;ma de distribution.

source: <strong>Stallman</strong>: I don't put software or manuals in the public domain, and the reason is that I want to make sure that all the users get the freedom to share. I don't want anyone making an improved version of a program I wrote and distributing it as proprietary. I don't want that to ever be able to happen. I want to encourage the free improvements to these programs, and the best way to do that is to take away any temptation for a person to make improvements nonfree. Yes, a few of them will refrain from making improvements, but a lot of others will make the same improvements and they'll make them free.
fr: <strong>Stallman</strong>&nbsp;: Je ne mets pas les logiciels ou les manuels dans le domaine public&nbsp;; la raison en est que je veux m'assurer que tous les utilisateurs aient la libert&eacute; de partager. Je ne veux pas que n'importe qui am&eacute;liore un programme que j'aurais &eacute;crit et qu'il le distribue sous un format propri&eacute;taire. Je ne veux m&ecirc;me pas qu'il soit possible que cela arrive. Je veux encourager les libres am&eacute;liorations de ces programmes et le meilleur moyen d'y parvenir est de bannir toute tentation d'am&eacute;lioration qui ne soit pas libre. Oui, certains d'entre eux se retiendront d'ajouter des perfectionnements, mais beaucoup d'autres feront les m&ecirc;mes perfectionnements et ils le feront librement.

source: <strong>BYTE</strong>: And how do you go about guaranteeing that?
fr: <strong>BYTE</strong>&nbsp;: Et comment allez-vous faire pour le garantir&nbsp;?
