Repository: gitGNU/gnu_www-fr
Catalog: gnu/byte-interview.*.po
Languages: fr

source: <strong>Stallman</strong>: I do this by copyrighting the programs and putting on a notice giving people explicit permission to copy the programs and change them but only on the condition that they distribute under the same terms that I used, if at all. You don't have to distribute the changes you make to any of my programs&mdash;you can just do it for yourself, and you don't have to give it to anyone or tell anyone. But if you do give it to someone else, you have to do it under the same terms that I use.
fr: <strong>Stallman</strong>&nbsp;: Je le garantis en mettant un copyright sur ces programmes et en communiquant une notice donnant aux gens la permission explicite decopier le programme et de le modifier, mais seulement &agrave; la condition qu'il soit distribu&eacute; sous les m&ecirc;mes termes que ceux que j'utilise. Vous n'&ecirc;tes pas oblig&eacute; de distribuer les changements effectu&eacute;s sur un de mes programmes&nbsp;; vous pouvez tr&egrave;s bien les faire pour vous seul, sans avoir &agrave; les donner ou en parler &agrave; qui que ce soit. Mais effectivement si vous les donnez &agrave; quelqu'un d'autre, vous devez le faire sous les m&ecirc;mes conditions que celles que j'utilise.

source: <strong>BYTE</strong>: Do you obtain any rights over the executable code derived from the C compiler?
fr: <strong>BYTE</strong>&nbsp;: Percevez-vous des droits sur le code ex&eacute;cutable d&eacute;riv&eacute; du compilateur C&nbsp;?

source: <strong>Stallman</strong>: The copyright law doesn't give me copyright on output from the compiler, so it doesn't give me a way to say anything about that, and in fact I don't try to. I don't sympathize with people developing proprietary products with any compiler, but it doesn't seem especially useful to try to stop them from developing them with this compiler, so I am not going to.
fr: <strong>Stallman</strong>&nbsp;: La loi sur le copyright ne me donne pas de copyright sur les gains provenants du compilateur, ce qui ne me donne pas d'occasion de me prononcer l&agrave;-dessus. Et de toutes fa&ccedil;ons, je n'essaye pas. Je ne sympathise pas avec ceux qui d&eacute;veloppent des produits propri&eacute;taires quel que soit le compilateur, mais il semblerait que cela ne soit pas tr&egrave;s utile de les arr&ecirc;ter de d&eacute;velopper quelque chose avec ce compilateur, alors je ne vais pas le faire.

source: <strong>BYTE</strong>: Do your restrictions apply if people take pieces of your code to produce other things as well?
fr: <strong>BYTE</strong>&nbsp;: Est-ce que vos restrictions s'appliquent si quelqu'un prend une partie de votre code pour en faire quelque chose d'autre&nbsp;?

source: <strong>Stallman</strong>: Yes, if they incorporate with changes any sizable piece. If it were two lines of code, that's nothing; copyright doesn't apply to that. Essentially, I have chosen these conditions so that first there is a copyright, which is what all the software hoarders use to stop everybody from doing anything, and then I add a notice giving up part of those rights. So the conditions talk only about the things that copyright applies to. I don't believe that the reason you should obey these conditions is because of the law. The reason you should obey is because an upright person when he distributes software encourages other people to share it further.
fr: <strong>Stallman</strong>&nbsp;: Oui, s'il inclut dans la modification un &eacute;l&eacute;ment d'importance. S'il s'agit de deux lignes de code, ce n'est pas grave ; le copyright ne s'applique pas dans ce cas. Pour aller &agrave; l'essentiel, j'ai choisi ces conditions pour que, tout d'abord il y ait un copyright - qui repr&eacute;sente tout ce que les th&eacute;sauriseurs de logiciels utilisent pour emp&ecirc;cher tout le monde de faire n'importe quoi - qui est suivi d'une notice que j'ai &eacute;crite, c&eacute;dant une partie de ces droits. Ainsi, les conditions ne concernent que les &eacute;l&eacute;ments sur lesquels le copyright s'applique. Je ne crois pas que la raison pour laquelle vous devriez ob&eacute;ir &agrave; ces conditions soit la loi. La raison pour laquelle vous devriez ob&eacute;ir est qu'une personne droite qui distribue un logiciel encourage les autres &agrave;le partager encore plus.

source: <strong>BYTE</strong>: In a sense you are enticing people into this mode of thinking by providing all of these interesting tools that they can use but only if they buy into your philosophy.
fr: <strong>BYTE</strong>&nbsp;: Dans un sens, vous attirez les gens dans cette fa&ccedil;on de penser en distribuant tous ces outils tr&egrave;s int&eacute;ressants qu'ils peuvent utiliser, mais seulement s'ils adh&egrave;rent &agrave; votre philosophie.

source: <strong>Stallman</strong>: Yes. You could also see it as using the legal system that software hoarders have set up against them. I'm using it to protect the public from them.
fr: <strong>Stallman</strong>&nbsp;: Oui. Vous pouvez aussi le voir comme l'utilisation du syst&egrave;me l&eacute;gal que les th&eacute;sauriseurs de logiciels ont &eacute;rig&eacute; contre eux. Je l'utilise pour prot&eacute;ger le public contre eux.

source: <strong>BYTE</strong>: Given that manufacturers haven't wanted to fund the project, who do you think will use the GNU system when it is done?
fr: <strong>BYTE</strong>&nbsp;: &Eacute;tant donn&eacute; que les constructeurs n'ont pas voulu financer le projet, &agrave; votre avis qui utilisera le syst&egrave;me GNU quand il sera termin&eacute;&nbsp;?

source: <strong>Stallman</strong>: I have no idea, but it is not an important question. My purpose is to make it possible for people to reject the chains that come with proprietary software. I know that there are people who want to do that. Now, there may be others who don't care, but they are not my concern. I feel a bit sad for them and for the people that they influence. Right now a person who perceives the unpleasantness of the terms of proprietary software feels that he is stuck and has no alternative except not to use a computer. Well, I am going to give him a comfortable alternative.
fr: <strong>Stallman</strong>&nbsp;: Je n'en ai aucune id&eacute;e, mais ce n'est pas une question importante. Mon but est de le rendre possible pour les gens, pour qu'ils rejettent les boulets tra&icirc;n&eacute;s par les logiciels propri&eacute;taires. Je sais qu'il y a des gens qui veulent faire cela. Maintenant, il peut y en avoir qui ne s'en soucient gu&egrave;re, mais je ne m'en pr&eacute;occupe pas. Je me sens un peu triste pour eux et pour les personnes qu'ils influencent. De nos jours, la personne qui per&ccedil;oit le caract&egrave;re d&eacute;plaisant des conditions des logiciels propri&eacute;taires se sent pieds et poings li&eacute;s et n'a d'autres alternatives que de ne pas utiliser d'ordinateur. Eh bien, &agrave; cette personne, je vais donner une alternative confortable.

source: Other people may use the GNU system simply because it is technically superior. For example, my C compiler is producing about as good a code as I have seen from any C compiler. And GNU EMACS is generally regarded as being far superior to the commercial competition. And GNU EMACS was not funded by anyone either, but everyone is using it. I therefore think that many people will use the rest of the GNU system because of its technical advantages. But I would be doing a GNU system even if I didn't know how to make it technically better because I want it to be socially better. The GNU project is really a social project. It uses technical means to make a change in society.
fr: D'autres personnes peuvent utiliser le syst&egrave;me GNU pour sa sup&eacute;riorit&eacute; technologique. Pour prendre un exemple, mon compilateur C produit un code aussi bon que n'importe quel bon code que j'aie vu chez n'importe quel compilateur C. Et en g&eacute;n&eacute;ral, GNU EMACS est consid&eacute;r&eacute; comme largement sup&eacute;rieur &agrave; ce qui se fait chez la concurrence commerciale. De plus, GNU EMACS n'a &eacute;t&eacute; financ&eacute; par personne, mais tout le monde l'utilise. C'est ce qui me pousse &agrave; croire que beaucoup de gens utiliseront le reste du syst&egrave;me GNU &agrave; cause de ses avantages techniques. Mais je ferais un syst&egrave;me GNU m&ecirc;me si je ne savais pas comment le faire techniquement meilleur, parce que je le veux socialement meilleur. Le projet GNU est vraiment un projet social. Il utilise des aspects techniques pour op&eacute;rer des changements dans la soci&eacute;t&eacute;.

source: <strong>BYTE</strong>: Then it is fairly important to you that people adopt GNU. It is not just an academic exercise to produce this software to give it away to people. You hope it will change the way the software industry operates.
fr: <strong>BYTE</strong>&nbsp;: Pour vous, c'est bel et bien important que les gens adoptent GNU. Il ne s'agit pas uniquement d'un exercice de style, produire des logiciels qu'on c&egrave;de ensuite aux gens. Vous esp&eacute;rez que cela changera la fa&ccedil;on de faire dans l'industrie du logiciel.

source: <strong>Stallman</strong>: Yes. Some people say no one will ever use it because it doesn't have some attractive corporate logo on it, and other people say that they think it is tremendously important and everyone's going to want to use it. I have no way of knowing what is really going to happen. I don't know any other way to try to change the ugliness of the field that I find myself in, so this is what I have to do.
fr: <strong>Stallman</strong>&nbsp;: Oui. Certains disent que personne ne l'utilisera jamais sous pr&eacute;texte qu'il n'y a pas le logo d'une soci&eacute;t&eacute; s&eacute;duisante dessus et d'autres pensent que c'est terriblement important et que tout le monde voudra l'utiliser. Je n'ai pas les moyens de savoir ce qui va vraiment arriver. Je ne connais pas d'autres moyens pour essayer de changer la laideur du milieu dans lequel je me trouve, alors c'est ce que j'ai &agrave; faire.

source: <strong>BYTE</strong>: Can you address the implications? You obviously feel that this is an important political and social statement.
fr: <strong>BYTE</strong>&nbsp;: Pouvez-vous en donner les implications&nbsp;? Manifestement, vous pensez qu'il s'agit l&agrave; de bases importantes, politiquement et socialement.

source: <strong>Stallman</strong>: It is a change. I'm trying to change the way people approach knowledge and information in general. I think that to try to own knowledge, to try to control whether people are allowed to use it, or to try to stop other people from sharing it, is sabotage. It is an activity that benefits the person that does it at the cost of impoverishing all of society. One person gains one dollar by destroying two dollars' worth of wealth. I think a person with a conscience wouldn't do that sort of thing except perhaps if he would otherwise die. And of course the people who do this are fairly rich; I can only conclude that they are unscrupulous. I would like to see people get rewards for writing free software and for encouraging other people to use it. I don't want to see people get rewards for writing proprietary software because that is not really a contribution to society. The principle of capitalism is the idea that people manage to make money by producing things and thereby are encouraged to do what is useful, automatically, so to speak. But that doesn't work when it comes to owning knowledge. They are encouraged to do not really what's useful, and what really is useful is not encouraged. I think it is important to say that information is different from material objects like cars and loaves of bread because people can copy it and share it on their own and, if nobody attempts to stop them, they can change it and make it better for themselves. That is a useful thing for people to do. This isn't true of loaves of bread. If you have one loaf of bread and you want another, you can't just put your loaf of bread into a bread copier. you can't make another one except by going through all the steps that were used to make the first one. It therefore is irrelevant whether people are permitted to copy it&mdash;it's impossible.
fr: <strong>Stallman</strong>&nbsp;: C'est un changement. J'essaye de modifier l'approche qu'ont les gens de la connaissance et de l'information en g&eacute;n&eacute;ral. Je pense qu'essayer de s'approprier le savoir, d'en contr&ocirc;ler son utilisation ou d'essayer d'en emp&ecirc;cher le partage est un sabotage. C'est une activit&eacute; qui b&eacute;n&eacute;ficie &agrave; la personne qui le fait, au prix de l'appauvrissement de toute la soci&eacute;t&eacute;. Une personne gagne un dollar en en d&eacute;truisant deux. Je pense qu'une personne ayant une conscience ne ferait pas ce genre de chose, &agrave; moins de vouloir mourir. Et bien entendu, ceux qui le font sont passablement riches ; ma seule conclusion est leur manque total de scrupules. J'aimerais voir des gens r&eacute;compens&eacute;s d'&eacute;crire des logiciels libres et d'en encourager d'autres &agrave; les utiliser. Je ne veux pas voir des gens &ecirc;tre r&eacute;compens&eacute;s pour avoir &eacute;crit des logiciels propri&eacute;taires, parce que ce n'est vraiment pas une contribution &agrave; la soci&eacute;t&eacute;. Le principe du capitalisme r&eacute;side dans l'id&eacute;e que les gens peuvent faire de l'argent en produisant des choses et de fait, ils sont encourag&eacute;s &agrave; faire ce qui est utile, automatiquement, si on peut dire. Mais &ccedil;a ne marche pas quand il s'agit de poss&eacute;der la connaissance. Ils sont encourag&eacute;s &agrave; ne pas vraiment faire ce qui est utile et ce qui est r&eacute;ellement utile n'est pas encourag&eacute;. Je pense qu'il est important de dire que l'information diff&egrave;re des objets mat&eacute;riels, comme une voiture ou une baguette de pain, car on peut la copier, la partager de son propre chef et si personne ne cherche &agrave; nous en emp&ecirc;cher, on peut la changer et la rendre meilleure pour nous-m&ecirc;me. C'est l&agrave; une chose utile que l'on peut faire. Mais il n'en va pas de m&ecirc;me avec la baguette de pain. Si vous en avez une et que vous en voulez une autre, impossible de la mettre dans un copieur &agrave; baguettes de pain. Vous ne pouvez pas en fabriquer une autre sans passer par toutes les &eacute;tapes qu'il a fallu pour produire la premi&egrave;re. Qu'on ait le droit de la copier ne veut rien dire&nbsp;: c'est impossible.

source: Books were printed only on printing presses until recently. It was possible to make a copy yourself by hand, but it wasn't practical because it took so much more work than using a printing press. And it produced something so much less attractive that, for all intents and purposes, you could act as if it were impossible to make books except by mass producing them. And therefore copyright didn't really take any freedom away from the reading public. There wasn't anything that a book purchaser could do that was forbidden by copyright.
fr: Jusqu'&agrave; r&eacute;cemment, les livres &eacute;taient imprim&eacute;s uniquement gr&acirc;ce &agrave; des presses. Il &eacute;tait possible de faire soi-m&ecirc;me une copie &agrave; la main, mais ce n'&eacute;tait pas pratique car cela prenait tellement plus de temps que d'utiliser la presse. Et cela donnait quelque chose de si peu attrayant que m&ecirc;me avec les meilleurs intentions du monde, on ne pouvait faire que comme s'il &eacute;tait impossible de fabriquer un livre, sauf en masse. Du coup, le copyright n'a pas vraiment &ocirc;t&eacute; de libert&eacute; aux lecteurs. Il n'y avait rien qu'un acqu&eacute;reur de livre puisse faire qui n'&eacute;tait interdit par le copyright.

source: But this isn't true for computer programs. It's also not true for tape cassettes. It's partly false now for books, but it is still true that for most books it is more expensive and certainly a lot more work to Xerox them than to buy a copy, and the result is still less attractive. Right now we are in a period where the situation that made copyright harmless and acceptable is changing to a situation where copyright will become destructive and intolerable. So the people who are slandered as &ldquo;pirates&rdquo; are in fact the people who are trying to do something useful that they have been forbidden to do. The copyright laws are entirely designed to help people take complete control over the use of some information for their own good. But they aren't designed to help people who want to make sure that the information is accessible to the public and stop others from depriving the public. I think that the law should recognize a class of works that are owned by the public, which is different from public domain in the same sense that a public park is different from something found in a garbage can. It's not there for anybody to take away, it's there for everyone to use but for no one to impede. Anybody in the public who finds himself being deprived of the derivative work of something owned by the public should be able to sue about it.
fr: Mais cela n'est pas vrai des programmes informatiques. Ce n'est pas vrai non plus pour les bandes. C'est partiellement faux maintenant pour les livres, mais il est toujours vrai que pour la plupart des livres, cela revient plus cher et demande certainement plus de travail de les photocopier que d'en acheter une copie, pour un r&eacute;sultat peu probant. Nous sommes actuellement dans une p&eacute;riode o&ugrave; la situation qui a rendu le copyright inoffensif et acceptable est en train de se changer en situation o&ugrave; le copyright deviendra destructif et intol&eacute;rable. Alors, ceux que l'on traite de &laquo;&nbsp;pirates&nbsp;&raquo; sont en fait des gens qui essayent de faire quelque chose d'utile, quelque chose dont ils n'avaient pas le droit. Les lois sur le copyright sont enti&egrave;rement destin&eacute;es &agrave; favoriser les gens &agrave; prendre un contr&ocirc;le total sur l'utilisation d'une information pour leur propre b&eacute;n&eacute;fice. Elles ne sont pas faites, au contraire, pour aider les gens d&eacute;sirant s'assurer que l'information est accessible au public ni emp&ecirc;cher que d'autres l'en d&eacute;poss&egrave;dent. Je pense que la loi devrait reconna&icirc;tre une certaine classe de travaux appartenant au public, ce qui est diff&eacute;rent du domaine public, de la m&ecirc;me fa&ccedil;on qu'un jardin public diff&egrave;re de quelque chose trouv&eacute; dans une poubelle. Elle n'est pas l&agrave; pour que n'importe qui la d&eacute;tourne, elle est l&agrave; pour que chacun l'utilise mais sans g&ecirc;ner personne. Toute personne dans le public qui se retrouve d&eacute;poss&eacute;d&eacute;e d'un travail d&eacute;riv&eacute; issu de quelque chose poss&eacute;d&eacute; par le public devrait &ecirc;tre capable d'en faire la demande.

source: <strong>BYTE</strong>: But aren't pirates interested in getting copies of programs because they want to use those programs, not because they want to use that knowledge to produce something better?
fr: <strong>BYTE</strong>&nbsp;: Mais les pirates, ce qui les int&eacute;ressent, c'est de se procurer des copies de programmes pour les utiliser, par pour en utiliser la connaissance afin de g&eacute;n&eacute;rer quelque chose de meilleur.

source: <strong>Stallman</strong>: I don't see that that's the important distinction. More people using a program means that the program contributes more to society. You have a loaf of bread that could be eaten either once or a million times.
fr: <strong>Stallman</strong>&nbsp;: Je ne pense pas que ce soit l&agrave; la distinction importante. Que plus de gens utilisent un programme, sous-tend que ce programme contribue plus &agrave; la soci&eacute;t&eacute;. Vous avez une baguette de pain qui peut se manger une fois ou un million.

source: <strong>BYTE</strong>: Some users buy commercial software to obtain support. How does your distribution scheme provide support?
fr: <strong>BYTE</strong>&nbsp;: Certains utilisateurs ach&egrave;tent un logiciel commercial &agrave; cause du support technique. Comment l'organisation de votre distribution pr&eacute;voit-elle un tel support&nbsp;?

source: <strong>Stallman</strong>: I suspect that those users are misled and are not thinking clearly. It is certainly useful to have support, but when they start thinking about how that has something to do with selling software or with the software being proprietary, at that point they are confusing themselves. There is no guarantee that proprietary software will receive good support. Simply because sellers say that they provide support, that doesn't mean it will be any good. And they may go out of business. In fact, people think that GNU EMACS has better support than commercial EMACSes. One of the reasons is that I'm probably a better hacker than the people who wrote the other EMACSes, but the other reason is that everyone has sources and there are so many people interested in figuring out how to do things with it that you don't have to get your support from me. Even just the free support that consists of my fixing bugs people report to me and incorporating that in the next release has given people a good level of support. You can always hire somebody to solve a problem for you, and when the software is free you have a competitive market for the support. You can hire anybody. I distribute a service list with EMACS, a list of people's names and phone numbers and what they charge to provide support.
fr: <strong>Stallman</strong>&nbsp;: Je soup&ccedil;onne ces utilisateurs d'avoir &eacute;t&eacute; tromp&eacute;s et d'avoir des pens&eacute;es confuses. Il est certainement tr&egrave;s utile d'avoir un support technique, mais lorsqu'ils commencent &agrave; penser comment cela a &agrave; voir avec la vente de logiciel ou si le logiciel est propri&eacute;taire, &agrave; ce niveau l&agrave;, ils s'embrouillent tout seul. Il n'y a pas de garantie qu'un logiciel propri&eacute;taire fournisse un bon support technique. Tout simplement parce que ce n'est pas parce qu'un vendeur dit qu'il assure le support technique que ce dernier sera bon. Il peut passer &agrave; c&ocirc;t&eacute; d'une affaire. En fait, les gens pensent que GNU EMACS a un meilleur support technique que les produits commerciaux y ressemblant. Une des raisons est que je suis probablement un meilleur hacker que les personnes qui ont &eacute;crit les autres produits ressemblant &agrave; EMACS, mais l'autre raison est que tout le monde a les sources et qu'il y a tellement de monde qui se passionne pour voir comment faire pour que &ccedil;a marche, qu'il n'est pas besoin que j'assume le support technique. &Agrave; la limite, ce qui a assur&eacute; un bon support gratuit, c'est que je corrige les bogues qu'on m'a rapport&eacute;s et que je mette &agrave; jour les versions suivantes. Vous pouvez toujours payer quelqu'un pour r&eacute;soudre un probl&egrave;me &agrave; votre place et dans le cas d'un logiciel libre, vous avez un march&eacute; comp&eacute;titif en ce qui concerne le support technique. Vous pouvez engager qui bon vous semble. Je distribue une liste de services avec EMACS, contenant les noms et num&eacute;ros de t&eacute;l&eacute;phone, ainsi que leur r&ocirc;le, des personnes en charge du support.

source: <strong>BYTE</strong>: Do you collect their bug fixes?
fr: <strong>BYTE</strong>&nbsp;: Rassemblez-vous leurs corrections de bogues&nbsp;?
