Repository: gitGNU/gnu_www-fr
Catalog: gnu/byte-interview.*.po
Languages: fr

source: <strong>Stallman</strong>: Well, they send them to me. I asked all the people who wanted to be listed to promise that they would never ask any of their customers to keep secret whatever they were told or any changes they were given to the GNU software as part of that support.
fr: <strong>Stallman</strong>&nbsp;: Eh bien, ils me les envoient. J'ai demand&eacute; &agrave; toutes les personnes qui voulaient &ecirc;tre sur la liste la promesse (cela fait partie du support) qu'ils ne demandent jamais &agrave; aucun de leurs clients de garder le secret, quoi qu'ils aient entendu ou quelles que soient les modifications qu'on leur aurait donn&eacute; sur un logiciel GNU.

source: <strong>BYTE</strong>: So you can't have people competing to provide support based on their knowing the solution to some problem that somebody else doesn't know.
fr: <strong>BYTE</strong>&nbsp;: Donc, vous ne pouvez pas avoir de personnes qui soient en comp&eacute;tition pour fournir un support bas&eacute; sur le fait qu'ils savent qu'ils ont la solution &agrave; un probl&egrave;me, alors que les autres non.

source: <strong>Stallman</strong>: No. They can compete based on their being clever and more likely to find the solution to your problem, or their already understanding more of the common problems, or knowing better how to explain to you what you should do. These are all ways they can compete. They can try to do better, but they cannot actively impede their competitors.
fr: <strong>Stallman</strong>&nbsp;: Non. Ils peuvent rivaliser d'ing&eacute;niosit&eacute; et plus vraisemblablement dans la fa&ccedil;on de trouver une solution &agrave; votre probl&egrave;me ou leur compr&eacute;hension anticip&eacute;e des probl&egrave;mes courants ou encore en sachant mieux comment vous expliquer quoi faire. Ils peuvent tenter de faire mieux, mais ils ne peuvent pas entraver leurs concurrents.

source: <strong>BYTE</strong>: I suppose it's like buying a car. You're not forced to go back to the original manufacturer for support or continued maintenance.
fr: <strong>BYTE</strong>&nbsp;: Je suppose que c'est comme acheter une voiture. Vous n'&ecirc;tes pas oblig&eacute; de vous adresser au constructeur d'origine pour assurer le support technique ou s'occuper de la maintenance.

source: <strong>Stallman</strong>: Or buying a house&mdash;what would it be like if the only person who could ever fix problems with your house was the contractor who built it originally? That is the kind of imposition that's involved in proprietary software. People tell me about a problem that happens in Unix. Because manufacturers sell improved versions of Unix, they tend to collect fixes and not give them out except in binaries. The result is that the bugs don't really get fixed.
fr: <strong>Stallman</strong>&nbsp;: Oui, ou comme acheter une maison. Comment les choses se passeraient si la seule personne qui pouvait r&eacute;soudre vos probl&egrave;mes avec la maison &eacute;tait l'entrepreneur qui l'a b&acirc;tie au tout d&eacute;but&nbsp;? C'est le genre d'abus qu'impliquent les logiciels propri&eacute;taires. Quelqu'un me parle d'un probl&egrave;me survenu sur un syst&egrave;me Unix. Parce que les constructeurs vendent des versions am&eacute;lior&eacute;es d'Unix, ils onttendance &agrave; accumuler les corrections plut&ocirc;t qu'&eacute;liminer vraiment les bogues, sauf dans les binaires. Le r&eacute;sultat, c'est que les bogues ne sont jamais vraiment corrig&eacute;s.

source: <strong>BYTE</strong>: They're all duplicating effort trying to solve bugs independently.
fr: <strong>BYTE</strong>&nbsp;: Tous multiplient les efforts pour r&eacute;soudre les bugs ind&eacute;pendamment.

source: <strong>Stallman</strong>: Yes. Here is another point that helps put the problem of proprietary information in a social perspective. Think about the liability insurance crisis. In order to get any compensation from society, an injured person has to hire a lawyer and split the money with that lawyer. This is a stupid and inefficient way of helping out people who are victims of accidents. And consider all the time that people put into hustling to take business away from their competition. Think of the pens that are packaged in large cardboard packages that cost more than the pen&mdash;just to make sure that the pen isn't stolen. Wouldn't it be better if we just put free pens on every street corner? And think of all the toll booths that impede the flow of traffic. It's a gigantic social phenomenon. People find ways of getting money by impeding society. Once they can impede society, they can be paid to leave people alone. The waste inherent in owning information will become more and more important and will ultimately make the difference between the utopia in which nobody really has to work for a living because it's all done by robots and a world just like ours where everyone spends much time replicating what the next fellow is doing.
fr: <strong>Stallman</strong>&nbsp;: Oui. C'est un autre aspect qui aide &agrave; voir le probl&egrave;me de l'information propri&eacute;taire dans une perspective sociale. Prenez l'assurance de responsabilit&eacute; civile. Pour obtenir une quelconque compensation de la part de la soci&eacute;t&eacute;, une personne accident&eacute;e devra payer un homme de loi et partager la somme avec cet homme de loi. C'est une fa&ccedil;on stupide et inefficace d'aider les gens victimes d'accident. Sans parler du temps que les gens mettent &agrave; se d&eacute;mener pour tirer leur &eacute;pingle du jeu. Prenez ces stylos vendus emball&eacute;s, co&ucirc;tant plus que le stylo seul, comme cela, on est s&ucirc;r qu'on ne le volera pas. Ce ne serait pas mieux de mettre gratuitement des stylos &agrave; disposition &agrave; chaque carrefour ? Et puis, regardez toutes ces cabines de p&eacute;age qui ralentissent le trafic. C'est un gigantesque ph&eacute;nom&egrave;ne de soci&eacute;t&eacute;. Il y en a qui ont trouv&eacute; le moyen de faire de l'argent en entravant la soci&eacute;t&eacute;. Une fois qu'ils peuvent faire obstacle &agrave; la soci&eacute;t&eacute;, ils peuvent &ecirc;tre pay&eacute;s pour laisser passer les gens. Le gaspillage inh&eacute;rent &agrave; la possession de l'information deviendra de plus en plus important et fera en fin de compte la diff&eacute;rence entre l'utopie qui veut que personne n'a vraiment besoin de travailler pour vivre, puisque les robots font tout le travail et ce monde qui est le n&ocirc;tre, o&ugrave; tout le monde passe un temps fou &agrave; recopier ce que fait le voisin.

source: <strong>BYTE</strong>: Like typing in copyright notices on the software.
fr: <strong>BYTE</strong>&nbsp;: Comme retranscrire des copyrights sur les logiciels.

source: <strong>Stallman</strong>: More like policing everyone to make sure that they don't have forbidden copies of anything and duplicating all the work people have already done because it is proprietary.
fr: <strong>Stallman</strong>&nbsp;: Ou plut&ocirc;t contr&ocirc;ler quiconque pour s'assurer qu'il n'a pas de copie interdite de quoi que ce soit et reproduire tout le travail que d'autres ont d&eacute;j&agrave; fait, puisqu'il est propri&eacute;taire.

source: <strong>BYTE</strong>: A cynic might wonder how you earn your living.
fr: <strong>BYTE</strong>&nbsp;: Cyniquement, on peut se demander de quoi vous vivez.

source: <strong>Stallman</strong>: From consulting. When I do consulting, I always reserve the right to give away what I wrote for the consulting job. Also, I could be making my living by mailing copies of the free software that I wrote and some that other people wrote. Lots of people send in $150 for GNU EMACS, but now this money goes to the Free Software Foundation that I started. The foundation doesn't pay me a salary because it would be a conflict of interest. Instead, it hires other people to work on GNU. As long as I can go on making a living by consulting I think that's the best way.
fr: <strong>Stallman</strong>&nbsp;: Je suis consultant. Quand je conseille, je me r&eacute;serve le droit de distribuer ce que j'ai &eacute;crit en tant que consultant. Il m'arrive aussi de gagner de l'argent en envoyant par mail des copies des logiciels libres que j'ai &eacute;crit ou que d'autres ont &eacute;crit. Beaucoup de personnes m'ont envoy&eacute; 150&nbsp;$ pour GNU EMACS, mais maintenant, cet argent va &agrave; la Fondation pour le logiciel libre que j'ai initi&eacute;e. La fondation ne me verse pas de salaire, cela entra&icirc;nerait un conflit d'int&eacute;r&ecirc;ts. Par contre, elle paye des gens pour travailler sur GNU. Tant que je peux gagner ma vie en tant que consultant, je le ferai, car je pense que c'est la meilleure voie.

source: <strong>BYTE</strong>: What is currently included in the official GNU distribution tape?
fr: <strong>BYTE</strong>&nbsp;: Que contient la bande de la distribution officielle de GNU&nbsp;?

source: <strong>Stallman</strong>: Right now the tape contains GNU EMACS (one version fits all computers); Bison, a program that replaces <acronym title="Yet Another Compiler Compiler">YACC</acronym>; <abbr>MIT</abbr> Scheme, which is Professor Sussman's super-simplified dialect of LISP; and Hack, a dungeon-exploring game similar to Rogue.
fr: <strong>Stallman</strong>&nbsp;: Actuellement, la bande contient GNU EMACS (dans une version qui tourne sur tous les ordinateurs) ; Bison, un programme qui remplace YACC&nbsp;; le langage Scheme du MIT, un langage super simplifi&eacute; du LISP que l'on doit au professeur Sussman et Hack, un jeu d'exploration de donjon, semblable &agrave; Rogue.

source: <strong>BYTE</strong>: Does the printed manual come with the tape as well?
fr: <strong>BYTE</strong>&nbsp;: Cette bande est accompagn&eacute;e d'un manuel&nbsp;?

source: <strong>Stallman</strong>: No. Printed manuals cost $15 each or copy them yourself. Copy this interview and share it, too.
fr: <strong>Stallman</strong>&nbsp;: Non. La version imprim&eacute;e des manuels co&ucirc;te 15&nbsp;$ l'exemplaire ou alors copiez-les vous-m&ecirc;me. Vous pouvez tout &agrave; fait copier cet entretien et le faire partager.

source: <strong>BYTE</strong>: How can you get a copy of that?
fr: <strong>BYTE</strong>&nbsp;: O&ugrave; s'en procurer une copie&nbsp;?

source: <strong>Stallman</strong>: Write to the Free Software Foundation, 675 Massachusetts Ave., Cambridge, MA 02139.
fr: <strong>Stallman</strong>&nbsp;: &Eacute;crivez &agrave;&nbsp;: Free Software Foundation, 675 Massachusetts Ave., Cambridge, MA 02139.

source: [The current address (since 2005) is: Free Software Foundation 51 Franklin St, Fifth Floor Boston, MA 02110-1301, USA Voice: +1-617-542-5942 Fax: +1-617-542-2652]
fr: [L'adresse actuelle (depuis 2005) est&nbsp;: Free Software Foundation 51 Franklin St, Fifth Floor Boston, MA 02110-1301, USA Voice: +1-617-542-5942 Fax: +1-617-542-2652]

source: <strong>BYTE</strong>: What are you going to do when you are done with the GNU system?
fr: <strong>BYTE</strong>&nbsp;: Quels sont vos projets, une fois que vous en aurez termin&eacute; avec le syst&egrave;me GNU&nbsp;?

source: <strong>Stallman</strong>: I'm not sure. Sometimes I think that what I'll go on to do is the same thing in other areas of software.
fr: <strong>Stallman</strong>&nbsp;: Je ne suis pas s&ucirc;r ; parfois je pense que ce que je ferai sera ce que je fais d&eacute;j&agrave;, mais dans d'autres domaines logiciels.

source: <strong>BYTE</strong>: So this is just the first of a whole series of assaults on the software industry?
fr: <strong>BYTE</strong>&nbsp;: Il ne s'agirait donc que du d&eacute;but d'une s&eacute;rie d'attaques contre l'industrie logicielle&nbsp;?

source: <strong>Stallman</strong>: I hope so. But perhaps what I'll do is just live a life of ease working a little bit of the time just to live. I don't have to live expensively. The rest of the time I can find interesting people to hang around with or learn to do things that I don't know how to do.
fr: <strong>Stallman</strong>&nbsp;: Je l'esp&egrave;re. Mais peut-&ecirc;tre que je ne vivrai qu'une vie tranquille, travaillant juste pour avoir de quoi vivre. Je ne suis pas d&eacute;pensier. Le reste du temps, je peux tr&egrave;s bien rencontrer des gens int&eacute;ressants avec qui fl&acirc;ner ou apprendre &agrave; faire des choses que je ne sais pas faire.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections (or suggestions) to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Pierre-Yves Enderlin.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
