Repository: gitGNU/gnu_www-fr
Catalog: gnu/fs-user-groups.*.po
Languages: fr

source: Free Software Users Groups - GNU Project - Free Software Foundation (FSF)
fr: Groupes d'utilisateurs de logiciels libres - GNU Project - Free Software Foundation (FSF)

source: Free Software Users Groups
fr: Groupes d'utilisateurs de logiciels libres

source: <a id="submit">Submitting groups to be listed</a>
fr: <a id="submit">Soumettre des groupes pour qu'ils soient list&eacute;s</a>

source: If you know of a free software users group that is not listed on this page, please let us know. Write to <a href="mailto:user-groups@gnu.org">&lt;user-groups@gnu.org&gt;</a> with the group's full name and other contact information, including the URL of the group's web site if it has one. If your group's information is out of date, you can use the same method to update it.
fr: Si vous connaissez un groupe d'utilisateurs de logiciels libres qui n'est pas indiqu&eacute; sur cette page, merci de nous le faire savoir. &Eacute;crivez &agrave; <a href="mailto:user-groups@gnu.org">&lt;user-groups@gnu.org&gt;</a> avec le nom complet du groupe et les informations de contacts, y compris l'URL du site Web du groupe, s'il en a un. Si les informations concernant votre groupe ne sont plus &agrave; jour, vous pouvez utiliser la m&ecirc;me m&eacute;thode pour les mettre &agrave; jour.

source: <a id="list">Free software groups listed by country</a>
fr: <a id="list">Groupes d'utilisateurs de logiciels libres class&eacute;s par pays</a>

source: As with our <a href="/links/links.html">links page</a>, the FSF is not responsible for the content of other web sites, or how up-to-date their information is. You may also be interested in our <a href="/gnu/gnu-user-groups.html">listing of GNU/Linux and GNU/Hurd user groups</a>.
fr: Comme pour notre <a href="/links/links.fr.html">page de liens</a>, la FSF n'est pas responsable du contenu des autres sites Web ou de l'actualit&eacute; de leurs informations. Vous pourriez aussi &ecirc;tre int&eacute;ress&eacute; par notre <a href="/gnu/gnu-user-groups.fr.html">liste de groupes d'utilisateurs de GNU/Linux et de GNU/Hurd</a>.

source: Here are the countries which have free software users groups listed:
fr: Ci-dessous, les pays recens&eacute;s ayant des groupes d'utilisateurs de logiciels libres&nbsp;:

source: <a href="#Argentina" id="TOCArgentina">Argentina</a>
fr: <a href="#Argentina" id="TOCArgentina">Argentine</a>

source: <a href="#Brazil" id="TOCBrazil">Brazil</a>
fr: <a href="#Brazil" id="TOCBrazil">Br&eacute;sil</a>

source: <a href="#Chile" id="TOCChile">Chile</a>
fr: <a href="#Chile" id="TOCChile">Chili</a>

source: <a href="#China" id="TOCChina">China</a>
fr: <a href="#China" id="TOCChina">Chine</a>

source: <a href="#Colombia" id="TOCColombia">Colombia</a>
fr: <a href="#Colombia" id="TOCColombia">Colombie</a>

source: <a href="#Czech" id="TOCCzech">Czech</a>
fr: <a href="#Czech" id="TOCCzech">R&eacute;publique tch&egrave;que</a>

source: <a href="#India" id="TOCIndia">India</a>
fr: <a href="#India" id="TOCIndia">Inde</a>

source: <a href="#Italy" id="TOCItaly">Italy</a>
fr: <a href="#Italy" id="TOCItaly">Italie</a>

source: <a href="#Mexico" id="TOCMexico">Mexico</a>
fr: <a href="#Mexico" id="TOCMexico">Mexique</a>

source: <a href="#Peru" id="TOCPeru">Peru</a>
fr: <a href="#Peru" id="TOCPeru">P&eacute;rou</a>

source: <a href="#Spain" id="TOCSpain">Spain</a>
fr: <a href="#Spain" id="TOCSpain">Espagne</a>

source: <a href="#UK" id="TOCUK">United Kingdom</a>
fr: <a href="#UK" id="TOCUK">Royaume Uni</a>

source: <a href="#USA" id="TOCUSA">United States</a>
fr: <a href="#USA" id="TOCUSA">&Eacute;tats-Unis</a>

source: Here are the free software users groups listed by country:
fr: Ci-dessous, les groupes d'utilisateurs de logiciels libres class&eacute;s par pays&nbsp;:

source: Argentina
fr: Argentine

source: Brazil
fr: Brésil

source: Chile
fr: Chili

source: China
fr: Chine

source: <a href="http://www.zeuux.org">ZEUUX Community</a>
fr: <a href="http://www.zeuux.org">Communauté ZEUUX</a>

source: Colombia
fr: Colombie

source: Czech
fr: République tchèque

source: <a href="http://www.gnu.cz/">Czech Free Software Users Group</a>
fr: <a href="http://www.gnu.cz/">Groupe d'utilisateurs de logiciels libres tch&egrave;que</a>

source: <a href="http://www.fsoguatemala.org/">Free Software Organization Guatemala</a>
fr: <a href="http://www.fsoguatemala.org/">Organisation pour les logiciels libres du Guatemala</a>

source: India
fr: Inde

source: <a href="http://bangalore.gnu.org.in/">Free Software Users Group, Bangalore</a>
fr: <a href="http://bangalore.gnu.org.in/">Groupe d'utilisateurs de logiciels libres, Bangalore</a>

source: <a href="http://fsugcalicut.org/">Free Software User Group - Kozhikode</a>
fr: <a href="http://fsugcalicut.org/">Groupe d'utilisateurs de logiciels libres - Kozhikode</a>

source: <a href="http://fsugtsr.org/">Free Software Users Group, Thrissur, Kerala</a>
fr: <a href="http://fsugtsr.org/">Groupe d'utilisateurs de logiciels libres, Thrissur, Kerala</a>

source: Italy
fr: Italie

source: <a href="http://www.fsugitalia.org/">FSUG Italia (Free Software User Group Italia)</a>
fr: <a href="http://www.fsugitalia.org/">FSUG Italia (Groupe d'utilisateurs de logiciels libres, Italie)</a>

source: <a href="http://www.fsugpadova.org/">FSUG Padova (Free Software Users Group Padova)</a>
fr: <a href="http://www.fsugpadova.org/">FSUG Padova (Groupe d'utilisateurs de logiciels libres, Padova)</a>

source: Mexico
fr: Mexique

source: <a href="http://gnupanama.com/">Comunidad GNU Panam&aacute;</a> - organization dedicated to distribution, development and research of Free Software in Panama
fr: <a href="http://gnupanama.com/">Comunidad GNU Panam&aacute;</a> - organisation dédiée à la distribution, au développement et à la recherche sur le logiciel libre au Panama

source: Peru
fr: Pérou

source: Spain
fr: Espagne

source: United Kingdom
fr: Royaume Uni

source: <a href="http://dfey.freedomdreams.co.uk/">DFEY: Digital Freedom for Education and Youth</a>
fr: <a href="http://dfey.freedomdreams.co.uk"><acronym title="Digital Freedom for Education and Youth">DFEY</acronym></a>&nbsp;: Libert&eacute; num&eacute;rique pour l'&eacute;ducation et la jeunesse - Angleterre du Nord-Ouest

source: <a id="USA">United States of America</a>
fr: <a id="USA">États-Unis d'Amérique</a>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web à <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
