Repository: gitGNU/gnu_www-fr
Catalog: gnu/gnu-linux-faq.*.po
Languages: fr

source: To confuse matters, some people use the term &ldquo;operating system&rdquo; to mean &ldquo;kernel&rdquo;. Both uses of the term go back many years. The use of &ldquo;operating system&rdquo; to mean &ldquo;kernel&rdquo; is found in a number of textbooks on system design, going back to the 80s. At the same time, in the 80s, the &ldquo;Unix operating system&rdquo; was understood to include all the system programs, and Berkeley's version of Unix included even games. Since we intended GNU to be a Unix-like operating system, we use the term &ldquo;operating system&rdquo; in the same way.
fr: Pour obscurcir les choses, certaines personnes utilisent le terme &laquo;&nbsp;syst&egrave;me d'exploitation&nbsp;&raquo; pour signifier &laquo;&nbsp;noyau&nbsp;&raquo;. Les deux utilisations remontent &agrave; de nombreuses ann&eacute;es. L'utilisation de &laquo;&nbsp;syst&egrave;me d'exploitation&nbsp;&raquo; pour signifier &laquo;&nbsp;noyau&nbsp;&raquo; est trouv&eacute;e dans un certain nombre de livres sur la conception de syst&egrave;me, remontant aux ann&eacute;es 80. D'autre part, dans les ann&eacute;es 80, le &laquo;&nbsp;syst&egrave;me d'exploitation Unix&nbsp;&raquo; &eacute;tait compris comme incluant tous les programmes du syst&egrave;me, et la version de Linux de Berkeley incluait m&ecirc;me des jeux. Puisque nous avions l'intention que GNU soit un syst&egrave;me d'exploitation similaire &agrave; Unix, nous avons utilis&eacute; le terme &laquo;&nbsp;syst&egrave;me d'exploitation&nbsp;&raquo; de la m&ecirc;me mani&egrave;re.

source: Most of the time when people speak of the &ldquo;Linux operating system&rdquo; they are using &ldquo;operating system&rdquo; in the same sense we use: they mean the whole collection of programs. If that's what you are referring to, please call it &ldquo;GNU/Linux&rdquo;. If you mean just the kernel, then &ldquo;Linux&rdquo; is the right name for it, but please say &ldquo;kernel&rdquo; also to avoid ambiguity about which body of software you mean.
fr: La plupart du temps quand les gens parlent du &laquo;&nbsp;syst&egrave;me d'exploitation Linux&nbsp;&raquo; ils utilisent &laquo;&nbsp;syst&egrave;me d'exploitation&nbsp;&raquo; dans le m&ecirc;me sens que nous&nbsp;: ils veulent parler de l'ensemble de tous les programmes. Si c'est ce &agrave; quoi vous voulez r&eacute;f&eacute;rer, merci de l'appeler &laquo;&nbsp;GNU/Linux&nbsp;&raquo;. Si vous parlez uniquement du noyau, alors &laquo;&nbsp;Linux&nbsp;&raquo; est le nom correct, mais dites aussi s'il vous pla&icirc;t &laquo;&nbsp;noyau&nbsp;&raquo; pour &eacute;viter toute ambigu&iuml;t&eacute; sur l'&eacute;l&eacute;ment de logiciel dont vous parlez.

source: If you prefer to use some other term such as &ldquo;system distribution&rdquo; for the entire collection of programs, instead of &ldquo;operating system&rdquo;, that's fine. Then you would talk about GNU/Linux system distributions.
fr: Si vous pr&eacute;f&eacute;rez utiliser un autre terme comme &laquo;&nbsp;distribution de syst&egrave;me&nbsp;&raquo; pour l'ensemble complet des programmes, &agrave; la place de &laquo;&nbsp;syst&egrave;me d'exploitation&nbsp;&raquo;, ce n'est pas un probl&egrave;me. Dans ce cas vous parlerez de distributions du syst&egrave;me GNU/Linux.

source: The kernel of a system is like the foundation of a house. How can a house be almost complete when it doesn't have a foundation?
fr: Le noyau d'un syst&egrave;me est comme les fondations d'une maison. Comment une maison peut-elle &ecirc;tre presque termin&eacute;e quand elle n'a pas de fondation&nbsp;?

source: A kernel is not much like the foundation of a house because building an operating system is not much like building a house.
fr: Un noyau n'a pas grand chose &agrave; voir avec les fondations d'une maison car construire un syst&egrave;me d'exploitation n'a pas grand chose &agrave; voir avec la construction d'une maison.

source: A house is built from lots of little general parts that are cut and put together in situ. They have to be put together from the bottom up. Thus, when the foundation has not been built, no substantial part has been built; all you have is a hole in the ground.
fr: Une maison est construite &agrave; partir de petites parties g&eacute;n&eacute;riques qui sont coup&eacute;es et rassembl&eacute;es sur site. Elles doivent &ecirc;tre assembl&eacute;es du bas vers le haut. Par cons&eacute;quent, quand les fondations n'ont pas &eacute;t&eacute; faites, aucune partie substantielle n'a &eacute;t&eacute; b&acirc;tie&nbsp;; tout ce que vous avez est alors un trou dans le sol.

source: By contrast, an operating system consists of complex components that can be developed in any order. When you have developed most of the components, most of the work is done. This is much more like the International Space Station than like a house. If most of the Space Station modules were in orbit but awaiting one other essential module, that would be like the GNU system in 1992.
fr: En comparaison, un syst&egrave;me d'exploitation est constitu&eacute; de composants complexes qui peuvent &ecirc;tre d&eacute;velopp&eacute;s dans n'importe quel ordre. Quand vous avez d&eacute;velopp&eacute; la plupart des composants, la majorit&eacute; du travail est termin&eacute;e. Cela ressemble plus &agrave; la Station spatiale internationale qu'&agrave; une maison. Si la plupart des modules de la station &eacute;taient en orbite et connect&eacute;s, mais en attente d'un module vital, ce serait comme le syst&egrave;me GNU en 1992.

source: Isn't the kernel the brain of the system?
fr: Le noyau n'est-il pas le cerveau du système&nbsp;?

source: A computer system is not much like a human body, and no part of it plays a role comparable to that of the brain in a human.
fr: Un ordinateur ne ressemble pas à un corps humain, et aucune partie ne joue un rôle comparable à celui du cerveau humain.

source: Isn't writing the kernel most of the work in an operating system?
fr: L'écriture du noyau n'est-elle pas le plus gros travail dans un système d'exploitation&nbsp;?

source: No, many components take a lot of work.
fr: Non, beaucoup de composants requièrent beaucoup de travail.

source: We're calling the whole system after the kernel, Linux. Isn't it normal to name an operating system after a kernel?
fr: Nous nommons le syst&egrave;me entier d'apr&egrave;s son noyau, Linux. N'est-il pas normal d'appeler un syst&egrave;me d'exploitation d'apr&egrave;s son noyau&nbsp;?

source: That practice seems to be very rare&mdash;we can't find any examples other than the misuse of the name &ldquo;Linux&rdquo;. Normally an operating system is developed as a single unified project, and the developers choose a name for the system as a whole. The kernel usually does not have a name of its own&mdash;instead, people say &ldquo;the kernel of such-and-such&rdquo; or &ldquo;the such-and-such kernel&rdquo;.
fr: Cette pratique semble tr&egrave;s rare&nbsp;: nous n'avons pas trouv&eacute; d'autre exemple que la mauvaise utilisation du nom &laquo;&nbsp;Linux&nbsp;&raquo;. Normalement un syst&egrave;me d'exploitation est d&eacute;velopp&eacute; comme un unique projet unifi&eacute;, et les d&eacute;veloppeurs choisissent un nom pour le syst&egrave;me entier. Le noyau n'a en g&eacute;n&eacute;ral pas de nom pour lui-m&ecirc;me&nbsp;: &agrave; la place, les gens parlent du &laquo;&nbsp;noyau de untel&nbsp;&raquo; ou du &laquo;&nbsp;noyau untel&nbsp;&raquo;.

source: Because those two constructions are used synonymously, the expression &ldquo;the Linux kernel&rdquo; can easily be misunderstood as meaning &ldquo;the kernel of Linux&rdquo; and implying that Linux must be more than a kernel. You can avoid the possibility of this misunderstanding by saying or writing &ldquo;the kernel, Linux&rdquo; or &ldquo;Linux, the kernel.&rdquo;
fr: Du fait que ces deux constructions sont utilis&eacute;es de mani&egrave;re synonyme, l'expression &laquo;&nbsp;le noyau Linux&nbsp;&raquo; peut facilement &ecirc;tre mal comprise comme signifiant &laquo;&nbsp;le noyau de Linux&nbsp;&raquo; ce qui implique que Linux serait plus que le noyau. Vous pouvez &eacute;viter cette incompr&eacute;hension en disant ou en &eacute;crivant &laquo;&nbsp;le noyau, Linux&nbsp;&raquo; ou &laquo;&nbsp;Linux, le noyau.&nbsp;&raquo;

source: The problem with &ldquo;GNU/Linux&rdquo; is that it is too long. How about recommending a shorter name?
fr: Le probl&egrave;me avec &laquo;&nbsp;GNU/Linux&nbsp;&raquo; est que c'est trop long. Pourquoi ne pas recommander un nom plus court&nbsp;?

source: For a while we tried the name &ldquo;LiGNUx&rdquo;, which combines the words &ldquo;GNU&rdquo; and &ldquo;Linux&rdquo;. The reaction was very bad. People accept &ldquo;GNU/Linux&rdquo; much better.
fr: Pendant une p&eacute;riode nous avons essay&eacute; le nom &laquo;&nbsp;LiGNUx&nbsp;&raquo;, qui combine les mots &laquo;&nbsp;GNU&nbsp;&raquo; et &laquo;&nbsp;Linux&nbsp;&raquo;. La r&eacute;action a &eacute;t&eacute; tr&egrave;s mauvaise. Les gens acceptent beaucoup mieux &laquo;&nbsp;GNU/Linux&nbsp;&raquo;.

source: The shortest legitimate name for this system is &ldquo;GNU&rdquo;, but we call it &ldquo;GNU/Linux&rdquo; for the reasons given below.
fr: Le nom court le plus l&eacute;gitime pour ce syst&egrave;me est &laquo;&nbsp;GNU&nbsp;&raquo;, mais nous l'appelons &laquo;&nbsp;GNU/Linux&nbsp;&raquo; pour les raisons donn&eacute;es ci-dessous.

source: Since Linux is a secondary contribution, would it be false to the facts to call the system simply &ldquo;GNU&rdquo;?
fr: Puisque Linux est une contribution secondaire serait-il incorrect dans les faits d'appeler simplement le syst&egrave;me &laquo;&nbsp;GNU&nbsp;&raquo;?

source: It would not be false to the facts, but it is not the best thing to do. Here are the reasons we call that system version &ldquo;GNU/Linux&rdquo; rather than just &ldquo;GNU&rdquo;:
fr: Dans les faits ce ne serait pas incorrect, mais ce n'est pas la meilleure chose &agrave; faire. Voici les raisons pour lesquelles nous appelons ce syst&egrave;me &laquo;&nbsp;GNU/Linux&nbsp;&raquo; plut&ocirc;t que juste &laquo;&nbsp;GNU&nbsp;&raquo;&nbsp;:

source: It's not exactly GNU&mdash;it has a different kernel (that is, Linux). Distinguishing GNU/Linux from GNU is useful.
fr: Ce n'est pas exactement GNU&nbsp;: il a un noyau diff&eacute;rent (c'est-&agrave;-dire, Linux). Distinguer GNU/Linux de GNU est utile.

source: It would be ungentlemanly to ask people to <em>stop</em> giving any credit to Linus Torvalds. He did write an important component of the system. We want to get credit for launching and sustaining the system's development, but this doesn't mean we should treat Linus the same way those who call the system &ldquo;Linux&rdquo; treat us. We strongly disagree with his political views, but we deal with that disagreement honorably and openly, rather than by trying to cut him out of the credit for his contribution to the system.
fr: Ce ne serait pas digne de gentlemen que de demander aux gens d'<em>arr&ecirc;ter</em> de donner la moindre reconnaissance &agrave; Linus Torvalds. Il a &eacute;crit un composant important du syst&egrave;me. Nous voulons recevoir de la reconnaissance pour avoir lanc&eacute; et soutenu le d&eacute;veloppement du syst&egrave;me, mais cela ne signifie pas que nous devrions traiter Linus de la m&ecirc;me mani&egrave;re que nous traitent ceux qui appellent le syst&egrave;me &laquo;&nbsp;Linux&nbsp;&raquo;. Nous sommes en net d&eacute;saccord avec ses vues politiques, mais nous g&eacute;rons ce d&eacute;saccord honorablement et ouvertement, plut&ocirc;t qu'en essayant de le priver de reconnaissance pour sa contribution au syst&egrave;me.

source: Since many people know of the system as &ldquo;Linux&rdquo;, if we say &ldquo;GNU&rdquo; they may simply not recognize we're talking about the same system. If we say &ldquo;GNU/Linux&rdquo;, they can make a connection to what they have heard about.
fr: Puisque que de nombreuses personnes connaissent le syst&egrave;me sous le nom &laquo;&nbsp;Linux&nbsp;&raquo;, si nous disions &laquo;&nbsp;GNU&nbsp;&raquo; ils pourraient simplement ne pas reconna&icirc;tre que nous parlons du m&ecirc;me syst&egrave;me. Si nous disons &laquo;&nbsp;GNU/Linux&nbsp;&raquo;, ils peuvent faire une connexion avec ce dont ils ont entendu parler.

source: I would have to pay a fee if I use &ldquo;Linux&rdquo; in the name of a product, and that would also apply if I say &ldquo;GNU/Linux&rdquo;. Is it wrong if I use &ldquo;GNU&rdquo; without &ldquo;Linux&rdquo;, to save the fee?
fr: J'aurais besoin de payer une taxe si j'utilisais &laquo;&nbsp;Linux&nbsp;&raquo; dans le nom d'un produit, et ce serait aussi le cas si j'utilisais &laquo;&nbsp;GNU/Linux&nbsp;&raquo;. Est-ce un probl&egrave;me d'utiliser&laquo;&nbsp;GNU&nbsp;&raquo; sans &laquo;&nbsp;Linux&nbsp;&raquo;, pour &eacute;viter la taxe&nbsp;?

source: There's nothing wrong in calling the system &ldquo;GNU&rdquo;; basically, that's what it is. It is nice to give Linus Torvalds a share of the credit as well, but you have no obligation to pay for the privilege of doing so.
fr: Appeler le syst&egrave;me &laquo;&nbsp;GNU&nbsp;&raquo; n'est pas un probl&egrave;me&nbsp;: &agrave; la base, c'est son nom correct. C'est gentil de donner &agrave; Linus Torvald une part de reconnaissance &eacute;galement, mais vous n'avez aucune obligation de payer pour obtenir le privil&egrave;ge de le faire.

source: So if you want to refer to the system simply as &ldquo;GNU&rdquo;, to avoid paying the fee for calling it &ldquo;Linux&rdquo;, we won't criticize you.
fr: Donc si vous voulez r&eacute;f&eacute;rer au syst&egrave;me simplement par &laquo;&nbsp;GNU&nbsp;&raquo;, pour &eacute;viter de payer la taxe associ&eacute;e au nom &laquo;&nbsp;Linux&nbsp;&raquo;, nous ne vous critiquerons pas.

source: Many other projects contributed to the system as it is today; it includes TeX, X11, Apache, Perl, and many more programs. Don't your arguments imply we have to give them credit too? (But that would lead to a name so long it is absurd.)
fr: Beaucoup d'autres projets ont contribu&eacute; au syst&egrave;me tel qu'il est actuellement&nbsp;: cela inclut TeX, X11, Apache, Perl, et beaucoup d'autres programmes. Est-ce que votre argument n'implique pas que nous devrions leur donner de la reconnaissance &eacute;galement&nbsp;? (Mais cela m&egrave;nerait &agrave; un nom aussi long qu'absurde).

source: What we say is that you ought to give the system's principal developer a share of the credit. The principal developer is the GNU Project, and the system is basically GNU.
fr: Ce que nous disons est que l'on devrait donner au principal d&eacute;veloppeur d'un syst&egrave;me une part de reconnaissance. Ce principal d&eacute;veloppeur est le projet GNU, et le syst&egrave;me est &agrave; la base GNU.

source: If you feel even more strongly about giving credit where it is due, you might feel that some secondary contributors also deserve credit in the system's name. If so, far be it from us to argue against it. If you feel that X11 deserves credit in the system's name, and you want to call the system GNU/X11/Linux, please do. If you feel that Perl simply cries out for mention, and you want to write GNU/Linux/Perl, go ahead.
fr: Si vous voulez vraiment donner de la reconnaissance &agrave; qui la m&eacute;rite, vous pouvez penser que certains contributeurs secondaires m&eacute;ritent &eacute;galement de la reconnaissance dans le nom du syst&egrave;me. Dans ce cas, loin de nous l'id&eacute;e de nous en plaindre. Si vous pensez que X11 m&eacute;rite de la reconnaissance dans le nom du syst&egrave;me, et que vous voulez appeler le syst&egrave;me GNU/X11/Linux, faites-le. Si vous pensez que Perl saute aux yeux et m&eacute;rite d'&ecirc;tre mentionn&eacute;, et que vous voulez &eacute;crire GNU/Linux/Perl, allez-y.

source: Since a long name such as GNU/X11/Apache/Linux/TeX/Perl/Python/FreeCiv becomes absurd, at some point you will have to set a threshold and omit the names of the many other secondary contributions. There is no one obvious right place to set the threshold, so wherever you set it, we won't argue against it.
fr: Comme un nom long comme GNU/X11/Apache/Linux/TeX/Perl/Python/FreeCiv devient absurde, il arrive un moment o&ugrave; il faudra tracer une limite et omettre les noms de beaucoup d'autres contributeurs secondaires. Il n'existe pas d'endroit &eacute;vident o&ugrave; placer cette limite, donc o&ugrave; que vous souhaitiez la placer, nous ne le critiquerons pas.

source: Different threshold levels would lead to different choices of name for the system. But one name that cannot result from concerns of fairness and giving credit, not for any possible threshold level, is &ldquo;Linux&rdquo;. It can't be fair to give all the credit to one secondary contribution (Linux) while omitting the principal contribution (GNU).
fr: Des limites diff&eacute;rentes m&egrave;neront &agrave; des noms diff&eacute;rents pour le syst&egrave;me. Mais &laquo;&nbsp;Linux&nbsp;&raquo; est un nom qui ne peut r&eacute;sulter de consid&eacute;ration d'&eacute;quit&eacute; et de reconnaissance, quelle que soit cette limite choisie. Cela ne peut pas &ecirc;tre &eacute;quitable de donner toute la reconnaissance &agrave; une unique contribution secondaire (Linux) en omettant la contribution principale (GNU).

source: Many other projects contributed to the system as it is today, but they don't insist on calling it XYZ/Linux. Why should we treat GNU specially?
fr: Beaucoup d'autre projets ont contribu&eacute; au syst&egrave;me tel qu'il est actuellement, mais ils n'insistent pas &agrave; demander qu'on l'appelle XYZ/Linux. Pourquoi devrait-on traiter GNU sp&eacute;cialement&nbsp;?

source: Thousands of projects have developed programs commonly included in today's GNU/Linux systems. They all deserve credit for their contributions, but they aren't the principal developers of the system as a whole, so they don't ask to be credited as such.
fr: Des milliers de projets ont d&eacute;velopp&eacute; des programmes couramment inclus dans les syst&egrave;mes actuels GNU/Linux. Ils m&eacute;ritent tous de la reconnaissance pour leur contribution, mais ils ne sont pas les d&eacute;veloppeurs du syst&egrave;me en tant qu'ensemble, donc ils ne demandent pas d'&ecirc;tre reconnus comme tels

source: GNU is different because it is more than just a contributed program, more than just a collection of contributed programs. GNU is the framework on which the system was made.
fr: GNU est diff&eacute;rent puisqu'il est plus qu'une simple contribution de programme, plus qu'un ensemble de contributions de programmes. GNU est le cadre sur lequel le syst&egrave;me a &eacute;t&eacute; b&acirc;ti.

source: GNU is a small fraction of the system nowadays, so why should we mention it?
fr: GNU est une petite fraction du syst&egrave;me de nos jours, alors pourquoi le mentionnerait-on&nbsp;?

source: In 2008, we found that GNU packages made up 15% of the &ldquo;main&rdquo; repository of the gNewSense GNU/Linux distribution. Linux made up 1.5%. So the same argument would apply even more strongly to calling it &ldquo;Linux&rdquo;.
fr: En 2008, nous avons observ&eacute; que les paquetages GNU repr&eacute;sentaient 15% du r&eacute;pertoire &laquo;&nbsp;principal&nbsp;&raquo; de la distribution GNU/Linux gNewSense. Linux repr&eacute;sentait 1,5%. Donc, le m&ecirc;me argument s'appliquerait encore plus fortement pour ne pas mentionner &laquo;&nbsp;Linux&nbsp;&raquo;.

source: GNU is a small fraction of the system nowadays, and Linux is an even smaller fraction. But they are the system's core; the system was made by combining them. Thus, the name &ldquo;GNU/Linux&rdquo; remains appropriate.
fr: GNU est une petite fraction du syst&egrave;me de nos jours, et Linux une fraction plus petite encore. Mais ils sont le c&oelig;ur du syst&egrave;me&nbsp;; le syst&egrave;me a &eacute;t&eacute; r&eacute;alis&eacute; en les combinant. Par cons&eacute;quent, le nom &laquo;&nbsp;GNU/Linux&nbsp;&raquo; reste appropri&eacute;.

source: Many companies contributed to the system as it is today; doesn't that mean we ought to call it GNU/Redhat/Novell/Linux?
fr: Beaucoup d'entreprises ont contribu&eacute; au syst&egrave;me tel qu'il est actuellement, cela ne signifie-t-il pas que nous devrions l'appeler GNU/Redhat/Novell/Linux&nbsp;?

source: GNU is not comparable to Red Hat or Novell; it is not a company, or an organization, or even an activity. GNU is an operating system. (When we speak of the GNU Project, that refers to the project to develop the GNU system.) The GNU/Linux system is based on GNU, and that's why GNU ought to appear in its name.
fr: GNU n'est pas comparable &agrave; Red Hat ou Novell&nbsp;: ce n'est pas une entreprise, ni une organisation, ni m&ecirc;me une activit&eacute;. GNU est un syst&egrave;me d'exploitation. Quand nous parlons du projet GNU, cela r&eacute;f&egrave;re au projet de d&eacute;veloppement du syst&egrave;me GNU. Le syst&egrave;me GNU/Linux est bas&eacute; sur GNU, et c'est pourquoi GNU doit appara&icirc;tre dans son nom.

source: Much of those companies' contribution to the GNU/Linux system lies in the code they have contributed to various GNU packages including GCC and GNOME. Saying GNU/Linux gives credit to those companies along with all the rest of the GNU developers.
fr: La plupart des contributions des entreprises au syst&egrave;me GNU/Linux sont dans le code qu'elles ont fourni pour des paquetages vari&eacute;s de GNU tels GCC ou GNOME. Dire GNU/Linux donne de la reconnaissance &agrave; ces entreprises de la m&ecirc;me mani&egrave;re qu'&agrave; tous les autres d&eacute;veloppeurs de GNU.

source: Why do you write &ldquo;GNU/Linux&rdquo; instead of &ldquo;GNU Linux&rdquo;?
fr: Pourquoi &eacute;crivez-vous &laquo;&nbsp;GNU/Linux&nbsp;&raquo; au lieu de &laquo;&nbsp;GNU Linux&nbsp;&raquo;?

source: Following the rules of English, in the construction &ldquo;GNU Linux&rdquo; the word &ldquo;GNU&rdquo; modifies &ldquo;Linux&rdquo;. This can mean either &ldquo;GNU's version of Linux&rdquo; or &ldquo;Linux, which is a GNU package.&rdquo; Neither of those meanings fits the situation at hand.
fr: En bon anglais, dans la construction &laquo;&nbsp;GNU Linux&nbsp;&raquo; le mot &laquo;&nbsp;GNU&nbsp;&raquo; modifie &laquo;&nbsp;Linux&nbsp;&raquo;. Ceci peut soit signifier &laquo;&nbsp;la version GNU de Linux&nbsp;&raquo; ou bien &laquo;&nbsp;Linux, qui est un paquetage GNU.&nbsp;&raquo; Aucune de ces significations n'est correcte dans le cas pr&eacute;sent&nbsp;.

source: Linux is not a GNU package; that is, it wasn't developed under the GNU Project's aegis or contributed specifically to the GNU Project. Linus Torvalds wrote Linux independently, as his own project. So the &ldquo;Linux, which is a GNU package&rdquo; meaning is not right.
fr: Linux n'est pas un paquetage GNU&nbsp;: c'est-&agrave;-dire qu'il n'a pas &eacute;t&eacute; d&eacute;velopp&eacute; sous l'&eacute;gide du projet GNU ou en tant que contribution au projet GNU. Linus Torvald a &eacute;crit Linux de fa&ccedil;on ind&eacute;pendante, en tant que projet personnel. Donc le sens &laquo;&nbsp;Linux, qui est un paquetage GNU.&nbsp;&raquo; est faux.
