Repository: gitGNU/gnu_www-fr
Catalog: gnu/gnu-linux-faq.*.po
Languages: fr

source: The people who combined Linux with the GNU system were not aware that that's what their activity amounted to. They focused their attention on the piece that was Linux and did not realize that more of the combination was GNU. They started calling it &ldquo;Linux&rdquo; even though that name did not fit what they had. It took a few years for us to realize what a problem this was and ask people to correct the practice. By that time, the confusion had a big head start.
fr: Les gens qui ont combin&eacute; Linux avec le syst&egrave;me GNU ne r&eacute;alisaient pas que c'&eacute;tait pr&eacute;cis&eacute;ment ce qu'ils faisaient. Ils ont concentr&eacute; leur attention sur le morceau qu'&eacute;tait Linux et n'ont pas r&eacute;alis&eacute; qu'une grande partie de l'ensemble &eacute;tait GNU. Ils ont commenc&eacute; &agrave; l'appeler &laquo;&nbsp;Linux&nbsp;&raquo; bien que ce nom ne corresponde pas &agrave; ce qu'ils avaient devant eux. Cela nous a pris quelques ann&eacute;es pour r&eacute;aliser le probl&egrave;me que cela repr&eacute;sentait et pour demander aux gens de corriger cette habitude. &Agrave; ce moment-l&agrave;, la confusion avait d&eacute;j&agrave; une bonne longueur d'avance.

source: Most of the people who call the system &ldquo;Linux&rdquo; have never heard why that's not the right thing. They saw others using that name and assume it must be right. The name &ldquo;Linux&rdquo; also spreads a false picture of the system's origin, because people tend to suppose that the system's history was such as to fit that name. For instance, they often believe its development was started by Linus Torvalds in 1991. This false picture tends to reinforce the idea that the system should be called &ldquo;Linux&rdquo;.
fr: La plupart des gens qui appellent le syst&egrave;me &laquo;&nbsp;Linux&nbsp;&raquo; n'ont jamais entendu pourquoi ce n'est pas correct. Ils ont vu d'autres personnes utiliser ce nom et ont suppos&eacute; qu'il devait &ecirc;tre correct. Le nom &laquo;&nbsp;Linux&nbsp;&raquo; a donc r&eacute;pandu une image fausse de l'origine du syst&egrave;me, parce que les gens supposent souvent que l'histoire du syst&egrave;me correspondait &agrave; ce nom. Par exemple, ils croient g&eacute;n&eacute;ralement que son d&eacute;veloppement a &eacute;t&eacute; commenc&eacute; par Linus Torvalds en 1991. Cette image fauss&eacute;e a tendance &agrave; renforcer l'id&eacute;e que le syst&egrave;me devrait &ecirc;tre appel&eacute; &laquo;&nbsp;Linux&nbsp;&raquo;.

source: Many of the questions in this file represent people's attempts to justify the name they are accustomed to using.
fr: Beaucoup de questions dans ce fichier repr&eacute;sentent les tentatives des gens pour justifier le nom qu'ils ont l'habitude d'utiliser.

source: Should we always say &ldquo;GNU/Linux&rdquo; instead of &ldquo;Linux&rdquo;?
fr: Devrions-nous toujours utiliser le nom &laquo;&nbsp;GNU/Linux&nbsp;&raquo; &agrave; la place de &laquo;&nbsp;Linux&nbsp;&raquo;?

source: Not always&mdash;only when you're talking about the whole system. When you're referring specifically to the kernel, you should call it &ldquo;Linux&rdquo;, the name its developer chose.
fr: Pas toujours&nbsp;: seulement quand vous parlez du syst&egrave;me en entier. Quand vous faites r&eacute;f&eacute;rence sp&eacute;cialement au noyau, vous devriez l'appeler &laquo;&nbsp;Linux&nbsp;&raquo;, le nom que son d&eacute;veloppeur a choisi.

source: When people call the whole system &ldquo;Linux&rdquo;, as a consequence they call the whole system by the same name as the kernel. This causes many kinds of confusion, because only experts can tell whether a statement is about the kernel or the whole system. By calling the whole system &ldquo;GNU/Linux&rdquo;, and calling the kernel &ldquo;Linux&rdquo;, you avoid the ambiguity.
fr: Quand les gens appellent le syst&egrave;me entier &laquo;&nbsp;Linux&nbsp;&raquo;, ils appellent par cons&eacute;quent le syst&egrave;me entier par le m&ecirc;me nom que celui du noyau. Cela cause beaucoup de confusion, car seuls des experts peuvent dire si une affirmation concerne le noyau ou le syst&egrave;me entier. En appelant le syst&egrave;me entier &laquo;&nbsp;GNU/Linux&nbsp;&raquo;, et en appelant le noyau &laquo;&nbsp;Linux&nbsp;&raquo;, vous &eacute;vitez l'ambigu&iuml;t&eacute;.

source: Would Linux have achieved the same success if there had been no GNU?
fr: Est-ce que Linux aurait eu le m&ecirc;me succ&egrave;s s'il n'y avait pas eu GNU&nbsp;?

source: In that alternative world, there would be nothing today like the GNU/Linux system, and probably no free operating system at all. No one attempted to develop a free operating system in the 1980s except the GNU Project and (later) Berkeley CSRG, which had been specifically asked by the GNU Project to start freeing its code.
fr: Dans cette alternative, il n'y aurait aujourd'hui rien de comparable au syst&egrave;me GNU/Linux, et probablement aucun syst&egrave;me d'exploitation libre du tout. Personne n'a essay&eacute; de d&eacute;velopper un syst&egrave;me d'exploitation libre dans les ann&eacute;es 1980 except&eacute; le Projet GNU et, plus tard, Berkeley CSRG, &agrave; qui le Projet GNU a sp&eacute;cialement demand&eacute; de commencer &agrave; lib&eacute;rer son code.

source: Linus Torvalds was partly influenced by a speech about GNU in Finland in 1990. It's possible that even without this influence he might have written a Unix-like kernel, but it probably would not have been free software. Linux became free in 1992 when Linus rereleased it under the GNU GPL. (See the release notes for version 0.12.)
fr: Linus Torvalds a &eacute;t&eacute; partiellement influenc&eacute; par une conf&eacute;rence &agrave; propos de GNU en Finlande en 1990. Il est possible que m&ecirc;me sans cette influence il aurait pu &eacute;crire un noyau de type Unix, mais il n'aurait probablement pas &eacute;t&eacute; un logiciel libre. Linux devint libre en 1992 quand Linus l'a redistribu&eacute; sous la licence GNU GPL. (Voir les notes de distribution pour la version 0.12.).

source: Even if Torvalds had released Linux under some other free software license, a free kernel alone would not have made much difference to the world. The significance of Linux came from fitting into a larger framework, a complete free operating system: GNU/Linux.
fr: M&ecirc;me si Torvalds avait distribu&eacute; Linux sous une autre licence de logiciel libre, un noyau libre seul n'aurait probablement pas fait beaucoup de diff&eacute;rence pour le monde. L'importance de Linux vient de ce qu'il prenait place dans un cadre plus large, un syst&egrave;me d'exploitation compl&egrave;tement libre&nbsp;: GNU/Linux.

source: Wouldn't it be better for the community if you did not divide people with this request?
fr: Ne serait-il pas mieux pour la communaut&eacute; que vous ne divisiez pas les gens avec cette demande&nbsp;?

source: When we ask people to say &ldquo;GNU/Linux&rdquo;, we are not dividing people. We are asking them to give the GNU Project credit for the GNU operating system. This does not criticize anyone or push anyone away.
fr: Quand nous demandons aux gens de dire &laquo;&nbsp;GNU/Linux&nbsp;&raquo;, nous ne divisons pas les gens. Nous leur demandons de donner au Projet GNU de la reconnaissance pour le syst&egrave;me GNU. Cela ne critique personne ni ne rejette personne.

source: However, there are people who do not like our saying this. Sometimes those people push us away in response. On occasion they are so rude that one wonders if they are intentionally trying to intimidate us into silence. It doesn't silence us, but it does tend to divide the community, so we hope you can convince them to stop.
fr: Cependant, il y a des gens qui n'aiment pas ce que nous disons. Parfois ces gens nous rejettent dans leur r&eacute;ponses. &Agrave; certaines occasions, ils sont si grossiers que l'on se demande s'ils ne sont pas en train d'essayer intentionnellement de nous intimider pour nous r&eacute;duire au silence. Cela ne nous fait pas taire, mais cela tend &agrave; diviser la communaut&eacute;, donc nous esp&eacute;rons que vous pouvez les convaincre de cesser.

source: However, this is only a secondary cause of division in our community. The largest division in the community is between people who appreciate free software as a social and ethical issue and consider proprietary software a social problem (supporters of the free software movement), and those who cite only practical benefits and present free software only as an efficient development model (the open source movement).
fr: Cependant, ce n'est qu'une cause secondaire de division dans notre communaut&eacute;. La principale division au sein de notre communaut&eacute; est celle entre les gens qui appr&eacute;cient le logiciel libre en tant que question &eacute;thique et sociale, et consid&egrave;rent le logiciel propri&eacute;taire comme un probl&egrave;me social (les soutiens du mouvement pour le logiciel libre), et ceux qui ne consid&egrave;rent que les b&eacute;n&eacute;fices pratiques et pr&eacute;sentent le logiciel libre uniquement comme un mod&egrave;le de d&eacute;veloppement efficace (le mouvement open source).

source: This disagreement is not just a matter of names&mdash;it is a matter of differing basic values. It is essential for the community to see and think about this disagreement. The names &ldquo;free software&rdquo; and &ldquo;open source&rdquo; are the banners of the two positions. See <a href="/philosophy/open-source-misses-the-point.html">Why Open Source misses the point of Free Software</a>.
fr: Ce d&eacute;saccord n'est pas uniquement un probl&egrave;me de nom&mdash; c'est un probl&egrave;me de valeurs de base diff&eacute;rentes. Il est essentiel pour la communaut&eacute; de voir ce d&eacute;saccord et d'y r&eacute;fl&eacute;chir. Les noms &laquo;&nbsp;logiciel libre&nbsp;&raquo; et &laquo;&nbsp;open source&nbsp;&raquo; sont les &eacute;tendards de deux positions. Voir <a href="/philosophy/open-source-misses-the-point.fr.html">Pourquoi l'&laquo;&nbsp;open source&nbsp;&raquo; passe &agrave; c&ocirc;t&eacute; du probl&egrave;me que soul&egrave;ve le logiciel libre</a>.

source: The disagreement over values partially aligns with the amount of attention people pay to the GNU Project's role in our community. People who value freedom are more likely to call the system &ldquo;GNU/Linux&rdquo;, and people who learn that the system is &ldquo;GNU/Linux&rdquo; are more likely to pay attention to our philosophical arguments for freedom and community (which is why the choice of name for the system makes a real difference for society). However, the disagreement would probably exist even if everyone knew the system's real origin and its proper name, because the issue is a real one. It can only go away if we who value freedom either persuade everyone (which won't be easy) or are defeated entirely (let's hope not).
fr: Le d&eacute;saccord sur ces valeurs rejoint partiellement l'attention que les gens accordent au r&ocirc;le du Projet GNU dans notre communaut&eacute;. Les gens qui accordent de l'importance &agrave; la libert&eacute; sont plus enclins &agrave; appeler le syst&egrave;me &laquo;&nbsp;GNU/Linux&nbsp;&raquo;, et les gens qui apprennent que le syst&egrave;me s'appelle &laquo;&nbsp;GNU/Linux&nbsp;&raquo; sont plus enclins &agrave; faire attention &agrave; nos arguments philosophiques pour la libert&eacute; et la communaut&eacute;&nbsp;: c'est pourquoi le choix du nom pour le syst&egrave;me fait une r&eacute;elle diff&eacute;rence pour la soci&eacute;t&eacute;. Cependant, ce d&eacute;saccord existerait probablement m&ecirc;me si tout le monde connaissait les origines r&eacute;elles du syst&egrave;me et son vrai nom, car ce probl&egrave;me est un vrai probl&egrave;me. Il ne peut dispara&icirc;tre que si nous, qui accordons de l'importance &agrave; la libert&eacute;, persuadons tout le monde (ce qui ne sera pas facile) ou que nous soyons compl&egrave;tement vaincus (esp&eacute;rons que non).

source: Doesn't the GNU project support an individual's free speech rights to call the system by any name that individual chooses?
fr: Le projet GNU ne soutient-il pas le droit &agrave; la libert&eacute; d'expression de chaque individu d'appeler le syst&egrave;me par n'importe quel nom qu'il choisit&nbsp;?

source: Yes, indeed, we believe you have a free speech right to call the operating system by any name you wish. We ask that people call it GNU/Linux as a matter of doing justice to the GNU project, to promote the values of freedom that GNU stands for, and to inform others that those values of freedom brought the system into existence.
fr: Oui, effectivement nous croyons que vous avez le droit d'appeler le syst&egrave;me d'exploitation par le nom que vous voulez. Nous demandons que les gens l'appellent GNU/Linux pour rendre justice au projet GNU, pour promouvoir les valeurs de libert&eacute; que GNU repr&eacute;sente, et pour informer les autres que ces valeurs de libert&eacute; ont fait na&icirc;tre ce syst&egrave;me.

source: Since everyone knows GNU's role in developing the system, doesn't the &ldquo;GNU/&rdquo; in the name go without saying?
fr: Puisque tout le monde conna&icirc;t le r&ocirc;le de GNU dans le d&eacute;veloppement du syst&egrave;me, le &laquo;&nbsp;GNU/&nbsp;&raquo; dans le nom ne va-t-il pas sans dire&nbsp;?

source: Experience shows that the system's users, and the computer-using public in general, often know nothing about the GNU system. Most articles about the system do not mention the name &ldquo;GNU&rdquo;, or the ideals that GNU stands for. <a href="/gnu/gnu-users-never-heard-of-gnu.html">GNU Users Who Have Never Heard of GNU</a> explains further.
fr: L'exp&eacute;rience montre que l'utilisateur du syst&egrave;me, et le public utilisateur des ordinateurs en g&eacute;n&eacute;ral, ne savent souvent rien du syst&egrave;me GNU. La plupart des articles &agrave; propos du syst&egrave;me ne mentionnent pas le nom &laquo;&nbsp;GNU&nbsp;&raquo;, ou les id&eacute;aux que repr&eacute;sente GNU. <a href="/gnu/gnu-users-never-heard-of-gnu.fr.html">Les utilisateurs de GNU qui n'ont jamais entendu parler de GNU</a> explique ceci plus avant.

source: The people who say this are probably geeks thinking of the geeks they know. Geeks often do know about GNU, but many have a completely wrong idea of what GNU is. For instance, many think it is a collection of <a href="#tools">&ldquo;tools&rdquo;</a>, or a project to develop tools.
fr: Les personnes qui disent ceci sont probablement des geeks pensant aux autres geeks qu'ils connaissent. Les geeks ont pour la plupart entendu parler de GNU, mais beaucoup d'entre eux ont une id&eacute;e compl&egrave;tement fausse de ce qu'est r&eacute;ellement GNU. Par exemple, beaucoup pensent qu'il s'agit d'une biblioth&egrave;que d'&laquo;&nbsp;<a href="#tools">outils</a>&nbsp;&raquo;, ou un projet pour d&eacute;velopper des outils.

source: The wording of this question, which is typical, illustrates another common misconception. To speak of &ldquo;GNU's role&rdquo; in developing something assumes that GNU is a group of people. GNU is an operating system. It would make sense to talk about the GNU Project's role in this or some other activity, but not that of GNU.
fr: La fa&ccedil;on de poser la question, qui est typique, illustre une autre incompr&eacute;hension habituelle. Le fait de parler du &laquo;&nbsp;r&ocirc;le de GNU&nbsp;&raquo; dans le d&eacute;veloppement de quelque chose sous-entend que GNU est un groupe de personnes. GNU est un syst&egrave;me d'exploitation. Il serait sens&eacute; de parler du r&ocirc;le du projet GNU dans telle ou telle activit&eacute;, mais pas de celui de GNU.

source: Since I know the role of GNU in this system, why does it matter what name I use?
fr: Puisque je connais le r&ocirc;le de GNU dans ce syst&egrave;me, pourquoi le nom que j'utilise a-t-il une importance&nbsp;?

source: If your words don't reflect your knowledge, you don't teach others. Most people who have heard of the GNU/Linux system think it is &ldquo;Linux&rdquo;, that it was started by Linus Torvalds, and that it was intended to be &ldquo;open source&rdquo;. If you don't tell them, who will?
fr: Si vos mots ne refl&egrave;tent pas votre connaissance, vous n'apprenez pas aux autres. La plupart des gens qui ont entendu parler du syst&egrave;me GNU/Linux pense qu'il s'agit de &laquo;&nbsp;Linux&nbsp;&raquo;, qu'il a &eacute;t&eacute; commenc&eacute; par Linus Torvalds, et qu'il &eacute;tait destin&eacute; &agrave; &ecirc;tre &laquo;&nbsp;open source&nbsp;&raquo;. Si vous ne leur dites pas, qui le fera&nbsp;?

source: Isn't shortening &ldquo;GNU/Linux&rdquo; to &ldquo;Linux&rdquo; just like shortening &ldquo;Microsoft Windows&rdquo; to &ldquo;Windows&rdquo;?
fr: L'abr&eacute;viation de &laquo;&nbsp;GNU/Linux&nbsp;&raquo; en &laquo;&nbsp;Linux&nbsp;&raquo; n'est-elle pas simplement comme l'abr&eacute;viation de &laquo;&nbsp;Microsoft Windows&nbsp;&raquo; en &laquo;&nbsp;Windows&nbsp;&raquo;?

source: It's useful to shorten a frequently-used name, but not if the abbreviation is misleading.
fr: Il est utile de raccourcir un nom fr&eacute;quemment utilis&eacute;, mais pas si l'abr&eacute;viation est trompeuse.

source: Most everyone in developed countries really does know that the &ldquo;Windows&rdquo; system is made by Microsoft, so shortening &ldquo;Microsoft Windows&rdquo; to &ldquo;Windows&rdquo; does not mislead anyone as to that system's nature and origin. Shortening &ldquo;GNU/Linux&rdquo; to &ldquo;Linux&rdquo; does give the wrong idea of where the system comes from.
fr: La plupart des gens dans les pays d&eacute;velopp&eacute;s savent r&eacute;ellement que le syst&egrave;me &laquo;&nbsp;Windows&nbsp;&raquo; est fait par Microsoft, donc abr&eacute;ger &laquo;&nbsp;Microsoft Windows&nbsp;&raquo; en &laquo;&nbsp;Windows&nbsp;&raquo; ne trompe personne sur la nature ou l'origine du syst&egrave;me. Abr&eacute;ger &laquo;&nbsp;GNU/Linux&nbsp;&raquo; en &laquo;&nbsp;Linux&nbsp;&raquo; donne par contre une fausse id&eacute;e d'o&ugrave; vient le syst&egrave;me.

source: The question is itself misleading because GNU and Microsoft are not the same kind of thing. Microsoft is a company; GNU is an operating system.
fr: La question elle-m&ecirc;me est trompeuse puisque GNU et Microsoft ne sont pas le m&ecirc;me genre de chose. Microsoft est une entreprise, GNU est un syst&egrave;me d'exploitation.

source: Isn't GNU a collection of programming tools that were included in Linux?
fr: Est-ce que GNU n'est pas une biblioth&egrave;que d'outils de programmation qui a &eacute;t&eacute; int&eacute;gr&eacute;e dans Linux&nbsp;?

source: People who think that Linux is an entire operating system, if they hear about GNU at all, often get a wrong idea of what GNU is. They may think that GNU is the name of a collection of programs&mdash;often they say &ldquo;programming tools&rdquo;, since some of our programming tools became popular on their own. The idea that &ldquo;GNU&rdquo; is the name of an operating system is hard to fit into a conceptual framework in which that operating system is labeled &ldquo;Linux&rdquo;.
fr: Les personnes qui pensent que Linux est un syst&egrave;me d'exploitation entier, tant est qu'ils aient entendu parler de GNU, ont souvent une fausse id&eacute;e de ce qu'est GNU. Ils peuvent penser que GNU est le nom d'un ensemble de programmes&nbsp;; souvent ils disent outils de programmation, puisque certains de nos outils de programmation sont devenus populaires par eux-m&ecirc;mes. L'id&eacute;e que &laquo;&nbsp;GNU&nbsp;&raquo; est le nom d'un syst&egrave;me d'exploitation est difficile &agrave; int&eacute;grer dans un cadre conceptuel dans lequel le syst&egrave;me d'exploitation est &eacute;tiquet&eacute; &laquo;&nbsp;Linux&nbsp;&raquo;.

source: The GNU Project was named after the GNU operating system&mdash;it's the project to develop the GNU system. (See <a href="/gnu/initial-announcement.html">the 1983 initial announcement</a>.)
fr: Le projet GNU &agrave; &eacute;t&eacute; nomm&eacute; d'apr&egrave;s le nom du syst&egrave;me d'exploitation GNU - c'est le projet de d&eacute;velopper le syst&egrave;me GNU. (Voir <a href="/gnu/initial-announcement.fr.html">l'annonce initiale de 1983</a>.).

source: We developed programs such as GCC, GNU Emacs, GAS, GLIBC, BASH, etc., because we needed them for the GNU operating system. GCC, the GNU Compiler Collection is the compiler that we wrote for the GNU operating system. We, the many people working on the GNU Project, developed Ghostscript, GNUCash, GNU Chess and GNOME for the GNU system too.
fr: Nous avons d&eacute;velopp&eacute; des programmes tels que GCC, GNU Emacs, GAS, GLIBC, BASH, etc., parce que nous avions besoin d'eux pour le syst&egrave;me d'exploitation GNU. GCC, le &laquo;&nbsp;GNU Compiler Collection&nbsp;&raquo; (biblioth&egrave;que de compilation GNU) est le compilateur que nous avons &eacute;crit pour le syst&egrave;me d'exploitation GNU. Nous, les nombreuses personnes travaillant sur le projet GNU, avons aussi d&eacute;velopp&eacute; Ghostscript, GNUCash, GNU Chess et GNOME pour le syst&egrave;me GNU.

source: What is the difference between an operating system and a kernel?
fr: Quelle est la diff&eacute;rence entre un syst&egrave;me d'exploitation et un noyau&nbsp;?

source: An operating system, as we use the term, means a collection of programs that are sufficient to use the computer to do a wide variety of jobs. A general purpose operating system, to be complete, ought to handle all the jobs that many users may want to do.
fr: Un syst&egrave;me d'exploitation, dans le sens que nous utilisons, signifie un ensemble de programmes qui sont suffisants pour utiliser l'ordinateur afin de r&eacute;aliser une grande vari&eacute;t&eacute; de travaux. Un syst&egrave;me d'exploitation &agrave; but g&eacute;n&eacute;raliste, pour &ecirc;tre complet, devrait &ecirc;tre capable de r&eacute;aliser tous les travaux souhait&eacute;s par n'importe quel utilisateur.

source: The kernel is one of the programs in an operating system&mdash;the program that allocates the machine's resources to the other programs that are running. The kernel also takes care of starting and stopping other programs.
fr: Le noyau est l'un des programmes d'un syst&egrave;me d'exploitation&nbsp;: le programme qui alloue les ressources de la machine aux autres programmes qui tournent en m&ecirc;me temps. Le noyau s'occupe &eacute;galement de lancer et d'arr&ecirc;ter les autres programmes.
