Repository: gitGNU/gnu_www-fr
Catalog: gnu/gnu-linux-faq.*.po
Languages: fr

source: The operating system in which Linux became popular was basically the same as the GNU operating system. It was not entirely the same, because it had a different kernel, but it was mostly the same system. It was a variant of GNU. It was the GNU/Linux system.
fr: Le syst&egrave;me d'exploitation dans lequel Linux est devenu populaire &eacute;tait fondamentalement le m&ecirc;me que le syst&egrave;me GNU. Ce n'&eacute;tait pas exactement le m&ecirc;me, parce qu'il avait un noyau diff&eacute;rent, mais c'&eacute;tait majoritairement le m&ecirc;me syst&egrave;me. C'&eacute;tait une variante de GNU.C'&eacute;tait le syst&egrave;me GNU/Linux.

source: Linux continues to be used primarily in derivatives of that system&mdash;in today's versions of the GNU/Linux system. What gives these systems their identity is GNU and Linux at the center of them, not particularly Linux alone.
fr: Linux continue d'&ecirc;tre principalement utilis&eacute; dans des d&eacute;riv&eacute;s de ce syst&egrave;me&nbsp;: dans les versions actuelles du syst&egrave;me GNU/Linux. Ce sont GNU et Linux en leur sein qui donne &agrave; ces syst&egrave;mes leur identit&eacute;, et pas seulement Linux.

source: Since much of GNU comes from Unix, shouldn't GNU give credit to Unix by using &ldquo;Unix&rdquo; in its name?
fr: Puisque la majorit&eacute; de GNU vient d'Unix, GNU ne devrait-il pas montrer de la reconnaissance &agrave; Unix en utilisant &laquo;&nbsp;Unix&nbsp;&raquo; dans son nom&nbsp;?

source: Actually, none of GNU comes from Unix. Unix was proprietary software (and still is), so using any of its code in GNU would have been illegal. This is not a coincidence; this is why we developed GNU: since you could not have freedom in using Unix, or any of the other operating systems of the day, we needed a free system to replace it. We could not copy programs, or even parts of them, from Unix; everything had to be written afresh.
fr: En r&eacute;alit&eacute;, rien de GNU ne vient d'Unix. Unix &eacute;tait un logiciel propri&eacute;taire (et l'est toujours), donc utiliser n'importe quelle partie de son code dans GNU aurait &eacute;t&eacute; ill&eacute;gal. Ceci n'est pas une co&iuml;ncidence, c'est pourquoi nous avons d&eacute;velopp&eacute; GNU&nbsp;: puisque vous ne pouviez pas&ecirc;tre libre en utilisant Unix, ou n'importe quel autre syst&egrave;me d'exploitation de l'&eacute;poque, nous avions besoin d'un syst&egrave;me libre pour les remplacer. Nous ne pouvions copier de programmes, ni m&ecirc;me de parties d'entre eux, depuis Unix&nbsp;: tout a d&ucirc; &ecirc;tre r&eacute;&eacute;crit.

source: No code in GNU comes from Unix, but GNU is a Unix-compatible system; therefore, many of the ideas and specifications of GNU do come from Unix. The name &ldquo;GNU&rdquo;, which stands for &ldquo;GNU's Not Unix&rdquo;, is a humorous way of giving credit to Unix for this, following a hacker tradition of recursive acronyms that started in the 70s.
fr: Aucun code de GNU ne provient d'Unix, mais GNU est un syst&egrave;me compatible avec Unix&nbsp;: c'est pourquoi beaucoup des id&eacute;es et sp&eacute;cifications de GNUproviennent d'Unix. Le nom &laquo;&nbsp;GNU&nbsp;&adquo;, qui signifie &laquo;&nbsp;GNU N'est pas Unix&nbsp;&raquo;, est une mani&egrave;re humoristique de donnercr&eacute;dit &agrave; Unix, en suivant la tradition des hackers des acronymes r&eacute;cursifs qui a d&eacute;but&eacute; dans les ann&eacute;es 70.

source: The first such recursive acronym was TINT, &ldquo;TINT Is Not TECO&rdquo;. The author of TINT wrote another implementation of TECO (there were already many of them, for various systems), but instead of calling it by a dull name like &ldquo;somethingorother TECO&rdquo;, he thought of a clever amusing name. (That's what hacking means: <a href="http://stallman.org/articles/on-hacking.html">playful cleverness</a>.)
fr: Le premier de ces acronymes &eacute;tait TINT, &laquo;&nbsp;TINT Is Not TECO&nbsp;&raquo;. L'auteur de TINT a &eacute;crit une autre impl&eacute;mentation de TECO (il en existait d&eacute;j&agrave; beaucoup, pour de nombreux syst&egrave;mes), mais au lieu de l'appeler par un nom ennuyeux comme &laquo;&nbsp;quelque chose TECO&nbsp;&raquo;, il a imagin&eacute; un nom plus intelligent et plus amusant. (C'est ce que hacking signifie&nbsp;: <a href="http://stallman.org/articles/on-hacking.html">intelligence ludique</a>).

source: Other hackers enjoyed that name so much that we imitated the approach. It became a tradition that, when you were writing from scratch a program that was similar to some existing program (let's imagine its name was &ldquo;Klever&rdquo;), you could give it a recursive acronym name, such as &ldquo;MINK&rdquo; for &ldquo;MINK Is Not Klever.&rdquo; In this same spirit we called our replacement for Unix &ldquo;GNU's Not Unix&rdquo;.
fr: D'autres hackers ont tellement aim&eacute; ce nom qu'ils ont imit&eacute; cette approche. Cela devint une tradition, quand vous &eacute;criviez &agrave; partir z&eacute;ro un programme similaire &agrave; un programme existant (imaginons que son nom &eacute;tait &laquo;&nbsp;Klever&nbsp;&raquo;), de pouvoir lui donner un nom en acronyme r&eacute;cursif, tel que &laquo;&nbsp;MINK&nbsp;&raquo; pour &laquo;&nbsp;MINK Is Not Klever.&nbsp;&raquo; Dans le m&ecirc;me esprit nous avons appel&eacute; notre remplacement d'Unix &laquo;&nbsp;GNU's Not Unix&nbsp;&raquo;.

source: Historically, AT&amp;T which developed Unix did not want anyone to give it credit by using &ldquo;Unix&rdquo; in the name of a similar system, not even in a system 99% copied from Unix. AT&amp;T actually threatened to sue anyone giving AT&amp;T credit in that way. This is why each of the various modified versions of Unix (all proprietary, like Unix) had a completely different name that didn't include &ldquo;Unix&rdquo;.
fr: Historiquement AT&amp;T, qui d&eacute;veloppait Unix, voulait que personne ne fasse preuve de reconnaissance en utilisant &laquo;&nbsp;Unix&nbsp;&raquo; dans le nom d'un syst&egrave;me similaire, m&ecirc;me pas pour un syst&egrave;me copi&eacute; &agrave; 99% d'Unix. AT&amp;T ont en r&eacute;alit&eacute; menac&eacute; de traduire en justice quiconque faisant preuve de reconnaissance &agrave; l'&eacute;gard de AT&amp;T de cette mani&egrave;re. C'est pourquoi chaque version modifi&eacute;e bas&eacute;e sur Unix (chacune d'entre elle tout autant propri&eacute;taire qu'Unix) a re&ccedil;u un nom compl&egrave;tement diff&eacute;rent qui n'incluait pas &laquo;&nbsp;Unix&nbsp;&raquo;.

source: Should we say &ldquo;GNU/BSD&rdquo; too?
fr: Devrions-nous dire &eacute;galement &laquo;&nbsp;GNU/BSD&nbsp;&raquo;&nbsp;?

source: We don't call the BSD systems (FreeBSD, etc.) &ldquo;GNU/BSD&rdquo; systems, because that term does not fit the history of the BSD systems.
fr: Nous n'appelons pas les syst&egrave;mes BSD (FreeBSD, etc.) syst&egrave;mes &laquo;&nbsp;GNU/BSD&nbsp;&raquo;, parce que ce terme ne convient pas vu l'histoire des syst&egrave;mes BSD.

source: The BSD system was developed by UC Berkeley as non-free software in the 80s, and became free in the early 90s. A free operating system that exists today is almost certainly either a variant of the GNU system, or a kind of BSD system.
fr: Le syst&egrave;me BSD a &eacute;t&eacute; d&eacute;velopp&eacute; par l'UC Berkeley en tant que logiciel non-libre dans les ann&eacute;es 80, et est devenu libre dans les ann&eacute;es 90. Tout syst&egrave;me d'exploitation libre existant aujourd'hui est presque certainement une variante soit du syst&egrave;me GNU, soit d'une sorte de syst&egrave;me BSD.

source: People sometimes ask whether BSD too is a variant of GNU, as GNU/Linux is. It is not. The BSD developers were inspired to make their code free software by the example of the GNU Project, and explicit appeals from GNU activists helped convince them to start, but the code had little overlap with GNU.
fr: Les gens demandent parfois si BSD &eacute;galement est une variante de GNU, de la m&ecirc;me mani&egrave;re que GNU/Linux l'est. Ce n'est pas le cas. Les d&eacute;veloppeurs de BSD ont &eacute;t&eacute; inspir&eacute;s par l'exemple du projet GNU pour lib&eacute;rer le code de leurs logiciels, et des appels explicites d'activistesde GNU les ont convaincu de commencer, mais le code n'a que peu de recoupement avec celui de GNU.

source: BSD systems today use some GNU packages, just as the GNU system and its variants use some BSD programs; however, taken as wholes, they are two different systems that evolved separately. The BSD developers did not write a kernel and add it to the GNU system, so a name like GNU/BSD would not fit the situation.
fr: Les syst&egrave;mes BSD d'aujourd'hui utilisent parfois certains paquets GNU, de la m&ecirc;me mani&egrave;re que le syst&egrave;me GNU utilise certains programmes BSD&nbsp;: cependant, en tant qu'ensemble, ce sont deux syst&egrave;mes diff&eacute;rents qui ont &eacute;volu&eacute; s&eacute;par&eacute;ment. Les d&eacute;veloppeurs de BSD n'ont pas &eacute;crit un noyau pour l'ajouter au syst&egrave;me GNU, donc un nom comme GNU/BSD ne convient pas du tout &agrave; la situation.

source: The connection between GNU/Linux and GNU is much closer, and that's why the name &ldquo;GNU/Linux&rdquo; is appropriate for it.
fr: La connexion entre GNU/Linux et GNU est beaucoup plus &eacute;troite, et c'est la raison pour laquelle le nom &laquo;&nbsp;GNU/Linux&nbsp;&raquo; est appropri&eacute;.

source: There is a version of GNU which uses the kernel from NetBSD. Its developers call it &ldquo;Debian GNU/NetBSD&rdquo;, but &ldquo;GNU/kernelofNetBSD&rdquo; would be more accurate, since NetBSD is an entire system, not just the kernel. This is not a BSD system, since most of the system is the same as the GNU/Linux system.
fr: Il y a une version de GNU qui utilise le noyau provenant de NetBSD. Ses d&eacute;veloppeurs l'ont appel&eacute; &laquo;&nbsp;Debian GNU/NetBSD&nbsp;&raquo;, mais &laquo;&nbsp;GNU/noyaudeNetBSD&nbsp;&raquo; serait plus pr&eacute;cis, puisque NetBSD est un syst&egrave;me complet, et pas uniquement le noyau utilis&eacute;. Ce n'est pas un syst&egrave;me BSD, puisque la majorit&eacute; du syst&egrave;me est identique au syst&egrave;me GNU/Linux.

source: If I install the GNU tools on Windows, does that mean I am running a GNU/Windows system?
fr: Si j'installe les outils GNU sur Windows, cela signifie-t-il que je fonctionne sous un syst&egrave;me GNU/Windows&nbsp;?

source: Not in the same sense that we mean by &ldquo;GNU/Linux&rdquo;. The tools of GNU are just a part of the GNU software, which is just a part of the GNU system, and underneath them you would still have another complete operating system which has no code in common with GNU. All in all, that's a very different situation from GNU/Linux.
fr: Pas dans le m&ecirc;me sens que nous utilisons dans &laquo;&nbsp;GNU/Linux&nbsp;&raquo;. Les outils de GNU sont simplement une partie des logiciels GNU, qui sont une partdu syst&egrave;me GNU, et sous ces outils vous aurez encore un syst&egrave;me d'exploitation complet n'ayant aucun code en commun avec GNU. C'est donc une situation tr&egrave;s diff&eacute;rente de GNU/Linux.

source: Can't there be Linux systems without GNU?
fr: Ne peut-il y avoir de syst&egrave;mes Linux sans GNU&nbsp;?

source: It is possible to make a system that uses Linux as the kernel but is not based on GNU. I'm told there are small systems, used for embedded development, that include Linux but not the GNU system. IBM was once rumored to be planning to put Linux as the kernel into AIX; whether or not they actually tried to do this, it is theoretically possible. What conclusions can we draw from this about the naming of various systems?
fr: Il est possible de faire un syst&egrave;me qui utilise Linux comme noyau mais n'est pas bas&eacute; sur GNU. J'ai entendu parler de petits syst&egrave;mes, utilis&eacute;s pour du d&eacute;veloppement embarqu&eacute;, qui incluent Linux mais pas le syst&egrave;me GNU. Il y a eu &agrave; un moment des rumeurs sur IBM, disant qu'ils pensaient utiliser le noyau Linux dans un syst&egrave;me AIX&nbsp;: qu'ils essayent r&eacute;ellement de le faire ou non, c'est th&eacute;oriquement possible. Quelles conclusions devons-nous tirer quant &agrave; la d&eacute;nomination des diff&eacute;rents syst&egrave;mes&nbsp;?

source: People who think of the kernel as more important than all the rest of the system say, &ldquo;They all contain Linux, so let's call them all Linux systems.&rdquo; But any two of these systems are mostly different, and calling them by the same name is misleading. (It leads people to think that the kernel is more important than all the rest of the system, for instance.)
fr: Les personnes qui pensent que le noyau est plus important que tout le reste du syst&egrave;me disent&nbsp;: &laquo;&nbsp;Ils contiennent tous Linux, donc appelons tous les syst&egrave;mes Linux.&nbsp;&raquo; Mais chacun de ces syst&egrave;mes est tr&egrave;s diff&eacute;rents des autres, et les appeler tous par le m&ecirc;me nom conduit &agrave; la confusion. (Cela am&egrave;ne les gens &agrave; penser que le noyau est plus important que tout le reste du syst&egrave;me, par exemple.).

source: In the small embedded systems, Linux may be most of the system; perhaps &ldquo;Linux systems&rdquo; is the right name for them. They are very different from GNU/Linux systems, which are more GNU than Linux. The hypothetical IBM system would be different from either of those. The right name for it would be AIX/Linux: basically AIX, but with Linux as the kernel. These different names would show users how these systems are different.
fr: Dans les petits syst&egrave;mes embarqu&eacute;s, Linux constitue peut-&ecirc;tre la majorit&eacute; du syst&egrave;me&nbsp;: peut-&ecirc;tre que &laquo;&nbsp;syst&egrave;mes Linux&nbsp;&raquo; est le bon terme pour eux. Ils sont tr&egrave;s diff&eacute;rents des syst&egrave;mes GNU/Linux, qui sont plus GNU que Linux. Le syst&egrave;me IBM hypoth&eacute;tique serait diff&eacute;rent de ces deux groupes. Le nom correct &agrave; lui donner serait AIX/Linux&nbsp;: fondamentalement AIX, mais avec le noyau Linux. Ces diff&eacute;rents noms montreraient aux utilisateurs en quoi ces syst&egrave;mes sont diff&eacute;rents.

source: Why not call the system &ldquo;Linux&rdquo; anyway, and strengthen Linus Torvalds' role as posterboy for our community?
fr: Pourquoi ne pas carr&eacute;ment appeler le syst&egrave;me &laquo;&nbsp;Linux&nbsp;&raquo;, et renforcer le r&ocirc;le de Linus Torwald comme posterboy (ndt&nbsp;: t&ecirc;te d'affiche, image de pub) pour notre communaut&eacute;&nbsp;?

source: Linus Torvalds is the &ldquo;posterboy&rdquo; (other people's choice of word, not ours) for his goals, not ours. His goal is to make the system more popular, and he believes its value to society lies merely in the practical advantages it offers: its power, reliability and easy availability. He has never advocated <a href="/philosophy/why-free.html">freedom to cooperate</a> as an ethical principle, which is why the public does not connect the name &ldquo;Linux&rdquo; with that principle.
fr: Linus Torvalds est le &laquo;&nbsp;posterboy&nbsp;&raquo; (ce terme ne vient pas de nous mais d'autres personnes) pour ses buts propres, pas les n&ocirc;tres. Son but est de rendre le syst&egrave;me plus populaire, et il croit que sa valeur pour la soci&eacute;t&eacute; r&eacute;side essentiellement dans les avantages pratiques qu'il offre. Sa puissance, sa fiabilit&eacute; et sa grande disponibilit&eacute;. Il n'a jamais adh&eacute;r&eacute; &agrave; <a href="/philosophy/why-free.fr.html">la libert&eacute; de coop&eacute;rer</a> en tant que principe &eacute;thique, c'est pourquoi le public ne rapproche pas le nom &laquo;&nbsp;Linux&nbsp;&raquo; avec ce principe.

source: Linus publicly states his disagreement with the free software movement's ideals. He developed non-free software in his job for many years (and said so to a large audience at a &ldquo;Linux&rdquo;World show), and publicly invited fellow developers of Linux, the kernel, to use non-free software to work on it with him. He goes even further, and rebukes people who suggest that engineers and scientists should consider social consequences of our technical work&mdash;rejecting the lessons society learned from the development of the atom bomb.
fr: Linus a publiquement affirm&eacute; son d&eacute;saccord avec les id&eacute;aux du mouvement du logiciel libre. Il a d&eacute;velopp&eacute; des logiciels non-libres dans son travail pendant de nombreuses ann&eacute;es (et l'a dit &agrave; un large public au cours d'une pr&eacute;sentation mondiale &laquo;&nbsp;Linux&nbsp;&raquo;), et a publiquement invit&eacute; ses coll&egrave;gues d&eacute;veloppeurs de Linux, le noyau, &agrave; utiliser des logiciels non-libres pour travailler dessus avec lui. Il va m&ecirc;me plus loin, et rembarre les personnes qui sugg&egrave;rent que les ing&eacute;nieurs et scientifiques devraient consid&eacute;rer les cons&eacute;quences sociales de leur travaux techniques (rejetant ainsi les le&ccedil;ons apprises par la soci&eacute;t&eacute; depuis le d&eacute;veloppement de la bombe atomique).

source: There is nothing wrong with writing a free program for the motivations of learning and having fun; the kernel Linus wrote for those reasons was an important contribution to our community. But those motivations are not the reason why the complete free system, GNU/Linux, exists, and they won't secure our freedom in the future. The public needs to know this. Linus has the right to promote his views; however, people should be aware that the operating system in question stems from ideals of freedom, not from his views.
fr: Il n'y a rien de mal &agrave; &eacute;crire un programme libre pour des motivations d'apprentissage et d'amusement&nbsp;: le noyau &eacute;crit par Linus pour ces raisons est une contribution importante &agrave; notre communeaut&eacute;. Mais ces raisons ne sont pas celles pour lesquelles le syst&egrave;me compl&egrave;tement libre, GNU/Linux,existe, et elles n'assureront pas notre libert&eacute; dans le futur. Le public a besoin de savoir cela. Linus a le droit de promouvoir son point de vue&nbsp;: cependant les gens devraient &ecirc;tre au courant que le syst&egrave;me d'exploitation en question provient d'id&eacute;aux de libert&eacute;, et pas de son point de vue.

source: Isn't it wrong for us to label Linus Torvalds' work as GNU?
fr: N'est-il pas incorrect de notre part de libeller le travail de Linus Torvalds, GNU&nbsp;?

source: It would be wrong, so we don't do that. Torvalds' work is Linux, the kernel; we are careful not to attribute that work to the GNU Project or label it as &ldquo;GNU&rdquo;. When we talk about the whole system, the name &ldquo;GNU/Linux&rdquo; gives him a share of the credit.
fr: Ce serait incorrect, c'est pourquoi nous ne le faisons pas. Le travail de Torvalds est Linux, le noyau&nbsp;; nous faisons attention &agrave; ne pas attribuer ce travail au projet GNUou de l'&eacute;tiqueter &laquo;&nbsp;GNU&nbsp;&raquo;. Quand nous parlons du syst&egrave;me entier, le nom &laquo;&nbsp;GNU/Linux&nbsp;&raquo; lui donne une part ducr&eacute;dit.

source: Does Linus Torvalds agree that Linux is just the kernel?
fr: Linus Torvalds reconna&icirc;t-il que Linux est uniquement le noyau&nbsp;?

source: He recognized this at the beginning. The earliest Linux release notes said, <a href="http://www.kernel.org/pub/linux/kernel/Historic/old-versions/RELNOTES-0.01"> &ldquo;Most of the tools used with linux are GNU software and are under the GNU copyleft. These tools aren't in the distribution - ask me (or GNU) for more info&rdquo;</a>.
fr: Il l'a reconnu d&egrave;s le d&eacute;but. La premi&egrave;re note de distribution de Linux dit&nbsp;: <a href="http://www.kernel.org/pub/linux/kernel/Historic/old-versions/RELNOTES-0.01">&laquo;&nbsp;La plupart des outils utilis&eacute;s avec Linux sont des logiciels GNU et sont sous la licence GNU. Ces outils ne sont pas dans la distribution&nbsp;: demandez-moi (ou &agrave; GNU) pour plus d'informations.&nbsp;&raquo;</a>.

source: The battle is already lost&mdash;society has made its decision and we can't change it, so why even think about it?
fr: La bataille est d&eacute;j&agrave; perdue&nbsp;: la soci&eacute;t&eacute; a pris sa d&eacute;cision et nous ne pouvons rien y changer, pourquoi continuer &agrave; y penser&nbsp;?

source: This isn't a battle, it is a campaign of education. What to call the system is not a single decision, to be made at one moment by &ldquo;society&rdquo;: each person, each organization, can decide what name to use. You can't make others say &ldquo;GNU/Linux&rdquo;, but you can decide to call the system &ldquo;GNU/Linux&rdquo; yourself&mdash;and by doing so, you will help educate others.
fr: Ceci n'est pas une bataille, c'est une campagne &eacute;ducative. Comment nommer le syst&egrave;me n'est pas une d&eacute;cision unique, prise &agrave; un moment donn&eacute; par la &laquo;&nbsp;soci&eacute;t&eacute;&nbsp;&raquo;&nbsp;: chaque personne, chaque organisation, peut d&eacute;cider quel nom utiliser. Vous ne pouvez forcer les autres &agrave; dire &laquo;&nbsp;GNU/Linux&nbsp;&raquo;, mais vous pouvez d&eacute;cider d'appeler le syst&egrave;me &laquo;&nbsp;GNU/Linux&nbsp;&raquo; vous-m&ecirc;me, et ainsi, vous &eacute;duquerez les autres.

source: Society has made its decision and we can't change it, so what good does it do if I say &ldquo;GNU/Linux&rdquo;?
fr: La soci&eacute;t&eacute; a pris sa d&eacute;cision et nous ne pouvons rien y changer, quel bien cela fait-il si je dis &laquo;&nbsp;GNU/Linux&nbsp;&raquo;&nbsp;?

source: This is not an all-or-nothing situation: correct and incorrect pictures are being spread more or less by various people. If you call the system &ldquo;GNU/Linux&rdquo;, you will help others learn the system's true history, origin, and reason for being. You can't correct the misnomer everywhere on your own, any more than we can, but you can help. If only a few hundred people see you use the term &ldquo;GNU/Linux&rdquo;, you will have educated a substantial number of people with very little work. And some of them will spread the correction to others.
fr: Ce n'est pas une situation tout-ou-rien&nbsp;: les deux noms, le correct et l'incorrect, sont plus ou moins r&eacute;pandus par diverses personnes. Si vous appelez le syst&egrave;me &laquo;&nbsp;GNU/Linux&nbsp;&raquo;, vous aiderez d'autres personnes &agrave; apprendre la vraie histoire, origine et raison d'&ecirc;tre du syst&egrave;me. Vous ne pouvez corriger tout ceux qui utilisent le nom incorrect par vous-m&ecirc;me, pas plus que nous ne le pouvons. Mais si seulement quelques centaines de personnes vous voient utiliser le terme correct &laquo;&nbsp;GNU/Linux&nbsp;&raquo;, vous aurez &eacute;duqu&eacute; un nombre substantiel de personnes avec tr&egrave;s peu de travail. Et certains d'entre eux r&eacute;pandrons s&ucirc;rement la correction &agrave; d'autres personnes.

source: Wouldn't it be better to call the system &ldquo;Linux&rdquo; and teach people its real origin with a ten-minute explanation?
fr: Ne serait-il pas mieux d'appeler le syst&egrave;me &laquo;&nbsp;Linux&nbsp;&raquo; et d'apprendre aux gens son origine r&eacute;elle avec une explication tenant en 10 minutes&nbsp;?
