Repository: gitGNU/gnu_www-fr
Catalog: gnu/gnu-history.*.po
Languages: fr

source: Overview of the GNU System - GNU Project - Free Software Foundation (FSF)
fr: Histoire du syst&egrave;me GNU - GNU Project - Free Software Foundation (FSF)

source: Overview of the GNU System
fr: Histoire du syst&egrave;me GNU

source: The GNU operating system is a complete free software system, upward-compatible with Unix. GNU stands for &ldquo;GNU's Not Unix&rdquo;. <a href="http://www.stallman.org/">Richard Stallman</a> made the <a href="/gnu/initial-announcement.html">Initial Announcement</a> of the GNU Project in September 1983. A longer version called the <a href="/gnu/manifesto.html">GNU Manifesto</a> was published in March 1985. It has been translated into several <a href="/gnu/manifesto.html#translations">other languages</a>.
fr: Le syst&egrave;me d'exploitation GNU est un syst&egrave;me complet de logiciels libres qui a une compatibilit&eacute; ascendante avec Unix. «&nbsp;GNU&nbsp;» signifie «&nbsp;GNU's Not Unix&nbsp;». <a href="http://www.stallman.org/">Richard Stallman</a> a fait <a href="/gnu/initial-announcement.fr.html">l'annonce initiale</a> du projet GNU en septembre 1983. Une version plus longue appel&eacute;e <a href="/gnu/manifesto.html">Manifeste GNU</a> a &eacute;t&eacute; publi&eacute;e en septembre 1985. Il a &eacute;t&eacute; traduit dans diff&eacute;rentes <a href="/gnu/manifesto.fr.html#translations">langues</a>.

source: The name &ldquo;GNU&rdquo; was chosen because it met a few requirements; first, it was a recursive acronym for &ldquo;GNU's Not Unix&rdquo;, second, because it was a real word, and third, it was fun to say (or <a href="http://www.poppyfields.net/poppy/songs/gnu.html">Sing</a>).
fr: Le nom &laquo;GNU&raquo; fut choisi parce qu'il satisfait &agrave; quelques conditions&nbsp;: premi&egrave;rement c'&eacute;tait un acronyme r&eacute;cursif pour &laquo;GNU's Not Unix&raquo;, en second lieu, c'&eacute;tait un mot r&eacute;el, et troisi&egrave;mement il &eacute;tait dr&ocirc;le &agrave; prononcer (ou &agrave; <a href="http://www.poppyfields.net/poppy/songs/gnu.html">chanter</a>).

source: The word &ldquo;free&rdquo; in &ldquo;free software&rdquo; pertains to <a href="/philosophy/free-sw.html">freedom</a>, not price. You may or may not pay a price to get GNU software. Either way, once you have the software you have three specific freedoms in using it. First, the freedom to copy the program and give it away to your friends and co-workers; second, the freedom to change the program as you wish, by having full access to source code; third, the freedom to distribute an improved version and thus help build the community. (If you redistribute GNU software, you may charge a fee for the physical act of transferring a copy, or you may give away copies.)
fr: Le mot &laquo;libre&raquo; ci-dessus fait r&eacute;f&eacute;rence &agrave; la <a href="/philosophy/free-sw.fr.html">libert&eacute;</a>, et non au prix. Vous pouvez avoir pay&eacute; des copies d'un logiciel GNU, ou les avoir obtenues sans frais. Mais quoi qu'il en soit, vous poss&eacute;dez trois libert&eacute;s sp&eacute;cifiques. Premi&egrave;rement, la libert&eacute; de copier le programme et de le donner &agrave; vos amis ou coll&egrave;gues. Deuxi&egrave;mement, la libert&eacute; de modifier le programme comme vous l'entendez, gr&acirc;ce &agrave; un acc&egrave;s complet au code source. Troisi&egrave;mement, la libert&eacute; de distribuer une version am&eacute;lior&eacute;e et ainsi aider la communaut&eacute;. (Si vous redistribuez des logiciels GNU, vous pouvez percevoir un droit pour le transfert de la copie, ou vous pouvez les offrir).

source: The project to develop the GNU system is called the &ldquo;GNU Project&rdquo;. The GNU Project was conceived in 1983 as a way of bringing back the cooperative spirit that prevailed in the computing community in earlier days&mdash;to make cooperation possible once again by removing the obstacles to cooperation imposed by the owners of proprietary software.
fr: Le projet pour d&eacute;velopper le syst&egrave;me d'exploitation GNU est appel&eacute; le &laquo;Projet GNU&raquo;. Le projet GNU a &eacute;t&eacute; con&ccedil;u en 1983 comme une mani&egrave;re de r&eacute;tablir l'esprit coop&eacute;ratif qui pr&eacute;valait dans la communaut&eacute; informatique aux premiers jours, pour rendre la coop&eacute;ration à nouveau possible en supprimant les barri&egrave;res &agrave; la coop&eacute;ration impos&eacute;es par les possesseurs de logiciels propri&eacute;taires.

source: In 1971, when Richard Stallman started his career at MIT, he worked in a group which used <a href="/philosophy/free-sw.html">free software</a> exclusively. Even computer companies often distributed free software. Programmers were free to cooperate with each other, and often did.
fr: En 1971, quand Richard Stallman d&eacute;marra sa carri&egrave;re au MIT, il travaillait dans un groupe qui utilisait exclusivement des <a href="/philosophy/free-sw.fr.html">logiciels libres</a>. M&ecirc;me les soci&eacute;t&eacute;s informatiques distribuaient des logiciels libres. Les programmeurs &eacute;taient libres de coop&eacute;rer entre eux, et ils le faisaient souvent.

source: By the 1980s, almost all software was <a href="/philosophy/categories.html#ProprietarySoftware">proprietary</a>, which means that it had owners who forbid and prevent cooperation by users. This made the GNU Project necessary.
fr: Au d&eacute;but des ann&eacute;es 80, presque tous les logiciels &eacute;taient des logiciels <a href="/philosophy/categories.fr.html#ProprietarySoftware">propri&eacute;taires</a>, ce qui signifie que les propri&eacute;taires de logiciels interdisaient et emp&ecirc;chaient la coop&eacute;ration entre utilisateurs. Ceci rendit n&eacute;cessaire le projet GNU.

source: Every computer user needs an operating system; if there is no free operating system, then you can't even get started using a computer without resorting to proprietary software. So the first item on the free software agenda obviously had to be a free operating system.
fr: Chaque utilisateur d'ordinateur a besoin d'un syst&egrave;me d'exploitation; s'il n'y a pas de syst&egrave;me d'exploitation libre, alors vous ne pouvez m&ecirc;me pas commencer &agrave; utiliser un ordinateur sans avoir recours au logiciel propri&eacute;taire. Ainsi la premi&egrave;re question &agrave; l'ordre du jour du logiciel libre a &eacute;t&eacute; &eacute;videmment d'&ecirc;tre un syst&egrave;me d'exploitation libre.

source: We decided to make the operating system compatible with Unix because the overall design was already proven and portable, and because compatibility makes it easy for Unix users to switch from Unix to GNU.
fr: Nous avons d&eacute;cid&eacute; de rendre le syst&egrave;me d'exploitation compatible avec Unix parce que le concept d'ensemble avait d&eacute;j&agrave; fait ses preuves et est portable, et parce que la compatibilit&eacute; rend plus facile le passage de Unix &agrave; GNU, pour les utilisateurs d'Unix.

source: By 1990 we had either found or written all the major components except one&mdash;the kernel. Then Linux, a Unix-like kernel, was developed by Linus Torvalds in 1991 and made free software in 1992. Combining Linux with the almost-complete GNU system resulted in a complete operating system: the GNU/Linux system. Estimates are that tens of millions of people now use GNU/Linux systems, typically via <a href="/distros">distributions</a> such as Slackware, Debian, Red Hat, and others.
fr: Au d&eacute;but des ann&eacute;es 90, nous avions trouv&eacute; ou &eacute;crit les composants majeurs, except&eacute; un&nbsp;: le noyau. Puis Linux, un noyau de type Unix, fut d&eacute;velopp&eacute; par Linus Torvald en 1991 et fut un logiciel libre en 1992. La combinaison du noyau Linux avec le syst&egrave;me &agrave; peu pr&egrave;s complet GNU a pour r&eacute;sultat un syst&egrave;me d'exploitation complet&nbsp;: le syst&egrave;me d'exploitation GNU/Linux. On estime que des dizaines de millions de personnes utilisent actuellement des syst&egrave;mes d'exploitation GNU/Linux, typiquement des <a href="/distros">distributions</a> comme Slackware, Debian, Red Hat, et d'autres.

source: (The principal version of Linux now contains non-free firmware &ldquo;blobs&rdquo;. Free software activists now maintain a modified <a href="http://directory.fsf.org/project/linux">free version</a> of Linux.)
fr: (La version principale de Linux contient actuellement des &laquo;&nbsp;blobs&nbsp;&raquo; (NdT&nbsp;: grands objets binaires) non-libres de firmware. Des activistes du logiciel libre maintiennent maintenant une <a href="http://directory.fsf.org/project/linux">version libre</a> modifi&eacute;e de Linux.)

source: However, the GNU Project is not limited to the core operating system. We aim to provide a whole spectrum of software, whatever many users want to have. This includes application software. See the <a href="/directory">Free Software Directory</a> for a catalogue of free software application programs.
fr: Cependant, le projet GNU n'est pas limit&eacute; aux syst&egrave;mes d'exploitation. Nous aspirons &agrave; fournir tout l'&eacute;ventail du logiciel, tout ce qui peut int&eacute;resser de nombreux utilisateurs. Ceci inclut des logiciels applicatifs. Consulter le <a href="/directory">R&eacute;pertoire du logiciel libre</a> pour un catalogue d'applications logicielles libres.

source: We also want to provide software for users who are not computer experts. Therefore we developed a <a href="http://www.gnome.org/">graphical desktop (called GNOME)</a> to help beginners use the GNU system.
fr: Nous voulons &eacute;galement fournir des logiciels pour les utilisateurs qui ne sont pas des experts en informatique. Nous avons donc d&eacute;velopp&eacute; <a href="http://www.gnome.org/">une interface graphique (appel&eacute;e GNOME)</a> pour aider les d&eacute;butants &agrave; utiliser le syst&egrave;me GNU.

source: We also want to provide games and other recreations. Plenty of <a href="http://directory.fsf.org/category/games/">free games</a> are already available.
fr: Nous voulons &eacute;galement fournir des jeux et autres logiciels r&eacute;cr&eacute;atifs. Pleins de <a href="http://directory.fsf.org/category/games/">jeux libres</a> sont d&eacute;j&agrave; disponibles.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Jérôme Dominguez<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
