Repository: gitGNU/gnu_www-fr
Catalog: gnu/gnu-linux-faq.*.po
Languages: fr

source: GNU/Linux FAQ - GNU Project - Free Software Foundation (FSF)
fr: FAQ sur GNU/Linux - GNU Project - Free Software Foundation (FSF)

source: GNU/Linux FAQ by Richard Stallman
fr: FAQ sur GNU/Linux par Richard Stallman

source: To learn more about this issue, you can also read our page on <a href="/gnu/linux-and-gnu.html">Linux and the GNU Project</a>, our page on <a href="/gnu/why-gnu-linux.html">Why GNU/Linux?</a> and our page on <a href="/gnu/gnu-users-never-heard-of-gnu.html">GNU Users Who Have Never Heard of GNU</a>.
fr: Pour en savoir plus, voir aussi nos pages suivantes&nbsp;: <a href="/gnu/linux-and-gnu.fr.html">Linux et le Projet GNU</a>, <a href="/gnu/why-gnu-linux.fr.html">Pourquoi GNU/Linux&nbsp;?</a> et <a href="/gnu/gnu-users-never-heard-of-gnu.fr.html">Les utilisateurs de GNU qui n'ont jamais entendu parler de GNU</a>.

source: When people see that we use and recommend the name GNU/Linux for a system that many others call just &ldquo;Linux&rdquo;, they ask many questions. Here are common questions, and our answers.
fr: Quand les gens voient que nous utilisons et recommandons le nom GNU/Linux pour un syst&egrave;me que beaucoup d'autres appellent simplement &laquo;&nbsp;Linux&nbsp;&raquo;, ils se posent beaucoup de questions. Voici les plus communes d'entre elles, et nos r&eacute;ponses.

source: <a href="#why" id="TOCwhy">Why do you call it GNU/Linux and not Linux?</a>
fr: <a href="#why" id="TOCwhy">Pourquoi l'appelez-vous GNU/Linux et pas Linux&nbsp;?</a>

source: <a href="#whycare" id="TOCwhycare">Why is the name important?</a>
fr: <a href="#whycare" id="TOCwhycare">Pourquoi le nom est-il important&nbsp;?</a>

source: <a href="#howerror" id="TOChowerror">How did it come about that most people call the system &ldquo;Linux&rdquo;?</a>
fr: <a href="#howerror" id="TOChowerror">D'o&ugrave; vient le fait que la plupart des gens appellent le syst&egrave;me &laquo;&nbsp;Linux&nbsp;&raquo;?

source: <a href="#always" id="TOCalways">Should we always say &ldquo;GNU/Linux&rdquo; instead of &ldquo;Linux&rdquo;?</a>
fr: <a href="#always" id="TOCalways">Devrions-nous toujours utiliser le nom &laquo;&nbsp;GNU/Linux&nbsp;&raquo; &agrave; la place de &laquo;&nbsp;Linux&nbsp;&raquo;?</a>

source: <a href="#linuxalone" id="TOClinuxalone">Would Linux have achieved the same success if there had been no GNU?</a>
fr: <a href="#linuxalone" id="TOClinuxalone">Est-ce que Linux aurait eu le m&ecirc;me succ&egrave;s s'il n'y avait pas eu GNU&nbsp;?</a>

source: <a href="#divide" id="TOCdivide">Wouldn't it be better for the community if you did not divide people with this request?</a>
fr: <a href="#divide" id="TOCdivide">Ne serait-il pas mieux pour la communaut&eacute; que vous ne divisiez pas les gens avec cette demande&nbsp;?</a>

source: <a href="#freespeech" id="TOCfreespeech">Doesn't the GNU project support an individual's free speech rights to call the system by any name that individual chooses?</a>
fr: <a href="#freespeech" id="TOCfreespeech">Le projet GNU ne soutient-il pas le droit &agrave; la libert&eacute; d'expression de chaque individu d'appeler le syst&egrave;me par n'importe quel nom qu'il choisit&nbsp;?</a>

source: <a href="#everyoneknows" id="TOCeveryoneknows">Since everyone knows the role of GNU in developing the system, doesn't the &ldquo;GNU/&rdquo; in the name go without saying?</a>
fr: <a href="#everyoneknows" id="TOCeveryoneknows">Puisque tout le monde conna&icirc;t le r&ocirc;le de GNU dans le d&eacute;veloppement du syst&egrave;me, le &laquo;&nbsp;GNU/&nbsp;&raquo; dans le nom ne va-t-il pas sans dire&nbsp;?</a>

source: <a href="#everyoneknows2" id="TOCeveryoneknows2">Since I know the role of GNU in this system, why does it matter what name I use?</a>
fr: <a href="#everyoneknows2" id="TOCeveryoneknows2">Puisque je connais le r&ocirc;le de GNU dans ce syst&egrave;me, pourquoi le nom que j'utilise a-t-il une importance&nbsp;?</a>

source: <a href="#windows" id="TOCwindows">Isn't shortening &ldquo;GNU/Linux&rdquo; to &ldquo;Linux&rdquo; just like shortening &ldquo;Microsoft Windows&rdquo; to &ldquo;Windows&rdquo;?</a>
fr: <a href="#windows" id="TOCwindows">L'abr&eacute;viation de &laquo;&nbsp;GNU/Linux&nbsp;&raquo; en &laquo;&nbsp;Linux&nbsp;&raquo; n'est-elle pas simplement comme l'abr&eacute;viation de &laquo;&nbsp;Microsoft Windows&nbsp;&raquo; en &laquo;&nbsp;Windows&nbsp;&raquo;?</a>

source: <a href="#tools" id="TOCtools">Isn't GNU a collection of programming tools that were included in Linux?</a>
fr: <a href="#tools" id="TOCtools">Est-ce que GNU n'est pas une biblioth&egrave;que d'outils de programmation qui a &eacute;t&eacute; int&eacute;gr&eacute;e dans Linux&nbsp;?</a>

source: <a href="#osvskernel" id="TOCosvskernel">What is the difference between an operating system and a kernel?</a>
fr: <a href="#osvskernel" id="TOCosvskernel">Quelle est la diff&eacute;rence entre un syst&egrave;me d'exploitation et un noyau&nbsp;?</a>

source: <a href="#house" id="TOChouse">The kernel of a system is like the foundation of a house. How can a house be almost complete when it doesn't have a foundation?</a>
fr: <a href="#house" id="TOChouse">Le noyau d'un syst&egrave;me est comme les fondations d'une maison. Comment une maison peut-elle &ecirc;tre presque termin&eacute;e quand elle n'a pas de fondation&nbsp;?</a>

source: <a href="#brain" id="TOCbrain">Isn't the kernel the brain of the system?</a>
fr: <a href="#brain" id="TOCbrain">Le noyau n'est-il pas le cerveau du système&nbsp;?</a>

source: <a href="#kernelmost" id="TOCkernelmost">Isn't writing the kernel most of the work in an operating system?</a>
fr: <a href="#kernelmost" id="TOCkernelmost">L'écriture du noyau n'est-elle pas le plus gros travail dans un système d'exploitation&nbsp;?</a>

source: <a href="#afterkernel" id="TOCafterkernel">We're calling the whole system after the kernel, Linux. Isn't it normal to name an operating system after a kernel?</a>
fr: <a href="#afterkernel" id="TOCafterkernel">Nous nommons le syst&egrave;me entier d'apr&egrave;s son noyau, Linux. N'est-il pas normal d'appeler un syst&egrave;me d'exploitation d'apr&egrave;s son noyau&nbsp;?

source: <a href="#long" id="TOClong">The problem with &ldquo;GNU/Linux&rdquo; is that it is too long. How about recommending a shorter name?</a>
fr: <a href="#long" id="TOClong">Le probl&egrave;me avec &laquo;&nbsp;GNU/Linux&nbsp;&raquo; est que c'est trop long. Pourquoi ne pas recommander un nom plus court&nbsp;?</a>

source: <a href="#justgnu" id="TOCjustgnu">Since Linux is a secondary contribution, would it be false to the facts to call the system simply "GNU"?</a>
fr: <a href="#justgnu" id="TOCjustgnu">Puisque Linux est une contribution secondaire serait-il incorrect dans les faits d'appeler simplement le syst&egrave;me &laquo;&nbsp;GNU&nbsp;&raquo;?</a>

source: <a href="#trademarkfee" id="TOCtrademarkfee">I would have to pay a fee if I use &ldquo;Linux&rdquo; in the name of a product, and that would also apply if I say &ldquo;GNU/Linux&rdquo;. Is it wrong if I use &ldquo;GNU&rdquo; without &ldquo;Linux&rdquo;, to save the fee?</a>
fr: <a href="#trademarkfee" id="TOCtrademarkfee">J'aurais besoin de payer une taxe si j'utilisais &laquo;&nbsp;Linux&nbsp;&raquo; dans le nom d'un produit, et ce serait aussi le cas si j'utilisais &laquo;&nbsp;GNU/Linux&nbsp;&raquo;. Est-ce un probl&egrave;me d'utiliser&laquo;&nbsp;GNU&nbsp;&raquo; sans &laquo;&nbsp;Linux&nbsp;&raquo;, pour &eacute;viter la taxe&nbsp;?</a>

source: <a href="#many" id="TOCmany">Many other projects contributed to the system as it is today; it includes TeX, X11, Apache, Perl, and many more programs. Don't your arguments imply we have to give them credit too? (But that would lead to a name so long it is absurd.)</a>
fr: <a href="#many" id="TOCmany">Beaucoup d'autres projets ont contribu&eacute; au syst&egrave;me tel qu'il est actuellement&nbsp;: cela inclut TeX, X11, Apache, Perl, et beaucoup d'autres programmes. Est-ce que votre argument n'implique pas que nous devrions leur donner de la reconnaissance &eacute;galement&nbsp;? (Mais cela m&egrave;nerait &agrave; un nom aussi long qu'absurde).</a>

source: <a href="#others" id="TOCothers">Many other projects contributed to the system as it is today, but they don't insist on calling it XYZ/Linux. Why should we treat GNU specially?</a>
fr: <a href="#others" id="TOCothers">Beaucoup d'autre projets ont contribu&eacute; au syst&egrave;me tel qu'il est actuellement, mais ils n'insistent pas &agrave; demander qu'on l'appelle XYZ/Linux. Pourquoi devrait-on traiter GNU sp&eacute;cialement&nbsp;?</a>

source: <a href="#allsmall" id="TOCallsmall">GNU is a small fraction of the system nowadays, so why should we mention it?</a>
fr: <a href="#allsmall" id="TOCallsmall">GNU est une petite fraction du syst&egrave;me de nos jours, alors pourquoi le mentionnerait-on&nbsp;?</a>

source: <a href="#manycompanies" id="TOCmanycompanies">Many companies contributed to the system as it is today; doesn't that mean we ought to call it GNU/Redhat/Novell/Linux?</a>
fr: <a href="#manycompanies" id="TOCmanycompanies">Beaucoup d'entreprises ont contribu&eacute; au syst&egrave;me tel qu'il est actuellement, cela ne signifie-t-il pas que nous devrions l'appeler GNU/Redhat/Novell/Linux?</a>

source: <a href="#whyslash" id="TOCwhyslash">Why do you write &ldquo;GNU/Linux&rdquo; instead of &ldquo;GNU Linux&rdquo;?</a>
fr: <a href="#whyslash" id="TOCwhyslash">Pourquoi &eacute;crivez-vous &laquo;&nbsp;GNU/Linux&nbsp;&raquo; au lieu de &laquo;&nbsp;GNU Linux&nbsp;&raquo;?</a>

source: <a href="#whyorder" id="TOCwhyorder">Why &ldquo;GNU/Linux&rdquo; rather than &ldquo;Linux/GNU&rdquo;?</a>
fr: <a href="#whyorder" id="TOCwhyorder">Pourquoi &laquo;&nbsp;GNU/Linux&nbsp;&raquo; plut&ocirc;t que &laquo;&nbsp;Linux/GNU&nbsp;&raquo;?</a>

source: <a href="#distronames" id="TOCdistronames">My distro is called &ldquo;Foobar Linux&rdquo;; doesn't that show it's really Linux?</a>
fr: <a href="#distronames" id="TOCdistronames">Ma distribution s'appelle &laquo;&nbsp;Foobar Linux&nbsp;&raquo;&nbsp;: est-ce que cela ne montre pas que c'est r&eacute;ellement Linux&nbsp;?</a>

source: <a href="#distronames1" id="TOCdistronames1">My distro's official name is &ldquo;Foobar Linux&rdquo;; isn't it wrong to call the distro anything but &ldquo;Linux&rdquo;?</a>
fr: <a href="#distronames1" id="TOCdistronames1">Le nom officiel de ma distribution est &laquo;&nbsp;Foobar Linux&nbsp;&raquo;&nbsp;: cela ne pose-t-il pas un probl&egrave;me de l'appeler par n'importe quel autre nom que juste &laquo;&nbsp;Linux&nbsp;&raquo;?</a>

source: <a href="#companies" id="TOCcompanies">Wouldn't it be more effective to ask companies such as Mandrake, Red Hat and IBM to call their distributions &ldquo;GNU/Linux&rdquo; rather than asking individuals?</a>
fr: <a href="#companies" id="TOCcompanies">Ne serait-il pas plus efficace de demander &agrave; des entreprises comme Mandrake, Red Hat et IBM d'appeler leur distributions &laquo;&nbsp;GNU/Linux&nbsp;&raquo; plut&ocirc;t que de demander &agrave; chaque personne individuellement&nbsp;?</a>

source: <a href="#reserve" id="TOCreserve">Wouldn't it be better to reserve the name &ldquo;GNU/Linux&rdquo; for distributions that are purely free software? After all, that is the ideal of GNU.</a>
fr: <a href="#reserve" id="TOCreserve">Ne serait-il pas mieux de r&eacute;server le nom &laquo;&nbsp;GNU/Linux&nbsp;&raquo; pour les distributions constitu&eacute;es uniquement de logiciels libres&nbsp;? Apr&egrave;s tout, c'est bien l'id&eacute;al de GNU.</a>

source: <a href="#gnudist" id="TOCgnudist">Why not make a GNU distribution of Linux (sic) and call that GNU/Linux?</a>
fr: <a href="#gnudist" id="TOCgnudist">Pourquoi ne pas faire une distribution de Linux (sic) et l'appeler GNU/Linux&nbsp;?</a>

source: <a href="#linuxgnu" id="TOClinuxgnu">Why not just say &ldquo;Linux is the GNU kernel&rdquo; and release some existing version of GNU/Linux under the name &ldquo;GNU&rdquo;?</a>
fr: <a href="#linuxgnu" id="TOClinuxgnu">Pourquoi ne pas simplement dire &laquo;&nbsp;Linux est le noyau de GNU&nbsp;&raquo; et ne pas distribuer une version existante quelconque de GNU/Linux sous le nom &laquo;&nbsp;GNU&nbsp;&raquo;&nbsp;?</a>

source: <a href="#condemn" id="TOCcondemn">Did the GNU Project condemn and oppose use of Linux in the early days?</a>
fr: <a href="#condemn" id="TOCcondemn">Le projet GNU a-t-il condamn&eacute; ou s'est-il oppos&eacute; &agrave; Linux dans les premiers temps&nbsp;?</a>

source: <a href="#wait" id="TOCwait">Why did you wait so long before asking people to use the name GNU/Linux?</a>
fr: <a href="#wait" id="TOCwait">Pourquoi avez-vous attendu si longtemps avant de demander aux gens d'utiliser le nom GNU/Linux&nbsp;?</a>

source: <a href="#allgpled" id="TOCallgpled">Should the GNU/[name] convention be applied to all programs that are GPL'ed?</a>
fr: <a href="#allgpled" id="TOCallgpled">La convention GNU/<i>nom</i> devrait-elle &ecirc;tre appliqu&eacute;e &agrave; tous les programmes sous GPL&nbsp;?</a>

source: <a href="#unix" id="TOCunix">Since much of GNU comes from Unix, shouldn't GNU give credit to Unix by using &ldquo;Unix&rdquo; in its name?</a>
fr: <a href="#unix" id="TOCunix">Puisque la majorit&eacute; de GNU vient d'Unix, GNU ne devrait-il pas montrer de la reconnaissance &agrave; Unix en utilisant &laquo;&nbsp;Unix&nbsp;&raquo; dans son nom&nbsp;?</a>

source: <a href="#bsd" id="TOCbsd">Should we say &ldquo;GNU/BSD&rdquo; too?</a>
fr: <a href="#bsd" id="TOCbsd">Devrions-nous dire &eacute;galement &laquo;&nbsp;GNU/BSD&nbsp;&raquo;&nbsp;?</a>

source: <a href="#othersys" id="TOCothersys">If I install the GNU tools on Windows, does that mean I am running a GNU/Windows system?</a>
fr: <a href="#othersys" id="TOCothersys">Si j'installe les outils GNU sur Windows, cela signifie-t-il que je fonctionne sous un syst&egrave;me GNU/Windows&nbsp;?</a>

source: <a href="#justlinux" id="TOCjustlinux">Can't there be Linux systems without GNU?</a>
fr: <a href="#justlinux" id="TOCjustlinux">Ne peut-il y avoir de syst&egrave;mes Linux sans GNU&nbsp;?</a>

source: <a href="#helplinus" id="TOChelplinus">Why not call the system &ldquo;Linux&rdquo; anyway, and strengthen Linus Torvalds' role as posterboy for our community?</a>
fr: <a href="#helplinus" id="TOChelplinus">Pourquoi ne pas carr&eacute;ment appeler le syst&egrave;me &laquo;&nbsp;Linux&nbsp;&raquo;, et renforcer le r&ocirc;le de Linus Torwald comme posterboy (NdT&nbsp;: t&ecirc;te d'affiche, image de pub) pour notre communaut&eacute;&nbsp;?</a>

source: <a href="#claimlinux" id="TOCclaimlinux">Isn't it wrong for us to label Linus Torvalds' work as GNU?</a>
fr: <a href="#claimlinux" id="TOCclaimlinux">N'est-il pas incorrect de notre part de libeller le travail de Linus Torvalds, GNU&nbsp;?</a>

source: <a href="#linusagreed" id="TOClinusagreed">Does Linus Torvalds agree that Linux is just the kernel?</a>
fr: <a href="#linusagreed" id="TOClinusagreed">Linus Torvalds reconna&icirc;t-il que Linux est uniquement le noyau&nbsp;?</a>

source: <a href="#lost" id="TOClost">The battle is already lost&mdash;society has made its decision and we can't change it, so why even think about it?</a>
fr: <a href="#lost" id="TOClost">La bataille est d&eacute;j&agrave; perdue&nbsp;: la soci&eacute;t&eacute; a pris sa d&eacute;cision et nous ne pouvons rien y changer, pourquoi continuer &agrave; y penser&nbsp;?</a>

source: <a href="#whatgood" id="TOCwhatgood">Society has made its decision and we can't change it, so what good does it do if I say &ldquo;GNU/Linux&rdquo;?</a>
fr: <a href="#whatgood" id="TOCwhatgood">La soci&eacute;t&eacute; a pris sa d&eacute;cision et nous ne pouvons rien y changer, quel bien cela fait-il si je dis &laquo;&nbsp;GNU/Linux&nbsp;&raquo;&nbsp;?</a>

source: <a href="#explain" id="TOCexplain">Wouldn't it be better to call the system &ldquo;Linux&rdquo; and teach people its real origin with a ten-minute explanation?</a>
fr: <a href="#explain" id="TOCexplain">Ne serait-il pas mieux d'appeler le syst&egrave;me &laquo;&nbsp;Linux&nbsp;&raquo; et d'apprendre aux gens son origine r&eacute;elle avec une explication tenant en 10 minutes&nbsp;?</a>

source: <a href="#treatment" id="TOCtreatment">Some people laugh at you when you ask them to call the system GNU/Linux. Why do you subject yourself to this treatment?</a>
fr: <a href="#treatment" id="TOCtreatment">Certaines personnes se moquent de vous quand vous leur demandez d'appeler le syst&egrave;me GNU/Linux. Pourquoi se rendre la cible de ce traitement&nbsp;?</a>

source: <a href="#alienate" id="TOCalienate">Some people condemn you when you ask them to call the system GNU/Linux. Don't you lose by alienating them?</a>
fr: <a href="#alienate" id="TOCalienate">Certaines personnes vous condamnent quand vous leur demandez d'appeler le syst&egrave;me GNU/Linux. Ne perdez-vous pas du terrainen vous les ali&eacute;nant&nbsp;?</a>

source: <a href="#rename" id="TOCrename">Whatever you contributed, is it legitimate to rename the operating system?</a>
fr: <a href="#rename" id="TOCrename">Quelle que soit votre contribution, est-ce l&eacute;gitime de renommer le syst&egrave;me d'exploitation&nbsp;?</a>

source: <a href="#BSDlicense" id="TOCBSDlicense">Since you objected to the original BSD license's advertising requirement to give credit to the University of California, isn't it hypocritical to demand credit for the GNU project?</a>
fr: <a href="#BSDlicense" id="TOCBSDlicense">Puisque vous &eacute;tiez contre l'exigence de publicit&eacute; de la licence originale BSD de reconna&icirc;tre le m&eacute;rite de l'universit&eacute; de Californie, n'est-il pas hypocrite de demander de la reconnaissance pour le projet GNU&nbsp;?</a>

source: <a href="#require" id="TOCrequire">Shouldn't you put something in the GNU GPL to require people to call the system &ldquo;GNU&rdquo;?</a>
fr: <a href="#require" id="TOCrequire">Ne devriez-vous pas mettre quelque chose dans la GPL GNU pour obliger les gens &agrave; appeler le syst&egrave;me &laquo;&nbsp;GNU&nbsp;&raquo;&nbsp;?</a>

source: <a href="#deserve" id="TOCdeserve">Since you failed to put something in the GNU GPL to require people to call the system &ldquo;GNU&rdquo;, you deserve what happened; why are you complaining now?</a>
fr: <a href="#deserve" id="TOCdeserve">Puisque vous avez &eacute;chou&eacute; &agrave; mettre quelque chose dans la GPL GNU qui exige des utilisateurs qu'ils appellent le syst&egrave;me &laquo;&nbsp;GNU&nbsp;&raquo;, vous n'avez que ce que vous m&eacute;ritez&nbsp;: pourquoi vous plaignez-vous maintenant&nbsp;?</a>

source: <a href="#contradict" id="TOCcontradict">Wouldn't you be better off not contradicting what so many people believe?</a>
fr: <a href="#contradict" id="TOCcontradict">Ne seriez-vous pas mieux si vous ne contredisiez pas ce que tant de personnes croient&nbsp;?</a>

source: <a href="#somanyright" id="TOCsomanyright">Since many people call it &ldquo;Linux&rdquo;, doesn't that make it right?</a>
fr: <a href="#somanyright" id="TOCsomanyright">Puisque tant de gens l'appellent &laquo;&nbsp;Linux&nbsp;&raquo;, cela ne leur donne-t-il pas raison&nbsp;?</a>

source: <a href="#winning" id="TOCwinning">Many people care about what's convenient or who's winning, not about arguments of right or wrong. Couldn't you get more of their support by a different road?</a>
fr: <a href="#winning" id="TOCwinning">Beaucoup de personnes sont int&eacute;ress&eacute;es par ce qui est pratique ou au gagnant, pas par des arguments de justice ou d'injustice. Ne pourriez-vous pas obtenir leur soutien par d'autres moyens&nbsp;?</a>

source: Why do you call it GNU/Linux and not Linux?
fr: Pourquoi l'appelez-vous GNU/Linux et pas Linux&nbsp;?

source: Most operating system distributions based on Linux as kernel are basically modified versions of the GNU operating system. We began developing GNU in 1984, years before Linus Torvalds started to write his kernel. Our goal was to develop a complete free operating system. Of course, we did not develop all the parts ourselves&mdash;but we led the way. We developed most of the central components, forming the largest single contribution to the whole system. The basic vision was ours too.
fr: La plupart des distributions de syst&egrave;mes d'exploitation bas&eacute;s sur Linux en tant que noyau sont &agrave; la base des versions modifi&eacute;es du syst&egrave;me d'exploitation GNU. Nous avons commenc&eacute; a d&eacute;velopper GNU en 1984, des ann&eacute;es avant que Linus Torvalds ne commence &agrave; &eacute;crire son noyau. Notre objectif &eacute;tait de d&eacute;velopper un syst&egrave;me d'exploitation enti&egrave;rement libre. Bien s&ucirc;r, nous n'avons pas d&eacute;velopp&eacute; tous ses &eacute;l&eacute;ments nous-m&ecirc;mes &mdash; mais nous avons montr&eacute; la voie. Nous avons d&eacute;velopp&eacute; la plupart des composants principaux, formant la plus importante contribution unique du syst&egrave;me entier. La vision de base &eacute;tait &eacute;galement la n&ocirc;tre.

source: In fairness, we ought to get at least equal mention.
fr: En toute justice, nous devrions avoir au moins une mention &eacute;quivalente

source: See <a href="/gnu/linux-and-gnu.html">Linux and the GNU Project</a> and <a href="/gnu/gnu-users-never-heard-of-gnu.html">GNU Users Who Have Never Heard of GNU</a> for more explanation, and <a href="/gnu/the-gnu-project.html">The GNU Project</a> for the history.
fr: Voir <a href="/gnu/linux-and-gnu.fr.html">Linux et le Projet GNU</a> et <a href="/gnu/gnu-users-never-heard-of-gnu.fr.html">Les utilisateurs de GNU qui n'ont jamais entendu parler de GNU</a> pour plus d'informations, et <a href="/gnu/the-gnu-project.fr.html">Le Projet GNU</a> pour l'historique.

source: Why is the name important?
fr: Pourquoi le nom est-il important&nbsp;?

source: Although the developers of Linux, the kernel, are contributing to the free software community, many of them do not care about freedom. People who think the whole system is Linux tend to get confused and assign to those developers a role in the history of our community which they did not actually play. Then they give inordinate weight to those developers' views.
fr: Bien que les d&eacute;veloppeurs de Linux, le noyau, contribuent &agrave; la communaut&eacute; du logiciel libre, la plupart d'entre eux ne s'int&eacute;ressent pas &agrave; l'aspect libre. Les gens qui pensent que le syst&egrave;me entier est Linux ont souvent les id&eacute;es confuses et donnent &agrave; ces d&eacute;veloppeurs un r&ocirc;le dans l'histoire de notre communaut&eacute; qu'ils n'ont pas r&eacute;ellement jou&eacute;. De cette mani&egrave;re, ils donnent un poids inappropri&eacute; aux points de vue de ces d&eacute;veloppeurs.

source: Calling the system GNU/Linux recognizes the role that our idealism played in building our community, and <a href="/gnu/why-gnu-linux.html">helps the public recognize the practical importance of these ideals</a>.
fr: Appeler le syst&egrave;me GNU/Linux reconna&icirc;t le r&ocirc;le que notre id&eacute;alisme a jou&eacute; dans la construction de notre communaut&eacute;, et <a href="/gnu/why-gnu-linux.fr.html">aide le public &agrave; reconna&icirc;tre l'importance pratique de ces id&eacute;aux</a>.

source: How did it come about that most people call the system &ldquo;Linux&rdquo;?
fr: D'o&ugrave; vient le fait que la plupart des gens appellent le syst&egrave;me &laquo;&nbsp;Linux&nbsp;&raquo;?

source: Calling the system &ldquo;Linux&rdquo; is a confusion that has spread faster than the corrective information.
fr: Appeler le syst&egrave;me &laquo;&nbsp;Linux&nbsp;&raquo; est une confusion qui s'est r&eacute;pandue plus rapidement que l'information corrective.
