Repository: gitGNU/gnu_www-fr
Catalog: gnu/gnu-linux-faq.*.po
Languages: fr

source: If you help us by explaining to others in that way, we appreciate your effort, but that is not the best method. It is not as effective as calling the system &ldquo;GNU/Linux&rdquo;, and uses your time inefficiently.
fr: Si vous nous aidez en expliquant aux autres le probl&egrave;me de cette fa&ccedil;on, nous appr&eacute;cions votre effort, mais ce n'est pas la meilleure m&eacute;thode. Ce n'est pas aussi efficace que d'appeler le syst&egrave;me &laquo;&nbsp;GNU/Linux&nbsp;&raquo;, et utilise votre temps inefficacement.

source: It is ineffective because it may not sink in, and surely will not propagate. Some of the people who hear your explanation will pay attention, and they may learn a correct picture of the system's origin. But they are unlikely to repeat the explanation to others whenever they talk about the system. They will probably just call it &ldquo;Linux&rdquo;. Without particularly intending to, they will help spread the incorrect picture.
fr: C'est inefficace parce que le message peut ne pas passer, et parce qu'il ne se r&eacute;pandra s&ucirc;rement pas. Certaines personnes qui entendront votre explication feront attention, et peuvent m&ecirc;me apprendre une image correcte des origines du syst&egrave;me. Mais c'est peu probable qu'ils r&eacute;p&egrave;tent l'explication &agrave; d'autres personnes chaque fois qu'ils parlent du syst&egrave;me. Ils l'appelleront probablement simplement &laquo;&nbsp;Linux&nbsp;&raquo;. Sans en avoir l'intention particuli&egrave;re, ils aideront &agrave; r&eacute;pandre l'image incorrecte.

source: It is inefficient because it takes a lot more time. Saying and writing &ldquo;GNU/Linux&rdquo; will take you only a few seconds a day, not minutes, so you can afford to reach far more people that way. Distinguishing between Linux and GNU/Linux when you write and speak is by far the easiest way to help the GNU Project effectively.
fr: C'est aussi inefficace parce que cela prend beaucoup de temps. Dire et &eacute;crire &laquo;&nbsp;GNU/Linux&nbsp;&raquo; ne vous prendra qu'une poign&eacute;e de secondes par jour, pas des minutes, donc il vous est possible de toucher beaucoup plus de personnes de cette fa&ccedil;on. Faire la distinction entre Linux et GNU/Linux quand vous &eacute;crivez et parlez est de loin la m&eacute;thode efficace, la plus facile d'aider le projet GNU.

source: Some people laugh at you when you ask them to call the system GNU/Linux. Why do you subject yourself to this treatment?
fr: Certaines personnes se moquent de vous quand vous leur demandez d'appeler le syst&egrave;me GNU/Linux. Pourquoi se rendre la cible de ce traitement&nbsp;?

source: Calling the system &ldquo;Linux&rdquo; tends to give people a mistaken picture of the system's history and reason for existence. People who laugh at our request probably have picked up that mistaken picture&mdash;they think our work was done by Linus, so they laugh when we ask for credit for it. If they knew the truth, they probably wouldn't laugh.
fr: Appeler le syst&egrave;me &laquo;&nbsp;Linux&nbsp;&raquo; tend &agrave; donner une fausse image de l'histoire du syst&egrave;me et des raisons de son existence. Les personnes se moquant de votre demande sont probablement celles ayant adopt&eacute; cette fausse image&nbsp;: ils pensent que tout le travail a &eacute;t&eacute; effectu&eacute; par Linus, donc ils rigolent quand nous demandons de la reconnaissance pour notre travail. S'ils connaissaient la v&eacute;rit&eacute;, ils ne riraient probablement pas.

source: Why do we take the risk of making a request that sometimes leads people to ridicule us? Because often it has useful results that help the GNU Project. We will run the risk of undeserved abuse to achieve our goals.
fr: Pourquoi prenons-nous le risque de faire une demande qui parfois am&egrave;ne les gens &agrave; se moquer de nous&nbsp;? Parce que parfois, cela a des r&eacute;sultats utilesqui aident le projet GNU. Nous prenons le risque de moqueries non fond&eacute;es pour r&eacute;aliser notre objectif.

source: If you see such an ironically unfair situation occurring, please don't sit idly by. Please teach the laughing people the real history. When they see why the request is justified, those who have any sense will stop laughing.
fr: Si vous &ecirc;tes t&eacute;moins d'une situation ironique et injuste, veuillez ne pas rester simplement passif. Expliquez aux gens se moquant l'histoire r&eacute;elle. Quand ils se rendent compte que la demande est fond&eacute;e, ceux qui ont une once de bon sens arr&ecirc;teront de rire.

source: Some people condemn you when you ask them to call the system GNU/Linux. Don't you lose by alienating them?
fr: Certaines personnes vous condamnent quand vous leur demandez d'appeler le syst&egrave;me GNU/Linux. Ne perdez-vous pas du terrain en vous les ali&eacute;nant&nbsp;?

source: Not much. People who don't appreciate our role in developing the system are unlikely to make substantial efforts to help us. If they do work that advances our goals, such as releasing free software, it is probably for other unrelated reasons, not because we asked them. Meanwhile, by teaching others to attribute our work to someone else, they are undermining our ability to recruit the help of others.
fr: Pas tant que &ccedil;a. Les gens qui n'appr&eacute;cient pas notre r&ocirc;le dans le d&eacute;veloppement du syst&egrave;me ne feront probablement aucun effort pour nous aider. S'ils r&eacute;alisent du travail qui contribue &agrave; nos buts, comme de distribuer du logiciel libre, c'est probablement pour d'autres raisons non li&eacute;es, pas parce que nous le leur avons demand&eacute;. Pendant ce temps, en apprenant aux autres &agrave; attribuer notre travail &agrave; quelqu'un d'autre, ils minent notre capacit&eacute; &agrave; recruter leur aide.

source: It makes no sense to worry about alienating people who are already mostly uncooperative, and it is self-defeating to be deterred from correcting a major problem lest we anger the people who perpetuate it. Therefore, we will continue trying to correct the misnomer.
fr: Cela n'a pas de sens de s'inqui&eacute;ter de s'ali&eacute;ner des personnes de toute fa&ccedil;on d&eacute;j&agrave; non coop&eacute;ratives, et c'est accepter la d&eacute;faitede se retenir de corriger un probl&egrave;me majeur par peur de m&eacute;contenter les personnes m&ecirc;mes qui posent ce probl&egrave;me. C'est pour cela que nous continuerons &agrave; essayer de corriger ceux qui se trompent de nom.

source: Whatever you contributed, is it legitimate to rename the operating system?
fr: Quelle que soit votre contribution, est-ce l&eacute;gitime de renommer le syst&egrave;me d'exploitation&nbsp;?

source: We are not renaming anything; we have been calling this system &ldquo;GNU&rdquo; ever since we announced it in 1983. The people who tried to rename it to &ldquo;Linux&rdquo; should not have done so.
fr: Nous ne renommons rien&nbsp;: nous avons appel&eacute; le syst&egrave;me &laquo;&nbsp;GNU&nbsp;&raquo; depuis notre premi&egrave;re annonce en 1983. Les personnes qui essayent de le renommer &laquo;&nbsp;Linux&nbsp;&raquo; ne devraient pas l'avoir fait.

source: Isn't it wrong to force people to call the system &ldquo;GNU/Linux&rdquo;?
fr: N'est-ce pas mal de forcer les gens &agrave; appeler le syst&egrave;me &laquo;&nbsp;GNU/Linux&nbsp;&raquo;?

source: It would be wrong to force them, and we don't try. We call the system &ldquo;GNU/Linux&rdquo;, and we ask you to do it too.
fr: Ce serait mal de les y forcer, et nous n'essayons pas de le faire. Nous appelons le syst&egrave;me &laquo;&nbsp;GNU/Linux&nbsp;&raquo;, et vous demandons simplement de faire de m&ecirc;me.

source: Why not sue people who call the whole system &ldquo;Linux&rdquo;?
fr: Pourquoi ne pas assigner en justice les personnes qui appellent le syst&egrave;me entier &laquo;&nbsp;Linux&nbsp;&raquo;?

source: There are no legal grounds to sue them, but since we believe in freedom of speech, we wouldn't want to do that anyway. We ask people to call the system &ldquo;GNU/Linux&rdquo; because that is the right thing to do.
fr: Il n'y a aucune base l&eacute;gale pour les assigner en justice, mais comme nous croyons en la libert&eacute; de parole, nous ne le ferions pas m&ecirc;me si c'&eacute;tait possible. Nous demandons aux gens d'appeler le syst&egrave;me &laquo;&nbsp;GNU/Linux&nbsp;&raquo; parce que c'est la bonne chose &agrave; faire.

source: Shouldn't you put something in the GNU GPL to require people to call the system &ldquo;GNU&rdquo;?
fr: Ne devriez-vous pas mettre quelque chose dans la GPL GNU pour obliger les gens &agrave; appeler le syst&egrave;me &laquo;&nbsp;GNU&nbsp;&raquo;&nbsp;?

source: The purpose of the GNU GPL is to protect the users' freedom from those who would make proprietary versions of free software. While it is true that those who call the system &ldquo;Linux&rdquo; often do things that limit the users' freedom, such as bundling non-free software with the GNU/Linux system or even developing non-free software for such use, the mere act of calling the system &ldquo;Linux&rdquo; does not, in itself, deny users their freedom. It seems improper to make the GPL restrict what name people can use for the system.
fr: Le but de la GPL GNU est de prot&eacute;ger la libert&eacute; des utilisateurs de ceux qui feraient des versions propri&eacute;taires bas&eacute;es sur des logiciels libres. Bien qu'il est vrai que ceux appelant le syst&egrave;me &laquo;&nbsp;Linux&nbsp;&raquo; font souvent des choses qui limitent la libert&eacute; des utilisateurs, comme inclure des logiciels non-libres dans le syst&egrave;me GNU/Linux ou m&ecirc;me d&eacute;velopper des logiciels libres pour une telle utilisation, le simple fait d'appeler le syst&egrave;me n'entrave pas lui-m&ecirc;me les libert&eacute;s des utilisateurs. Il para&icirc;t incorrect de faire limiter par la GPL les noms que les utilisateurs peuvent utiliser pour le syst&egrave;me.

source: Since you objected to the original BSD license's advertising requirement to give credit to the University of California, isn't it hypocritical to demand credit for the GNU project?
fr: Puisque vous &eacute;tiez contre l'exigence de publicit&eacute; de la licence originale BSD de reconna&icirc;tre le m&eacute;rite de l'universit&eacute; de Californie, n'est-il pas hypocrite de demander de la reconnaissance pour le projet GNU&nbsp;?

source: It would be hypocritical to make the name GNU/Linux a license requirement, and we don't. We only <em>ask</em> you to give us the credit we deserve.
fr: Ce serait hypocrite de faire du nom GNU/Linux une exigence de licence, et nous ne le faisons pas. Nous vous <em>demandons</em> seulement de nous donner la reconnaissance que nous m&eacute;ritons.

source: Since you failed to put something in the GNU GPL to require people to call the system &ldquo;GNU&rdquo;, you deserve what happened; why are you complaining now?
fr: Puisque vous avez &eacute;chou&eacute; &agrave; mettre quelque chose dans la GPL GNU qui exige des utilisateurs qu'ils appellent le syst&egrave;me &laquo;&nbsp;GNU&nbsp;&raquo;, vous n'avez que ce que vous m&eacute;ritez&nbsp;: pourquoi vous plaignez-vous maintenant&nbsp;?

source: The question presupposes a rather controversial general ethical premise: that if people do not force you to treat them fairly, you are entitled to take advantage of them as much as you like. In other words, it assumes that might makes right.
fr: Cette question pr&eacute;suppose une hypoth&egrave;se g&eacute;n&eacute;rale &eacute;thique plut&ocirc;t controvers&eacute;e&nbsp;: que si les gens ne vous forcent pas &agrave; les traiter correctement, vous pouvez tirer avantage d'eux autant que vous le voulez. En d'autres mots, cela signifie que cela pourrait &ecirc;tre juste.

source: We hope you disagree with that premise just as we do.
fr: Nous esp&eacute;rons que vous &ecirc;tes autant en d&eacute;saccord avec cette hypoth&egrave;se que nous le sommes.

source: Wouldn't you be better off not contradicting what so many people believe?
fr: Ne seriez-vous pas mieux si vous ne contredisiez pas ce que tant de personnes croient&nbsp;?

source: We don't think we should go along with large numbers of people because they have been misled. We hope you too will decide that truth is important.
fr: Nous ne pensons pas que nous devrions suivre un grand nombre de personnes simplement parce qu'elles ont &eacute;t&eacute; tromp&eacute;es. Nous esp&eacute;rons que vous d&eacute;ciderez aussi que la v&eacute;rit&eacute; est importante.

source: We could never have developed a free operating system without first denying the belief, held by most people, that proprietary software was legitimate and acceptable.
fr: Nous n'aurions jamais pu d&eacute;velopper un syst&egrave;me d'exploitation libre sans nier la croyance g&eacute;n&eacute;rale que les logiciels propri&eacute;taires &eacute;taient l&eacute;gitimes et acceptables.

source: Since many people call it &ldquo;Linux&rdquo;, doesn't that make it right?
fr: Puisque tant de gens l'appellent &laquo;&nbsp;Linux&nbsp;&raquo;, cela ne leur donne-t-il pas raison&nbsp;?

source: We don't think that the popularity of an error makes it the truth.
fr: Nous ne pensons pas que la popularit&eacute; d'une erreur la fasse devenir juste.

source: Many people care about what's convenient or who's winning, not about arguments of right or wrong. Couldn't you get more of their support by a different road?
fr: Beaucoup de personnes sont int&eacute;ress&eacute;es par ce qui est pratique ou au gagnant, pas par des arguments de justice ou d'injustice. Ne pourriez-vous pas obtenir leur soutien par d'autres moyens&nbsp;?

source: To care only about what's convenient or who's winning is an amoral approach to life. Non-free software is an example of that amoral approach and thrives on it. So in the long run it is self-defeating for us to bow to that approach. We will continue talking in terms of right and wrong.
fr: Ne s'int&eacute;resser qu'&agrave; ce qui est pratique ou au gagnant est une approche immorale de la vie. Le logiciel non-libre est un exemple de cette approche immorale et fleurit sur cette approche. Donc sur le long terme c'est courir &agrave; la d&eacute;faite que de se plier &agrave; cette approche. Nous continuerons &agrave; parler en termes de justice et d'injustice.

source: We hope that you are one of those for whom right and wrong do matter.
fr: Nous esp&eacute;rons que vous &ecirc;tes l'un de ceux pour qui la justice et l'injustice ont de l'importance.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Marc de Maillard<br> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
