Repository: gitGNU/gnu_www-fr
Catalog: gnu/gnu-linux-faq.*.po
Languages: fr

source: We're not talking about a distinct GNU version of Linux, the kernel. The free GNU/Linux distros do have a <a href="http://directory.fsf.org/project/linux">separate version of Linux</a>, since the &ldquo;standard&rdquo; version contains non-free firmware &ldquo;blobs&rdquo;. If this were part of the GNU Project, it could be considered &ldquo;GNU Linux&rdquo;; but we would not want to call it that, because it would be too confusing.
fr: Nous ne parlons pas ici d'une version distincte, GNU, du noyau Linux. Les distributions libres GNU/Linux ont une <a href="http://directory.fsf.org/project/linux">version distincte de Linux</a>, car la version &laquo;&nbsp;standard&nbsp;&raquo; contient des &laquo;&nbsp;blobs&nbsp;&raquo; de firmware non-libres. Si cela faisait partie du Projet GNU, on pourrait consid&eacute;rer de l'appeler &laquo;&nbsp;GNU Linux&nbsp;&raquo;&nbsp;; mais nous ne voudrions pas l'appeler ainsi car ce serait trop confus.

source: We're talking about a version of GNU, the operating system, distinguished by having Linux as the kernel. A slash fits the situation because it means &ldquo;combination.&rdquo; (Think of &ldquo;Input/Output&rdquo;.) This system is the combination of GNU and Linux; hence, &ldquo;GNU/Linux&rdquo;.
fr: Nous parlons ici d'une version de GNU, le syst&egrave;me d'exploitation, distingu&eacute;e par le fait d'avoir Linux comme noyau. Une barre de fraction correspond bien &agrave; la situation puisqu'elle signifie &laquo;&nbsp;combinaison.&nbsp;&raquo; (Pensez &agrave; &laquo;&nbsp;Entr&eacute;e/Sortie&nbsp;&raquo;). Ce syst&egrave;me est une combinaison de GNU et de Linux, d'o&ugrave; le nom &laquo;&nbsp;GNU/Linux&nbsp;&raquo;.

source: There are other ways to express &ldquo;combination&rdquo;. If you think that a plus-sign is clearer, please use that. In French, a hyphen is clear: &ldquo;GNU-Linux&rdquo;. In Spanish, we sometimes say &ldquo;GNU con Linux&rdquo;.
fr: Il y a d'autres moyens d'exprimer cette combinaison. Si vous pensez qu'un signe plus est plus clair, utilisez-le. En fran&ccedil;ais, un tiret est clair&nbsp;: &laquo;&nbsp;GNU-Linux&nbsp;&raquo;. En espagnol, nous disons parfois &laquo;&nbsp;GNU con Linux&nbsp;&raquo;

source: Why &ldquo;GNU/Linux&rdquo; rather than &ldquo;Linux/GNU&rdquo;?
fr: Pourquoi &laquo;&nbsp;GNU/Linux&nbsp;&raquo; plut&ocirc;t que &laquo;&nbsp;Linux/GNU&nbsp;&raquo;?

source: It is right and proper to mention the principal contribution first. The GNU contribution to the system is not only bigger than Linux and prior to Linux, we actually started the whole activity.
fr: Il est juste et &eacute;quitable de mentionner en premier le principal contributeur. La contribution de GNU au projet n'est pas uniquement plus importante et plus ancienne que Linux, nous avons effectivement lanc&eacute; l'activit&eacute; enti&egrave;re.

source: However, if you prefer to call the system &ldquo;Linux/GNU&rdquo;, that is a lot better than what people usually do, which is to omit GNU entirely and make it seem that the whole system is Linux.
fr: Cependant, si vous pr&eacute;f&eacute;rez appeler le systeme &laquo;&nbsp;Linux/GNU&nbsp;&raquo;, c'est d&eacute;j&agrave; largement plus correct que ce que les gens font d'habitude, &agrave; savoir omettre compl&egrave;tement GNU et donner l'impression que le syst&egrave;me entier est Linux.

source: My distro is called &ldquo;Foobar Linux&rdquo;; doesn't that show it's really Linux?
fr: Ma distribution s'appelle &laquo;&nbsp;Foobar Linux&nbsp;&raquo;&nbsp;: est-ce que cela ne montre pas que c'est r&eacute;ellement Linux&nbsp;?

source: It means that the people who make the &ldquo;Foobar Linux&rdquo; distro are repeating the common mistake.
fr: Cela signifie juste que les personnes qui font la distribution &laquo;&nbsp;Foobar Linux&nbsp;&raquo; r&eacute;p&egrave;tent l'erreur g&eacute;n&eacute;rale.

source: My distro's official name is &ldquo;Foobar Linux&rdquo;; isn't it wrong to call the distro anything but &ldquo;Linux&rdquo;?
fr: Le nom officiel de ma distribution est &laquo;&nbsp;Foobar Linux&nbsp;&raquo;&nbsp;: cela ne pose-t-il pas un probl&egrave;me de l'appeler par n'importe quel autre nom que juste &laquo;&nbsp;Linux&nbsp;&raquo;?

source: If it's allowed for them to change &ldquo;GNU&rdquo; to &ldquo;Foobar Linux&rdquo;, it's allowed for you to change it back and call the distro &ldquo;Foobar GNU/Linux&rdquo;. It can't be more wrong to correct the mistake than it was to make the mistake.
fr: S'ils se sont autoris&eacute;s &agrave; changer &laquo;&nbsp;GNU&nbsp;&raquo; en &laquo;&nbsp;Foobar Linux&nbsp;&raquo;, vous pouvez aussi vous autoriser &agrave; le r&eacute;tablir et &agrave; appeler la distribution &laquo;&nbsp;Foobar GNU/Linux&nbsp;&raquo;. Cela ne peut &ecirc;tre pire de corriger l'erreur que de faire l'erreur en premier lieu.

source: Wouldn't it be more effective to ask companies such as Mandrake, Red Hat and IBM to call their distributions &ldquo;GNU/Linux&rdquo; rather than asking individuals?
fr: Ne serait-il pas plus efficace de demander &agrave; des entreprises comme Mandrake, Red Hat et IBM d'appeler leur distributions &laquo;&nbsp;GNU/Linux&nbsp;&raquo; plut&ocirc;t que de demander &agrave; chaque personne individuellement&nbsp;?

source: It isn't a choice of one or the other&mdash;we ask companies and organizations and individuals to help spread the word about this. In fact, we have asked all three of those companies. Mandrake said it would use the term &ldquo;GNU/Linux&rdquo; some of the time, but IBM and Red Hat were unwilling to help. One executive said, &ldquo;This is a pure commercial decision; we expect to make more money calling it &lsquo;Linux&rsquo;.&rdquo; In other words, that company did not care what was right.
fr: Il ne s'agit pas d'un choix entre l'un et l'autre&nbsp;: nous demandons &agrave; des entreprises, des organisations et des individus de passer le mot. En fait, nous l'avons demand&eacute; &agrave; ces trois entreprises. Mandrake utilise parfois le terme &laquo;&nbsp;GNU/Linux&nbsp;&raquo;, mais IBM et Red Hat ont refus&eacute; de nous aider. Un de leurs dirigeants a dit&nbsp;: &laquo;&nbsp;C'est une d&eacute;cision purement commerciale&nbsp;: nous pensons faire plus de profit en l'appelant &laquo;&nbsp;Linux&nbsp;&raquo;.&nbsp;&raquo; En d'autres termes, cette entreprise ne se pr&eacute;occupe pas de ce qui est juste ou non.

source: We can't make them do this right, but we're not the sort to give up just because the road isn't easy. You may not have as much influence at your disposal as IBM or Red Hat, but you can still help. Together we can change the situation to the point where companies will make more profit calling it &ldquo;GNU/Linux&rdquo;.
fr: Nous ne pouvons pas les faire changer, mais nous ne sommes pas du genre &agrave; abandonner simplement parce que le chemin n'est pas facile. Vous ne disposez peut-&ecirc;tre pas d'autant d'influence qu'IBM ou Red Hat, mais vous pouvez tout de m&ecirc;me aider. Ensemble nous pouvons changer la situation &agrave; tel point que les entreprises feront plus de profit en l'appelant &laquo;&nbsp;GNU/Linux&nbsp;&raquo;.

source: Wouldn't it be better to reserve the name &ldquo;GNU/Linux&rdquo; for distributions that are purely free software? After all, that is the ideal of GNU.
fr: Ne serait-il pas mieux de r&eacute;server le nom &laquo;&nbsp;GNU/Linux&nbsp;&raquo; pour les distributions constitu&eacute;es uniquement de logiciels libres&nbsp;? Apr&egrave;s tout, c'est bien l'id&eacute;al de GNU.

source: The widespread practice of adding non-free software to the GNU/Linux system is a major problem for our community. It teaches the users that non-free software is ok, and that using it is part of the spirit of &ldquo;Linux&rdquo;. Many &ldquo;Linux&rdquo; User Groups make it part of their mission to help users use non-free add-ons, and may even invite salesmen to come and make sales pitches for them. They adopt goals such as &ldquo;helping the users&rdquo; of GNU/Linux (including helping them use non-free applications and drivers), or making the system more popular even at the cost of freedom.
fr: La pratique couramment admise d'ajouter des logiciels non-libres au syst&egrave;me GNU/Linux est un probl&egrave;me majeur pour notre communaut&eacute;. Cela enseigne aux utilisateurs que les logiciels non-libres sont ok, et que les utiliser fait partie de l'esprit &laquo;&nbsp;Linux&nbsp;&raquo;. Beaucoup de groupes d'utilisateurs de &laquo;&nbsp;Linux&nbsp;&raquo; consid&egrave;rent qu'aider les utilisateurs &agrave; utiliser des extensions non-libres fait partie de leur mission, et peuvent m&ecirc;me inviter des vendeurs &agrave; venir et faire de la vente pour eux. Ils adoptent des buts tels que &laquo;&nbsp;aider les utilisateurs&nbsp;&raquo; de GNU/Linux (ceci incluant l'aide &agrave; l'utilisation d'applications et de pilotes non-libres), ou encore rendre le syst&egrave;me plus populaire m&ecirc;me au prix de la libert&eacute;.

source: The question is how to try to change this.
fr: La question est&nbsp;: comment faire changer cela&nbsp;?

source: Given that most of the community which uses GNU with Linux already does not realize that's what it is, for us to disown these adulterated versions, saying they are not really GNU, would not teach the users to value freedom more. They would not get the intended message. They would only respond they never thought these systems were GNU in the first place.
fr: &Eacute;tant donn&eacute; que la plupart des communaut&eacute;s qui utilisent GNU avec Linux ne r&eacute;alisent d&eacute;j&agrave; pas que c'est ce qu'elles font, d&eacute;savouer ces versions d&eacute;natur&eacute;es, dire que ce n'est pas vraiment GNU, n'apprendrait pas aux utilisateurs &agrave; donner plus de valeur &agrave; la libert&eacute;. Ils ne comprendraient pas le message. Ils r&eacute;pondraient simplement qu'ils n'avaient jamais pens&eacute; que ces syst&egrave;mes &eacute;taient GNU.

source: The way to lead these users to see a connection with freedom is exactly the opposite: to inform them that all these system versions <em>are</em> versions of GNU, that they all are based on a system that exists specifically for the sake of the users' freedom. With this understanding, they can start to recognize the distributions that include non-free software as perverted, adulterated versions of GNU, instead of thinking they are proper and appropriate &ldquo;versions of Linux&rdquo;.
fr: Le moyen d'amener ces utilisateurs &agrave; voir une connexion avec la libert&eacute; est exactement l'oppos&eacute;&nbsp;: il faut les informer que toutes ces versions du syst&egrave;me <em>sont</em> des versions de GNU, et qu'elles sont toutes bas&eacute;es sur un syst&egrave;me qui existe sp&eacute;cialement pour le bien de la libert&eacute; des utilisateurs. En comprenant cela, ils pourront commencer &agrave; reconna&icirc;tre les distributions qui incluent des logiciels non-libres comme des versions perverties, d&eacute;natur&eacute;es de GNU, au lieu de penser qu'elles sont des &laquo;&nbsp;versions de Linux&nbsp;&raquo; correctes et l&eacute;gitimes.

source: It is very useful to start GNU/Linux User Groups, which call the system GNU/Linux and adopt the ideals of the GNU Project as a basis for their activities. If the Linux User Group in your area has the problems describe above, we suggest you either campaign within the group to change its orientation (and name) or start a new group. The people who focus on the more superficial goals have a right to their views, but don't let them drag you along!
fr: Il est tr&egrave;s utile de lancer des groupes d'utilisateurs de GNU/Linux, qui appellent le syst&egrave;me par son nom GNU/Linux et adoptent les id&eacute;aux du projet GNU comme base de leurs activit&eacute;s. Si le groupe d'utilisateurs de Linux de votre r&eacute;gion est touch&eacute; par le probl&egrave;me d&eacute;crit ci-dessus, nous vous sugg&eacute;rons de faire campagne dans ce groupe pour changer son orientation (et son nom), ou de lancer un nouveau groupe. Les gens qui se focalisent sur des buts plus superficiels ont le droit d'avoir leur point de vue, mais ne les laissez pas vous entra&icirc;ner&nbsp;!

source: Why not make a GNU distribution of Linux (sic) and call that GNU/Linux?
fr: Pourquoi ne pas faire une distribution de Linux (sic) et l'appeler GNU/Linux&nbsp;?

source: All the &ldquo;Linux&rdquo; distributions are actually versions of the GNU system with Linux as the kernel. The purpose of the term &ldquo;GNU/Linux&rdquo; is to communicate this point. To develop one new distribution and call that alone &ldquo;GNU/Linux&rdquo; would obscure the point we want to make.
fr: Toutes les versions des distributions &laquo;&nbsp;Linux&nbsp;&raquo; sont en r&eacute;alit&eacute; des versions du syst&egrave;me GNU utilisant Linux comme noyau. C'est le but du terme GNU/Linux que de communiquer sur ce point. D&eacute;velopper une autre distribution et appeler uniquement celle-l&agrave; GNU/Linux rendrait incompr&eacute;hensible ce que nous voulons expliquer.

source: As for developing a distribution of GNU/Linux, we already did this once, when we funded the early development of Debian GNU/Linux. To do it again now does not seem useful; it would be a lot of work, and unless the new distribution had substantial practical advantages over other distributions, it would serve no purpose.
fr: Quant &agrave; d&eacute;velopper une distribution de GNU/Linux, nous l'avons d&eacute;j&agrave; fait une fois, quand nous avons lanc&eacute; le d&eacute;veloppement de Debian GNU/Linux. Le refaire ne semble pas utile&nbsp;: ce serait beaucoup de travail, et &agrave; moins que la nouvelle distribution n'ait des avantages substantiels par rapport aux autres distributions, elle ne servirait &agrave; rien.

source: Instead we help the developers of 100% free GNU/Linux distributions, such as gNewSense and Ututo.
fr: &Agrave; la place, nous aidons les d&eacute;veloppeurs de distributions GNU/Linux 100% libres, comme gNewSense et Ututo.

source: Why not just say &ldquo;Linux is the GNU kernel&rdquo; and release some existing version of GNU/Linux under the name &ldquo;GNU&rdquo;?
fr: Pourquoi ne pas simplement dire &laquo;&nbsp;Linux est le noyau de GNU&nbsp;&raquo; et ne pas distribuer une version existante quelconque de GNU/Linux sous le nom &laquo;&nbsp;GNU&nbsp;&raquo;&nbsp;?

source: It might have been a good idea to adopt Linux as the GNU kernel back in 1992. If we had realized, then, how long it would take to get the GNU Hurd to work, we might have done that. (Alas, that is hindsight.)
fr: Cela aurait pu &ecirc;tre une bonne id&eacute;e d'adopter Linux comme noyau de GNU en 1992. Si nous avions r&eacute;alis&eacute; le temps que cela prendrait pour faire marcher le Hurd GNU, nous aurions pu le faire. (H&eacute;las, ce n'est facile &agrave; dire qu'avec du recul).

source: If we were to take an existing version of GNU/Linux and relabel it as &ldquo;GNU&rdquo;, that would be somewhat like making a version of the GNU system and labeling it &ldquo;Linux&rdquo;. That wasn't right, and we don't want to act like that.
fr: Si nous voulions prendre une version existante de GNU/Linux et la r&eacute;&eacute;tiqueter &laquo;&nbsp;GNU&nbsp;&raquo;, cela reviendrait &agrave; la m&ecirc;me chose que de prendre une version du syst&egrave;me GNU et le r&eacute;&eacute;tiqueter &laquo;&nbsp;Linux&nbsp;&raquo;. Ce ne serait pas juste, et nous ne voulons pas agir de cette fa&ccedil;on.

source: Did the GNU Project condemn and oppose use of Linux in the early days?
fr: Le projet GNU a-t-il condamn&eacute; ou s'est-il oppos&eacute; &agrave; Linux dans les premiers temps&nbsp;?

source: We did not adopt Linux as our kernel, but we didn't condemn or oppose it. In 1993 we started discussing the arrangements to sponsor the development of Debian GNU/Linux. We also sought to cooperate with the people who were changing some GNU packages for use with Linux. We wanted to include their changes in the standard releases so that these GNU packages would work out-of-the-box in combination with Linux. But the changes were often ad-hoc and nonportable; they needed to be cleaned up for installation.
fr: Nous n'avons pas adopt&eacute; Linux comme notre noyau, mais nous ne l'avons ni condamn&eacute; ni ne nous sommes oppos&eacute;s &agrave; lui. En 1993 nous avons commenc&eacute; &agrave; discuter des arrangements pour sponsoriser le d&eacute;veloppement de Debian GNU/Linux. Nous avons &eacute;galement cherch&eacute; &agrave; coop&eacute;rer avec les personnes qui changeaient certains paquets GNU pour les utiliser avec Linux. Nous voulions inclure leurs changements dans les distributions standards pour que nos paquets fonctionnent directement en combinaison avec Linux. Mais ces changements &eacute;taient souvent ad-hoc et non-compatibles, il &eacute;tait n&eacute;cessaire de les nettoyer pour l'installation.

source: The people who had made the changes showed little interest in cooperating with us. One of them actually told us that he didn't care about working with the GNU Project because he was a &ldquo;Linux user&rdquo;. That came as a shock, because the people who ported GNU packages to other systems had generally wanted to work with us to get their changes installed. Yet these people, developing a system that was primarily based on GNU, were the first (and still practically the only) group that was unwilling to work with us.
fr: Les personnes ayant r&eacute;alis&eacute; ces changements ont montr&eacute; peu d'int&eacute;r&ecirc;t &agrave; coop&eacute;rer avec nous. Un d'entre eux nous a m&ecirc;me dit qu'il se moquait de travailler avec le projet GNU puisqu'il &eacute;tait un &laquo;&nbsp;utilisateur Linux&nbsp;&raquo;. Cela nous a choqu&eacute;, puisque les personnes qui adaptaient des paquets GNU pour d'autres syst&egrave;mes voulaient g&eacute;n&eacute;ralement travailler avec nous pour que leurs changements soient inclus. N&eacute;anmoins ces personnes, d&eacute;veloppant un syst&egrave;me bas&eacute; principalement sur le syst&egrave;me GNU, &eacute;taient le premier groupe (et toujours pratiquement le seul) &agrave; ne pas vouloir travailler avec nous.

source: It was this experience that first showed us that people were calling a version of the GNU system &ldquo;Linux&rdquo;, and that this confusion was obstructing our work. Asking you to call the system &ldquo;GNU/Linux&rdquo; is our response to that problem, and to the other problems caused by the &ldquo;Linux&rdquo; misnomer.
fr: C'est cette exp&eacute;rience qui nous a montr&eacute; en premier que des personnes appelaient une version du syst&egrave;me GNU &laquo;&nbsp;Linux&nbsp;&raquo;, et que cette confusion faisait obstruction &agrave; notre travail. Vous demander d'appeler le syst&egrave;me GNU/Linux est notre r&eacute;ponse &agrave; ce probl&egrave;me, et aux autres probl&egrave;mes pos&eacute;s par cette erreur de d&eacute;nomination &laquo;&nbsp;Linux&nbsp;&raquo;.

source: Why did you wait so long before asking people to use the name GNU/Linux?
fr: Pourquoi avez-vous attendu si longtemps avant de demander aux gens d'utiliser le nom GNU/Linux&nbsp;?

source: Actually we didn't. We began talking privately with developers and distributors about this in 1994, and made a more public campaign in 1996. We will continue for as long as it's necessary.
fr: En fait nous n'avons pas attendu si longtemps. Nous avons commenc&eacute; &agrave; parler en priv&eacute; aux d&eacute;veloppeurs et distributeurs &agrave; ce sujet en 1994, et avons fait une campagne plus publique en 1996. Nous continuerons aussi longtemps que cela sera n&eacute;cessaire.

source: Should the GNU/<i>name</i> convention be applied to all programs that are GPL'ed?
fr: La convention GNU/<i>nom</i> devrait-elle &ecirc;tre appliqu&eacute;e &agrave; tous les programmes sous GPL&nbsp;?

source: We never refer to individual programs as &ldquo;GNU/<i>name</i>&rdquo;. When a program is a GNU package, we may call it &ldquo;GNU <i>name</i>&rdquo;.
fr: Nous ne faisons jamais r&eacute;f&eacute;rence &agrave; des programmes individuels en tant que &laquo;&nbsp;GNU/<i>nom</i>&nbsp;&raquo;. Quand un programme est un paquet GNU, nous l'appelons g&eacute;n&eacute;ralement &laquo;&nbsp;GNU <i>nom</i>&nbsp;&raquo;.

source: GNU, the operating system, is made up of many different programs. Some of the programs in GNU were written as part of the GNU Project or specifically contributed to it; these are the GNU packages, and we often use &ldquo;GNU&rdquo; in their names.
fr: GNU, le syst&egrave;me d'exploitation, est constitu&eacute; de beaucoup de programmes diff&eacute;rents. Certains des programmes de GNU ont &eacute;t&eacute; &eacute;crits en tant que part du projet GNU ou sp&eacute;cialement comme contribution au projet&nbsp;: ce sont les paquets GNU, et nous utilisons souvent &laquo;&nbsp;GNU&nbsp;&raquo; dans leurs noms.

source: It's up to the developers of a program to decide if they want to contribute it and make it a GNU package. If you have developed a program and you would like it to be a GNU package, please write to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>, so we can evaluate it and decide whether we want it.
fr: C'est aux d&eacute;veloppeurs d'un programme de d&eacute;cider s'ils veulent contribuer et en faire un paquet GNU. Si vous avez d&eacute;velopp&eacute; un programme et aimeriez qu'il devienne un paquet GNU, merci d'&eacute;crire &agrave; <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>, pour que nous puissions l'&eacute;valuer et d&eacute;cider si nous le voulons ou pas.

source: It wouldn't be fair to put the name GNU on every individual program that is released under the GPL. If you write a program and release it under the GPL, that doesn't mean the GNU Project wrote it or that you wrote it for us. For instance, the kernel, Linux, is released under the GNU GPL, but Linus did not write it as part of the GNU Project&mdash;he did the work independently. If something is not a GNU package, the GNU Project can't take credit for it, and putting &ldquo;GNU&rdquo; in its name would be improper.
fr: Ce ne serait pas correct de mettre le nom GNU sur chaque programme distribu&eacute; sous GPL. Si vous &eacute;crivez un programme et le distribuez sous GPL, cela ne signifie pas que le projet GNU l'a &eacute;crit ou que vous l'avez &eacute;crit pour nous. Par exemple, le noyau, Linux, est distribu&eacute; sous notre GPL, mais Linus ne l'a pas &eacute;crit comme part du projet GNU&nbsp;: il a r&eacute;alis&eacute; ce travail ind&eacute;pendamment. Si quelque chose n'est pas un paquet GNU, le projet GNU ne peut pas demander de reconnaissance pour cela, et mettre &laquo;&nbsp;GNU&nbsp;&raquo; dans son nom serait incorrect.

source: In contrast, we do deserve the overall credit for the GNU operating system as a whole, even though not for each and every program in it. The system exists as a system because of our determination and persistence, starting in 1984, many years before Linux was begun.
fr: Au contraire, nous m&eacute;ritons la reconnaissance globale pour le syst&egrave;me d'exploitation GNU en tant qu'ensemble, m&ecirc;me si effectivement pas pour chaque programme individuel qu'il contient. Le syst&egrave;me existe en tant que syst&egrave;me gr&acirc;ce &agrave; notre d&eacute;termination et notre pers&eacute;v&eacute;rance, et ce depuis 1984, donc de nombreuses ann&eacute;es avant que Linux ne soit commenc&eacute;.
