Repository: gitGNU/gnu_www-fr
Catalog: gnu/gnu.*.po
Languages: fr

source: About the GNU Operating System - GNU project - Free Software Foundation (FSF)
fr: À propos du système d'exploitation GNU - GNU project - Free Software Foundation (FSF)

source: About the GNU Operating System
fr: À propos du système d'exploitation GNU

source: <a href="/gnu/gnu-history.html">An overview of GNU</a>
fr: <a href="/gnu/gnu-history.fr.html">Un aperçu de GNU</a>

source: <a href="/gnu/thegnuproject.html">A more detailed history of GNU</a>
fr: <a href="/gnu/thegnuproject.fr.html">Une histoire plus détaillée de GNU</a>

source: <a href="/gnu/initial-announcement.html">The initial announcement</a> of the project
fr: <a href="/gnu/initial-announcement.fr.html">L'annonce initiale</a> du projet

source: <a href="/gnu/manifesto.html">The GNU Manifesto</a>
fr: <a href="/gnu/manifesto.fr.html">Le manifeste GNU</a>

source: <a href="/gnu/byte-interview.html">BYTE interview with Richard Stallman</a> (1986)
fr: <a href="/gnu/byte-interview.fr.html">Entretien sur BYTE avec Richard Stallman</a> (1986)

source: <a href="/gnu/rms-lisp.html">My Lisp Experiences and the Development of GNU Emacs</a> (by Richard Stallman)
fr: <a href="/gnu/rms-lisp.fr.html">Mes exp&eacute;riences de Lisp et du développement de GNU Emacs</a> (par Richard M. Stallman)

source: <a name="gnulinux"></a>GNU and Linux
fr: <a name="gnulinux"></a>GNU et Linux

source: <a href="/gnu/linux-and-gnu.html">The relationship between GNU and Linux</a>
fr: <a href="/gnu/linux-and-gnu.fr.html">Les relations entre GNU et Linux</a>

source: <a href="/gnu/why-gnu-linux.html">Why the &lsquo;Linux system&rsquo; should be called GNU/Linux</a>
fr: <a href="/gnu/why-gnu-linux.fr.html">Pourquoi le &laquo;&nbsp;syst&egrave;me Linux&nbsp;&raquo; devrait &ecirc;tre appel&eacute; GNU/Linux</a>

source: <a href="/gnu/gnu-users-never-heard-of-gnu.html">GNU Users Who Have Never Heard of GNU</a>
fr: <a href="/gnu/gnu-users-never-heard-of-gnu.fr.html">Les utilisateurs de GNU qui n'ont jamais entendu parler de GNU</a>

source: <a href="/gnu/gnu-linux-faq.html">A GNU/Linux FAQ</a>
fr: <a href="/gnu/gnu-linux-faq.fr.html">Une FAQ sur GNU/Linux</a>

source: <a name="misc"></a>Other GNU-related resources
fr: <a name="misc"></a>Autres ressources relatives &agrave; GNU

source: <a href="/gnu/gnu-user-groups.html">GNU/Linux and GNU/Hurd user groups</a>
fr: <a href="/gnu/gnu-user-groups.fr.html">Groupes d'utilisateurs de GNU/Linux et de GNU/Hurd</a>

source: <a href="/gnu/fs-user-groups.html">Free software user groups</a>
fr: <a href="/gnu/fs-user-groups.fr.html">Groupes d'utilisateurs de logiciels libres</a>

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Cédric Corazza.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
