Repository: gitGNU/gnu_www-fr
Catalog: gnu/initial-announcement.*.po
Languages: fr

source: About the GNU Project - GNU Project - Free Software Foundation (FSF)
fr: À propos du Projet GNU - Projet GNU - Free Software Foundation (FSF)

source: Initial Announcement
fr: Annonce initiale

source: This is the original announcement of the GNU Project, posted by <a href="http://www.stallman.org/">Richard Stallman</a> on September 27th 1983.
fr: Ceci est l'annonce originale du Projet GNU, &eacute;crite par <a href="http://www.stallman.org/">Richard Stallman</a> le 27 septembre 1983.

source: The history of the GNU Project is in many ways different from this initial plan. For example, the beginning was delayed until January, 1984 and several of the details about <a href="/philosophy/free-sw.html">free software</a> had not yet been clarified.
fr: L'histoire du Projet GNU diff&egrave;re en beaucoup de points de ce plan initial. Par exemple, le d&eacute;but a &eacute;t&eacute; report&eacute; en janvier 1984 et plusieurs d&eacute;tails en rapport avec le <a href="/philosophy/free-sw.fr.html">logiciel libre</a> n'ont pas encore &eacute;t&eacute; clarifi&eacute;s.

source: Free Unix!
fr: Lib&eacute;rez Unix&nbsp;!

source: Starting this Thanksgiving I am going to write a complete Unix-compatible software system called GNU (for Gnu's Not Unix), and give it away free<a href="#f1">(1)</a> to everyone who can use it. Contributions of time, money, programs and equipment are greatly needed.
fr: &Agrave; partir de Thanksgiving je vais &eacute;crire un syst&egrave;me logiciel complet compatible avec Unix appel&eacute; GNU (pour Gnu's Not Unix - Gnu N'est pas Unix) et le distribuer librement <a href="#f1"><sup>1</sup></a> &agrave; quiconque voudra l'utiliser. Il y a un grand besoin de contributions sous forme de temps, d'argent, de programmes et d'&eacute;quipement.

source: To begin with, GNU will be a kernel plus all the utilities needed to write and run C programs: editor, shell, C compiler, linker, assembler, and a few other things. After this we will add a text formatter, a YACC, an Empire game, a spreadsheet, and hundreds of other things. We hope to supply, eventually, everything useful that normally comes with a Unix system, and anything else useful, including on-line and hardcopy documentation.
fr: Pour commencer, GNU comprendra un noyau ainsi que tous les utilitaires requis pour &eacute;crire et faire tourner des programmes C&nbsp;: &eacute;diteur, interpr&eacute;teur de commandes, compilateur C, &eacute;diteur de liens, assembleur et quelques autres encore. Par la suite, nous ajouterons un formateur de texte, un YACC, un jeu Empire, un tableur et des centaines d'autres choses. Nous esp&eacute;rons suppl&eacute;er par la suite &agrave; tout composant utile venant normalement avec un syst&egrave;me Unix ainsi que n'importe quoi d'autre d'utile, incluant de la documentation en ligne et imprim&eacute;e.

source: GNU will be able to run Unix programs, but will not be identical to Unix. We will make all improvements that are convenient, based on our experience with other operating systems. In particular, we plan to have longer filenames, file version numbers, a crashproof file system, filename completion perhaps, terminal-independent display support, and eventually a Lisp-based window system through which several Lisp programs and ordinary Unix programs can share a screen. Both C and Lisp will be available as system programming languages. We will have network software based on MIT's chaosnet protocol, far superior to UUCP. We may also have something compatible with UUCP.
fr: GNU sera capable de faire tourner des programmes Unix mais ne sera pas identique &agrave; Unix. Nous y apporterons toute am&eacute;lioration pratique en nous basant sur notre exp&eacute;rience d'autres syst&egrave;mes d'exploitation. En particulier, nous avons l'intention de mettre en oeuvre des noms de fichiers plus longs, des num&eacute;ros de version sur les fichiers, un syst&egrave;me de fichiers r&eacute;sistant aux plantages, la terminaison automatique des noms de fichiers peut-&ecirc;tre, l'affichage ind&eacute;pendant du terminal et &eacute;ventuellement un syst&egrave;me de fen&ecirc;trage bas&eacute; sur le Lisp gr&acirc;ce auquel plusieurs programmes Lisp ou programmes Unix ordinaires pourront se partager l'&eacute;cran. Le C et le Lisp seront tous les deux disponibles comme langages de programmation syst&egrave;me. Nous aurons des logiciels r&eacute;seaux bas&eacute;s sur le protocole chaosnet du MIT, bien sup&eacute;rieur &agrave; UUCP. Nous pourrions aussi avoir quelque chose de compatible avec UUCP.

source: Who Am I?
fr: Qui suis-je&nbsp;?

source: I am Richard Stallman, inventor of the original much-imitated EMACS editor, now at the Artificial Intelligence Lab at MIT. I have worked extensively on compilers, editors, debuggers, command interpreters, the Incompatible Timesharing System and the Lisp Machine operating system. I pioneered terminal-independent display support in ITS. In addition I have implemented one crashproof file system and two window systems for Lisp machines.
fr: Je suis Richard Stallman, inventeur de la version originale de l'&eacute;diteur tr&egrave;s imit&eacute; Emacs, maintenant au Labo d'Intelligence Artificielle du MIT. J'ai travaill&eacute; intens&eacute;ment sur des compilateurs, des &eacute;diteurs, des d&eacute;bogueurs, des interpr&eacute;teurs de commandes, sur l'Incompatible Timesharing System (Syst&egrave;me &agrave; Temps partag&eacute; Incompatible) ainsi que sur le syst&egrave;me d'exploitation de la Machine Lisp. J'ai &eacute;t&eacute; un pionnier lors du support de l'affichage ind&eacute;pendant du terminal dans l'ITS. De plus, j'ai mis en œuvre un syst&egrave;me de fichiers robuste et deux syst&egrave;mes de fen&ecirc;trage pour machines Lisp.

source: Why I Must Write GNU
fr: Pourquoi je dois &eacute;crire GNU

source: I consider that the golden rule requires that if I like a program I must share it with other people who like it. I cannot in good conscience sign a nondisclosure agreement or a software license agreement.
fr: Je consid&egrave;re que la r&egrave;gle d'or requiert que si j'aime un programme je dois le partager avec d'autres personnes qui l'aiment. Je ne peux pas en bonne conscience signer un accord de non-r&eacute;v&eacute;lation ni un accord de licence pour logiciel.

source: So that I can continue to use computers without violating my principles, I have decided to put together a sufficient body of free software so that I will be able to get along without any software that is not free.
fr: Afin de pouvoir continuer &agrave; utiliser les ordinateurs sans violer mes principes, j'ai d&eacute;cid&eacute; de rassembler une quantit&eacute; suffisante de logiciels libres, de mani&egrave;re &agrave; ce que je puisse m'en tirer sans aucun logiciel qui ne soit pas libre.

source: How You Can Contribute
fr: Comment vous pouvez participer

source: I am asking computer manufacturers for donations of machines and money. I'm asking individuals for donations of programs and work.
fr: Je demande aux constructeurs d'ordinateurs des dons sous forme de machines et d'argent. Je demande aux individus une participation sous forme de programmes et de travail.

source: One computer manufacturer has already offered to provide a machine. But we could use more. One consequence you can expect if you donate machines is that GNU will run on them at an early date. The machine had better be able to operate in a residential area, and not require sophisticated cooling or power.
fr: Un constructeur d'ordinateurs a d&eacute;j&agrave; offert de nous fournir une machine. Mais nous pourrions en employer d'autres. Une cons&eacute;quence &agrave; laquelle vous pouvez vous attendre si vous donnez des machines est que GNU tournera sur elles &agrave; une date proche. La machine devrait pouvoir fonctionner dans une zone r&eacute;sidentielle sans requ&eacute;rir des syst&egrave;mes de courant ou de refroidissement sophistiqu&eacute;s.

source: Individual programmers can contribute by writing a compatible duplicate of some Unix utility and giving it to me. For most projects, such part-time distributed work would be very hard to coordinate; the independently-written parts would not work together. But for the particular task of replacing Unix, this problem is absent. Most interface specifications are fixed by Unix compatibility. If each contribution works with the rest of Unix, it will probably work with the rest of GNU.
fr: Les programmeurs individuels peuvent apporter leur contribution en &eacute;crivant des clones de certains utilitaires Unix et en me les donnant. Pour la plupart des projets, un tel travail distribu&eacute; &agrave; temps partiel serait tr&egrave;s difficile &agrave; coordonner; les parties &eacute;crites ind&eacute;pendamment ne pourraient pas fonctionner ensemble. Mais pour la t&acirc;che particuli&egrave;re de remplacer Unix, ce probl&egrave;me est absent. La plupart des sp&eacute;cifications d'interface sont r&eacute;solues par la compatibilit&eacute; avec Unix. Si chacune des contributions peut fonctionner avec le reste de Unix, elle a de fortes chances de fonctionner avec le reste de GNU.

source: If I get donations of money, I may be able to hire a few people full or part time. The salary won't be high, but I'm looking for people for whom knowing they are helping humanity is as important as money. I view this as a way of enabling dedicated people to devote their full energies to working on GNU by sparing them the need to make a living in another way.
fr: Si je recevais des dons d'argent, je pourrais engager quelques personnes &agrave; temps complet ou &agrave; temps partiel. Le salaire ne sera pas &eacute;lev&eacute; mais je recherche des gens pour qui aider l'humanit&eacute; est aussi important que l'argent. Je vois cela comme un moyen de permettre aux personnes d&eacute;vou&eacute;es de mettre toute leur &eacute;nergie &agrave; travailler sur GNU en leur &eacute;pargnant le besoin de gagner leur vie d'une autre mani&egrave;re.

source: For more information, contact me.
fr: Pour de plus amples informations, contactez-moi.

source: Arpanet mail:<br /> RMS@MIT-MC.ARPA
fr: Courriel Arpanet&nbsp;:<br />RMS&#64;MIT-MC.ARPA

source: Usenet:<br /> ...!mit-eddie!RMS@OZ<br /> ...!mit-vax!RMS@OZ
fr: Usenet&nbsp;:<br />&hellip;!mit-eddie!RMS&#64;OZ<br />&hellip;!mit-vax!RMS&#64;OZ

source: US Snail:<br /> Richard Stallman<br /> 166 Prospect St<br /> Cambridge, MA 02139
fr: Adresse postale (&Eacute;tats-Unis)&nbsp;:<br />Richard Stallman<br />166 Prospect St<br />Cambridge, MA 02139

source: Poor choice of wording around &ldquo;free&rdquo;
fr: Pi&egrave;tre formulation pour &laquo;&nbsp;libre&nbsp;&raquo;

source: The wording here was careless. The intention was that nobody would have to pay for <b>permission</b> to use the GNU system. But the words don't make this clear, and people often interpret them as saying that copies of GNU should always be distributed at little or no charge. That was never the intent.
fr: La formulation ici a &eacute;t&eacute; faite sans soin. L'intention &eacute;tait que personne n'aurait &agrave; payer pour la <b>permission</b> d'utiliser le syst&egrave;me GNU. Mais les mots ne rendent pas cela clairement, et les gens les interpr&egrave;tent souvent comme indiquant que les copies de GNU devraient toujours &ecirc;tre distribu&eacute;es &agrave; bas co&ucirc;t ou gratuitement. Cela n'a jamais &eacute;t&eacute; l'intention.

source: Original message
fr: Message original

source: For completeness, the original email is reproduced here, in its original form.
fr: Pour &ecirc;tre complet, le courriel original est reproduit ici, dans sa forme originale.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web à &lt;webmasters@gnu.org&gt;.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Wolfgang Sourdeau.<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traduction de cette page
