Repository: gitGNU/gnu_www-fr
Catalog: gnu/linux-and-gnu.*.po
Languages: fr

source: <a id="unexciting"></a>These unexciting but essential components include the GNU assembler, GAS and the linker, GLD, both are now part of the <a href="/software/binutils/">GNU Binutils</a> package, <a href="/software/tar/">GNU tar</a>, and more.
fr: <a id="unexciting">Ces composants non passionnants mais essentiels</a> comprenne l'assembleur GNU, GAS et le linker, GLD, qui font actuellement partie du paquetage <a href="/software/binutils/">GNU Binutils</a>, <a href="/software/tar/">GNU tar</a>, &hellip;.

source: <a id="nottools"></a>For instance, The Bourne Again SHell (BASH), the PostScript interpreter <a href="/software/ghostscript/ghostscript.html">Ghostscript</a>, and the <a href="/software/libc/libc.html">GNU C library</a> are not programming tools. Neither are GNUCash, GNOME, and GNU Chess.
fr: <a id="nottools">Par exemple</a>, le Bourne Again SHell (BASH), l'interpr&eacute;teur PostScript <a href="/software/ghostscript/ghostscript.html">Ghostscript</a>, et la <a href="/software/libc/libc.html">biblioth&egrave;que C GNU</a> ne sont pas des outils de programmation. Tout comme GNUCash, GNOME et GNU Chess.

source: <a id="somecomponents"></a>For instance, the <a href="/software/libc/libc.html">GNU C library</a>.
fr: <a id="somecomponents">Par exemple</a>, la <a href="/software/libc/libc.html">biblioth&egrave;que C GNU</a>.

source: <a id="newersystems"></a>Since that was written, a nearly-all-free Windows-like system has been developed, but technically it is not at all like GNU or Unix, so it doesn't really affect this issue. Most of the kernel of Solaris has been made free, but if you wanted to make a free system out of that, aside from replacing the missing parts of the kernel, you would also need to put it into GNU or BSD.
fr: <a id="newersystems"></a>Depuis que ceci a &eacute;t&eacute; &eacute;crit, un syst&egrave;me presque enti&egrave;rement libre de style Windows a &eacute;t&eacute; d&eacute;velopp&eacute;, mais techniquement il n'est pas du tout comme GNU ou Unix, donc cela n'affecte pas vraiment ce probl&egrave;me. La plupart du noyau de Solaris a &eacute;t&eacute; rendu libre, mais si vous voulez faire un syst&egrave;me libre de cela, &agrave; part remplacer les parties manquantes du noyau, vous aurez aussi besoin d'y ajouter GNU ou BSD.

source: <a id="gnubsd"></a>On the other hand, in the years since this article was written, the GNU C Library has been ported to the FreeBSD kernel, which made it possible to combine the GNU system with that kernel. Just as with GNU/Linux, these are indeed variants of GNU, and are therefore called GNU/kFreeBSD and GNU/kNetBSD depending on the kernel of the system. Ordinary users on typical desktops can hardly distinguish between GNU/Linux and GNU/*BSD.
fr: <a id="gnubsd"></a>D'un autre c&ocirc;t&eacute;, dans les ann&eacute;es qui ont suivi l'&eacute;criture de cet article, la biblioth&egrave;que GNU C a &eacute;t&eacute; port&eacute;e dans le noyau de FreeBSD, ce qui a rendu possible de combiner le syst&egrave;me GNU avec ce noyau. Tout comme avec GNU/Linux, ce sont des variantes de GNU, et sont par cons&eacute;quent appel&eacute;es GNU/kFreeBSD et GNU/kNetBSD en fonction du noyau du syst&egrave;me. Les utilisateurs ordinaires des bureaux classiques peuvent difficilement faire la diff&eacute;rence entre GNU/Linux et GNU/*BSD.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: ?<br />Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
