Repository: gitGNU/gnu_www-fr
Catalog: gnu/linux-and-gnu.*.po
Languages: fr

source: Linux and GNU - GNU Project - Free Software Foundation (FSF)
fr: Linux et le projet GNU - GNU Project - Free Software Foundation (FSF)

source: Since 1983, developing the free Unix style operating system GNU, so that computer users can have the freedom to share and improve the software they use.
fr: Depuis 1983, développement du système d'exploitation GNU de type Unix pour que les utilisateurs d'ordinateurs puissent avoir la liberté de partager et d'améliorer les logiciels qu'ils utilisent.

source: What's New
fr: Quoi de neuf&nbsp;?

source: New Free Software
fr: Nouveaux logiciels libres

source: Linux and the GNU Project
fr: Linux et le Projet GNU

source: <strong>by <a href="http://www.stallman.org/">Richard Stallman</a></strong>
fr: <strong>par <a href="http://www.stallman.org/">Richard Stallman</a></strong>

source: For more information see also the <a href="/gnu/gnu-linux-faq.html">GNU/Linux FAQ</a>, and <a href="/gnu/why-gnu-linux.html">Why GNU/Linux?</a>
fr: Pour plus de d&eacute;tails, consultez aussi la <a href="/gnu/gnu-linux-faq.fr.html">FAQ GNU/Linux</a> et <a href="/gnu/why-gnu-linux.fr.html">Pourquoi GNU/Linux&nbsp;?</a>.

source: Many computer users run a modified version of <a href="/philosophy/categories.html#TheGNUsystem">the GNU system</a> every day, without realizing it. Through a peculiar turn of events, the version of GNU which is widely used today is often called &ldquo;Linux&rdquo;, and many of its users are <a href="/gnu/gnu-users-never-heard-of-gnu.html"> not aware</a> that it is basically the GNU system, developed by the <a href="/gnu/gnu-history.html">GNU Project</a>.
fr: Beaucoup d'utilisateurs d'ordinateurs utilisent une version modifi&eacute;e du <a href="/philosophy/categories.fr.html#TheGNUsystem">Syst&egrave;me GNU</a> tous les jours sans m&ecirc;me le r&eacute;aliser. Apr&egrave;s une tournure particuli&egrave;re des &eacute;v&eacute;nements, la version de GNU qui est largement utilis&eacute;e est souvent appel&eacute;e &laquo;&nbsp;Linux&nbsp;&raquo; et beaucoup de ses utilisateurs ne <a href="/gnu/gnu-users-never-heard-of-gnu.fr.html">savent pas</a> qu'il s'agit basiquement du syst&egrave;me GNU, d&eacute;velop&eacute; par le <a href="/gnu/gnu-history.fr.html">Projet GNU</a>.

source: There really is a Linux, and these people are using it, but it is just a part of the system they use. Linux is the kernel: the program in the system that allocates the machine's resources to the other programs that you run. The kernel is an essential part of an operating system, but useless by itself; it can only function in the context of a complete operating system. Linux is normally used in combination with the GNU operating system: the whole system is basically GNU with Linux added, or GNU/Linux. All the so-called &ldquo;Linux&rdquo; distributions are really distributions of GNU/Linux.
fr: Il existe vraiment un Linux, et ces personnes l'utilisent, mais c'est juste une partie du syst&egrave;me qu'ils utilisent. Linux est le noyau&nbsp;: le programme du syst&egrave;me qui alloue les ressources de la machine aux autres programmes que vous ex&eacute;cutez. Le noyau est une partie essentielle du syst&egrave;me d'exploitation, mais il est inutile seul&nbsp;; il ne peut fonctionner que dans le contexte d'un syst&egrave;me d'exploitation complet. Linux est normalement utilis&eacute; en combinaison avec le syst&egrave;me d'exploitation GNU&nbsp;: le syst&egrave;me complet est basiquement GNU avec Linux ajout&eacute;, ou GNU/Linux. toutes les distributions appel&eacute;es &laquo;&nbsp;Linux&nbsp;&raquo; sont en r&eacute;alit&eacute; des distributions GNU/Linux.

source: Many users do not understand the difference between the kernel, which is Linux, and the whole system, which they also call &ldquo;Linux&rdquo;. The ambiguous use of the name doesn't help people understand. These users often think that Linus Torvalds developed the whole operating system in 1991, with a bit of help.
fr: Beaucoup d'utilisateurs ne sont pas au courant de la distinction entre le noyau, Linux, et le syst&egrave;me en entier qu'ils appellent aussi &laquo;&nbsp;Linux&nbsp;&raquo;. L'usage ambig&uuml; du nom ne facilite pas la compr&eacute;hension. Ces utilisateurs pensent que Linus Torvalds a d&eacute;velop&eacute; tout le syst&egrave;me d'exploitation en 1991, avec un peu d'aide.

source: Programmers generally know that Linux is a kernel. But since they have generally heard the whole system called &ldquo;Linux&rdquo; as well, they often envisage a history that would justify naming the whole system after the kernel. For example, many believe that once Linus Torvalds finished writing Linux, the kernel, its users looked around for other free software to go with it, and found that (for no particular reason) most everything necessary to make a Unix-like system was already available.
fr: Les programmeurs savent en g&eacute;n&eacute;ral que Linux est un noyau. Mais puisqu'ils ont entendu le syst&egrave;me entier &ecirc;tre appel&eacute; &laquo;&nbsp;Linux&nbsp;&raquo; aussi, souvent ils con&ccedil;oivent une histoire tournant autour de ce nom. Par exemple, plusieurs d'entre eux croient que d&egrave;s que Linus Torvalds a achev&eacute; l'&eacute;criture du noyau, ses amis ont recherch&eacute; d'autres logiciels libres et que, pour aucune raison en particulier, la plupart de ce qui &eacute;tait n&eacute;cessaire &agrave; un syst&egrave;me semblable &agrave; Unix &eacute;tait d&eacute;ja disponible.

source: What they found was no accident&mdash;it was the not-quite-complete GNU system. The available <a href="/philosophy/free-sw.html">free software</a> added up to a complete system because the GNU Project had been working since 1984 to make one. In the <a href="/gnu/manifesto.html"> The GNU Manifesto</a> we set forth the goal of developing a free Unix-like system, called GNU. The <a href="/gnu/initial-announcement.html"> Initial Announcement</a> of the GNU Project also outlines some of the original plans for the GNU system. By the time Linux was started, GNU was almost finished.
fr: Ce qu'ils ont trouv&eacute; n'&eacute;tait pas un accident&nbsp;: c'&eacute;tait le syst&egrave;me GNU. Les <a href="/philosophy/free-sw.fr.html">logiciels libres</a> disponibles compl&eacute;t&egrave;rent le syst&egrave;me parce que le Projet GNU travaillait &agrave; en concevoir un depuis 1984. <a href="/gnu/manifesto.fr.html">Le manifeste GNU</a> a mis en avant le dessein de d&eacute;velopper un syst&egrave;me semblable &agrave; Unix et appel&eacute; GNU. <a href="/gnu/initial-announcement.fr.html">L'Annonce Initiale</a> du Projet GNU souligne aussi quelques-uns des plans originaux pour le syst&egrave;me GNU. Au moment o&ugrave; Linux &eacute;tait lanc&eacute;, le syst&egrave;me &eacute;tait presque fini.

source: Most free software projects have the goal of developing a particular program for a particular job. For example, Linus Torvalds set out to write a Unix-like kernel (Linux); Donald Knuth set out to write a text formatter (TeX); Bob Scheifler set out to develop a window system (the X Window System). It's natural to measure the contribution of this kind of project by specific programs that came from the project.
fr: La plupart des projets de logiciel libre ont pour but de d&eacute;velopper un programme particulier pour accomplir une t&acirc;che particuli&egrave;re. Par exemple, Linus Torvalds s'est attel&eacute; &agrave; &eacute;crire un noyau semblable &agrave; Unix (Linux); Donald Knuth s'est attel&eacute; &agrave; &eacute;crire un programme de formatage de texte (TeX); Bob Scheifler s'est attel&eacute; &agrave; d&eacute;velopper un syst&egrave;me de fen&ecirc;trage (X Window System). Il est naturel de mesurer la contribution de ce type de projet par les programmes sp&eacute;cifiques qui proviennent dudit projet.

source: If we tried to measure the GNU Project's contribution in this way, what would we conclude? One CD-ROM vendor found that in their &ldquo;Linux distribution&rdquo;, <a href="/philosophy/categories.html#GNUsoftware">GNU software</a> was the largest single contingent, around 28% of the total source code, and this included some of the essential major components without which there could be no system. Linux itself was about 3%. (The proportions in 2008 are similar: in the &ldquo;main&rdquo; repository of gNewSense, Linux is 1.5% and GNU packages are 15%.) So if you were going to pick a name for the system based on who wrote the programs in the system, the most appropriate single choice would be &ldquo;GNU&rdquo;.
fr: Si nous essayions de mesurer la contribution du Projet GNU de cette mani&egrave;re, &agrave; quelle conclusion arriverions-nous&nbsp;? Un producteur de CD-ROM a constat&eacute; dans sa &laquo;&nbsp;Distribution de Linux&nbsp;&raquo; que les <a href="/philosophy/categories.fr.html#GNUsoftware">Logiciels GNU</a> y repr&eacute;sentaient la plus grande entit&eacute;, 28% du code source total, et que cela incluait quelques-uns des composants majeurs essentiels sans lesquels il n'y aurait pas de syst&egrave;me. Linux lui-m&ecirc;me n'y prenait une part que de 3%. (Les proportions en 2008 sont similaires&nbsp;: dans le r&eacute;pertoire &laquo;&nbsp;principal&nbsp;&raquo; de gNewSense, Linux a une part de 1,5% et les paquetages GNU de 15%). Alors s'il fallait trouver un nom pour le syst&egrave;meen se basant sur qui avait &eacute;crit les programmes qui le composent, le seul choix le plus appropri&eacute; serait &laquo;&nbsp;GNU&nbsp;&raquo;.

source: But that is not the deepest way to consider the question. The GNU Project was not, is not, a project to develop specific software packages. It was not a project <a href="/software/gcc/gcc.html"> to develop a C compiler</a>, although we did that. It was not a project to develop a text editor, although we developed one. The GNU Project set out to develop <em>a complete free Unix-like system</em>: GNU.
fr: Mais nous ne pensons pas que c'est la meilleure mani&egrave;re de consid&eacute;rer la question. Le Projet GNU n'&eacute;tait pas, et n'est pas, un projet pour d&eacute;velopper des paquetages logiciels sp&eacute;cifiques. Ce n'&eacute;tait pas un projet pour d&eacute;velopper un <a href="/software/gcc/gcc.html">compilateur C</a>, bien que nous l'ayions fait. Ce n'&eacute;tait pas non plus un projet pour d&eacute;velopper un &eacute;diteur de texte, bien que nous en ayions d&eacute;velopp&eacute; un. L'objectif final du Projet GNU est de d&eacute;velopper <em> un syst&egrave;me semblable &agrave; Unix, complet et libre</em>&nbsp;: GNU.

source: Many people have made major contributions to the free software in the system, and they all deserve credit for their software. But the reason it is <em>an integrated system</em>&mdash;and not just a collection of useful programs&mdash;is because the GNU Project set out to make it one. We made a list of the programs needed to make a <em>complete</em> free system, and we systematically found, wrote, or found people to write everything on the list. We wrote essential but unexciting <a href="#unexciting">(1)</a> components because you can't have a system without them. Some of our system components, the programming tools, became popular on their own among programmers, but we wrote many components that are not tools <a href="#nottools">(2)</a>. We even developed a chess game, GNU Chess, because a complete system needs games too.
fr: Plusieurs personnes ont apport&eacute; des contributions majeures aux logiciels libres qu'on trouve dans le syst&egrave;me et elles m&eacute;ritent toutes de la reconnaissance. Mais la raison pour laquelle c'est <em>un syst&egrave;me</em> -- et pas seulement une collection de programmes utiles -- est que le Projet GNU s'est donn&eacute; pour objectif d'en concevoir un. Nous avons dress&eacute; une liste des programmes requis &agrave; la conception d'un syst&egrave;me libre <em>complet</em> et nous avons syst&eacute;matiquement &eacute;crit ou trouv&eacute; des gens pour &eacute;crire toutes les choses mentionn&eacute;es sur la liste. Nous avons &eacute;crit des composants majeurs et essentiels mais non-passionnants <a href="#unexciting"><sup>1</sup></a> parce qu'on ne peut pas avoir de syst&egrave;me sans eux. Certains de nos composants syst&egrave;me, les outils de programmation, sont devenus populaires parmi les programmeurs, mais nous avons aussi &eacute;crit beaucoup de composants qui ne sont pas des outils <a href="#nottools"><sup>2</sup></a>. Nous avons m&ecirc;me d&eacute;velopp&eacute; un jeu d'&eacute;chec, GNU Chess, car un syst&egrave;me complet a besoin de jeux aussi.

source: By the early 90s we had put together the whole system aside from the kernel. We had also started a kernel, the <a href="/software/hurd/hurd.html">GNU Hurd</a>, which runs on top of Mach. Developing this kernel has been a lot harder than we expected; <a href="/software/hurd/hurd/documentation/hurd-and-linux.html">the GNU Hurd started working reliably in 2001</a>, but it is a long way from being ready for people to use in general.
fr: Au début des années 90 nous avions rassemblé le système complet en dehors du noyau. Nous avons commencé aussi un noyau&nbsp;: le <a href="/software/hurd/hurd.html">GNU Hurd</a>, qui tourne en superposition à Mach. Le développement de ce noyau fut bien plus difficile que nous nous y attendions&nbsp;: <a href="/software/hurd/hurd/documentation/hurd-and-linux.html">le GNU Hurd a commencé à fonctionner de manière fiable en 2001</a>, mais est encore loin d'être prêt à l'usage public.

source: Fortunately, we didn't have to wait for the Hurd, because of Linux. Once Torvalds wrote Linux, it fit into the last major gap in the GNU system. People could then <a href="http://www.kernel.org/pub/linux/kernel/Historic/old-versions/RELNOTES-0.01"> combine Linux with with the GNU system</a> to make a complete free system: a Linux-based version of the GNU system; the GNU/Linux system, for short.
fr: Heureusement, vous n'&ecirc;tes pas oblig&eacute; de l'attendre gr&acirc;ce &agrave; Linux. Quand Linus Torvalds a &eacute;crit Linux, il a bouch&eacute; le dernier trou dans le syst&egrave;me GNU. Les gens purent alors <a href="http://www.kernel.org/pub/linux/kernel/Historic/old-versions/RELNOTES-0.01">adjoindre Linux au syst&egrave;me GNU</a> pour obtenir un syst&egrave;me libre complet&nbsp;: un syst&egrave;me GNU bas&eacute; sur Linux&nbsp;; le syst&egrave;me GNU/Linux, en plus court.

source: Making them work well together was not a trivial job. Some GNU components<a href="#somecomponents">(3)</a> needed substantial change to work with Linux. Integrating a complete system as a distribution that would work &ldquo;out of the box&rdquo; was a big job, too. It required addressing the issue of how to install and boot the system&mdash;a problem we had not tackled, because we hadn't yet reached that point. Thus, the people who developed the various system distributions did a lot of essential work. But it was work that, in the nature of things, was surely going to be done by someone.
fr: Les faire fonctionner ensemble n'&eacute;tait pas un travail trivial. Certains composants GNU <a href="#somecomponents"><sup>3</sup></a> requ&eacute;raient des changements substantiels pour fonctionner avec Linux. L'int&eacute;gration d'un syst&egrave;me complet en une distribution qui pourrait fonctionner &laquo;&nbsp;au d&eacute;ballage&nbsp;&raquo; fut un travail tout aussi gros. Il fallait r&eacute;soudre la question de l'installation et du d&eacute;marrage du syst&egrave;me -- un probl&egrave;me auquel nous ne nous &eacute;tions pas attaqu&eacute; car nous n'en &eacute;tions pas encore l&agrave;. Les personnes qui ont d&eacute;velopp&eacute; les diverses distributions du syst&egrave;me ont donc &eacute;ffectu&eacute; un travail &eacute;ssentiel. Mais c'&eacute;tait du travail qui, de toute fa&ccedil;on, allait certainement &ecirc;tre r&eacute;alis&eacute; par quelqu'un.

source: The GNU Project supports GNU/Linux systems as well as <em>the</em> GNU system. The <a href="http://fsf.org/">FSF</a> funded the rewriting of the Linux-related extensions to the GNU C library, so that now they are well integrated, and the newest GNU/Linux systems use the current library release with no changes. The FSF also funded an early stage of the development of Debian GNU/Linux.
fr: Le Projet GNU soutient les syst&egrave;mes GNU/Linux ainsi que <em>le</em> syst&egrave;me GNU, et les fonds de la FSF sont impliqu&eacute;s. La <a href="http://fsf.org/">FSF</a> a financ&eacute; la r&eacute;&eacute;criture des extensions propres &agrave; Linux de la biblioth&egrave;que C de GNU afin qu'ils soient maintenant bien int&eacute;gr&eacute;s et les syst&egrave;mes GNU/Linux les plus r&eacute;cents emploient la biblioth&egrave;que actuelle sans aucune modification. La FSF a aussi financ&eacute; le d&eacute;veloppement de <a href="http://www.debian.org/">Debian GNU/Linux</a> &agrave; un de ses stades initiaux.

source: Today there are many different variants of the GNU/Linux system (often called &ldquo;distros&rdquo;). Most of them include non-free software&mdash;their developers follow the philosophy associated with Linux rather than that of GNU. But there are also <a href="/links/links.html#FreeGNULinuxDistributions"> completely free GNU/Linux distros</a>. The FSF supports computer facilities for two of these distributions, <a href="http://ututo.org">Ututo</a> and <a href="http://gnewsense.org/">gNewSense</a>.
fr: Aujourd'hui il &eacute;xiste de nombreuses variantes du syst&egrave;me GNU/Linux souvent appel&eacute;s &laquo;&nbsp;distributions&nbsp;&raquo;. La plupart d'entre elles incluent des logiciels non-libres&nbsp;: leur d&eacute;veloppeurs suivent la philosophie associ&eacute;e &agrave; Linux plut&ocirc;t que celle de GNU. Mais il y a aussi des<a href="/links/links.fr.html#FreeGNULinuxDistributions">distributions de GNU/Linux compl&egrave;tement libres</a>. La FSF pourvoit le mat&eacute;riel informatique pour deux de ces distributions, <a href="http://ututo.org">Ututo</a> et <a href="http://gnewsense.org/">gNewSense</a>.

source: Making a free GNU/Linux distribution is not just a matter of eliminating various non-free programs. Nowadays, the usual version of Linux contains non-free programs too. These programs are intended to be loaded into I/O devices when the system starts, and they are included, as long series of numbers, in the "source code" of Linux. Thus, maintaining free GNU/Linux distributions now entails maintaining a <a href="http://directory.fsf.org/project/linux"> free version of Linux</a> too.
fr: Faire une distribution libre de GNU/Linux n'est pas uniquement une question d'&eacute;limination des programmes divers non-libres. Aujourd'hui, les versions usuelles de Linux contiennent &eacute;galement des programmes non-libres. Ces programmes sont destin&eacute;s &agrave; &ecirc;tre charg&eacute;s dans des appareils d'entr&eacute;e/sortie quand le syst&egrave;me d&eacute;marre, et ils sont inclus, sous forme de longues s&eacute;ries de nombres, dans le &laquo;&nbsp;code source&nbsp;&raquo; de Linux. De ce fait, maintenir une distribution libre de GNU/Linux inclut maintenant &eacute;galement la maintenance d'une <a href="http://directory.fsf.org/project/linux">version libre de Linux</a>.

source: Whether you use GNU/Linux or not, please don't confuse the public by using the name &ldquo;Linux&rdquo; ambiguously. Linux is the kernel, one of the essential major components of the system. The system as a whole is basically the GNU system, with Linux added. When you're talking about this combination, please call it &ldquo;GNU/Linux&rdquo;.
fr: Que vous utilisiez GNU/Linux ou pas, veuillez ne pas semez la confusion en utilisant le nom &laquo;&nbsp;Linux&nbsp;&raquo; de mani&egrave;re ambigu&euml;. Linux est le noyau, un des composants majeurs essentiels du syst&egrave;me. Le syst&egrave;me dans son ensemble est plus ou moins le syst&egrave;me GNU additionn&eacute; de Linux. Quand vous parlez de cette combinaison, veuillez l'appeler &laquo;&nbsp;GNU/Linux&nbsp;&raquo;.

source: If you want to make a link on &ldquo;GNU/Linux&rdquo; for further reference, this page and <a href="/gnu/the-gnu-project.html"> http://www.gnu.org/gnu/the-gnu-project.html</a> are good choices. If you mention Linux, the kernel, and want to add a link for further reference, <a href="http://foldoc.doc.ic.ac.uk/foldoc/foldoc.cgi?Linux"> http://foldoc.doc.ic.ac.uk/foldoc/foldoc.cgi?Linux</a> is a good URL to use.
fr: Si vous voulez indiquer une r&eacute;f&eacute;rence vers &laquo;&nbsp;GNU/Linux&nbsp;&raquo;, cette page et <a href="/gnu/the-gnu-project.fr.html">http://www.gnu.org/gnu/the-gnu-project.fr.html</a> sont de bons choix. Si vous voulez indiquer une r&eacute;f&eacute;rence &agrave; Linux, le noyau, <a href="http://foldoc.doc.ic.ac.uk/foldoc/foldoc.cgi?Linux"> http://foldoc.doc.ic.ac.uk/foldoc/foldoc.cgi?Linux</a> est une bonne URL &agrave; utiliser.

source: Addendum: Aside from GNU, one other project has independently produced a free Unix-like operating system. This system is known as BSD, and it was developed at UC Berkeley. It was non-free in the 80s, but became free in the early 90s. A free operating system that exists today<a href="#newersystems">(4)</a> is almost certainly either a variant of the GNU system, or a kind of BSD system.
fr: Addendum&nbsp;: &Agrave; c&ocirc;t&eacute; de GNU, un autre projet a produit de mani&egrave;re ind&eacute;pendante un syst&egrave;me d'exploitation libre semblable &agrave; Unix. Ce syst&egrave;me est connu sous le nom de BSD et a &eacute;t&eacute; d&eacute;velopp&eacute; &agrave; l'University College de Berkeley. Il n'&eacute;tait pas libre dans les ann&eacute;es 80, mais le devint au d&eacute;but des ann&eacute;es 90. Tout syst&egrave;me d'exploitation libre existant aujourd'hui <a href="#newersystems"><sup>4</sup></a> est fort probablement soit une variante de GNU, soit un type de syst&egrave;me BSD.

source: People sometimes ask whether BSD too is a version of GNU, like GNU/Linux. The BSD developers were inspired to make their code free software by the example of the GNU Project, and explicit appeals from GNU activists helped persuade them, but the code had little overlap with GNU. BSD systems today use some GNU programs, just as the GNU system and its variants use some BSD programs; however, taken as wholes, they are two different systems that evolved separately. The BSD developers did not write a kernel and add it to the GNU system, and a name like GNU/BSD would not fit the situation.<a href="#gnubsd">(5)</a>
fr: Quelquefois les gens demandent si BSD est aussi une version de GNU, comme GNU/Linux. Les d&eacute;veloppeurs de BSD ont &eacute;t&eacute; inspir&eacute;s &agrave; rendre leur travail libre par l'exemple du Projet GNU et ils ont &eacute;t&eacute; encourag&eacute;s &agrave; l'occasion par des activistes de GNU mais leur travail &eacute;tait de moindre relation avec GNU. Les syst&egrave;mes BSD emploient quelques logiciels GNU aujourd'hui, de m&ecirc;me que le syst&egrave;me GNU et ses variantes font usage de quelques logiciels BSD; mais pris &agrave; part, ce sont deux syst&egrave;mes diff&eacute;rents qui ont &eacute;volu&eacute; s&eacute;par&eacute;ment. Les d&eacute;veloppeurs de BSD n'ont pas &eacute;crit un noyau qu'ils auraient ajout&eacute; au syst&egrave;me GNU, et un nom tel que GNU/BSD ne refl&eacute;rait pas la situation <a href="#gnubsd"><sup>5</sup></a>.

source: Notes:
fr: Notes&nbsp;:
