Repository: gitGNU/gnu_www-fr
Catalog: gnu/manifesto.*.po
Languages: fr

source: <strong>&ldquo;Won't everyone stop programming without a monetary incentive?&rdquo;</strong>
fr: <strong>&laquo;&nbsp;Les gens s'arr&ecirc;teront-ils de programmer sans l'app&acirc;t du gain&nbsp;?&nbsp;&raquo;</strong>

source: Actually, many people will program with absolutely no monetary incentive. Programming has an irresistible fascination for some people, usually the people who are best at it. There is no shortage of professional musicians who keep at it even though they have no hope of making a living that way.
fr: En fait, beaucoup de gens programmeront m&ecirc;me sans aucun b&eacute;n&eacute;fice financier. La programmation exerce une fascination irr&eacute;sistible pour quelques-uns, g&eacute;n&eacute;ralement ceux qui programment le mieux. Il n'y a aucune p&eacute;nurie de musiciens professionnels qui continuent &agrave; jouer, m&ecirc;me sans l'espoir de pouvoir en faire leur gagne-pain.

source: But really this question, though commonly asked, is not appropriate to the situation. Pay for programmers will not disappear, only become less. So the right question is, will anyone program with a reduced monetary incentive? My experience shows that they will.
fr: Mais en fait cette question, bien qu'elle soit souvent pos&eacute;e, ne convient pas &agrave; la situation. Les salaires des programmeurs ne dispara&icirc;tront pas mais diminueront peut-&ecirc;tre. La question devient donc, trouvera-t-on des programmeurs qui travailleront pour une moindre r&eacute;mun&eacute;ration&nbsp;? D'apr&egrave;s mon exp&eacute;rience, la r&eacute;ponse est oui.

source: For more than ten years, many of the world's best programmers worked at the Artificial Intelligence Lab for far less money than they could have had anywhere else. They got many kinds of non-monetary rewards: fame and appreciation, for example. And creativity is also fun, a reward in itself.
fr: Pendant plus de dix ans, plusieurs des meilleurs programmeurs du monde ont travaill&eacute; au laboratoire d'Intelligence Artificielle du MIT pour un salaire bien moins important que ce qu'ils auraient touch&eacute;s ailleurs. Ils &eacute;taient r&eacute;compens&eacute;s de plusieurs autres mani&egrave;res: la notori&eacute;t&eacute;, le respect des autres, par exemple. Et la cr&eacute;ativit&eacute; est une r&eacute;compense en soi.

source: Then most of them left when offered a chance to do the same interesting work for a lot of money.
fr: Et puis la plupart sont partis pour faire le m&ecirc;me travail pour beaucoup plus d'argent.

source: What the facts show is that people will program for reasons other than riches; but if given a chance to make a lot of money as well, they will come to expect and demand it. Low-paying organizations do poorly in competition with high-paying ones, but they do not have to do badly if the high-paying ones are banned.
fr: Les faits d&eacute;montrent que les gens programmeront pour d'autres raisons que l'accumulation de richesses; mais si on leur propose beaucoup plus d'argent, ils s'y attendront finalement et l'exigeront. Les organismes qui payent moins bien ont du mal face &agrave; ceux qui payent bien, mais ils devraient pouvoir s'en sortir si les gros payeurs sont bannis.

source: <strong>&ldquo;We need the programmers desperately. If they demand that we stop helping our neighbors, we have to obey.&rdquo;</strong>
fr: <strong>&laquo;&nbsp;Nos besoins en programmeurs sont tellement importants que s'ils interdisent le partage, nous ne pouvons que leur ob&eacute;ir.&nbsp;&raquo;</strong>

source: You're never so desperate that you have to obey this sort of demand. Remember: millions for defense, but not a cent for tribute!
fr: La situation n'est jamais aussi d&eacute;sesp&eacute;r&eacute;e au point d'&ecirc;tre amen&eacute; &agrave; ob&eacute;ir &agrave; une telle interdiction.

source: <strong>&ldquo;Programmers need to make a living somehow.&rdquo;</strong>
fr: <strong>&laquo;&nbsp;Les programmeurs doivent bien gagner leur pain.&nbsp;&raquo;</strong>

source: In the short run, this is true. However, there are plenty of ways that programmers could make a living without selling the right to use a program. This way is customary now because it brings programmers and businessmen the most money, not because it is the only way to make a living. It is easy to find other ways if you want to find them. Here are a number of examples.
fr: &Agrave; court terme, cela est vrai. Cependant, il y a de nombreuses possibilit&eacute;s offertes &agrave; un programmeur pour vivre d&eacute;cemment sans pour autant vendre le droit d'utiliser un programme. Cette fa&ccedil;on est la plus r&eacute;pandue actuellement, car c'est celle qui engendre le plus de profit pour les programmeurs et les hommes d'affaires, et non parce que c'est la seule mani&egrave;re de gagner son pain. Vous pouvez facilement trouver d'autres mani&egrave;res si vous le voulez. Voici quelques exemples.

source: A manufacturer introducing a new computer will pay for the porting of operating systems onto the new hardware.
fr: Un fabricant arrivant avec un nouvel ordinateur payera pour le portage des syst&egrave;mes d'exploitation sur le nouveau mat&eacute;riel.

source: The sale of teaching, hand-holding and maintenance services could also employ programmers.
fr: L'offre de services d'enseignement, de conseil et de maintenance peut permettre la cr&eacute;ation d'emplois.

source: People with new ideas could distribute programs as freeware<a href="#f7">(7)</a>, asking for donations from satisfied users, or selling hand-holding services. I have met people who are already working this way successfully.
fr: Les personnes avec des id&eacute;es nouvelles peuvent distribuer des logiciels librement <a href="#f7"><sup>7</sup></a>, en demandant des dons aux utilisateurs satisfaitsou en offrant un service de conseil. J'ai d&eacute;j&agrave; rencontr&eacute; des personnes travaillant ainsi.

source: Users with related needs can form users' groups, and pay dues. A group would contract with programming companies to write programs that the group's members would like to use.
fr: Les utilisateurs ayant des besoins en commun, peuvent cr&eacute;er des groupes d'utilisateurs et payer des cotisations. Un tel groupe pourrait faire appel &agrave; une soci&eacute;t&eacute; de d&eacute;veloppement pour &eacute;crire les programmes sp&eacute;cifiques pour ses membres.

source: All sorts of development can be funded with a Software Tax:
fr: Toutes sortes de d&eacute;veloppement pourraient &ecirc;tre financ&eacute;s par une taxe sur les logiciels&nbsp;:

source: Suppose everyone who buys a computer has to pay x percent of the price as a software tax. The government gives this to an agency like the NSF to spend on software development.
fr: supposons que chaque personne qui ach&egrave;te un ordinateur doive payer x pour cent du prix en tant que taxe sur les logiciels. Le gouvernement reverserait cette somme &agrave; un organisme tel que la NSF pour subvenir au d&eacute;veloppement de logiciels

source: But if the computer buyer makes a donation to software development himself, he can take a credit against the tax. He can donate to the project of his own choosing&mdash;often, chosen because he hopes to use the results when it is done. He can take a credit for any amount of donation up to the total tax he had to pay.
fr: Mais si l'acheteur fait lui-m&ecirc;me un don au d&eacute;veloppement de logiciels, il pourra &ecirc;tre cr&eacute;dit&eacute; pour cette taxe. Il pourrait donner au projet de son choix, car il esp&eacute;rera profiter des r&eacute;sultats &agrave; l'ach&egrave;vement du projet. Il pourra donc &ecirc;tre exempt&eacute; de la taxe si le montant de sa donation recouvre celle-ci.

source: The total tax rate could be decided by a vote of the payers of the tax, weighted according to the amount they will be taxed on.
fr: Le taux de la taxe pourrait &ecirc;tre d&eacute;termin&eacute; par un vote de ceux qui la payent, pond&eacute;r&eacute; par le montant de l'imposition.

source: The consequences:
fr: Les cons&eacute;quences&nbsp;:

source: The computer-using community supports software development.
fr: La communaut&eacute; des utilisateurs soutient le d&eacute;veloppement des logiciels.

source: This community decides what level of support is needed.
fr: Cette communaut&eacute; d&eacute;cide du niveau du soutien n&eacute;cessaire.

source: Users who care which projects their share is spent on can choose this for themselves.
fr: Pour les utilisateurs qui se soucient de quels projets profitent de leur participation, ils pourront les choisir eux-m&ecirc;mes.

source: In the long run, making programs free is a step toward the post-scarcity world, where nobody will have to work very hard just to make a living. People will be free to devote themselves to activities that are fun, such as programming, after spending the necessary ten hours a week on required tasks such as legislation, family counseling, robot repair and asteroid prospecting. There will be no need to be able to make a living from programming.
fr: &Agrave; terme, rendre les programmes libres est un pas vers le monde d'apr&egrave;s p&eacute;nurie, quand personne ne devra travailler tr&egrave;s dur juste pour survivre. Les gens seront libres de se consacrer &agrave; des activit&eacute;s ludiques telles que la programmation, apr&egrave;s avoir, bien entendu, pass&eacute; les dix heures par semaine n&eacute;cessaires pour des œuvres telles que la l&eacute;gislation, la th&eacute;rapie de famille, la r&eacute;paration de robots et l'exploration d'ast&eacute;ro&iuml;des. Il n'y aura donc plus besoin de gagner sa vie en programmant.

source: We have already greatly reduced the amount of work that the whole society must do for its actual productivity, but only a little of this has translated itself into leisure for workers because much nonproductive activity is required to accompany productive activity. The main causes of this are bureaucracy and isometric struggles against competition. Free software will greatly reduce these drains in the area of software production. We must do this, in order for technical gains in productivity to translate into less work for us.
fr: Nous avons d&eacute;j&agrave; beaucoup r&eacute;duit la quantit&eacute; de travail que la soci&eacute;t&eacute; enti&egrave;re doit fournir pour sa productivit&eacute;, mais seulement une petite part se traduit en temps de loisirs pour les travailleurs, car beaucoup d'activit&eacute;s non productives sont n&eacute;cessaires pour accompagner l'activit&eacute; productive. Les raisons principales sont la bureaucratie et la lutte isom&eacute;trique contre la concurrence. Le logiciel libre va r&eacute;duire grandement ces fuites du domaine du d&eacute;veloppement logiciel. Nous devons faire cela, pour que les gains de productivit&eacute; se traduisent en moins d'heures de travail pour nous.

source: Footnotes
fr: Notes

source: <a name="f1"></a>The wording here was careless. The intention was that nobody would have to pay for <b>permission</b> to use the GNU system. But the words don't make this clear, and people often interpret them as saying that copies of GNU should always be distributed at little or no charge. That was never the intent; later on, the manifesto mentions the possibility of companies providing the service of distribution for a profit. Subsequently I have learned to distinguish carefully between &ldquo;free&rdquo; in the sense of freedom and &ldquo;free&rdquo; in the sense of price. Free software is software that users have the freedom to distribute and change. Some users may obtain copies at no charge, while others pay to obtain copies&mdash;and if the funds help support improving the software, so much the better. The important thing is that everyone who has a copy has the freedom to cooperate with others in using it.
fr: <a name="f1"></a> Le choix des mots ici &eacute;tait irr&eacute;fl&eacute;chi. L'id&eacute;e &eacute;tait que personne n'aurait &agrave; payer l'autorisation d'utiliser le syst&egrave;me GNU. Mais cela n'&eacute;tait pas clair, et les gens ont souvent compris que les copies de GNU devaient toujours &ecirc;tre distribu&eacute;es peu ch&egrave;res ou gratuitement. Cela n'a jamais &eacute;t&eacute; l'intention; plus tard, le manifeste mentionne pour les soci&eacute;t&eacute;s la possibilit&eacute; de fournir un service de distribution rentable. Par la suite, j'ai appris &agrave; bien faire la distinction entre &laquo;&nbsp;free&nbsp;&raquo; dans le sens de libre, et &laquo;&nbsp;free&nbsp;&raquo; dans le sens de gratuit. Le logiciel libre est un programme que les utilisateurs ont la libert&eacute; de distribuer et de modifier. Certains utilisateurs peuvent obtenir des copies gratuitement, tandis que d'autres les paieront et si cela peut rapporter de quoi financer l'am&eacute;lioration de programmes, tant mieux. L'important est que toute personne d&eacute;tenant une copie a le droit de l'utiliser en collaboration avec d'autres.

source: <a name="f2"></a>This is another place I failed to distinguish carefully between the two different meanings of &ldquo;free&rdquo;. The statement as it stands is not false&mdash;you can get copies of GNU software at no charge, from your friends or over the net. But it does suggest the wrong idea.
fr: <a name="f2"></a> Voil&agrave; un autre endroit o&ugrave; je n'ai pas fait la distinction entre les deux d&eacute;finitions de &laquo;&nbsp;libre&nbsp;&raquo;. La phrase telle quelle n'est pas fausse, vous pouvez obtenir des copies de logiciels GNU gratuitement, par vos amis ou par l'Internet. Mais elle sugg&egrave;re effectivement la mauvaise id&eacute;e. [NdT&nbsp;: En fran&ccedil;ais, la distinction entre &laquo;&nbsp;libre&nbsp;&raquo; et &laquo;&nbsp;gratuit&nbsp;&raquo; est &eacute;vidente.]

source: <a name="f3"></a>Several such companies now exist.
fr: <a name="f3"></a> De telles soci&eacute;t&eacute;s existent actuellement.

source: <a name="f4"></a>The Free Software Foundation for 10 years raised most of its funds from a distribution service, although it is a charity rather than a company. You can <a href="/order/order.html">order things from the FSF</a>.
fr: <a name="f4"></a>Depuis dix ans, la Free Software Foundation a lev&eacute; la plupart de ses fonds &agrave; travers un service de distribution, bien qu'elle soit une association plut&ocirc;t qu'une soci&eacute;t&eacute;. Vous pouvez <a href="/order/order.html">commander des logiciels, des livres, &hellip; &agrave; la FSF</a>.

source: <a name="f5"></a>A group of computer companies pooled funds around 1991 to support maintenance of the GNU C Compiler.
fr: <a name="f5"></a> Un groupe de soci&eacute;t&eacute;s a r&eacute;uni des fonds vers 1991 pour financer la maintenance du compilateur C de GNU.

source: <a name="f6"></a>In the 80s I had not yet realized how confusing it was to speak of &ldquo;the issue&rdquo; of &ldquo;intellectual property&rdquo;. That term is obviously biased; more subtle is the fact that it lumps together various disparate laws which raise very different issues. Nowadays I urge people to reject the term &ldquo;intellectual property&rdquo; entirely, lest it lead others to suppose that those laws form one coherent issue. The way to be clear is to discuss patents, copyrights, and trademarks separately. See <a href="/philosophy/not-ipr.html">further explanation</a> of how this term spreads confusion and bias.
fr: <a name="f6"></a> Dans les ann&eacute;es 80, je n'avais pas encore r&eacute;alis&eacute; &agrave; quel point il &eacute;tait d&eacute;routant de parler du &laquo;&nbsp;probl&egrave;me&nbsp;&raquo; de la &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;. Ce terme est &eacute;videmment partial; plus subtil dans le fait qu'il m&eacute;lange diverses lois disparates qui traitent de probl&agrave;mes tr&agrave;s diff&eacute;rents. De nos jours, je presse les gens &agrave; rejeter totalement le terme &laquo;&nbsp;propri&eacute;t&eacute; intellectuelle&nbsp;&raquo;, de peur qu'il ne conduise d'autres personnes &agrave; supposer que ces lois forment une solution coh&eacute;rente. La fa&ccedil;on d'&ecirc;tre clair est de parler de brevets, de droits d'auteur, et de marques d&eacute;pos&eacute;es s&eacute;par&eacute;ment. Voir <a href="/philosophy/not-ipr.fr.xhtml">des explications plus d&eacute;taill&eacute;es</a> sur la mani&egrave;re dont ce terme s&egrave;me la confusion et le parti-pris.

source: <a name="f7"></a>Subsequently we have learned to distinguish between &ldquo;free software&rdquo; and &ldquo;freeware&rdquo;. The term &ldquo;freeware&rdquo; means software you are free to redistribute, but usually you are not free to study and change the source code, so most of it is not free software. See <a href="/philosophy/words-to-avoid.html#Freeware"> the Confusing Words and Phrases page</a> for more explanation.
fr: <a name="f7"></a> Par la suite, nous avons appris la distinction entre &laquo;&nbsp;logiciel libre&nbsp;&raquo; et &laquo;&nbsp;graticiel&nbsp;&raquo; (&laquo;&nbsp;freeware&nbsp;&raquo;). Le terme &laquo;&nbsp;graticiel&nbsp;&nbsp;&raquo; signifie logiciel que vous &ecirc;tes libre de redistribuer, mais g&eacute;n&eacute;ralement, vous n'&ecirc;tes pas libre de l'&eacute;tudier ou de changer le code source; donc la plupart d'entre eux ne sont pas des logiciels libres. Voir la page <a href="/philosophy/words-to-avoid.fr.html#Freeware">Termes pr&ecirc;tant &agrave; confusion, que vous devriez &eacute;viter</a> pour plus d'explications.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections or suggestions to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Permission is granted to anyone to make or distribute verbatim copies of this document, in any medium, provided that the copyright notice and permission notice are preserved, and that the distributor grants the recipient permission for further redistribution as permitted by this notice. <br /> Modified versions may not be made.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: ?.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
