Repository: gitGNU/gnu_www-fr
Catalog: gnu/manifesto.*.po
Languages: fr

source: <strong>&ldquo;Nobody will use it if it is free, because that means they can't rely on any support.&rdquo;</strong>
fr: <strong>&laquo;&nbsp;Personne ne s'en servira si c'est gratuit, car cela veut dire que l'on ne peut compter sur aucun support.&nbsp;&raquo;</strong>

source: <strong>&ldquo;You have to charge for the program to pay for providing the support.&rdquo;</strong>
fr: <strong>&laquo;&nbsp;Il faut faire payer le logiciel pour financer le service apr&egrave;s-vente.&nbsp;&raquo;</strong>

source: If people would rather pay for GNU plus service than get GNU free without service, a company to provide just service to people who have obtained GNU free ought to be profitable.<a href="#f3">(3)</a>
fr: Il y a des gens qui pr&eacute;f&egrave;rent payer pour GNU et le service plut&ocirc;t que d'obtenir GNU sans service. Une soci&eacute;t&eacute; qui propose le service uniquement &agrave; ceux qui ont obtenu GNU gratuitement, devrait &ecirc;tre rentable <a href="#f3"><sup>3</sup></a>.

source: We must distinguish between support in the form of real programming work and mere handholding. The former is something one cannot rely on from a software vendor. If your problem is not shared by enough people, the vendor will tell you to get lost.
fr: Nous devons faire la distinction entre le support en termes de r&eacute;el travail de programmation et le simple support d'assistance. On ne peut pas compter sur le premier de la part d'un simple revendeur. Si votre probl&egrave;me n'est pas suffisamment r&eacute;pandu, le revendeur vous enverra balader.

source: If your business needs to be able to rely on support, the only way is to have all the necessary sources and tools. Then you can hire any available person to fix your problem; you are not at the mercy of any individual. With Unix, the price of sources puts this out of consideration for most businesses. With GNU this will be easy. It is still possible for there to be no available competent person, but this problem cannot be blamed on distribution arrangements. GNU does not eliminate all the world's problems, only some of them.
fr: Si votre soci&eacute;t&eacute; a besoin d'un support fiable, la seule fa&ccedil;on est d'avoir toutes les sources et tous les outils n&eacute;cessaires. &Agrave; partir de l&agrave;, vous pouvez engager n'importe quelle personne qualifi&eacute;e pour r&eacute;gler les probl&egrave;mes. Vous n'&ecirc;tes pas &agrave; la merci d'une seule personne. Avec Unix, le prix des sources rend cette solution inabordable pour la plupart des soci&eacute;t&eacute;s. Avec GNU ce sera facile. Il serait &eacute;ventuellement concevable qu'il n'y ait personne de disponible, mais les modalit&eacute;s de distribution ne sont pas responsables de ce probl&egrave;me. GNU ne propose pas de r&eacute;gler tous les probl&egrave;mes, mais seulement quelques-uns.

source: Meanwhile, the users who know nothing about computers need handholding: doing things for them which they could easily do themselves but don't know how.
fr: Pendant ce temps, les utilisateurs qui n'y connaissent rien en informatique ont besoin d'assistance et de personnes pour les aider &agrave; faire ce qu'ils pourraient faire tr&egrave;s bien eux-m&ecirc;mes si seulement ils s'y connaissaient.

source: Such services could be provided by companies that sell just hand-holding and repair service. If it is true that users would rather spend money and get a product with service, they will also be willing to buy the service having got the product free. The service companies will compete in quality and price; users will not be tied to any particular one. Meanwhile, those of us who don't need the service should be able to use the program without paying for the service.
fr: De tels services pourraient &ecirc;tre propos&eacute;s par des soci&eacute;t&eacute;s qui ne font que des cours d'initiation et des r&eacute;parations. S'il est vrai que les utilisateurs pr&eacute;f&egrave;rent d&eacute;penser de l'argent pour un logiciel int&eacute;grant un service apr&egrave;s-vente, ils seront aussi d'accord pour payer simplement le service, ayant obtenu le logiciel gratuitement. Les soci&eacute;t&eacute;s de service se feront concurrence sur la qualit&eacute; et le prix de leurs prestations. Les utilisateurs ne seront pas limit&eacute;s &agrave; une soci&eacute;t&eacute; particuli&egrave;re. En m&ecirc;me temps, ceux d'entre nous qui n'ont pas besoin du service pourront utiliser le logiciel sans payer le service.

source: <strong>&ldquo;You cannot reach many people without advertising, and you must charge for the program to support that.&rdquo;</strong>
fr: <strong>&laquo;&nbsp;On ne peut pas &ecirc;tre connu sans publicit&eacute; et il faut payer le logiciel pour financer la publicit&eacute;.&nbsp;&raquo;</strong>

source: <strong>&ldquo;It's no use advertising a program people can get free.&rdquo;</strong>
fr: <strong>&laquo;&nbsp;Ca ne sert &agrave; rien de faire de la publicit&eacute; si on peut obtenir le logiciel gratuitement.&nbsp;&raquo;</strong>

source: There are various forms of free or very cheap publicity that can be used to inform numbers of computer users about something like GNU. But it may be true that one can reach more microcomputer users with advertising. If this is really so, a business which advertises the service of copying and mailing GNU for a fee ought to be successful enough to pay for its advertising and more. This way, only the users who benefit from the advertising pay for it.
fr: Il existe plusieurs formes de publicit&eacute; gratuite ou bon march&eacute; qui peuvent &ecirc;tre utilis&eacute;es pour informer de nombreux utilisateurs au sujet de GNU. Cependant, il est peut-&ecirc;tre vrai que l'on peut atteindre plus d'utilisateurs avec de la publicit&eacute;. Si cela est vrai, une soci&eacute;t&eacute; qui fait de la publicit&eacute; sur le service payant de copie et de distribution de GNU doit &ecirc;tre suffisamment rentable pour assurer sa propre publicit&eacute; et bien davantage. Ainsi, seuls les utilisateurs qui b&eacute;n&eacute;ficient de la publicit&eacute; la payent.

source: On the other hand, if many people get GNU from their friends, and such companies don't succeed, this will show that advertising was not really necessary to spread GNU. Why is it that free market advocates don't want to let the free market decide this?<a href="#f4">(4)</a>
fr: En revanche, si de nombreuses personnes obtiennent GNU par leurs relations, de telles soci&eacute;t&eacute;s ne seraient pas rentables, et cela d&eacute;montrerait que la publicit&eacute; n'&eacute;tait pas vraiment n&eacute;cessaire pour r&eacute;pandre GNU. Pourquoi est-ce que les partisans du libre &eacute;change ne veulent pas laisser cette d&eacute;cision au march&eacute; libre <a href="#f4"><sup>4</sup></a>&nbsp;?

source: <strong>&ldquo;My company needs a proprietary operating system to get a competitive edge.&rdquo;</strong>
fr: <strong>&laquo;&nbsp;Ma soci&eacute;t&eacute; a besoin d'un syst&egrave;me propri&eacute;taire pour &ecirc;tre comp&eacute;titive.&nbsp;&raquo;</strong>

source: GNU will remove operating system software from the realm of competition. You will not be able to get an edge in this area, but neither will your competitors be able to get an edge over you. You and they will compete in other areas, while benefiting mutually in this one. If your business is selling an operating system, you will not like GNU, but that's tough on you. If your business is something else, GNU can save you from being pushed into the expensive business of selling operating systems.
fr: GNU va retirer les syst&egrave;mes d'exploitation du domaine de la concurrence. Vous ne pourrez pas &ecirc;tre avantag&eacute; dans ce domaine, mais votre concurrent non plus. Vous pourrez rivaliser dans d'autres domaines. Si votre domaine est la vente de syst&egrave;mes d'exploitation, vous n'aimerez pas GNU, et c'est tant pis pour vous. Si votre domaine est diff&eacute;rent, GNU peut vous &eacute;viter d'&ecirc;tre pouss&eacute; dans le domaine on&eacute;reux de la vente de syst&egrave;mes d'exploitation.

source: I would like to see GNU development supported by gifts from many manufacturers and users, reducing the cost to each.<a href="#f5">(5)</a>
fr: J'aimerais bien voir le d&eacute;veloppement de GNU financ&eacute; par des dons de fabricants et utilisateurs, r&eacute;duisant ainsi les co&ucirc;ts pour chacun <a href="#f5"><sup>5</sup></a>.

source: <strong>&ldquo;Don't programmers deserve a reward for their creativity?&rdquo;</strong>
fr: <strong>&laquo;&nbsp;Les programmeurs ne m&eacute;ritent-ils pas d'&ecirc;tre r&eacute;compens&eacute;s pour leur cr&eacute;ativit&eacute;&nbsp;?&nbsp;&raquo;</strong>

source: If anything deserves a reward, it is social contribution. Creativity can be a social contribution, but only in so far as society is free to use the results. If programmers deserve to be rewarded for creating innovative programs, by the same token they deserve to be punished if they restrict the use of these programs.
fr: Si quelque chose m&eacute;rite une r&eacute;compense, c'est bien la contribution sociale. La cr&eacute;ativit&eacute; peut &ecirc;tre une contribution sociale, mais seulement tant que la soci&eacute;t&eacute; est libre de profiter des r&eacute;sultats. Si les programmeurs m&eacute;ritent d'&ecirc;tre r&eacute;compens&eacute;s pour la cr&eacute;ation de logiciels innovants, de m&ecirc;me, ils m&eacute;ritent d'&ecirc;tre punis s'ils limitent l'utilisation de leurs programmes.

source: <strong>&ldquo;Shouldn't a programmer be able to ask for a reward for his creativity?&rdquo;</strong>
fr: <strong>&laquo;&nbsp;Un programmeur ne devrait-il pas avoir le droit de demander une r&eacute;compense pour sa cr&eacute;ativit&eacute;&nbsp;?&nbsp;&raquo;</strong>

source: There is nothing wrong with wanting pay for work, or seeking to maximize one's income, as long as one does not use means that are destructive. But the means customary in the field of software today are based on destruction.
fr: Il n'y a rien de mal &agrave; vouloir &ecirc;tre pay&eacute; pour son travail, ou &agrave; chercher &agrave; augmenter ses revenus, tant que l'on n'utilise pas de m&eacute;thodes destructives. Mais les m&eacute;thodes pratiqu&eacute;es dans le domaine du logiciel sont fond&eacute;es sur la destruction.

source: Extracting money from users of a program by restricting their use of it is destructive because the restrictions reduce the amount and the ways that the program can be used. This reduces the amount of wealth that humanity derives from the program. When there is a deliberate choice to restrict, the harmful consequences are deliberate destruction.
fr: Extraire de l'argent aux utilisateurs d'un programme en limitant son utilisation est destructeur, car ces restrictions r&eacute;duisent l'utilit&eacute; du programme. Ce qui &agrave; son tour r&eacute;duit la richesse apport&eacute;e par ce programme &agrave; l'humanit&eacute;. Quand le choix de limiter est d&eacute;lib&eacute;r&eacute;, les cons&eacute;quences n&eacute;fastes qui en d&eacute;coulent sont de la destruction d&eacute;lib&eacute;r&eacute;e.

source: The reason a good citizen does not use such destructive means to become wealthier is that, if everyone did so, we would all become poorer from the mutual destructiveness. This is Kantian ethics; or, the Golden Rule. Since I do not like the consequences that result if everyone hoards information, I am required to consider it wrong for one to do so. Specifically, the desire to be rewarded for one's creativity does not justify depriving the world in general of all or part of that creativity.
fr: La raison pour laquelle un bon citoyen ne doit pas utiliser de telles m&eacute;thodes destructrices pour augmenter sa richesse personnelle est que si tout le monde faisait de m&ecirc;me, il y aurait un appauvrissement g&eacute;n&eacute;ral d&ucirc; &agrave; la destruction mutuelle. C'est ce que l'on appelle la morale kantienne, ou la R&egrave;gle d'or. Puisque je n'appr&eacute;cie pas les cons&eacute;quences qui adviennent si tout le monde fait de la r&eacute;tention d'informations, je ne dois pas trouver acceptable qu'un individu le fasse. Plus pr&eacute;cis&eacute;ment, le d&eacute;sir d'&ecirc;tre r&eacute;compens&eacute; pour sa cr&eacute;ation ne justifie pas que l'on prive le monde en g&eacute;n&eacute;ral de toute ou partie de cette cr&eacute;ativit&eacute;.

source: <strong>&ldquo;Won't programmers starve?&rdquo;</strong>
fr: <strong>&laquo;&nbsp;Les programmeurs ne vont-ils pas mourir de faim&nbsp;?&nbsp;&raquo;</strong>

source: I could answer that nobody is forced to be a programmer. Most of us cannot manage to get any money for standing on the street and making faces. But we are not, as a result, condemned to spend our lives standing on the street making faces, and starving. We do something else.
fr: Je peux r&eacute;pondre que personne n'est forc&eacute; d'&ecirc;tre un programmeur. La plupart d'entre nous n'arriverait pas &agrave; se faire payer pour faire des grimaces dans la rue. Mais nous ne sommes pas pour autant condamn&eacute;s &agrave; passer notre vie dans la rue &agrave; faire des grimaces et &agrave; mourir de faim. On fait autre chose.

source: But that is the wrong answer because it accepts the questioner's implicit assumption: that without ownership of software, programmers cannot possibly be paid a cent. Supposedly it is all or nothing.
fr: Mais c'est une mauvaise r&eacute;ponse, car elle accepte l'a priori de la question&nbsp;: c'est-&agrave;-dire que sans possession du logiciel, les programmeurs ne pourraient pas recevoir le moindre sou. C'est, soi-disant, tout ou rien.

source: The real reason programmers will not starve is that it will still be possible for them to get paid for programming; just not paid as much as now.
fr: La vraie raison pour laquelle les programmeurs ne vont pas mourir de faim est qu'il sera quand m&ecirc;me possible pour eux d'&ecirc;tre pay&eacute;s pour programmer; seulement, peut-&ecirc;tre pas autant qu'actuellement.

source: Restricting copying is not the only basis for business in software. It is the most common basis because it brings in the most money. If it were prohibited, or rejected by the customer, software business would move to other bases of organization which are now used less often. There are always numerous ways to organize any kind of business.
fr: La restriction des copies n'est pas la seule base des affaires du domaine des logiciels. C'est la base la plus commune, car c'est la plus rentable. Si ces restrictions &eacute;taient interdites ou rejet&eacute;es par le client, les &eacute;diteurs passeraient &agrave; d'autres formes d'organisation, qui sont actuellement moins utilis&eacute;es. Il y a de nombreuses fa&ccedil;ons d'organiser une entreprise.

source: Probably programming will not be as lucrative on the new basis as it is now. But that is not an argument against the change. It is not considered an injustice that sales clerks make the salaries that they now do. If programmers made the same, that would not be an injustice either. (In practice they would still make considerably more than that.)
fr: Il est probable qu'avec ce nouveau syst&egrave;me, la programmation serait moins rentable qu'elle ne l'est actuellement. Mais ce n'est pas un argument valable contre le changement. Il n'est pas consid&eacute;r&eacute; comme injuste que les caissi&egrave;res gagnent ce qu'elles gagnent. Si les programmeurs gagnaient la m&ecirc;me chose, ce ne serait pas non plus une injustice. (En pratique, ils gagneraient quand m&ecirc;me beaucoup plus).

source: <strong>&ldquo;Don't people have a right to control how their creativity is used?&rdquo;</strong>
fr: <strong>&laquo;&nbsp;Les gens n'ont-ils pas le droit de g&eacute;rer l'utilisation de leur cr&eacute;ativit&eacute;&nbsp;?&nbsp;&raquo;</strong>

source: &ldquo;Control over the use of one's ideas&rdquo; really constitutes control over other people's lives; and it is usually used to make their lives more difficult.
fr: &laquo;&nbsp;Contr&ocirc;ler l'utilisation que l'on fait de ses id&eacute;es&nbsp;&raquo; revient &agrave; contr&ocirc;ler la vie des autres; et c'est souvent utilis&eacute; pour leur rendre la vie plus difficile.

source: People who have studied the issue of intellectual property rights<a href="#f6">(6)</a> carefully (such as lawyers) say that there is no intrinsic right to intellectual property. The kinds of supposed intellectual property rights that the government recognizes were created by specific acts of legislation for specific purposes.
fr: Ceux qui ont &eacute;tudi&eacute; le probl&egrave;me de la propri&eacute;t&eacute; intellectuelle <a href="#f6"><sup>6</sup></a> &agrave; fond (les avocats, les juristes, etc.) soutiennent qu'il n'existe aucun droit intrins&egrave;que &agrave; la propri&eacute;t&eacute; intellectuelle. Les diff&eacute;rents droits de soi-disant propri&eacute;t&eacute; intellectuelle reconnus par le gouvernement ont &eacute;t&eacute; cr&eacute;&eacute;s par des l&eacute;gislations pr&eacute;cises dans des buts bien pr&eacute;cis.

source: For example, the patent system was established to encourage inventors to disclose the details of their inventions. Its purpose was to help society rather than to help inventors. At the time, the life span of 17 years for a patent was short compared with the rate of advance of the state of the art. Since patents are an issue only among manufacturers, for whom the cost and effort of a license agreement are small compared with setting up production, the patents often do not do much harm. They do not obstruct most individuals who use patented products.
fr: Par exemple, le syst&egrave;me de brevets a &eacute;t&eacute; &eacute;tabli pour encourager les inventeurs &agrave; divulguer les d&eacute;tails de leurs inventions. Sa raison d'&ecirc;tre &eacute;tait d'aider la soci&eacute;t&eacute; plut&ocirc;t que d'avantager les inventeurs. &Agrave; l'&eacute;poque, la dur&eacute;e de vie de 17 ans pour un brevet &eacute;tait court par rapport &agrave; la cadence des &eacute;volutions technologiques. Puisque les brevets ne concernent que les fabricants, pour lesquels le co&ucirc;t et l'effort d'&eacute;tablir une licence sont minimes compar&eacute;s &agrave; la mise en production, les brevets ne font souvent pas trop de tort. Ils ne g&ecirc;nent pas la plupart des individus qui utilisent des produits brevet&eacute;s.

source: The idea of copyright did not exist in ancient times, when authors frequently copied other authors at length in works of non-fiction. This practice was useful, and is the only way many authors' works have survived even in part. The copyright system was created expressly for the purpose of encouraging authorship. In the domain for which it was invented&mdash;books, which could be copied economically only on a printing press&mdash;it did little harm, and did not obstruct most of the individuals who read the books.
fr: Le concept de droit d'auteur n'existait pas dans l'Antiquit&eacute;, les auteurs copiaient souvent, et beaucoup, l'œuvre des autres. Cette pratique &eacute;tait utile, et c'est de cette seule fa&ccedil;on que les travaux de certains auteurs ont surv&eacute;cus ne serait-ce qu'en partie. Le syst&egrave;me du droit d'auteur a &eacute;t&eacute; cr&eacute;&eacute; express&eacute;ment pour encourager les auteurs. Dans le domaine pour lequel ce syst&egrave;me a &eacute;t&eacute; invent&eacute;, les livres, qui pouvaient seulement &ecirc;tre copi&eacute;s en imprimerie ne causait pas beaucoup de tort, et ne g&ecirc;nait pas la plupart des personnes qui lisaient ces livres.

source: All intellectual property rights are just licenses granted by society because it was thought, rightly or wrongly, that society as a whole would benefit by granting them. But in any particular situation, we have to ask: are we really better off granting such license? What kind of act are we licensing a person to do?
fr: Tous les droits de propri&eacute;t&eacute; intellectuelle ne sont que des licences accord&eacute;es par la soci&eacute;t&eacute; parce que nous pensions, &agrave; tort ou &agrave; raison, que la soci&eacute;t&eacute; en g&eacute;n&eacute;ral b&eacute;n&eacute;ficierait de ces accords. Mais dans chaque situation pr&eacute;cise, nous devons nous demander&nbsp;: b&eacute;n&eacute;ficierons-nous vraiment d'accorder cette licence&nbsp;? Quels actes autorisons-nous avec cette licence&nbsp;?

source: The case of programs today is very different from that of books a hundred years ago. The fact that the easiest way to copy a program is from one neighbor to another, the fact that a program has both source code and object code which are distinct, and the fact that a program is used rather than read and enjoyed, combine to create a situation in which a person who enforces a copyright is harming society as a whole both materially and spiritually; in which a person should not do so regardless of whether the law enables him to.
fr: Le cas des logiciels aujourd'hui est tr&egrave;s diff&eacute;rent de celui des livres il y a un si&egrave;cle. Le fait que la mani&egrave;re la plus r&eacute;pandue de copier un programme est entre voisins, le fait qu'un programme contient &agrave; la fois du code source et du code binaire bien distinct, et le fait qu'un programme est utilis&eacute; plut&ocirc;t que lu comme divertissement, se r&eacute;unissent pour cr&eacute;er une situation dans laquelle celui qui applique le droit d'auteur fait du tort &agrave; la soci&eacute;t&eacute;, mat&eacute;riellement et spirituellement; cette personne ne devrait pas appliquer le droit d'auteur, que la loi l'y autorise ou non.

source: <strong>&ldquo;Competition makes things get done better.&rdquo;</strong>
fr: <strong>&laquo;&nbsp;La comp&eacute;tition permet de mieux faire les choses.&nbsp;&raquo;</strong>

source: The paradigm of competition is a race: by rewarding the winner, we encourage everyone to run faster. When capitalism really works this way, it does a good job; but its defenders are wrong in assuming it always works this way. If the runners forget why the reward is offered and become intent on winning, no matter how, they may find other strategies&mdash;such as, attacking other runners. If the runners get into a fist fight, they will all finish late.
fr: Le paradigme de la comp&eacute;tition est une course&nbsp;: en r&eacute;compensant le vainqueur, nous encourageons tout le monde &agrave; courir plus vite. Quand le capitalisme fonctionne r&eacute;ellement de cette fa&ccedil;on, tout marche bien; mais ses partisans ont tort s'ils pensent que cela fonctionne toujours de cette fa&ccedil;on. Si les coureurs oublient le pourquoi de la r&eacute;compense, et deviennent obs&eacute;d&eacute;s par la victoire, quelles que soient les m&eacute;thodes employ&eacute;es, ils risquent de trouver d'autres strat&eacute;gies telles qu'agresser les autres concurrents. Si tous les coureurs s'engageaient dans un combat, ils finiraient tous en retard.

source: Proprietary and secret software is the moral equivalent of runners in a fist fight. Sad to say, the only referee we've got does not seem to object to fights; he just regulates them (&ldquo;For every ten yards you run, you can fire one shot&rdquo;). He really ought to break them up, and penalize runners for even trying to fight.
fr: Les logiciels propri&eacute;taires et secrets sont l'&eacute;quivalent moral des coureurs qui se battent. Malheureusement, le seul arbitre que l'on ait ne semble pas s'opposer aux combats ; il se contente de les r&eacute;guler (&laquo;&nbsp;Pour dix m&egrave;tres parcourus, vous avez le droit de tirer un coup de feu&nbsp;&raquo;). Il devrait en fait s&eacute;parer les combattants, et punir les coureurs qui tentent de se battre.
