Repository: gitGNU/gnu_www-fr
Catalog: gnu/manifesto.*.po
Languages: fr

source: The GNU Manifesto - GNU Project - Free Software Foundation (FSF)
fr: Le Manifeste GNU - GNU Project - Free Software Foundation (FSF)

source: The GNU Manifesto
fr: Le Manifeste GNU

source: The GNU Manifesto (which appears below) was written by <a href="http://www.stallman.org/">Richard Stallman</a> at the beginning of the GNU Project, to ask for participation and support. For the first few years, it was updated in minor ways to account for developments, but now it seems best to leave it unchanged as most people have seen it.
fr: Le manifeste GNU, reproduit ci-dessous, a &eacute;t&eacute; &eacute;crit par <a href="http://www.stallman.org/">Richard Stallman</a> au commencement du projet GNU pour encourager la participation et le soutien de tous. Au cours des premi&egrave;res ann&eacute;es, il y a eu quelques petites mises &agrave; jour pour tenir compte des d&eacute;veloppements, mais il nous semble maintenant plus judicieux de le laisser en l'&eacute;tat.

source: Since that time, we have learned about certain common misunderstandings that different wording could help avoid. Footnotes added in 1993 help clarify these points.
fr: Nous avons appris depuis qu'il y avait quelques incompr&eacute;hensions; celles-ci peuvent &ecirc;tre corrig&eacute;es en changeant quelques mots. Des notes de bas de page ajout&eacute;es en 1993 aident &agrave; clarifier ces points.

source: For up-to-date information about the available GNU software, please see the information available on our <a href="/home.html">web server</a>, in particular our <a href="/software/software.html">list of software</a>. For how to contribute, see <a href="/help/">http://www.gnu.org/help</a>.
fr: Pour les derni&egrave;res informations sur les logiciels GNU actuellement disponibles, veuillez vous r&eacute;f&eacute;rer &agrave; notre <a href="/home.fr.html">site web</a>, en particulier notre <a href="/software/software.fr.html">liste de logiciels</a>. Pour savoir comment contribuer, consultez <a href="/help/">http://www.gnu.org/help/help.fr.html</a>.

source: What's GNU? Gnu's Not Unix!
fr: Qu'est ce que GNU&nbsp;? Gnu N'est pas Unix&nbsp;!

source: GNU, which stands for Gnu's Not Unix, is the name for the complete Unix-compatible software system which I am writing so that I can give it away free to everyone who can use it. <a href="#f1">(1)</a> Several other volunteers are helping me. Contributions of time, money, programs and equipment are greatly needed.
fr: GNU, l'acronyme de GNU's Not Unix (GNU n'est pas Unix), est le nom du syst&egrave;me complet de logiciels compatible Unix que j'&eacute;cris pour pouvoir le donner librement &agrave; tous ceux qui en auraient besoin. <a href="#f1"><sup>1</sup></a> De nombreux b&eacute;n&eacute;voles m'aident. Les contributions en temps, en argent, en logiciels et en mat&eacute;riel sont les bienvenues.

source: So far we have an Emacs text editor with Lisp for writing editor commands, a source level debugger, a yacc-compatible parser generator, a linker, and around 35 utilities. A shell (command interpreter) is nearly completed. A new portable optimizing C compiler has compiled itself and may be released this year. An initial kernel exists but many more features are needed to emulate Unix. When the kernel and compiler are finished, it will be possible to distribute a GNU system suitable for program development. We will use TeX as our text formatter, but an nroff is being worked on. We will use the free, portable X window system as well. After this we will add a portable Common Lisp, an Empire game, a spreadsheet, and hundreds of other things, plus on-line documentation. We hope to supply, eventually, everything useful that normally comes with a Unix system, and more.
fr: Pour l'instant, nous avons un &eacute;diteur de texte, Emacs, utilisant le Lisp pour &eacute;crire des commandes d'&eacute;dition, un d&eacute;bogueur, un g&eacute;n&eacute;rateur d'analyseurs syntaxiques compatible avec YACC, un &eacute;diteur de liens, et environ trente-cinq autres utilitaires. Un shell (un interpr&egrave;tede commandes) est presque termin&eacute;. Un nouveau compilateur C portable et optimis&eacute; s'est compil&eacute; lui-m&ecirc;me et devrait &ecirc;tre disponible cette ann&eacute;e. Un premier noyau existe, mais n&eacute;cessite plus de fonctions pour &eacute;muler Unix. Quand le noyau et le compilateur seront termin&eacute;s, il serapossible de distribuer un syst&egrave;me GNU propice au d&eacute;veloppement. Nous utiliserons TeX comme formateur de textes, mais un nroff est en cours de d&eacute;veloppement. Nous utiliserons aussi le syst&egrave;me libre et portable X Window System. Par la suite, nous ajouterons un Common Lisp portable, le jeu Empire, un tableur et des centaines d'autres choses, plus une documentation en ligne. Nous esp&eacute;rons fournir, finalement, tout ce qui peut &ecirc;tre utile et qui est normalement inclus dans un syst&egrave;me Unix et plus encore.

source: GNU will be able to run Unix programs, but will not be identical to Unix. We will make all improvements that are convenient, based on our experience with other operating systems. In particular, we plan to have longer file names, file version numbers, a crashproof file system, file name completion perhaps, terminal-independent display support, and perhaps eventually a Lisp-based window system through which several Lisp programs and ordinary Unix programs can share a screen. Both C and Lisp will be available as system programming languages. We will try to support UUCP, MIT Chaosnet, and Internet protocols for communication.
fr: GNU pourra ex&eacute;cuter des programmes Unix mais ne sera pas identique &agrave; Unix. Nous ferons toutes les am&eacute;liorations que nous jugerons appropri&eacute;es, en nous fondant sur nos exp&eacute;riences avec d'autres syst&egrave;mes d'exploitation. En particulier, nous pr&eacute;voyons d'avoir des fichiers avec des noms longs, des num&eacute;ros de version de fichier, un syst&egrave;me de fichiers &agrave; tol&eacute;rance de panne, &eacute;ventuellement un syst&egrave;me de compl&eacute;tion des noms de fichiers, un dispositif d'affichage ind&eacute;pendant du terminal, et peut-&ecirc;tre, finalement, un syst&egrave;me de fen&ecirc;trage fond&eacute; sur Lisp, au travers duquel plusieurs programmes Lisp et autres programmes Unix pourront partager un &eacute;cran. Le C et le Lisp seront tous les deux disponibles comme langages de programmation syst&egrave;me. Nous essayerons de supporter UUCP, MIT Chaosnet, et les protocoles de l'Internet pour la communication.

source: GNU is aimed initially at machines in the 68000/16000 class with virtual memory, because they are the easiest machines to make it run on. The extra effort to make it run on smaller machines will be left to someone who wants to use it on them.
fr: Initialement, GNU vise les machines de classe 68000/16000 avec de la m&eacute;moire virtuelle, car ce sont les machines les plus simples pour le faire fonctionner. Nous laissons l'effort suppl&eacute;mentaire pour l'adapter sur de plus faibles machines &agrave; ceux qui voudront l'utiliser sur celles-ci.

source: To avoid horrible confusion, please pronounce the &lsquo;G&rsquo; in the word &lsquo;GNU&rsquo; when it is the name of this project.
fr: Pour &eacute;viter d'horribles confusions, veuillez bien prononcer le «&nbsp;G&nbsp;» de «&nbsp;GNU&nbsp;» quand vous parlez de ce projet.

source: Why I Must Write GNU
fr: Pourquoi dois-je &eacute;crire GNU

source: I consider that the golden rule requires that if I like a program I must share it with other people who like it. Software sellers want to divide the users and conquer them, making each user agree not to share with others. I refuse to break solidarity with other users in this way. I cannot in good conscience sign a nondisclosure agreement or a software license agreement. For years I worked within the Artificial Intelligence Lab to resist such tendencies and other inhospitalities, but eventually they had gone too far: I could not remain in an institution where such things are done for me against my will.
fr: J'estime que la R&egrave;gle d'or est que, si j'aime un programme, je dois le partager avec d'autres qui aiment ce programme. Les &eacute;diteurs de logiciels cherchent &agrave; diviser et &agrave; conqu&eacute;rir les utilisateurs, en interdisant &agrave; chacun de partager avec les autres. Je refuse de rompre la solidarit&eacute; avec les autres utilisateurs de cette mani&egrave;re. Je ne peux pas, en mon &acirc;me et conscience, signer un accord de non-divulgation ou une licence de logiciels. Pendant des ann&eacute;es, j'ai œuvr&eacute; au sein du Laboratoire d'Intelligence Artificielle du MIT pour r&eacute;sister &agrave; ces tendances, mais finalement, ils sont all&eacute;s trop loin : je ne pouvais pas rester dans une institution o&ugrave; de telles choses avaient lieu contre ma volont&eacute;.

source: So that I can continue to use computers without dishonor, I have decided to put together a sufficient body of free software so that I will be able to get along without any software that is not free. I have resigned from the AI lab to deny MIT any legal excuse to prevent me from giving GNU away.
fr: Pour pouvoir continuer &agrave; utiliser les ordinateurs en accord avec ma conscience, j'ai d&eacute;cid&eacute; de rassembler un ensemble suffisant de logiciels libres, pour pouvoir me d&eacute;brouiller sans logiciels non libres. J'ai d&eacute;missionn&eacute; du laboratoire d'Intelligence Artificielle pour que le MIT ne puisse invoquer toutes les excuses l&eacute;gales pour m'emp&ecirc;cher de distribuer GNU librement.

source: Why GNU Will Be Compatible with Unix
fr: Pourquoi GNU sera compatible avec Unix

source: Unix is not my ideal system, but it is not too bad. The essential features of Unix seem to be good ones, and I think I can fill in what Unix lacks without spoiling them. And a system compatible with Unix would be convenient for many other people to adopt.
fr: Unix n'est pas pour moi le syst&egrave;me parfait, mais il n'est pas trop mauvais. Les fonctions essentielles d'Unix semble &ecirc;tre les bonnes, et je pense pouvoir compl&eacute;ter ce qui manque &agrave; Unix sans les g&acirc;cher. Et un syst&egrave;me compatible Unix serait commode &agrave; adopter par de nombreuses personnes.

source: How GNU Will Be Available
fr: Disponibilit&eacute; de GNU

source: GNU is not in the public domain. Everyone will be permitted to modify and redistribute GNU, but no distributor will be allowed to restrict its further redistribution. That is to say, <a href="/philosophy/categories.html#ProprietarySoftware">proprietary</a> modifications will not be allowed. I want to make sure that all versions of GNU remain free.
fr: GNU n'est pas dans le domaine public. Tout le monde aura le droit de modifier et redistribuer GNU, mais aucun distributeur ne pourra restreindre ces futures redistributions. C'est-&agrave;-dire que des modifications <a href="/philosophy/categories.fr.html#ProprietarySoftware">propri&eacute;taires</a> seront interdites. Je veux &ecirc;tre s&ucirc;r que toutes les versions de GNU restent libres.

source: Why Many Other Programmers Want to Help
fr: Pourquoi beaucoup de programmeurs veulent contribuer

source: I have found many other programmers who are excited about GNU and want to help.
fr: J'ai rencontr&eacute; beaucoup de programmeurs enthousiasm&eacute;s par GNU et qui souhaitaient contribuer.

source: Many programmers are unhappy about the commercialization of system software. It may enable them to make more money, but it requires them to feel in conflict with other programmers in general rather than feel as comrades. The fundamental act of friendship among programmers is the sharing of programs; marketing arrangements now typically used essentially forbid programmers to treat others as friends. The purchaser of software must choose between friendship and obeying the law. Naturally, many decide that friendship is more important. But those who believe in law often do not feel at ease with either choice. They become cynical and think that programming is just a way of making money.
fr: De nombreux programmeurs sont insatisfaits de la commercialisation de logiciels syst&egrave;mes. Il se peut que cela leur permette de gagner plus d'argent, mais cela les am&egrave;ne forcement &agrave; se sentir en conflit avec les autres programmeurs en g&eacute;n&eacute;ral, plut&ocirc;t que d'&ecirc;tre camarades. L'acte fondamental d'une amiti&eacute; entre des programmeurs est le partage des programmes&nbsp;; les arrangements commerciaux typiquement utilis&eacute;s de nos jours interdisent aux programmeurs de consid&eacute;rer les autres comme des amis. L'acheteur de programmes doit choisir entre l'amiti&eacute; et l'ob&eacute;issance &agrave; la loi. Naturellement, un grand nombre d&eacute;cident que l'amiti&eacute; est plus importante. Mais ceux qui respectent la loi se sentent souvent mal &agrave; l'aise face &agrave; ce seul choix. Ils sont d&eacute;sabus&eacute;s et pensent que programmer n'est qu'une fa&ccedil;on de gagner de l'argent.

source: By working on and using GNU rather than proprietary programs, we can be hospitable to everyone and obey the law. In addition, GNU serves as an example to inspire and a banner to rally others to join us in sharing. This can give us a feeling of harmony which is impossible if we use software that is not free. For about half the programmers I talk to, this is an important happiness that money cannot replace.
fr: En utilisant GNU plut&ocirc;t que des programmes propri&eacute;taires, nous pouvons &ecirc;tre amicaux envers tout le monde tout en respectant la loi. De plus, GNU est une source d'inspiration et une banni&egrave;re sous laquelle d'autres peuvent nous rejoindre dans le partage. Ceci peut nous procurer un sentiment d'harmonie, impossible &agrave; atteindre avec des logiciels qui ne sont pas libres. Pour environ la moiti&eacute; des programmeurs avec lesquels j'ai discut&eacute;, c'est une satisfaction importante que l'argent ne peut pas remplacer.

source: How You Can Contribute
fr: Comment vous pouvez contribuer

source: (Nowadays, for software tasks to work on, see <a href="http://savannah.gnu.org/projects/tasklist">the GNU task list</a>. For other ways to contribute, see <a href="/help/">http://www.gnu.org/help</a>.)
fr: (Actuellement, pour la liste des t&acirc;ches logicielles sur lesquelles travailler, consultez <a href="http://savannah.gnu.org/projects/tasklist">la liste des t&acirc;ches GNU</a>.Pour d'autres mani&egrave;res de contribuer, consultez <a href="http://www.gnu.org/help/help.fr.html">http://www.gnu.org/help/help.fr.html</a>.)

source: I am asking computer manufacturers for donations of machines and money. I'm asking individuals for donations of programs and work.
fr: Je demande aux fabricants d'ordinateurs de faire don de machines et d'argent. Je demande aux individus de faire don de programmes et de travail.

source: One consequence you can expect if you donate machines is that GNU will run on them at an early date. The machines should be complete, ready to use systems, approved for use in a residential area, and not in need of sophisticated cooling or power.
fr: Une des cons&eacute;quences &agrave; laquelle vous pouvez vous attendre si vous donnez des machines, c'est que GNU tournera dessus tr&egrave;s rapidement. Les machines doivent &ecirc;tre compl&egrave;tes, pr&ecirc;tes &agrave; l'utilisation, sans besoin de syst&egrave;me particulier de climatisation ou d'alimentation.

source: I have found very many programmers eager to contribute part-time work for GNU. For most projects, such part-time distributed work would be very hard to coordinate; the independently-written parts would not work together. But for the particular task of replacing Unix, this problem is absent. A complete Unix system contains hundreds of utility programs, each of which is documented separately. Most interface specifications are fixed by Unix compatibility. If each contributor can write a compatible replacement for a single Unix utility, and make it work properly in place of the original on a Unix system, then these utilities will work right when put together. Even allowing for Murphy to create a few unexpected problems, assembling these components will be a feasible task. (The kernel will require closer communication and will be worked on by a small, tight group.)
fr: J'ai trouv&eacute; de nombreux programmeurs impatients de contribuer &agrave; mi-temps pour GNU. Pour la plupart des projets, un tel travail distribu&eacute; &agrave; temps partiel serait tr&egrave;s difficile &agrave; coordonner; les diverses parties cod&eacute;es ind&eacute;pendamment ne fonctionneraient pas ensemble. Mais ce probl&egrave;me n'existe pas dans le cas du projet de remplacement d'Unix. Un syst&egrave;me Unix complet contient des centaines d'utilitaires, chacun &eacute;tant document&eacute; s&eacute;par&eacute;ment. La plupart des sp&eacute;cifications des interfaces sont d&eacute;termin&eacute;es par la compatibilit&eacute; avec Unix. Si chaque collaborateur peut &eacute;crire un remplacement compatible pour un seul utilitaire Unix et l'int&eacute;grer proprement &agrave; la place de l'original sur un syst&egrave;me Unix, il s'ensuit que ces utilitaires fonctionneront ensemble sans probl&egrave;me. M&ecirc;me en faisant quelques concessions &agrave; la loi de Murphy qui cr&eacute;era quelques probl&egrave;mes inattendus, l'assemblage de ces composants sera une t&acirc;che r&eacute;alisable. (Le noyau demandera quand m&ecirc;me une communication plus soutenue et sera r&eacute;alis&eacute; par un petit groupe).

source: If I get donations of money, I may be able to hire a few people full or part time. The salary won't be high by programmers' standards, but I'm looking for people for whom building community spirit is as important as making money. I view this as a way of enabling dedicated people to devote their full energies to working on GNU by sparing them the need to make a living in another way.
fr: Si je re&ccedil;ois des dons financiers, je pourrais embaucher quelques personnes &agrave; temps plein ou &agrave; mi-temps. Le salaire ne sera peut-&ecirc;tre pas tr&egrave;s &eacute;lev&eacute; par rapport au march&eacute;, mais je cherche des personnes pour lesquelles l'esprit de communaut&eacute; est aussi important que l'app&acirc;t du gain. Je consid&egrave;re que c'est une fa&ccedil;on de permettre &agrave; quelques personnes d&eacute;vou&eacute;es de consacrer toutes leurs ressources au projet GNU, en leur &eacute;vitant d'avoir &agrave; gagner leur vie autrement.

source: Why All Computer Users Will Benefit
fr: Pourquoi tous les utilisateurs en b&eacute;n&eacute;ficieront

source: Once GNU is written, everyone will be able to obtain good system software free, just like air.<a href="#f2">(2)</a>
fr: Une fois GNU achev&eacute;, tout le monde pourra obtenir de bons logiciels libres comme l'air <a href="#f2"><sup>2</sup></a>.

source: This means much more than just saving everyone the price of a Unix license. It means that much wasteful duplication of system programming effort will be avoided. This effort can go instead into advancing the state of the art.
fr: Ceci repr&eacute;sente beaucoup plus que l'&eacute;conomie d'une licence Unix. Cela veut dire que l'on va &eacute;viter la duplication inutile du travail de programmation. Cet effort pourra plut&ocirc;t se diriger vers l'avancement du domaine informatique.

source: Complete system sources will be available to everyone. As a result, a user who needs changes in the system will always be free to make them himself, or hire any available programmer or company to make them for him. Users will no longer be at the mercy of one programmer or company which owns the sources and is in sole position to make changes.
fr: Les sources du syst&egrave;me complet seront disponibles pour tous. Et cela aura pour r&eacute;sultat qu'un utilisateur qui a besoin de changer un composant du syst&egrave;me aura toujours la libert&eacute; d'effectuer des changements lui-m&ecirc;me, ou d'engager une personne ou une soci&eacute;t&eacute; capable d'effectuer ces changements pour lui. Les utilisateurs ne seront plus &agrave; la merci d'une seule personne ou d'une seule soci&eacute;t&eacute; qui poss&egrave;de les sources du programme et qui est la seule &agrave; pouvoir effectuer des changements.

source: Schools will be able to provide a much more educational environment by encouraging all students to study and improve the system code. Harvard's computer lab used to have the policy that no program could be installed on the system if its sources were not on public display, and upheld it by actually refusing to install certain programs. I was very much inspired by this.
fr: Les &eacute;coles pourront fournir un milieu beaucoup plus &eacute;ducatif en encourageant chaque &eacute;tudiant &agrave; &eacute;tudier et &agrave; am&eacute;liorer le code du syst&egrave;me. Le laboratoire informatique d'Harvard avait comme politique de n'installer aucun programme sur le syst&egrave;me si ses sources n'&eacute;taient pas disponibles, et ils soutenaient cette politique en refusant carr&eacute;ment d'installer certains programmes. Cela m'a beaucoup inspir&eacute;.

source: Finally, the overhead of considering who owns the system software and what one is or is not entitled to do with it will be lifted.
fr: Enfin, les frais engendr&eacute;s par les questions d'appartenance et de droits des logiciels ne seront plus d'actualit&eacute;.

source: Arrangements to make people pay for using a program, including licensing of copies, always incur a tremendous cost to society through the cumbersome mechanisms necessary to figure out how much (that is, which programs) a person must pay for. And only a police state can force everyone to obey them. Consider a space station where air must be manufactured at great cost: charging each breather per liter of air may be fair, but wearing the metered gas mask all day and all night is intolerable even if everyone can afford to pay the air bill. And the TV cameras everywhere to see if you ever take the mask off are outrageous. It's better to support the air plant with a head tax and chuck the masks.
fr: Les mesures pour faire payer les licences des programmes et de leurs copies g&eacute;n&egrave;rent toujours un co&ucirc;t important pour la soci&eacute;t&eacute; en g&eacute;n&eacute;ral, &agrave; cause des m&eacute;canismes n&eacute;cessaires pour calculer combien (c'est-&agrave;-dire quels programmes) chacun doit payer. Et il faudrait un &Eacute;tat policier pour appliquer parfaitement ces mesures. Prenons une station orbitale, o&ugrave; l'air doit &ecirc;tre fabriqu&eacute; &agrave; un co&ucirc;t important: facturer chaque litre inspir&eacute; peut &ecirc;tre justifi&eacute;, mais porter un masque/compteur toute la journ&eacute;e et toute la nuit est intol&eacute;rable m&ecirc;me si on a de quoi payer la facture. Et les cam&eacute;ras de surveillance plac&eacute;es partout pour v&eacute;rifier que vous ne retirez jamais le masque/compteur seraient inacceptables. Il vaut mieux financer la fabrication de l'air avec une taxe par personne et se d&eacute;barrasser des masques.

source: Copying all or parts of a program is as natural to a programmer as breathing, and as productive. It ought to be as free.
fr: De copier tout ou des parties d'un logiciel semble aussi naturel &agrave; un programmeur que de respirer, tout aussi productif. Cela aussi devrait &ecirc;tre libre.

source: Some Easily Rebutted Objections to GNU's Goals
fr: Quelques objections facilement contr&eacute;es aux objectifs de GNU
