Repository: gitGNU/gnu_www-fr
Catalog: gnu/rms-lisp.*.po
Languages: fr

source: For instance, at the time the only looping construct was &lsquo;while&rsquo;, which was extremely simple. There was no way to break out of the &lsquo;while&rsquo; statement, you just had to do a catch and a throw, or test a variable that ran the loop. That shows how far I was pushing to keep things small. We didn't have &lsquo;caar&rsquo; and &lsquo;cadr&rsquo; and so on; &ldquo;squeeze out everything possible&rdquo; was the spirit of GNU Emacs, the spirit of Emacs Lisp, from the beginning.
fr: Par exemple, &agrave; ce moment-l&agrave;, la seule construction de boucle &eacute;tait &laquo;&nbsp;while&nbsp;&raquo;, qui &eacute;tait extr&ecirc;mement simple. Il n'y avait pas de moyen de sortir de cette boucle &laquo;&nbsp;while&nbsp;&raquo;, vous ne pouviez faire qu'un &laquo;&nbsp;catch&nbsp;&raquo; et un &laquo;&nbsp;throw&nbsp;&raquo;, ou tester une variable dans la boucle. Cela montre &agrave; quel point je poussais les choses pour les garder le plus petites possibles. Nous n'avions pas de <tt>caar</tt>, de <tt>cadr</tt> et caetera&nbsp;: simplifier au maximum &eacute;tait l'esprit de GNU Emacs, l'esprit de Emacs Lisp, depuis le d&eacute;but.

source: Obviously, machines are bigger now, and we don't do it that way anymore. We put in &lsquo;caar&rsquo; and &lsquo;cadr&rsquo; and so on, and we might put in another looping construct one of these days. We're willing to extend it some now, but we don't want to extend it to the level of common Lisp. I implemented Common Lisp once on the Lisp machine, and I'm not all that happy with it. One thing I don't like terribly much is keyword arguments. They don't seem quite Lispy to me; I'll do it sometimes but I minimize the times when I do that.
fr: &Eacute;videmment les machines sont plus grosses maintenant, et nous ne le faisons plus de cette fa&ccedil;on. Nous utilisons <tt>caar</tt> et <tt>cadr</tt> et caetera, et nous pourrions int&eacute;grer une autre construction de boucle un de ces jours. Nous sommes favorables &agrave; l'&eacute;tendre un peu maintenant, mais nous ne voulons pas l'&eacute;tendre au niveau du Common Lisp. Une chose que je n'aime pas &eacute;norm&eacute;ment sont les arguments mot-clefs. Il ne me semblent pas tr&egrave;s Lisp&nbsp;: je le fais de temps &agrave; autre mais je minimise les fois o&ugrave; je le fais.

source: That was not the end of the GNU projects involved with Lisp. Later on around 1995, we were looking into starting a graphical desktop project. It was clear that for the programs on the desktop, we wanted a programming language to write a lot of it in to make it easily extensible, like the editor. The question was what it should be.
fr: Ce n'&eacute;tait pas la fin de l'implication du projet GNU avec Lisp. Plus tard vers 1995, nous pensions &agrave; lancer un projet de bureau graphique. Il &eacute;tait clair que pour les programmes du bureau, nous voulions un langage de programmation afin d'en &eacute;crire une grande partie et de le rendre facilement extensible, comme l'&eacute;diteur. La question &eacute;tait lequel choisir.

source: At the time, <acronym title="Tool Command Language">TCL</acronym> was being pushed heavily for this purpose. I had a very low opinion of <acronym>TCL</acronym>, basically because it wasn't Lisp. It looks a tiny bit like Lisp, but semantically it isn't, and it's not as clean. Then someone showed me an ad where Sun was trying to hire somebody to work on <acronym>TCL</acronym> to make it the &ldquo;de-facto standard extension language&rdquo; of the world. And I thought, &ldquo;We've got to stop that from happening.&rdquo; So we started to make Scheme the standard extensibility language for GNU. Not Common Lisp, because it was too large. The idea was that we would have a Scheme interpreter designed to be linked into applications in the same way <acronym>TCL</acronym> was linked into applications. We would then recommend that as the preferred extensibility package for all GNU programs.
fr: &Agrave; ce moment, TCL &eacute;tait largement mis en avant pour ce genre d'applications. J'avais une tr&egrave;s mauvaise opinion de TCL, avant tout parce que ce n'&eacute;tait pas du Lisp. Cela ressemblait un peu &agrave; Lisp, mais pas au niveau s&eacute;mantique, et ce n'est pas aussi propre. Puis quelqu'un m'a montr&eacute; une publicit&eacute; dans laquelle Sun essayait de recruter quelqu'un pour travailler sur TCL afin de le rendre &laquo;&nbsp;de facto langage d'extension standard&nbsp;&raquo; mondial. Et j'ai pens&eacute;&nbsp;: &laquo;&nbsp;Nous devons emp&ecirc;cher cela&nbsp;&raquo;. Donc nous avons commenc&eacute; &agrave; rendre Scheme le langage d'extension standard pour GNU. Pas Common Lisp parce qu'il &eacute;tait trop gros. L'id&eacute;e &eacute;tait d'avoir un interpr&eacute;teur Scheme con&ccedil;u pour &ecirc;tre li&eacute; &agrave; des applications de la m&ecirc;me mani&egrave;re que TCL &eacute;tait li&eacute; &agrave; d'autres applications. Nous allions donc recommander qu'il soit le paquet pour extension pr&eacute;f&eacute;r&eacute; pour tous les programmes GNU.

source: There's an interesting benefit you can get from using such a powerful language as a version of Lisp as your primary extensibility language. You can implement other languages by translating them into your primary language. If your primary language is <acronym>TCL</acronym>, you can't very easily implement Lisp by translating it into <acronym>TCL</acronym>. But if your primary language is Lisp, it's not that hard to implement other things by translating them. Our idea was that if each extensible application supported Scheme, you could write an implementation of <acronym>TCL</acronym> or Python or Perl in Scheme that translates that program into Scheme. Then you could load that into any application and customize it in your favorite language and it would work with other customizations as well.
fr: Il y a un b&eacute;n&eacute;fice int&eacute;ressant &agrave; utiliser un langage si puissant en tant que version de Lisp pour votre langage d'extension primaire. Vous pouvezimpl&eacute;menter d'autres langages en les traduisant dans votre langage primaire. Si votre langage primaire &eacute;tait TCL, vous ne pourriez impl&eacute;menter facilement Lisp en le traduisant en TCL. Mais si votre langage primaire est Lisp, il n'est pas difficile d'impl&eacute;menter d'autres choses en les traduisant. Notre id&eacute;e &eacute;tait que si chaque application extensible acceptait Scheme, vous pourriez &eacute;crire une impl&eacute;mentation de TCL ou de Python ou de Perl en Scheme qui traduirait ce programme en Scheme. Puis vous pourriez charger cela dans n'importe quelle application et la configurer dans votre langage favori, et cela marcherait &eacute;galement avec d'autres configurations.

source: As long as the extensibility languages are weak, the users have to use only the language you provided them. Which means that people who love any given language have to compete for the choice of the developers of applications &mdash; saying &ldquo;Please, application developer, put my language into your application, not his language.&rdquo; Then the users get no choices at all &mdash; whichever application they're using comes with one language and they're stuck with [that language]. But when you have a powerful language that can implement others by translating into it, then you give the user a choice of language and we don't have to have a language war anymore. That's what we're hoping &lsquo;Guile&rsquo;, our scheme interpreter, will do. We had a person working last summer finishing up a translator from Python to Scheme. I don't know if it's entirely finished yet, but for anyone interested in this project, please get in touch. So that's the plan we have for the future.
fr: Tant que l'extensibilit&eacute; des langages est faible, les utilisateurs doivent uniquement utiliser le langage que vous leur fournissez. Ce qui signifie que les gens qui adorent n'importe quel langage ont besoin de concourir pour le choix des d&eacute;veloppeurs d'application&nbsp;: &laquo;&nbsp;S'il vous pla&icirc;t Monsieur le d&eacute;veloppeurd'applications, incluez mon langage dans votre application, pas le sien&nbsp;&raquo;. Puis les autres utilisateurs n'ont plus le choix&nbsp;: quelle que soit l'application qu'ils utilisent, elle arrive avec un langage et ils sont limit&eacute;s &agrave; ce langage. Mais quand vous avez un langage puissant qui peux impl&eacute;menter les autres en lestraduisant, alors vous donnez aux utilisateurs le choix du langage et vous n'avez plus de guerre des langages du tout. Nous esp&eacute;rons que c'est ce que fera &laquo;&nbsp;Guile&nbsp;&raquo;, notre interpr&eacute;teur Scheme. Nous avions une personne travaillant l'&eacute;t&eacute; dernier &agrave; finir un traducteur de Python vers Scheme. Je ne sais pas s'il est enti&egrave;rement fini maintenant, mais si quelqu'un est int&eacute;ress&eacute; par ce projet, contactez-moi. Donc c'est notre plan pour le futur.

source: I haven't been speaking about free software, but let me briefly tell you a little bit about what that means. Free software does not refer to price; it doesn't mean that you get it for free. (You may have paid for a copy, or gotten a copy gratis.) It means that you have freedom as a user. The crucial thing is that you are free to run the program, free to study what it does, free to change it to suit your needs, free to redistribute the copies of others and free to publish improved, extended versions. This is what free software means. If you are using a non-free program, you have lost crucial freedom, so don't ever do that.
fr: Je n'ai pas parl&eacute; de logiciel libre, mais laissez-moi vous dire rapidement un petit peu ce que cela veut dire. Le logiciel libre ne se r&eacute;f&egrave;re pas &agrave; un prix, cela ne veut pas dire que vous l'obtiendrez gratuitement. (Vous pouvez avoir &agrave; payer pour une copie, ou bien vous pouvez l'obtenir gratuitement.) Cela signifie que vous &ecirc;tes libre en tant qu'utilisateur. La chose capitale est que vous &ecirc;tes libre d'utilisez le programme, libre d'&eacute;tudier ce qu'il fait, libre de le modifier pour s'adapter &agrave; vos besoins, libre de redistribuer des copies aux autres et libre de publier des versions am&eacute;lior&eacute;es ou &eacute;tendues. C'est ce que signifie logiciel libre. Si vous utilisez des logiciels non-libres, vous perdez cette libert&eacute; capitale, donc ne le faites jamais.

source: The purpose of the GNU project is to make it easier for people to reject freedom-trampling, user-dominating, non-free software by providing free software to replace it. For those who don't have the moral courage to reject the non-free software, when that means some practical inconvenience, what we try to do is give a free alternative so that you can move to freedom with less of a mess and less of a sacrifice in practical terms. The less sacrifice the better. We want to make it easier for you to live in freedom, to cooperate.
fr: Le but du projet GNU est de rendre facile pour les gens de rejeter les logiciels dominateurs d'utilisateurs, pi&eacute;tineurs de libert&eacute;, non-libres, en mettant &agrave; disposition des logiciels libres pour les remplacer. Pour ceux qui n'ont pas le courage moral de rejeter les logiciels non-libres, quand cela signifie quelque inconv&eacute;nient pratique, nous essayons de donner une alternative libre pour que vous puissiez vous lib&eacute;rer avec moins de complications et un sacrifice moindre en termes pratiques. Plus le sacrifice est petit, mieux c'est. Nous voulons vous faciliter la vie libre, la coop&eacute;ration.

source: This is a matter of the freedom to cooperate. We're used to thinking of freedom and cooperation with society as if they are opposites. But here they're on the same side. With free software you are free to cooperate with other people as well as free to help yourself. With non-free software, somebody is dominating you and keeping people divided. You're not allowed to share with them, you're not free to cooperate or help society, anymore than you're free to help yourself. Divided and helpless is the state of users using non-free software.
fr: C'est un probl&egrave;me de faire coop&eacute;rer pour la libert&eacute;. Nous avons l'habitude pour la soci&eacute;t&eacute; de penser &agrave; la libert&eacute; et &agrave; la coop&eacute;ration en tant qu'oppos&eacute;s. Mais elles sont dans le m&ecirc;me camp. Avec le logiciel libre vous &ecirc;tes libres de coop&eacute;rer avec d'autres personnes et &ecirc;tes libre de vous aider vous-m&ecirc;me. Avec le logiciel non-libre, quelqu'un vous domine et tient les gens divis&eacute;s. Vous n'&ecirc;tes pas autoris&eacute;s &agrave; partager avec eux, vous n'&ecirc;tes pas libres de coop&eacute;rer avec ou d'aider la soci&eacute;t&eacute;, pas plus que vous n'&ecirc;tes autoris&eacute;s &agrave; vous aider vous-m&ecirc;me. Divis&eacute;s et impuissants, voil&agrave; l'&eacute;tat des utilisateurs de logiciel non libre.

source: We've produced a tremendous range of free software. We've done what people said we could never do; we have two operating systems of free software. We have many applications and we obviously have a lot farther to go. So we need your help. I would like to ask you to volunteer for the GNU project; help us develop free software for more jobs. Take a look at <a href="/help/">http://www.gnu.org/help</a> to find suggestions for how to help. If you want to order things, there's a link to that from the home page. If you want to read about philosophical issues, look in /philosophy. If you're looking for free software to use, look in /directory, which lists about 1900 packages now (which is a fraction of all the free software out there). Please write more and contribute to us. My book of essays, &ldquo;Free Software and Free Society&rdquo;, is on sale and can be purchased at <a href="http://www.gnu.org/">www.gnu.org</a>. Happy hacking!
fr: Nous avons produit une vari&eacute;t&eacute; &eacute;norme de logiciels libres. Nous avons fait ce que les gens disaient que nous n'arriverions jamais, nous avons deuxsyst&egrave;mes d'exploitation en logiciels libres. Nous avons de nombreuses applications et &eacute;videmment avons encore beaucoup &agrave; faire. Donc nous avonsbesoin de votre aide. J'aimerais vous demander d'&ecirc;tre volontaire pour le projet GNU, aidez-nous &agrave; d&eacute;velopper le logiciel libre pour plus de travail. Allezvoir sur <a href="/help/">http://www.gnu.org/help</a> pour trouver des suggestions sur la mani&egrave;re de nous aider. Si vous voulez commander des choses, il y a un lien pour cela sur cette page. Si vous voulez lire &agrave; propos des questions philosophiques, allez voir dans /philosophy. Si vous cherchez des logiciels libres &agrave; utiliser, allez voir dans /directory, qui liste environ 1900 paquets maintenant (ce qui repr&eacute;sente une fraction de tout le logiciel libre existant). S'il vous pla&icirc;t, &eacute;crivez-en plus et contribuez. Mon livre d'essais, &laquo;&nbsp;Free Software and Free Society&nbsp;&raquo; (Logiciel libre et soci&eacute;t&eacute; libre), est en vente et peut &ecirc;tre achet&eacute; sur <a href="http://www.gnu.org/">www.gnu.org</a>. Happy hacking! (Codez joyeusement&nbsp;!).

source: <a name="foot-1">(1)</a> Greenblatt's plan, as I understood it, was to hire lab people part time, so that they could continue working at the AI Lab. Symbolics hired them full time instead, so they stopped working at MIT.
fr: <a name="foot-1">(1)</a> Le plan de Greenblatt, &agrave; ce que j'en ai compris, &eacute;tait d'engager les gens du laboratoire &agrave; temps partiel, afin qu'ils puissent continuer &agrave; travailler au Labo d'I.A.. Symbolics les a engag&eacute; &agrave; temps plein &agrave; la place, donc ils ont arr&ecirc;t&eacute; de travailler au M.I.T.

source: <a name="foot-2">(2)</a> It was not that I cared particularly about the fate of LMI, but rather I did not want to let Symbolics gain through its aggression against the AI Lab.
fr: <a name="foot-2">(2)</a> Ce n'&eacute;tait pas que le sort de LMI m'int&eacute;resse particuli&egrave;rement, mais plut&ocirc;t je ne voulais pas laisser Symbolics gagner parson aggression contre le labo d'I.A.

source: <a name="foot-3">(3)</a> This statement has been misconstrued as saying that I never, ever looked at Symbolics' code. Actually it says I did.
fr: <a name="foot-3">(3)</a> Cette phrase a &eacute;t&eacute; mal interpr&eacute;t&eacute;e, selon quoi je n'aurais jamais, jamais jet&eacute; un &oelig;il sur le code de Symbolics. En r&eacute;alit&eacute;, je l'ai fait.

source: The Symbolics source code was available at MIT, where I was entitled to read it, and at first that's how I found out about their changes. But that meant I had to make extra effort to solve each problem differently, in order to avoid copying Symbolics code. After a while, I concluded it was better not to even look. That way I could write code in whatever way was best, without concern for what was in Symbolics' code.
fr: Le code source de Symbolics &eacute;tait disponible au M.I.T., o&ugrave; j'&eacute;tais en droit de le lire, et au d&eacute;but c'est ainsi que je me suis rendu compte de leurschangements. Mais cela signifie que j'avais l'effort suppl&eacute;mentaire de r&eacute;soudre chaque probl&egrave;me diff&eacute;remment, pour &eacute;viter de copier le code Symbolics. Apr&egrave;s un moment, j'ai conclu que c'&eacute;tait mieux de ne pas le regarder du tout. De cette fa&ccedil;on, je pouvais &eacute;crire le code de la meilleure fa&ccedil;on, sans me soucier de ce qui &eacute;tait dans le code Symbolics.

source: <a name="foot-4">(4)</a> The background of this plan, which I did not state explicitly in the talk, is that during an initial period the ex-AI-Lab hackers, whether at Symbolics or LMI, continued contributing their changes to the MIT Lisp Machine system &mdash; even though the contract did not require this. Symbolics' plan was to rupture this cooperation unilaterally.
fr: <a name="foot-4">(4)</a> L'arri&egrave;re pens&eacute;e de ce plan, que je n'ai pas explicit&eacute; dans le discours, est que durant cette p&eacute;riode initiale les ex hackers du labo d'I.A., que ce soit chez Symbolics ou chez LMI, ont continu&eacute; &agrave; faire contribuer leurs modifications au syst&egrave;me machine Lisp du M.I.T., bien que le contrat ne l'exigeait pas. Le plan de Symbolics &eacute;tait de briser cette coop&eacute;ration unilat&eacute;ralement.

source: <a name="foot-5">(5)</a> Bernie Greenberg says that Dan Weinreb's implementation of Emacs for the Lisp Machine came before Greenberg's implementation for Multics. I apologize for the mistake.
fr: <a name="foot-5">(5)</a> Bernie Greenberg dit que l'impl&eacute;mentation de Dan Weinberg d'Emacs pour la machine Lisp est arriv&eacute;e avant l'impl&eacute;mentation deGreenberg pour Multics. Je m'excuse pour cette erreur.

source: <a name="foot-6">(6)</a> Symbolics at one point protested to MIT that my work, by thwarting their plan, had cost Symbolics a million dollars.
fr: <a name="foot-6">(6)</a> Symbolics a &agrave; un moment protest&eacute; au M.I.T. que mon travail, en contrant leur plan, avait cout&eacute; &agrave; Symbolics un million de dollars.

source: <a name="foot-7">(7)</a> Guy Steele designed the original symmetrical Emacs command set; then he and I began implementing Emacs (on top of TECO), but after one long joint development session, Steele began drifting away, so I finished Emacs. Others particularly including Eugene C. Cicciarelli and Mike McMahon contributed substantially later on.
fr: <a name="foot-7">(7)</a> Guy Steele a con&ccedil;u la biblioth&egrave;que de commande de l'Emacs sym&eacute;trique original, puis lui et moi avons commenc&eacute; &agrave; impl&eacute;menter Emacs (par dessus TECO), mais apr&egrave;s une longue session de d&eacute;veloppement conjointe, Steele a commenc&eacute; &agrave; s'&eacute;loigner, donc j'ai fini Emacs. D'autres incluant particuli&egrave;rement Eugene C. Cicciarelli et Mike McMahon ont par la suite contribu&eacute; de mani&egrave;re substantielle.

source: Please send FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. There are also <a href="/contact/">other ways to contact</a> the FSF. <br /> Please send broken links and other corrections (or suggestions) to <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.
fr: Veuillez envoyer les requêtes concernant la FSF et GNU à <a href="mailto:gnu@gnu.org"><em>gnu@gnu.org</em></a>. Il existe aussi <a href="/contact/">d'autres moyens de contacter</a> la FSF. <br /> Veuillez envoyer les liens orphelins ou d'autres suggestions sur cette page Web aux <a href="/people/webmeisters.html">webmestres de GNU</a> à l'adresse <a href="mailto:webmasters@gnu.org"><em>webmasters@gnu.org</em></a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved.
fr: La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Marc de Maillard.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
