Repository: gitGNU/gnu_www-fr
Catalog: gnu/rms-lisp.*.po
Languages: fr

source: My Lisp Experiences and the Development of GNU Emacs - GNU Project - Free Software Foundation (FSF)
fr: Mes exp&eacute;riences avec Lisp et le d&eacute;veloppement de GNU Emacs - GNU Project - Free Software Foundation (FSF)

source: My Lisp Experiences and the Development of GNU Emacs
fr: Mes exp&eacute;riences avec Lisp et le d&eacute;veloppement de GNU Emacs

source: (Transcript of Richard Stallman's Speech, 28 Oct 2002, at the International Lisp Conference).
fr: (Transcription du discours de Richard Stallman, 28 octobre 2002, &agrave; la conf&eacute;rence internationale Lisp

source: Since none of my usual speeches have anything to do with Lisp, none of them were appropriate for today. So I'm going to have to wing it. Since I've done enough things in my career connected with Lisp I should be able to say something interesting.
fr: Comme aucun de mes discours habituels n'a &agrave; voir avec Lisp, aucun ne serait appropri&eacute; pour aujourd'hui. Donc je vais improviser. Comme j'ai fait suffisamment de choses dans ma carri&egrave;re en relation avec Lisp, je devrais &ecirc;tre capable de raconter quelque chose d'int&eacute;ressant.

source: My first experience with Lisp was when I read the Lisp 1.5 manual in high school. That's when I had my mind blown by the idea that there could be a computer language like that. The first time I had a chance to do anything with Lisp was when I was a freshman at Harvard and I wrote a Lisp interpreter for the <abbr title="Programmed Data Processor">PDP</abbr>-11. It was a very small machine &mdash; it had something like 8k of memory &mdash; and I managed to write the interpreter in a thousand instructions. This gave me some room for a little bit of data. That was before I got to see what real software was like, that did real system jobs.
fr: Ma premi&egrave;re exp&eacute;rience avec Lisp a &eacute;t&eacute; de lire le manuel Lisp 1.5 au lyc&eacute;e. C'est &agrave; ce moment l&agrave; que l'id&eacute;e m'a frapp&eacute; de plein fouet&nbsp;: qu'il puisse y avoir un langage informatique comme cela. La premi&egrave;re fois que j'ai eu la chance de faire quelque chose avec Lisp fut quand je suis arriv&eacute; &agrave; Harvard et que j'ai &eacute;crit un interpr&eacute;teur Lisp pour le <abbr title="Programmed Data Processor">PDP</abbr>-11. C'&eacute;tait une toute petite machine, avec quelque chose comme 8 Ko de m&eacute;moire, et j'ai r&eacute;ussi &agrave; &eacute;crire l'interpr&eacute;teur en un millier de lignes. Cela m'a laiss&eacute; un peu de place pour quelques donn&eacute;es. Tout cela &eacute;tait avant que je ne vois ce qu'est du vrai logiciel, qui ex&eacute;cute un vrai travail syst&egrave;me

source: I began doing work on a real Lisp implementation with JonL White once I started working at <abbr title="Massachusetts Institute of Technology">MIT</abbr>. I got hired at the Artificial Intelligence Lab not by JonL, but by Russ Noftsker, which was most ironic considering what was to come &mdash; he must have really regretted that day.
fr: J'ai commenc&eacute; &agrave; travailler sur une vraie impl&eacute;mentation de Lisp avec JonL White apr&egrave;s avoir d&eacute;but&eacute; au <acronym title="Massachusetts Institute of Technology">M.I.T.</acronym> J'ai &eacute;t&eacute; engag&eacute; au laboratoire d'intelligence artificielle non pas par JonL, mais par Russ Noftsker, ce qui est plut&ocirc;t ironique vu ce qui s'est pass&eacute; par la suite&nbsp;: il a vraiment d&ucirc; regretter ce jour-l&agrave;.

source: During the 1970s, before my life became politicized by horrible events, I was just going along making one extension after another for various programs, and most of them did not have anything to do with Lisp. But, along the way, I wrote a text editor, Emacs. The interesting idea about Emacs was that it had a programming language, and the user's editing commands would be written in that interpreted programming language, so that you could load new commands into your editor while you were editing. You could edit the programs you were using and then go on editing with them. So, we had a system that was useful for things other than programming, and yet you could program it while you were using it. I don't know if it was the first one of those, but it certainly was the first editor like that.
fr: Pendant les ann&eacute;es 70, avant que ma vie ne soit politis&eacute;e par des &eacute;v&eacute;nements horribles, je me contentais de faire une extension apr&egrave;s l'autre pour des programmes vari&eacute;s, et la plupart d'entre eux n'avaient rien &agrave; voir avec Lisp. Mais, au fur et &agrave; mesure, j'ai &eacute;crit un &eacute;diteur de texte, Emacs. L'id&eacute;e int&eacute;ressante &agrave; propos d'Emacs &eacute;tait qu'il poss&eacute;dait un langage de programmation, et que les commandes d'&eacute;dition de l'utilisateur seraient &eacute;crites dans ce langage de programmation interpr&eacute;t&eacute;, de telle sorte que vous pouviez charger de nouvelles commandes dans votre &eacute;diteur pendant que vous &eacute;ditiez. Vous pouviez &eacute;diter les programmes que vous utilisiez et continuer &agrave; &eacute;diter avec eux. Donc, nous avions un syst&egrave;me qui &eacute;tait utile &agrave; autre chose qu'&agrave; programmer, et que vous pouviez programmer pendant que vous l'utilisiez. Je ne sais pas si c'&eacute;tait le premier programme &agrave; le faire, mais c'&eacute;tait certainement le premier &eacute;diteur comme &ccedil;a.

source: The original Emacs did not have Lisp in it. The lower level language the non-interpreted language &mdash; was <abbr>PDP</abbr>-10 Assembler. The interpreter we wrote in that actually wasn't written for Emacs, it was written for <acronym title="Text Editor and COrrector">TECO</acronym>. It was our text editor, and was an extremely ugly programming language, as ugly as could possibly be. The reason was that it wasn't designed to be a programming language, it was designed to be an editor and command language. There were commands like &lsquo;5l&rsquo;, meaning &lsquo;move five lines&rsquo;, or &lsquo;i&rsquo; and then a string and then an ESC to insert that string. You would type a string that was a series of commands, which was called a command string. You would end it with ESC ESC, and it would get executed.
fr: L'Emacs original ne contenait pas de Lisp. Le langage de bas-niveau, le langage non interpr&eacute;t&eacute;, &eacute;tait de l'assembleur PDP-10. L'interpr&eacute;teur dans lequel nous &eacute;crivions n'&eacute;tait en fait pas &eacute;crit pour Emacs, il &eacute;tait &eacute;crit pour TECO. C'&eacute;tait notre &eacute;diteur de texte, et &eacute;tait un langage de programmation extr&ecirc;mement laid, le plus laid qu'il puisse exister. La raison en &eacute;tait qu'il n'&eacute;tait pas con&ccedil;u pour &ecirc;tre un langage de programmation, mais pour &ecirc;tre un langage d'&eacute;dition et de commande. Il y avait des commandes comme &laquo;&nbsp;5l&nbsp;&raquo;, signifiant &laquo;&nbsp;avance de 5 lignes&nbsp;&raquo;, ou bien &laquo;&nbsp;i&nbsp;&raquo; puis une cha&icirc;ne de caract&egrave;re et &Eacute;chap pour ins&eacute;rer cette cha&icirc;ne. Vous pouviez taper une cha&icirc;ne de caract&egrave;res qui &eacute;tait une s&eacute;rie de commandes, ce quis'appelait une cha&icirc;ne de commande. Vous la terminiez par &Eacute;chap &Eacute;chap, et elle &eacute;tait ex&eacute;cut&eacute;e.

source: Well, people wanted to extend this language with programming facilities, so they added some. For instance, one of the first was a looping construct, which was &lt; &gt;. You would put those around things and it would loop. There were other cryptic commands that could be used to conditionally exit the loop. To make Emacs, we <a href="#foot-7">(7)</a> added facilities to have subroutines with names. Before that, it was sort of like Basic, and the subroutines could only have single letters as their names. That was hard to program big programs with, so we added code so they could have longer names. Actually, there were some rather sophisticated facilities; I think that Lisp got its unwind-protect facility from <acronym>TECO</acronym>.
fr: Eh bien, certaines personnes voulaient &eacute;tendre ce langage avec des m&eacute;thodes de programmation, donc ils en ont ajout&eacute; quelques-unes. Par exemple, l'une des premi&egrave;res fut une structure de boucle, qui &eacute;tait &lt; &gt;. Vous pouviez les placer autour de quelque chose, et cette chose s'ex&eacute;cutait en boucle. Il y avait d'autres commandes cryptiques qui pouvaient &ecirc;tre utilis&eacute;es pour sortir de la boucle en fonction de conditions. Pour faire Emacs, nous <a href="#foot-7">(7)</a> avons ajout&eacute; des m&eacute;thodes pour avoir des sous-routines avec des noms. Avant cela, c'&eacute;tait une sorte de Basic, et les sous-routines pouvaient uniquement avoir une seule lettre pour nom. Il &eacute;tait difficile de faire des gros programmes avec, donc nous avons ajout&eacute; du code pour qu'elles puissent avoir des noms plus long. En fait, il y avait des m&eacute;thodes plut&ocirc;t sophistiqu&eacute;es&nbsp;: je pense que Lisp a h&eacute;rit&eacute; sam&eacute;thode unwind-protect de TECO.

source: We started putting in rather sophisticated facilities, all with the ugliest syntax you could ever think of, and it worked &mdash; people were able to write large programs in it anyway. The obvious lesson was that a language like <acronym>TECO</acronym>, which wasn't designed to be a programming language, was the wrong way to go. The language that you build your extensions on shouldn't be thought of as a programming language in afterthought; it should be designed as a programming language. In fact, we discovered that the best programming language for that purpose was Lisp.
fr: Nous avons commenc&eacute; &agrave; int&eacute;grer des m&eacute;thodes plut&ocirc;t sophistiqu&eacute;es, toutes avec la syntaxe la plus horrible que vous pouviez vous repr&eacute;senter, et cela marchait&nbsp;: les gens &eacute;taient capables d'&eacute;crire des programmes avec en tout cas. La le&ccedil;on &eacute;vidente &eacute;tait qu'un langage comme TECO, qui n'&eacute;tait pas con&ccedil;u pour programmer, &eacute;tait la mauvaise direction. Le langage sur lequel vous construisez vos extensions ne devrait pas &ecirc;tre vu en tant que langage de programmation apr&egrave;s coup, il devrait &ecirc;tre con&ccedil;u en tant que langage de programmation. En fait, nous avons d&eacute;couvert que le meilleur langage de programmation pour faire cela &eacute;tait Lisp.

source: It was Bernie Greenberg, who discovered that it was <a href="#foot-5">(5)</a>. He wrote a version of Emacs in Multics MacLisp, and he wrote his commands in MacLisp in a straightforward fashion. The editor itself was written entirely in Lisp. Multics Emacs proved to be a great success &mdash; programming new editing commands was so convenient that even the secretaries in his office started learning how to use it. They used a manual someone had written which showed how to extend Emacs, but didn't say it was a programming. So the secretaries, who believed they couldn't do programming, weren't scared off. They read the manual, discovered they could do useful things and they learned to program.
fr: C'est Bernie Greenberg, qui a d&eacute;couvert qu'il l'&eacute;tait <a href="#foot-5">(5)</a>. Il a &eacute;crit une version d'Emacs en Multics MacLisp, et il &eacute;crivait ses commandes en MacLisp de fa&ccedil;on tr&egrave;s directe. L'&eacute;diteur lui-m&ecirc;me &eacute;tait enti&egrave;rement &eacute;crit en Lisp. Emacs Multics fut un grand succ&egrave;s&nbsp;: programmer de nouvelles commandes d'&eacute;dition &eacute;tait si pratique que m&ecirc;me les secr&eacute;taires dans son bureau ont commenc&eacute; &agrave; apprendre &agrave; s'en servir. Elles utilisaient un manuel que quelqu'un avait &eacute;crit qui montrait comment &eacute;tendre Emacs, mais qui ne disait pas qu'il s'agissait de programmation. Donc les secr&eacute;taires, qui croyaient qu'elles ne pouvaient pas programmer, n'ont pas &eacute;t&eacute; effray&eacute;es. Elles ont lu le manuel, d&eacute;couvert qu'elles pouvaient faire des choses utiles, et ont appris &agrave; programmer.

source: So Bernie saw that an application &mdash; a program that does something useful for you &mdash; which has Lisp inside it and which you could extend by rewriting the Lisp programs, is actually a very good way for people to learn programming. It gives them a chance to write small programs that are useful for them, which in most arenas you can't possibly do. They can get encouragement for their own practical use &mdash; at the stage where it's the hardest &mdash; where they don't believe they can program, until they get to the point where they are programmers.
fr: Donc Bernie &agrave; vu qu'une application (un programme qui fait quelque chose d'utile pour vous) qui avait Lisp &agrave; l'int&eacute;rieur et que vous pouviez &eacute;tendre en r&eacute;&eacute;crivant les programmes Lisp, &eacute;tait r&eacute;ellement une tr&egrave;s bonne mani&egrave;re pour les gens d'apprendre &agrave; programmer. Cela leur donnait la chance d'&eacute;crire de petits programmes qui leur &eacute;taient utiles, ce qui est impossible dans la plupart des situations. Ils peuvent ainsi s'encourager (au stade le plus difficile) quand ils ne croient pas qu'ils puissent programmer, jusqu'&agrave; ce qu'ils arrivent au point o&ugrave; ils sont devenus programmeurs.

source: At that point, people began to wonder how they could get something like this on a platform where they didn't have full service Lisp implementation. Multics MacLisp had a compiler as well as an interpreter &mdash; it was a full-fledged Lisp system &mdash; but people wanted to implement something like that on other systems where they had not already written a Lisp compiler. Well, if you didn't have the Lisp compiler you couldn't write the whole editor in Lisp &mdash; it would be too slow, especially redisplay, if it had to run interpreted Lisp. So we developed a hybrid technique. The idea was to write a Lisp interpreter and the lower level parts of the editor together, so that parts of the editor were built-in Lisp facilities. Those would be whatever parts we felt we had to optimize. This was a technique that we had already consciously practiced in the original Emacs, because there were certain fairly high level features which we re-implemented in machine language, making them into <acronym>TECO</acronym> primitives. For instance, there was a <acronym>TECO</acronym> primitive to fill a paragraph (actually, to do most of the work of filling a paragraph, because some of the less time-consuming parts of the job would be done at the higher level by a <acronym>TECO</acronym> program). You could do the whole job by writing a <acronym>TECO</acronym> program, but that was too slow, so we optimized it by putting part of it in machine language. We used the same idea here (in the hybrid technique), that most of the editor would be written in Lisp, but certain parts of it that had to run particularly fast would be written at a lower level.
fr: &Agrave; ce moment-l&agrave;, les gens ont commenc&eacute; &agrave; se demander comment ils pouvaient obtenir quelque chose de ce genre sur une plateforme sur laquelle ils ne disposaient pas de l'impl&eacute;mentation des services complets de Lisp. Multics MacLisp avait un compilateur aussi bien qu'un interpr&eacute;teur (c'&eacute;tait un syst&egrave;me Lisp complet) mais les gens voulaient impl&eacute;menter quelque chose comme &ccedil;a sur d'autres syst&egrave;mes o&ugrave; ils n'avaient pas encore de compilateur Lisp. Car sans avoir le compilateur Lisp vous ne pouviez &eacute;crire l'&eacute;diteur entier en Lisp&nbsp;: ce serait trop lent, sp&eacute;cialement l'affichage, s'il fallait faire tourner du Lisp interpr&eacute;t&eacute;. Donc nous avons d&eacute;velopp&eacute; une technique hybride. L'id&eacute;e &eacute;tait d'&eacute;crire un interpr&eacute;teur Lisp et les parties bas-niveau de l'&eacute;diteur ensemble, de telle sorte que des morceaux de l'&eacute;diteur &eacute;taient des m&eacute;thodes int&eacute;gr&eacute;es Lisp. C'&eacute;tait toutes les parties dont nous avions le sentiment qu'il fallait les optimiser. C'est une technique que nous avions d&eacute;j&agrave; consciemment pratiqu&eacute; dans l'Emacs original, puisqu'il y avait certaines fonctionnalit&eacute;s de relativement haut-niveau que nous r&eacute;-impl&eacute;mentions en langage machine, les transformant en primitives TECO. Par exemple, il y avait une primitive TECO pour remplir un paragraphe (en fait, pour faire le gros du travail de remplir un paragraphe, parce que certaines des parties du travail les moins exigentes en temps &eacute;taient faites &agrave; un niveau sup&eacute;rieur par un programme TECO). Vous pouviez faire tout le travail en &eacute;crivant un programme TECO, mais c'&eacute;tait trop lent, doncnous l'avons optimis&eacute; en en mettant une partie en langage machine. Nous avons utilis&eacute; la m&ecirc;me id&eacute;e ici (dans la technique hybride), que la grosse partie de l'&eacute;diteur serait &eacute;crite en Lisp, mais que certaines parties ayant besoin de fonctionner particuli&egrave;rement rapidement seraient &eacute;crites &agrave; un niveau inf&eacute;rieur.

source: Therefore, when I wrote my second implementation of Emacs, I followed the same kind of design. The low level language was not machine language anymore, it was C. C was a good, efficient language for portable programs to run in a Unix-like operating system. There was a Lisp interpreter, but I implemented facilities for special purpose editing jobs directly in C &mdash; manipulating editor buffers, inserting leading text, reading and writing files, redisplaying the buffer on the screen, managing editor windows.
fr: C'est pourquoi, quand j'ai &eacute;crit ma deuxi&egrave;me impl&eacute;mentation d'Emacs, j'ai suivi le m&ecirc;me concept.Le langage de bas niveau n'&eacute;tait plus du langage machine mais du C. C &eacute;tait un bon langage, efficace pour des programmes portables fonctionnant dans un syst&egrave;me d'exploitation de type Unix. Il y avait un interpr&eacute;teur Lisp, mais j'ai impl&eacute;ment&eacute; des m&eacute;thodes pour des travaux d'&eacute;dition sp&eacute;ciale directement en C&nbsp;: manipuler les piles de l'&eacute;diteur, ins&eacute;rer du &laquo;&nbsp;leading text&nbsp;&raquo;, lire et &eacute;crire des fichiers, r&eacute;afficher la pile &agrave; l'&eacute;cran, g&eacute;rer les fen&ecirc;tres de l'&eacute;diteur.

source: Now, this was not the first Emacs that was written in C and ran on Unix. The first was written by James Gosling, and was referred to as GosMacs. A strange thing happened with him. In the beginning, he seemed to be influenced by the same spirit of sharing and cooperation of the original Emacs. I first released the original Emacs to people at <abbr>MIT</abbr>. Someone wanted to port it to run on Twenex &mdash; it originally only ran on the Incompatible Timesharing System we used at <abbr>MIT</abbr>. They ported it to Twenex, which meant that there were a few hundred installations around the world that could potentially use it. We started distributing it to them, with the rule that &ldquo;you had to send back all of your improvements&rdquo; so we could all benefit. No one ever tried to enforce that, but as far as I know people did cooperate.
fr: Maintenant, ce n'&eacute;tait pas le premier Emacs &eacute;crit en C et fonctionnant sous Unix. Le premier a &eacute;t&eacute; &eacute;crit par James Gosling, et &eacute;tait appel&eacute; GosMac. Une chose &eacute;trange lui est arriv&eacute;e. Au d&eacute;but, il semblait &ecirc;tre influenc&eacute; par le m&ecirc;me esprit de partage et de coop&eacute;ration que celui de l'Emacs original. J'ai d'abord distribu&eacute; l'Emacs original aux gens du M.I.T. Quelqu'un voulait le porter pour le faire fonctionner sur Twenex&nbsp;: il fonctionnait &agrave; l'origine sur l'Incompatible Timesharing System que nous utilisions au M.I.T. Ils l'ont port&eacute; sur Twenex, ce qui signifiait qu'il y avait quelques centaines d'installations dans le monde qui pouvaient potentiellement l'utiliser. Nous avons commenc&eacute; &agrave; le leur distribuer, avec la r&egrave;gle que &laquo;&nbsp;vous aviez &agrave; renvoyer toutes vos am&eacute;liorations&nbsp;&raquo; pour que tout le monde en b&eacute;n&eacute;ficie. Personne n'a jamais essay&eacute; de surveiller son application, mais &agrave; ce que j'en sais les gens ont coop&eacute;r&eacute;.

source: Gosling did, at first, seem to participate in this spirit. He wrote in a manual that he called the program Emacs hoping that others in the community would improve it until it was worthy of that name. That's the right approach to take towards a community &mdash; to ask them to join in and make the program better. But after that he seemed to change the spirit, and sold it to a company.
fr: Gosling avait l'air, au d&eacute;but, de participer &agrave; cet esprit. Il a &eacute;crit dans un manuel qu'il appelait le programme Emacs esp&eacute;rant que d'autres dans la communaut&eacute; l'am&eacute;liore jusqu'&agrave; ce qu'il soit digne de ce nom. C'est la bonne approche pour cr&eacute;er une communaut&eacute;&nbsp;: leur demander de se joindre et de participer &agrave; am&eacute;liorer le programme. Mais apr&egrave;s cela il a apparemment chang&eacute; d'esprit, et a vendu le programme &agrave; une entreprise.

source: At that time I was working on the GNU system (a free software Unix-like operating system that many people erroneously call &ldquo;Linux&rdquo;). There was no free software Emacs editor that ran on Unix. I did, however, have a friend who had participated in developing Gosling's Emacs. Gosling had given him, by email, permission to distribute his own version. He proposed to me that I use that version. Then I discovered that Gosling's Emacs did not have a real Lisp. It had a programming language that was known as &lsquo;mocklisp&rsquo;, which looks syntactically like Lisp, but didn't have the data structures of Lisp. So programs were not data, and vital elements of Lisp were missing. Its data structures were strings, numbers and a few other specialized things.
fr: &Agrave; ce moment-l&agrave; je travaillais sur le syst&egrave;me GNU (un syst&egrave;me d'exploitation libre de type Unix que beaucoup de personnes nomment par erreur &laquo;&nbsp;Linux&nbsp;&raquo;). Il n'y avait pas d'&eacute;diteur Emacs libre qui fonctionnait sur Unix. J'avais par contre un ami qui avait particip&eacute; au d&eacute;veloppement de l'Emacs de Gosling. Gosling lui avait donn&eacute;, par courriel, la permission de distribuer sa propre version. Il a propos&eacute; que j'utilise cette version. Puis j'ai d&eacute;couvert que l'Emacs de Gosling n'avait pas r&eacute;ellement de Lisp. Il avait un langage de programmation connu sous le nom de &laquo;&nbsp;mocklisp&nbsp;&raquo;, qui ressemblait pour la syntaxe &agrave; Lisp, mais n'avait pas les structures de donn&eacute;es de Lisp. Donc les programmes n'&eacute;taient pas des donn&eacute;es, et des &eacute;l&eacute;ments vitaux de Lisp manquaient. Ses structures de donn&eacute;es &eacute;taient les cha&icirc;nes de caract&egrave;res, les nombres et quelques autres choses sp&eacute;cialis&eacute;es.
