Repository: gitGNU/gnu_www-fr
Catalog: gnu/rms-lisp.*.po
Languages: fr

source: I concluded I couldn't use it and had to replace it all, the first step of which was to write an actual Lisp interpreter. I gradually adapted every part of the editor based on real Lisp data structures, rather than ad hoc data structures, making the data structures of the internals of the editor exposable and manipulable by the user's Lisp programs.
fr: J'ai conclu que je ne pouvais pas l'utiliser et que j'avais &agrave; tout remplacer, en commen&ccedil;ant par &eacute;crire un vrai interpr&eacute;teur Lisp. J'ai progressivement adapt&eacute; toutes les parties de l'&eacute;diteur aux structures de donn&eacute;es du vrai Lisp, plut&ocirc;t qu'&agrave; des structures de donn&eacute;es ad hoc, rendant les structures de donn&eacute;es des parties internes de l'&eacute;diteur exposables et manipulables par les programmes Lisp des utilisateurs.

source: The one exception was redisplay. For a long time, redisplay was sort of an alternate world. The editor would enter the world of redisplay and things would go on with very special data structures that were not safe for garbage collection, not safe for interruption, and you couldn't run any Lisp programs during that. We've changed that since &mdash; it's now possible to run Lisp code during redisplay. It's a quite a convenient thing.
fr: L'unique exception &eacute;tait l'affichage. Pendant longtemps, le r&eacute;affichage &eacute;tait une sorte d'autre plan&egrave;te. L'&eacute;diteur entrait le mot pour r&eacute;affichage, et les choses continuaient avec des structures de donn&eacute;es tr&egrave;s sp&eacute;ciales qui n'&eacute;taient pas s&ucirc;res pour l'interception des messages d'erreurs, pas s&ucirc;res pour les interruptions, et vous ne pouviez lancer aucun programme Lisp pendant ce temps-l&agrave;. Nous avons chang&eacute; &ccedil;a depuis&nbsp;: il est maintenant possible de lancer du code Lisp pendant le r&eacute;affichage. C'est quelque chose d'assez pratique.

source: This second Emacs program was &lsquo;free software&rsquo; in the modern sense of the term &mdash; it was part of an explicit political campaign to make software free. The essence of this campaign was that everybody should be free to do the things we did in the old days at <abbr>MIT</abbr>, working together on software and working with whomever wanted to work with us. That is the basis for the free software movement &mdash; the experience I had, the life that I've lived at the <abbr>MIT</abbr> AI lab &mdash; to be working on human knowledge, and not be standing in the way of anybody's further using and further disseminating human knowledge.
fr: Ce second programme Emacs &eacute;tait du &laquo;&nbsp;logiciel libre&nbsp;&raquo; dans le sens moderne du terme&nbsp;: il faisait partie d'une campagne politique explicite pour lib&eacute;rer le logiciel. L'essence de cette campagne &eacute;tait que n'importe qui devrait &ecirc;tre libre de faire les choses que nous faisions au temps du M.I.T., travailler ensemble sur du logiciel et travailler avec qui que ce soit voulant travailler avec nous. C'est la base pour le mouvement du logiciel libre&nbsp;: l'exp&eacute;rience que j'ai eue, la vie que nous avions au Labo d'I.A. du M.I.T., de travailler sur du savoir, et ne pas &ecirc;tre en travers du chemin de qui que ce soit, et de diss&eacute;miner de plus en plus le savoir.

source: At the time, you could make a computer that was about the same price range as other computers that weren't meant for Lisp, except that it would run Lisp much faster than they would, and with full type checking in every operation as well. Ordinary computers typically forced you to choose between execution speed and good typechecking. So yes, you could have a Lisp compiler and run your programs fast, but when they tried to take <tt>car</tt> of a number, it got nonsensical results and eventually crashed at some point.
fr: &Agrave; cette &eacute;poque, vous pouviez faire un ordinateur dans le m&ecirc;me ordre de prix que d'autres non con&ccedil;us pour Lisp, sauf qu'il ferait fonctionner Lisp beaucoup plus rapidement qu'ils ne le feraient, et avec en plus v&eacute;rification compl&egrave;te de type. Les ordinateurs ordinaires vous for&ccedil;aient typiquement &agrave; choisir entre vitesse d'ex&eacute;cution et bonne v&eacute;rification de type. Donc oui, vous pouviez avoir un compilateur Lisp et faire fonctionner vos programmes rapidement, mais quand ils essayaient de prendre le &laquo;&nbsp;car&nbsp;&raquo; d'un nombre, il sortaient des r&eacute;sultats insens&eacute;s et finalement plantaient au bout d'un moment.

source: The Lisp machine was able to execute instructions about as fast as those other machines, but each instruction &mdash; a car instruction would do data typechecking &mdash; so when you tried to get the car of a number in a compiled program, it would give you an immediate error. We built the machine and had a Lisp operating system for it. It was written almost entirely in Lisp, the only exceptions being parts written in the microcode. People became interested in manufacturing them, which meant they should start a company.
fr: La machine Lisp &eacute;tait capable d'ex&eacute;cuter des instructions presque aussi vite que ces autres machines, mais pour toutes les instructions (une instruction<tt>car</tt> fait de la v&eacute;rification de type), donc quand vous essayiez d'obtenir le &laquo;&nbsp;car&nbsp;&raquo; d'un nombre dans un programme compil&eacute;, vous obteniez imm&eacute;diatement l'erreur. Nous construisions la machine et avions un syst&egrave;me d'exploitation Lisp pour elle. Il &eacute;tait presque enti&egrave;rement &eacute;crit en Lisp, les seules exceptions &eacute;tant certaines parties &eacute;crites dans le micro code. Des gens ont port&eacute; de l'int&eacute;r&ecirc;t &agrave; leur fabrication, ce qui signifie qu'ils allaient lancer une entreprise.

source: There were two different ideas about what this company should be like. Greenblatt wanted to start what he called a &ldquo;hacker&rdquo; company. This meant it would be a company run by hackers and would operate in a way conducive to hackers. Another goal was to maintain the AI Lab culture <a href="#foot-1">(1)</a>. Unfortunately, Greenblatt didn't have any business experience, so other people in the Lisp machine group said they doubted whether he could succeed. They thought that his plan to avoid outside investment wouldn't work.
fr: Il y avait deux id&eacute;es diff&eacute;rentes &agrave; propos de comment cette soci&eacute;t&eacute; devrait &ecirc;tre. Greenblatt voulait lancer ce qu'il appelait une entreprise de &laquo;&nbsp;hacker&nbsp;&raquo;. Cela signifie qu'il voulait une entreprise dirig&eacute;e par des hackers et qui fonctionnerait d'une mani&egrave;re favorable aux hackers. Un autre but &eacute;tait de maintenir la culture du labo d'I.A. <a href="#foot-1">(1)</a>. Malheureusement, Greenblatt n'avait aucune exp&eacute;rience des affaires, donc d'autres personnes dans le groupe de la machine Lisp ont dit qu'ils doutaient qu'il puisse r&eacute;ussir. Ils pensaient que son plan pour &eacute;viter les investissements ext&eacute;rieurs ne marcherait pas.

source: Why did he want to avoid outside investment? Because when a company has outside investors, they take control and they don't let you have any scruples. And eventually, if you have any scruples, they also replace you as the manager.
fr: Pourquoi voulait-il &eacute;viter les investissements ext&eacute;rieurs&nbsp;? Parce que quand une entreprise a des investisseurs ext&eacute;rieurs, ils prennent le contr&ocirc;le, et ne vous laissent pas avoir le moindre scrupule. Et finalement, si vous avez des scrupules, ils vous remplacent &eacute;galement en tant que directeur.

source: So Greenblatt had the idea that he would find a customer who would pay in advance to buy the parts. They would build machines and deliver them; with profits from those parts, they would then be able to buy parts for a few more machines, sell those and then buy parts for a larger number of machines, and so on. The other people in the group thought that this couldn't possibly work.
fr: Donc Greenblatt avait l'id&eacute;e qu'il trouverait un client pr&ecirc;t &agrave; payer en avance pour acheter les composants. Ils construiraient les machines et les livreraient&nbsp;: avec le b&eacute;n&eacute;fice r&eacute;alis&eacute;, ils seraient en mesure d'acheter les composants pour quelques machines de plus, de les vendre, d'acheter des composants pour plus de machines, et caetera et caetera. Les autres personnes dans le groupe ne pensaient pas que cela puisse fonctionner.

source: Greenblatt then recruited Russell Noftsker, the man who had hired me, who had subsequently left the AI Lab and created a successful company. Russell was believed to have an aptitude for business. He demonstrated this aptitude for business by saying to the other people in the group, &ldquo;Let's ditch Greenblatt, forget his ideas, and we'll make another company.&rdquo; Stabbing in the back, clearly a real businessman. Those people decided they would form a company called Symbolics. They would get outside investment, not have scruples, and do everything possible to win.
fr: Greenblatt a ensuite recrut&eacute; Russel Noftsker, la personne qui m'avait engag&eacute;, et qui avait entre temps quitt&eacute; le Labo d'I.A. et mont&eacute; une entreprise florissante. Russel passait pour avoir des capacit&eacute; pour les affaires. Il a d&eacute;montr&eacute; cette capacit&eacute; pour les affaires en disant aux autres membres du groupe&nbsp;: &laquo;&nbsp;jetons Greenblatt, oublions son id&eacute;e, et faisons une autre entreprise&nbsp;&raquo;. Poignarder dans le dos, clairement un vrai homme d'affaires. Ces personnes d&eacute;cid&egrave;rent qu'elles formeraient une soci&eacute;t&eacute; nomm&eacute;e Symbolics. Ils chercheraient des investissements ext&eacute;rieurs, n'auraient aucun scrupule, et feraient tout leur possible pour gagner.

source: But Greenblatt didn't give up. He and the few people loyal to him decided to start Lisp Machines Inc. anyway and go ahead with their plans. And what do you know, they succeeded! They got the first customer and were paid in advance. They built machines and sold them, and built more machines and more machines. They actually succeeded even though they didn't have the help of most of the people in the group. Symbolics also got off to a successful start, so you had two competing Lisp machine companies. When Symbolics saw that LMI was not going to fall flat on its face, they started looking for ways to destroy it.
fr: Mais Greenblatt n'a pas abandonn&eacute;. Lui et les quelques personnes qui lui &eacute;taient rest&eacute;es loyales d&eacute;cid&egrave;rent de lancer tout de m&ecirc;me Lisp Machines Inc. et de continuer sur leur plan original. Et devinez quoi, ils ont r&eacute;ussi&nbsp;! Ils ont trouv&eacute; leur premier client et ont &eacute;t&eacute; pay&eacute;s en avance. Ils ont construit leurs machines et les ont vendues, construit plus de machines et encore plus. Ils ont effectivement r&eacute;ussi alors m&ecirc;me qu'ils n'avaient pas l'aide de la plupart des personnes du groupe. Symbolics a aussi eu un d&eacute;part r&eacute;ussi, donc vous aviez deux entreprises concurrentes de machines Lisp. Quand Symbolics a vu que LMI n'allait pas s'&eacute;crouler, ils ont commenc&eacute; &agrave; chercher des moyens de le d&eacute;truire.

source: Thus, the abandonment of our lab was followed by &ldquo;war&rdquo; in our lab. The abandonment happened when Symbolics hired away all the hackers, except me and the few who worked at LMI part-time. Then they invoked a rule and eliminated people who worked part-time for <abbr>MIT</abbr>, so they had to leave entirely, which left only me. The AI lab was now helpless. And <abbr>MIT</abbr> had made a very foolish arrangement with these two companies. It was a three-way contract where both companies licensed the use of Lisp machine system sources. These companies were required to let <abbr>MIT</abbr> use their changes. But it didn't say in the contract that <abbr>MIT</abbr> was entitled to put them into the <abbr>MIT</abbr> Lisp machine systems that both companies had licensed. Nobody had envisioned that the AI lab's hacker group would be wiped out, but it was.
fr: Donc, l'abandon de notre labo fut suivi par une &laquo;&nbsp;guerre&nbsp;&raquo; dans notre labo. L'abandon s'est fait quand Symbolics a d&eacute;bauch&eacute; tous les hackers, &agrave; l'exception de moi et des quelques-uns qui travaillaient &agrave; LMI &agrave; temps partiel. Puis ils ont invoqu&eacute; une r&egrave;gle et &eacute;limin&eacute; les gens travaillant &agrave; temps partiel pour le M.I.T., les for&ccedil;ant &agrave; le quitter enti&egrave;rement, ce qui m'a laiss&eacute; seul. Le Labo d'I.A. &eacute;tait maintenant impuissant. Et le M.I.T. a pass&eacute; un arrangement absurde avec ces deux entreprises. C'&eacute;tait un contrat entre eux trois dans lequel chaque entreprise licenciait l'utilisation des sources des syst&egrave;mes de machine Lisp. Ces entreprises &eacute;taient forc&eacute;es de laisser le M.I.T. utiliser leurs modifications. Mais le contrat ne contenait rien disant que le M.I.T. avait le droit de les utiliser dans les syst&egrave;mes de machine Lisp que les deux entreprises avaient licenci&eacute;es. Personne ne s'&eacute;tait rendu compte que le groupe de hacker du Labo d'I.A. avait disparu, mais c'&eacute;tait le cas.

source: So Symbolics came up with a plan <a href="#foot-4">(4)</a>. They said to the lab, &ldquo;We will continue making our changes to the system available for you to use, but you can't put it into the <abbr>MIT</abbr> Lisp machine system. Instead, we'll give you access to Symbolics' Lisp machine system, and you can run it, but that's all you can do.&rdquo;
fr: Donc Symbolics &agrave; eu une id&eacute;e <a href="#foot-4">(4)</a>. Ils ont dit au labo&nbsp;: &laquo;&nbsp;Nous continuerons &agrave; mettre &agrave; votre disposition nos modifications du syst&egrave;me pour votre utilisation, mais vous ne pouvez les utiliser dans le syst&egrave;me de machine Lisp du M.I.T. &Agrave; la place, nous vous donnerons acc&egrave;s au syst&egrave;me de machine Lisp de Symbolics, et vous pourrez l'utiliser, mais c'est tout ce que vous pourrez faire&nbsp;&raquo;.

source: This, in effect, meant that they demanded that we had to choose a side, and use either the <abbr>MIT</abbr> version of the system or the Symbolics version. Whichever choice we made determined which system our improvements went to. If we worked on and improved the Symbolics version, we would be supporting Symbolics alone. If we used and improved the <abbr>MIT</abbr> version of the system, we would be doing work available to both companies, but Symbolics saw that we would be supporting LMI because we would be helping them continue to exist. So we were not allowed to be neutral anymore.
fr: Ceci, en pratique, voulait dire qu'ils demandaient que nous choisissions un camp, et utilisions soit la version du syst&egrave;me du M.I.T., soit la version de Symbolics. Quel que soit notre choix cela d&eacute;terminait &agrave; quel syst&egrave;me iraient nos am&eacute;liorations. Si nous travaillions et am&eacute;liorions la version de Symbolics, nous soutiendrions uniquement Symbolics. Si nous utilisions et am&eacute;liorions la version M.I.T. du syst&egrave;me, nous r&eacute;aliserions du travail disponible pour les deux entreprises, mais Symbolics verrait que nous soutiendrions LMI puisque nous les aiderions &agrave; exister. Donc nous ne pouvions plus rester neutres.

source: Up until that point, I hadn't taken the side of either company, although it made me miserable to see what had happened to our community and the software. But now, Symbolics had forced the issue. So, in an effort to help keep Lisp Machines Inc. going <a href="#foot-2">(2)</a> &mdash; I began duplicating all of the improvements Symbolics had made to the Lisp machine system. I wrote the equivalent improvements again myself (i.e., the code was my own).
fr: Jusqu'&agrave; ce moment, je n'avais pris parti pour aucune des deux entreprises, bien que cela me rendait malheureux de voir ce qui &eacute;tait arriv&eacute; &agrave; notrecommunaut&eacute; et au logiciel. Mais maintenant, Symbolics avait forc&eacute; le probl&egrave;me. Donc, dans un effort pour aider &agrave; faire continuer Lisp Machines Inc. <a href="#foot-2">(2)</a>, j'ai commenc&eacute; &agrave; dupliquer toutes les am&eacute;liorations que Symbolics avait fait au syst&egrave;me machine Lisp. J'ai &eacute;crit les am&eacute;liorations &eacute;quivalentes &agrave; neuf moi-m&ecirc;me (c'est-&agrave;-dire avec mon propre code).

source: After a while <a href="#foot-3">(3)</a>, I came to the conclusion that it would be best if I didn't even look at their code. When they made a beta announcement that gave the release notes, I would see what the features were and then implement them. By the time they had a real release, I did too.
fr: Au bout d'un moment <a href="#foot-3">(3)</a>, je suis arriv&eacute; &agrave; la conclusion que cela irait mieux si je ne regardais m&ecirc;me pas leur code. Quand ils annon&ccedil;aient une version b&ecirc;ta qui donnait les notes de versions, je pouvais voir quelles allaient &ecirc;tre les fonctionnalit&eacute;s et les impl&eacute;menter moi-m&ecirc;me. Au moment o&ugrave; ils avaient une vraie version, j'avais la mienne &eacute;galement.

source: In this way, for two years, I prevented them from wiping out Lisp Machines Incorporated, and the two companies went on. But, I didn't want to spend years and years punishing someone, just thwarting an evil deed. I figured they had been punished pretty thoroughly because they were stuck with competition that was not leaving or going to disappear<a href="#foot-6">(6)</a>. Meanwhile, it was time to start building a new community to replace the one that their actions and others had wiped out.
fr: De cette fa&ccedil;on, et pendant deux ans, je les ai emp&ecirc;ch&eacute;s d'&eacute;craser Lisp Machines Incorporated, et les deux entreprises ont continu&eacute; d'exister. Mais je ne voulais pas passer des ann&eacute;es et des ann&eacute;es &agrave; punir quelqu'un, uniquement &agrave; contrer une entreprise mal&eacute;fique. J'imagine qu'ils ont &eacute;t&eacute; punis assez s&eacute;v&egrave;rement parce qu'ils &eacute;taient bloqu&eacute;s avec de la concurrence qui n'avait ni l'intention de laisser tomber ni ne risquait de dispara&icirc;tre <a href="#foot-6">(6)</a>. Entre temps, il &eacute;tait temps de commencer &agrave; b&acirc;tir une nouvelle communaut&eacute; pour remplacer l'autre que leurs actions et d'autres avait ray&eacute; de la carte.

source: The Lisp community in the 70s was not limited to the <abbr>MIT</abbr> AI Lab, and the hackers were not all at <abbr>MIT</abbr>. The war that Symbolics started was what wiped out <abbr>MIT</abbr>, but there were other events going on then. There were people giving up on cooperation and together, this wiped out the community and there wasn't much left.
fr: La communaut&eacute; Lisp des ann&eacute;es 70 n'&eacute;tait pas limit&eacute;e au Labo d'I.A. du M.I.T., et les hackers ne venaient pas tous du M.I.T.. La guerre que Symbolics a lanc&eacute;e fut ce qui an&eacute;anti (la communaut&eacute; au) M.I.T., mais il y avait d'autres &eacute;v&eacute;nements en cours au m&ecirc;me moment. Il y avait des gens qui abandonnaient la coop&eacute;ration, et tout cela d&eacute;truisait la communaut&eacute;, et il n'en restait pas grand chose.

source: Once I stopped punishing Symbolics, I had to figure out what to do next. I had to make a free operating system, that was clear &mdash; the only way that people could work together and share was with a free operating system.
fr: Apr&egrave;s avoir arr&ecirc;t&eacute; de punir Symbolics, il a fallu r&eacute;fl&eacute;chir &agrave; quoi faire ensuite. Il fallait que je fasse un syst&egrave;me d'exploitation libre, c'&eacute;tait clair&nbsp;: la seule fa&ccedil;on de faire travailler des gens ensemble et de les faire partager &eacute;tait avec un syst&egrave;me d'exploitation libre.

source: At first, I thought of making a Lisp-based system, but I realized that wouldn't be a good idea technically. To have something like the Lisp machine system, you needed special purpose microcode. That's what made it possible to run programs as fast as other computers would run their programs and still get the benefit of typechecking. Without that, you would be reduced to something like the Lisp compilers for other machines. The programs would be faster, but unstable. Now that's okay if you're running one program on a timesharing system &mdash; if one program crashes, that's not a disaster, that's something your program occasionally does. But that didn't make it good for writing the operating system in, so I rejected the idea of making a system like the Lisp machine.
fr: Au d&eacute;but, j'ai pens&eacute; faire un syst&egrave;me bas&eacute; sur Lisp, mais j'ai r&eacute;alis&eacute; que techniquement ce n'&eacute;tait pas une tr&egrave;s bonne id&eacute;e. Pour avoir quelque chose comme le syst&egrave;me machine Lisp, vous aviez besoin de micro code &agrave; but sp&eacute;cifique. C'est ce qui rendait possible de faire fonctionner des programmes aussi rapidement que les autres ordinateurs faisaient fonctionner les leurs, en ayant tout de m&ecirc;me le b&eacute;n&eacute;fice de la v&eacute;rification de type. Sans cela, vous seriez r&eacute;duit &agrave; quelque chose comme les compilateurs Lisp pour les autres machines. Les programmes seraient plus rapides, mais instables. Maintenant c'est bon si vous faites fonctionner un programme sur un syst&egrave;me &agrave; partage de temps&nbsp;: si un programme plante, ce n'est pas un d&eacute;sastre, c'est quelque chose que les programmes font occasionnellement. Mais cela ne le rendait pas bon pour &eacute;crire le syst&egrave;me d'exploitation de cette fa&ccedil;on, donc j'ai rejet&eacute; l'id&eacute;e de faire un syst&egrave;me comme la machine Lisp.

source: I decided instead to make a Unix-like operating system that would have Lisp implementations to run as user programs. The kernel wouldn't be written in Lisp, but we'd have Lisp. So the development of that operating system, the GNU operating system, is what led me to write the GNU Emacs. In doing this, I aimed to make the absolute minimal possible Lisp implementation. The size of the programs was a tremendous concern.
fr: J'ai d&eacute;cid&eacute; de faire un syst&egrave;me d'exploitation de type Unix qui aurait des impl&eacute;mentations Lisp qui fonctionneraient en tant que programmes utilisateurs. Le noyau ne serait pas &eacute;crit en Lisp, mais nous aurions Lisp. Donc le d&eacute;veloppement de ce syst&egrave;me d'exploitation, le syst&egrave;me d'exploitation GNU, est ce qui m'a amen&eacute; &agrave; &eacute;crire GNU Emacs. En faisant cela, j'ai cherch&eacute; &agrave; faire le minimum d'impl&eacute;mentation Lisp possible. La taille des programmes &eacute;tait un souci &eacute;norme.

source: There were people in those days, in 1985, who had one-megabyte machines without virtual memory. They wanted to be able to use GNU Emacs. This meant I had to keep the program as small as possible.
fr: Il y avait des gens &agrave; cette &eacute;poque, en 1985, qui avaient des machines d'un megaoctet sans m&eacute;moire virtuelle. Ils voulaient pouvoir utiliser GNU Emacs. Cequi signifie qu'il fallait que je garde le programme aussi petit que possible.
