Repository: gitGNU/gnu_www-fr
Catalog: gnu/why-gnu-linux.*.po
Languages: fr

source: Why GNU/Linux? - GNU Project - Free Software Foundation (FSF)
fr: Pourquoi GNU/Linux ? - GNU Project - Free Software Foundation (FSF)

source: What's in a name?
fr: Qu'y a-t-il dans un nom&nbsp;?

source: <strong>by <a href="http://www.stallman.org/">Richard Stallman</a></strong>
fr: par <a href="http://www.stallman.org">Richard Stallman</a>

source: To learn more about this issue, you can also read our <a href="/gnu/gnu-linux-faq.html">GNU/Linux FAQ</a>, our page on <a href="/gnu/linux-and-gnu.html">Linux and the GNU Project</a> and our page on <a href="/gnu/gnu-users-never-heard-of-gnu.html">GNU Users Who Have Never Heard of GNU</a>.
fr: Si vous souhaitez en savoir plus sur ce sujet, vous pouvez aussi consulter notre <a href="/gnu/gnu-linux-faq.fr.html">FAQ GNU/Linux</a> et notre page sur <a href="/gnu/gnu-users-never-heard-of-gnu.fr.html">Les utilisateurs de GNU qui n'ont jamais entendu parler de GNU</a>.

source: Names convey meanings; our choice of names determines the meaning of what we say. An inappropriate name gives people the wrong idea. A rose by any name would smell as sweet&mdash;but if you call it a pen, people will be rather disappointed when they try to write with it. And if you call pens &ldquo;roses&rdquo;, people may not realize what they are good for. If you call our operating system &ldquo;Linux&rdquo;, that conveys a mistaken idea of the system's origin, history, and purpose. If you call it <a href="/gnu/linux-and-gnu.html">GNU/Linux</a>, that conveys (though not in detail) an accurate idea.
fr: Les noms v&eacute;hiculent des significations&nbsp;; le choix des noms d&eacute;termine la signification de ce que nous disons. Un nom mal choisi donne une mauvaise id&eacute;e aux gens. Une rose, quel que soit son nom, sentira toujours aussi bon, mais si vous l'appelez stylo, les gens seront plut&ocirc;t surpris quand ils essaieront d'&eacute;crire avec. Et si vous appelez les stylos &laquo;roses&raquo;, les gens pourraient ne pas r&eacute;aliser &agrave; quoi ils servent. Si vous appelez notre syst&egrave;me d'exploitation &laquo;Linux&raquo;, cela v&eacute;hicule une id&eacute;e fausse de l'origine du syst&egrave;me, de son histoire et de son but. Si vous l'appelez <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a>, cela transporte (mais pas en d&eacute;tail) une id&eacute;e correcte.

source: But does this matter for our community? Is it important whether people know the system's origin, history, and purpose? Yes&mdash;because people who forget history are often condemned to repeat it. The Free World which has developed around <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> is not secure; the problems that led us to develop GNU are not completely eradicated, and they threaten to come back.
fr: Mais est-ce important pour notre communaut&eacute;&nbsp;? Est-ce important que les gens connaissent l'origine, l'histoire et le but du syst&egrave;me? Oui, parce que ceux qui oublient l'histoire sont souvent condamn&eacute;s &agrave; la r&eacute;p&eacute;ter. Le Monde Libre qui s'est d&eacute;velopp&eacute; autour de <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a> n'est pas en s&eacute;curit&eacute;; les probl&egrave;mes qui nous ont amen&eacute; &agrave; d&eacute;velopper GNU ne sont pas compl&egrave;tement &eacute;radiqu&eacute;s et ils menacent de revenir.

source: When I explain why it's appropriate to call the operating system &ldquo;GNU/Linux&rdquo; rather than &ldquo;Linux&rdquo;, people sometimes respond this way:
fr: Quand j'explique pourquoi il est correct d'appeler le syst&egrave;me d'exploitation &laquo;GNU/Linux&raquo; plut&ocirc;t que &laquo;Linux&raquo;, les gens r&eacute;pondent parfois de la mani&egrave;re suivante&nbsp;:

source: <em> Granted that the GNU Project deserves credit for this work, is it really worth a fuss when people don't give credit? Isn't the important thing that the job was done, not who did it? You ought to relax, take pride in the job well done, and not worry about the credit. </em>
fr: <em>Bien que le projet GNU m&eacute;rite le cr&eacute;dit pour son travail, est-ce que cela vaut la peine de s'agiter quand les personnes ne le donnent pas? Est-ce que la chose importante n'est pas que le travail soit fait et pas celui qui l'a fait&nbsp;? Vous devriez vous calmer, &ecirc;tre fiers du travail bien fait et ne pas vous soucier de cr&eacute;dit.</em>

source: This would be wise advice, if only the situation were like that&mdash;if the job were done and it were time to relax. If only that were true! But challenges abound, and this is no time to take the future for granted. Our community's strength rests on commitment to freedom and cooperation. Using the name <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> is a way for people to remind themselves and inform others of these goals.
fr: Ce serait un sage conseil si seulement la situation &eacute;tait telle, si le travail &eacute;tait fait et s'il &eacute;tait temps de se calmer. Si seulement c'&eacute;tait vrai&nbsp;! Mais les probl&egrave;mes abondent et il n'est pas temps de consid&eacute;rer le futur comme acquis. La force de notre communaut&eacute; repose sur son engagement dans la libert&eacute; et la coop&eacute;ration. Utiliser le nom <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a> est une mani&egrave;re pour les personnes de se le rappeler et d'informer les autres de ces buts.

source: It is possible to write good free software without thinking of GNU; much good work has been done in the name of Linux also. But &ldquo;Linux&rdquo; has been associated ever since it was first coined with a philosophy that does not make a commitment to the freedom to cooperate. As the name becomes used increasingly by business, we will have even more trouble making it connect with community spirit.
fr: Il est possible d'&eacute;crire de bons logiciels sans penser &agrave; GNU; beaucoup de bons travaux ont &eacute;t&eacute; faits au nom de Linux aussi. Mais &laquo;Linux&raquo; a &eacute;t&eacute; associ&eacute; m&ecirc;me s'il a d'abord &eacute;t&eacute; invent&eacute; avec une philosophie qui ne s'engage pas dans la libert&eacute; de coop&eacute;rer. Comme le nom est de plus en plus utilis&eacute; par le commerce, nous aurons encore plus de mal &agrave; le connecter &agrave; l'esprit de la communaut&eacute;.

source: A great challenge to the future of free software comes from the tendency of the &ldquo;Linux&rdquo; distribution companies to add non-free software to <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> in the name of convenience and power. All the major commercial distribution developers do this; none produces a distribution that is entirely free. Most of them do not clearly identify the non-free packages in their distributions. Many even develop non-free software and add it to the system. Some outrageously advertise &ldquo;Linux&rdquo; systems that are &ldquo;licensed per seat&rdquo;, which give the user as much freedom as Microsoft Windows.
fr: Un grand d&eacute;fi pour le futur du logiciel libre vient de la tendance des compagnies de distribution de &laquo;Linux&raquo; &agrave; ajouter des logiciels non libres &agrave; <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a>, au nom de la commodit&eacute; et de la puissance. Tous les d&eacute;veloppeurs de distributions commerciales majeures le font, aucune ne produit une distribution enti&egrave;ment libre. La plupart des compagnies n'identifie pas clairement les produits non libres dansleurs distributions; beaucoup d&eacute;veloppent m&ecirc;me des logiciels non libres et les ajoutent au syst&egrave;me. Quelques unes annoncent de fa&ccedil;on scandaleuse des syst&egrave;mes &laquo;Linux&raquo; dont le droit d'utilisation est conc&eacute;d&eacute; par poste, ce qui donne &agrave; l'utilisateur autant de libert&eacute; que Microsoft Windows.

source: People justify adding non-free software in the name of the &ldquo;popularity of Linux&rdquo;&mdash;in effect, valuing popularity above freedom. Sometimes this is openly admitted. For instance, Wired Magazine says Robert McMillan, editor of Linux Magazine, &ldquo;feels that the move toward open source software should be fueled by technical, rather than political, decisions.&rdquo; And Caldera's <acronym title="Chief Executive Officer">CEO</acronym> openly urged users to drop the goal of freedom and work instead for the &ldquo;popularity of Linux&rdquo;.
fr: Les personnes justifient l'ajout de logiciel non libre au nom de la &laquo;popularit&eacute; de Linux&raquo;, mettant en fait la popularit&eacute; au dessus de la libert&eacute;. Parfois, c'est ouvertement admis. Par exemple, Wired Magazine dit que Robert McMillan, &eacute;diteur de Linux Magazine, &laquo;&nbsp;pense que le mouvement vers le logiciel open source devrait &ecirc;tre soutenu par des d&eacute;cisions techniques, plut&ocirc;t que politiques&nbsp;&raquo;. Et le PDG de Caldera a demand&eacute; ouvertement aux utilisateurs de laisser tomber le but de la libert&eacute; pour travailler &agrave; la place en faveur de &laquo;&nbsp;la popularit&eacute; de Linux&nbsp;&raquo;.

source: Adding non-free software to the <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> system may increase the popularity, if by popularity we mean the number of people using some of <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> in combination with non-free software. But at the same time, it implicitly encourages the community to accept non-free software as a good thing, and forget the goal of freedom. It is no use driving faster if you can't stay on the road.
fr: Ajouter des logiciels non libres au syst&egrave;me <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a> pourrait augmenter sa popularit&eacute;, si nous signifions par popularit&eacute; le nombre de personnes utilisant une partie de <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a> en combinaison avec des logiciels non libres. Mais en m&ecirc;me temps, cela encourage implicitement la communaut&eacute; &agrave; accepter des logiciels non libres comme une bonne chose et &agrave; oublier le but de lalibert&eacute;. &Ccedil;a ne sert &agrave; rien de conduire plus vite si vous ne pouvez pas rester sur la route.

source: When the non-free &ldquo;add-on&rdquo; is a library or programming tool, it can become a trap for free software developers. When they write free software that depends on the non-free package, their software cannot be part of a completely free system. Motif and Qt trapped large amounts of free software in this way in the past, creating problems whose solutions took years. The Motif problem is still not entirely solved, since LessTif needs some polishing (please volunteer!). Sun's non-free Java implementation is now having a similar effect: the <a href="/philosophy/java-trap.html">Java Trap</a> (Historical note: As of December 2006 Sun is in the middle of <a href="http://www.fsf.org/news/fsf-welcomes-gpl-java.html">rereleasing its Java platform under GNU GPL</a>.)
fr: Quand un &laquo;&nbsp;ajout&nbsp;&raquo; non libre est une biblioth&egrave;que ou un outil de d&eacute;veloppement, il peut devenir un pi&egrave;ge pour les d&eacute;veloppeurs de logiciel libre. Quand ils &eacute;crivent un logiciel libre qui d&eacute;pend d'un outil non libre, leur logiciel ne peut pas faire partie d'un syst&egrave;mecompl&egrave;tement libre. Motif et Qt ont emprisonn&eacute; de nombreux logiciels libres de cette mani&egrave;re dans le pass&eacute;, en cr&eacute;ant des probl&egrave;mes dont la solution a pris des ann&eacute;es. Le probl&egrave;me de Motif n'est toujours pas enti&egrave;rement r&eacute;solu, puisque LessTif a encore besoin de peaufinage (des volontaires, s'il vous pla&icirc;t&nbsp;!). L'impl&eacute;mentation Java non libre de Sun a d&eacute;sormais un effet similaire&nbsp;: <a href="/philosophy/java-trap.fr.html">Le pi&egrave;ge Java</a>. (Note historique&nbsp;: En d&eacute;cembre 2006, Sun est sur le point de republier sa plateforme Java sous licence GNU GPL).

source: If our community keeps moving in this direction, it could redirect the future of <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> into a mosaic of free and non-free components. Five years from now, we will surely still have plenty of free software; but if we are not careful, it will hardly be usable without the non-free software that users expect to find with it. If this happens, our campaign for freedom will have failed.
fr: Si notre communaut&eacute; continue d'aller dans cette direction, cela peut rediriger le futur de <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a> vers une mosa&iuml;que de composants libres et non libres. Dans cinq ans, nous aurons certainement toujours beaucoup de logiciels libres&nbsp;; mais si nous ne faisons pas attention, ils seront difficilement utilisables sans les logiciels non libres que les utilisateurs esp&egrave;rent trouver avec. Si cela arrive, notre campagne pour la libert&eacute; aura &eacute;chou&eacute;.

source: If releasing free alternatives were simply a matter of programming, solving future problems might become easier as our community's development resources increase. But we face obstacles which threaten to make this harder: laws that prohibit free software. As software patents mount up, and as laws like the <abbr title="Digital Millennium Copyright Act">DMCA</abbr> are used to prohibit the development of free software for important jobs such as viewing a DVD or listening to a RealAudio stream, we will find ourselves with no clear way to fight the patented and secret data formats except to <strong>reject the non-free programs that use them</strong>.
fr: Si la publication d'alternatives libres &eacute;tait simplement une question de programmation, la r&eacute;solution de probl&egrave;mes futurs pourrait devenir plus simple au fur et &agrave; mesure que les ressources de d&eacute;veloppement de notre communaut&eacute; augmenteront. Mais nous faisons face &agrave; des obstacles quimenacent de la rendre plus difficile&nbsp;: des lois qui interdisent le logiciel libre. Comme les brevets logiciels se dressent (lisez la p&eacute;tition petition.eurolinux.org et signez la&nbsp;!) et comme des lois telles que la DMCA sont utilis&eacute;es pour interdire le d&eacute;veloppement de logiciels libres concernant d'importants besoins comme la lecture de DVD ou l'&eacute;coute d'un flux RealAudio, nous nous trouverons sans autre mani&egrave;re claire de nous battre contre les formats de fichiers brevet&eacute;s et secrets que de <strong>rejeter les programmes non libres qui les utilisent</strong>.

source: Meeting these challenges will require many different kinds of effort. But what we need above all, to confront any kind of challenge, is to remember the goal of freedom to cooperate. We can't expect a mere desire for powerful, reliable software to motivate people to make great efforts. We need the kind of determination that people have when they fight for their freedom and their community, determination to keep on for years and not give up.
fr: R&eacute;pondre &agrave; ces d&eacute;fis demandera plusieurs sortes d'effort. Mais ce dont nous avons besoin avant tout, pour affronter tous types d'adversit&eacute;, est de garder en m&eacute;moire le but de la libert&eacute; de coop&eacute;rer. Nous ne pouvons pas nous reposer sur le simple d&eacute;sir de logiciels puissants et fiablespour motiver les gens &agrave; faire de grands efforts. Nous avons besoin de cette d&eacute;termination que les gens ont quand ils se battent pour leur libert&eacute; et leur communaut&eacute;, la d&eacute;termination de tenir pendant des ann&eacute;es et de ne pas abandonner.

source: In our community, this goal and this determination emanate mainly from the GNU Project. We're the ones who talk about freedom and community as something to stand firm for; the organizations that speak of &ldquo;Linux&rdquo; normally don't say this. The magazines about &ldquo;Linux&rdquo; are typically full of ads for non-free software; the companies that package &ldquo;Linux&rdquo; add non-free software to the system; other companies &ldquo;support Linux&rdquo; with non-free applications; the user groups for &ldquo;Linux&rdquo; typically invite salesman to present those applications. The main place people in our community are likely to come across the idea of freedom and determination is in the GNU Project.
fr: Dans notre communaut&eacute;, ce but et cette d&eacute;termination &eacute;manent principalement du projet GNU. Nous sommes ceux qui parlons de libert&eacute; et de communaut&eacute; comme de quelque chose qu'il faut d&eacute;fendre; les organisations qui parlent de &laquo;&nbsp;Linux&nbsp;&raquo; ne le disent normalement pas. Les magazines sur &laquo;&nbsp;Linux&nbsp;&raquo; sont typiquement pleins de publicit&eacute;s pour des logiciels non libres; les compagnies qui empaquettent &laquo;&nbsp;Linux&nbsp;&raquo; ajoutent des logiciels non libres au syst&egrave;me; d'autres compagnies &laquo;&nbsp;supportent Linux&nbsp;&raquo; avec des applications non libres; les groupes d'utilisateurs de &laquo;&nbsp;Linux&nbsp;&raquo; invitent typiquement des revendeurs &agrave; pr&eacute;senter ces applications. Le point central o&ugrave; les personnes de notre communaut&eacute; sont susceptibles de croiser l'id&eacute;e de la libert&eacute; et de la d&eacute;termination est le Projet GNU.

source: But when people come across it, will they feel it relates to them?
fr: Mais quand les gens la croisent, est-ce qu'ils penseront qu'elle les concerne&nbsp;?

source: People who know they are using a system that came out of the GNU Project can see a direct relationship between themselves and GNU. They won't automatically agree with our philosophy, but at least they will see a reason to think seriously about it. In contrast, people who consider themselves &ldquo;Linux users&rdquo;, and believe that the GNU Project &ldquo;developed tools which proved to be useful in Linux&rdquo;, typically perceive only an indirect relationship between GNU and themselves. They may just ignore the GNU philosophy when they come across it.
fr: Les personnes qui savent qu'elles utilisent un syst&egrave;me qui vient du projet GNU peuvent voir une relation directe entre eux et GNU. Elles ne vont pas forc&eacute;ment &ecirc;tre d'accord avec notre philosophie, mais au moins elles verront une raison d'y penser s&eacute;rieusement. Par contre, les personnes qui se consid&egrave;rent comme des &laquo;&nbsp;utilisateurs Linux&nbsp;&raquo; et qui croient que le projet GNU &laquo;&nbsp;a d&eacute;velopp&eacute; des outils qui ont prouv&eacute; leur efficacit&eacute; pour Linux&nbsp;&raquo;, per&ccedil;oivent typiquement une relation indirecte entre GNU et eux. Elles peuvent tout simplement passer &agrave; c&ocirc;t&eacute; de la philosophie de GNU.

source: The GNU Project is idealistic, and anyone encouraging idealism today faces a great obstacle: the prevailing ideology encourages people to dismiss idealism as &ldquo;impractical&rdquo;. Our idealism has been extremely practical: it is the reason we have a free <a href="/gnu/linux-and-gnu.html">GNU/Linux</a> operating system. People who love this system ought to know that it is our idealism made real.
fr: Le projet GNU est id&eacute;aliste et tous ceux qui encouragent l'id&eacute;alisme aujourd'hui font face &agrave; un grand obstacle&nbsp;: l'id&eacute;ologie dominante qui encourage les personnes &agrave; rejeter l'id&eacute;alisme comme &laquo;manquant de sens pratique&raquo;. Notre id&eacute;alisme a &eacute;t&eacute; on ne peut plus pratique : c'est bien la raison pour laquelle nous avons un syst&egrave;me d'exploitation <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a>. Les personnes qui aiment ce syst&egrave;me devraient savoir que c'est notre id&eacute;alisme qui l'a rendu possible, concret.

source: If &ldquo;the job&rdquo; really were done, if there were nothing at stake except credit, perhaps it would be wiser to let the matter drop. But we are not in that position. To inspire people to do the work that needs to be done, we need to be recognized for what we have already done. Please help us, by calling the operating system <a href="/gnu/linux-and-gnu.html">GNU/Linux</a>.
fr: Si &laquo;&nbsp;le travail&nbsp;&raquo; avait &eacute;t&eacute; fait, s'il n'y avait rien d'autre en jeu &agrave; part le cr&eacute;dit, peut-&ecirc;tre qu'il serait plus sage de laisser tomber le sujet. Mais nous ne sommes pas dans cette position. Pour inciter les gens &agrave; faire le travail qui doit &ecirc;tre fait, nous avons besoin d'&ecirc;tre reconnus pour ce que nous avons d&eacute;j&agrave; fait. S'il vous pla&icirc;t, aidez-nous en appelant le syst&egrave;me d'exploitation <a href="/gnu/linux-and-gnu.fr.html">GNU/Linux</a>.

source: P.S. For an explanation of the history of the GNU/Linux system as it relates to this issue of naming, see <a href="/gnu/linux-and-gnu.html">http://www.gnu.org/gnu/linux-and-gnu.html</a>. For answers to other questions and arguments about this issue, see the <a href="/gnu/gnu-linux-faq.html">GNU/Linux FAQ</a>.
fr: P.S.&nbsp;: pour une explication de l'histoire du syst&egrave;me GNU/Linux par rapport &agrave; la question du nom, voir <a href="/gnu/linux-and-gnu.fr.html">http://www.gnu.org/gnu/linux-and-gnu.fr.html</a>. Pour des r&eacute;ponses aux questions et arguments sur ce sujet, veuillez consulter la <a href="/gnu/gnu-linux-faq.fr.html">FAQ GNU/Linux</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
fr: Veuillez consulter le <a href="/server/standards/README.translations.fr.html">README des traductions</a> pour des informations sur la coordination et la soumission de traductions de cet article.

source: Copyright &copy; 2000, 2006, 2007 Richard Stallman <br /> Verbatim copying and distribution of this entire article is permitted in any medium without royalty provided this notice is preserved.
fr: Copyright &copy; 2000, 2006, 2007 Richard Stallman <br /> La reproduction exacte et la distribution intégrale de cet article est permise sur n'importe quel support d'archivage, pourvu que cette notice soit préservée.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
fr: Traduction&nbsp;: Pierre-Yves Enderlin.<br /> Révision&nbsp;: <a href="mailto:trad-gnu&#64;april.org">trad-gnu&#64;april.org</a>

source: Updated:
fr: Dernière mise à jour&nbsp;:

source: Translations of this page
fr: Traductions de cette page
